{
    "title": "Japanese publishers’ habit of region locking games in Japan may finally be changing",
    "comments": [
        {
            "depth": 0,
            "author": "GarlicRagu",
            "body": "Wow. Didn't know this was a thing. That sounds like it would be incredibly frustrating. Hopefully things improve.",
            "score": 38,
            "replies": [
                {
                    "depth": 1,
                    "author": "MyNameIs-Anthony",
                    "body": "Yeah it's particularly annoying that I cannot buy stuff like the Naruto games here.\n\n\nI'm happy I purchased Kakarot before I switched my account over to Japan because there's negative transparency from Steam on what's available where and what version you'll be stuck with when doing so.",
                    "score": 15
                }
            ]
        },
        {
            "depth": 0,
            "author": "megaapple",
            "body": "In India too, BNE brought back a lot of Dragon Ball games.\n\nBut One Piece and (previously listed) Digimon games remain delisted here.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "BlackBlizzard",
            "body": "I wish they would do this the other way, I would buy all the Japanese Resident Evils (Biohazards) on Steam for my RE collection and achievement hunting.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "RefreshingCapybara",
                    "body": "It's not ideal at all, but a while back I swapped my accounts region to Japan to grab a few games that aren't available in the west, and used Yen steam cards to make purchases.\n\nBut if you do this you'll be locked to that store region for 3 months afterwards. I just kept using yen cards to make other purchases for those three months as most games aren't region locked so it wasn't that big of a deal.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "ssj1236",
            "body": "Can Pakistan and India stop getting shafted too? Please? ",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "ManateeofSteel",
                    "body": "This is all on governments not steam",
                    "score": 21
                },
                {
                    "depth": 1,
                    "author": "Zakika",
                    "body": "i think it is on their goverments on that case.",
                    "score": 22
                }
            ]
        },
        {
            "depth": 0,
            "author": "theveryendofyou",
            "body": "In the meantime Steam Decks have been completely sold out in Japan for months, except for a single shipment once per month that sells out within hours. Valve need to get their shit together",
            "score": -29,
            "replies": [
                {
                    "depth": 1,
                    "author": "GarlicRagu",
                    "body": "You really just saw a steam thumbnail and went on a little rant? This article has nothing to do with Valve. valve isn't the one holding these games up from being published. Its the publisher treating steam differently for their users. Even if valve had anything to do with this, why is deck stock relevant? They should stop everything until they wait for their manufacturer to get more stock in hand? What a ridiculous thought.",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "theveryendofyou",
                            "body": "This article is about Steam booming in Japan, so I noted that Valve isn’t cashing in on it because they aren’t getting enough Deck stock to Japan.",
                            "score": -14
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Resstario",
                    "body": "Which country have they been sold out in?",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "theveryendofyou",
                            "body": "Uh, Japan? The country this whole post is about??",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Resstario",
                                    "body": "Never mind, im stupid.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}