{
    "title": "Insider Gaming: XDefiant Hits 1 Million Unique Players Within 2.5 Hours of Launch",
    "comments": [
        {
            "depth": 0,
            "author": "DiscretionFist",
            "body": "as a fps maniac, this game is free and 30 gigs of fast pace COD like gameplay. It scratches that itch without supporting 300 gigabyte download practices and that's honestly a huge W in my book.\n\nOh, and it actually has good performance.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamEclipse",
                    "body": "Matchmaking is also far quicker, and match connection quality is so far above COD in my experience that it's laughable.\n\nCOD takes a minute to put me in a 200ms ping lobby of Domination on a Saturday night.\n\nXDefiant can find a 20ms ping lobby instantly. It's beautiful.\n\nWith that said, hit-reg does need some work. It's not as consistent as a game like this should be.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chriszz25",
                            "body": "Oh god, I thought it was only me aboutnthe hit-reg being an issue, I hit all shots first but I’m still the one who died.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ParagonFury",
                                    "body": "Hitreg was trash in all the tests, and still is now. Combine that with how the game is balanced like CoD Ghosts where body shots are mediocre but headshots have a massive multiplier and you end up with a LOT of frustrating gun fights.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "LordCaelistis",
                                    "body": "Is this an America-centric issue ? I'm playing on european servers and while hit-reg is occasionally an issue, I've had plenty of very normal fights and definitely nothing as egregious as some videos I've seen (played around 5 hours)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "VoriVox",
                                            "body": "I'm also on Europe, playing with less than 30ms ping, and at least once a match I'm killed half a second or more after I turned a corner.\n  \n[Here's one example](https://i.imgur.com/BgVBj75.mp4) where I see the sniper and hide, with my player model being completely covered by a pillar, and 30 frames later the sniper kills me because on their end my player model didn't register hiding yet.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Zoloir",
                            "body": "a million players all at once will help with the queue times don't you think? can't last forever",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DudeKosh",
                                    "body": "It's not the players, it's the fact that XDefiant doesn't have skill based matchmaking.\n\nThe matchmaking priority is to get you into a low ping lobby as soon as possible. CoD is trying to match you with evenly skilled players.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "IamEclipse",
                                    "body": "I don't think *Call of Duty* of all games is struggling for players so much that it can't find me a single good quality match quickly. \n\nThe problem is that COD's matchmaking is trying to get me into a very specific match, seemingly without regard for connection, whereas XDefiant gets me playing asap, and due to a large player count, good connection gets found quickly.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Zoloir",
                                            "body": "i promise if CoD could get you into high quality matches quickly, they would. the trouble is how you define \"high quality\". currently YOU are using ping as a benchmark, but there is so much more to consider.\n\nthis game is too new for people to have hyper specific complaints about exactly why their \"quick\" matchmaking system is actually giving them shit quality matches.\n\npure honeymoon effect, call me jaded but gaming communities don't stay positive very long and the complaints about matchmaking will inevitably arise.\n\nCoD has been around so long their algo probably considers a ton of factors tuned to minimize complaints",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "IamEclipse",
                                                    "body": "I consider a good connection the bare minimum for a shooter to have *good matches*.\n\nIf *Halo: Infinite*, *Overwatch 2*, *XDefiant*, *Fortnite* and *Battlefield 2042* can all get me into well connected matches (<40ms) within a minute, and *Call of Duty* struggles to do that as a bare minimum, that tells me that COD's matchmaking is factoring far too much into its matchmaking, and it's the reason I stopped playing the games. \n\nSkill-based matchmaking is fine, but never at the cost of connection.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Zoloir",
                                                            "body": "well, all i can tell you is, good luck - if you like it now, you will have fun arguing with other people who will come and shit on xdefiant's algo soon, just like you're shitting on CoD's algo now, and the circle will be complete",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "IamEclipse",
                                                                    "body": "I shit on COD's algorithm because it's actively detrimental to the experience of the game. It's the only shooter series that has ever lost me due to its matchmaking philosophy.\n\nI'm confident that XDefiant will stick to its *Ping is King* matchmaking over SBMM as it's literally a pillar the game was marketed on and designed around.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Radulno",
                                    "body": "To be fair, that's probably what COD has all the time (and more on a launch period).\n\nI'm guessing SBMM absence makes it way easier to do matchmaking, they don't try to balance anything, they just grab X players randomly, that's not hard",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Zoloir",
                                            "body": "yea this exactly. new, unbloated algo, that will inevitably get complained about until they bloat it up with all the factors they could/should consider\n\nim very jaded about gaming communities and their ability to always find something to complain about. hopefully i'm not actively contributing by talking about this but I just can't imagine people will stay happy with a new matchmaking system for very long.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "PM_PICS_OF_UR_PUPPER",
                            "body": "There’s no SBMM I think, so probably purely connection based",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TomVinPrice",
                    "body": "One cool thing is that if the game does indeed have long-term success you won’t have to buy the new one in a year and lose all your gained collectibles/skins etc. so that’s already one thing it has over cod (as well as being free and no SBMM as Ubisoft claim)",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "-idkwhattocallmyself",
                    "body": "Right? I've been wanting something to play off and on but I'm not willing to download a 200gb platform just to play COD multiplayer.\n\nThis game has some balancing issues, but ultimately it's still just stupid fun. I really hope it can stick around for a bit.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Zikronious",
                    "body": "Good performance with a 120hz option in the menu! I know COD offers that too but like you said, it’s free and small file size!\n\nThe negatives I’ve seen are that the micro transactions are priced for whales and the progression in the battle pass is stupidly slow. Hope to see those things corrected otherwise I’ll play but they won’t get a penny from me as it stands.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Multifaceted-Simp",
                    "body": "It's very artificial feeling. Anyways it crashes for me on the xsx, but it's not cod at all. Feels like a mobile shooter",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ledairyman",
                    "body": "Cod is 147GB currently for Warzone, Multiplayer, and Campaign. \n\nYou don't even get half of that with XDefiant. Yet dude is bragging.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DiscretionFist",
                            "body": "Nobody wants to install 150gb ls just to play Warzone, or multi-player, or the campaign.\n\nXdefiant allows you to hop in and have fun without all the baggage. I don't see your point, 150 gigs is still stupid, and it's even higher on console.\n\nAt least Xdefiant doesn't force you to install extra gigs for shit you won't ever touch.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Resouledxx",
            "body": "Decently fun game, feels good to play. Nothing too special but not every game has to be revolutionary.",
            "score": 100,
            "replies": [
                {
                    "depth": 1,
                    "author": "Impressive_Volume752",
                    "body": "That's what im thinking too. It's the very definition of a 6.5/7-10 game thats fun to run with your friends and is very simple + requires no unlocks to play",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DaItalianFish",
                    "body": "definitely disagree with feels good to play. there's something really wrong with the gunplay, it does not feel responsive at all",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BottAndPaid",
                            "body": "Feels like there is some kind of lag compensation that's not quite configured correctly bad net code possibly. It feels really bad.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Radulno",
                            "body": "Yeah did like 5 matches and just stopped and I don't think I'll pick it back up. \n\nSay what you want about COD but they do nail the gunplay and movement to be enjoyable.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "scottheeeeeeem",
                            "body": "I really don’t like the feel of the slide mechanics. It’s clunky and I can’t fluidly return to a sprint after sliding. I hear you on the gun play. I haven’t used all the weapons so my opinion is limited but certain guns do not feel good lol",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Impressive_Volume752",
                                    "body": "you need to chain together the slide and bunny hop.\n\nso slide, jump, jump",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "poofynamanama2",
                                            "body": "oh cool more adhd movement mechanics",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Panicles",
                                                            "body": "Maybe I'm just getting to that age but the constant jumping up and down rapidly as soon as a gunfight starts looks and feels beyond stupid (especially when we're holding AK's and M4's). Like if I'm going to play a movement shooter Apex feels like a more appropriate game to do it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Impressive_Volume752",
                                                                    "body": "All shooters are movement shooters. The whole point of an FPS game is you win fights by making other person miss....\n\nEven CS which requires you to stand still you can strafe very quickly, and a person with good counter strafes will win in a straight up 1v1 all the time",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Panicles",
                                                                            "body": "You're missing the point. The bunnyhopping in xdefiant looks and feels beyond stupid compared to movement mechanics in other games. When I get into a gunfight and we're both hopping up and down like morons to win the fight, its just laughably dumb looking and isn't remotely rewarding.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Impressive_Volume752",
                                                                                    "body": "then strafe? bunny hopping isnt even hard to hit because youre locked into a predictable arc",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Panicles",
                                                                                            "body": "You really don't understand do you?. Not every argument is a 'skill issue' subject. Bunnyhopping is a braindead easy game mechanic and isn't hard to deal with, it just looks fucking stupid to see in a video game like xdefiant or CoD.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "blacksun9",
                                                            "body": "I have 34 kids and 7 jobs I can't be learning how to hit two buttons",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Impressive_Volume752",
                                                                    "body": "bro they need to bring back those arcade on rails shooters for these guys, no buttons at all! well unless its time crisis...",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "scottheeeeeeem",
                                            "body": "I’ll try that out thank you!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "YakaAvatar",
                            "body": "Also experienced this. I'm not sure exactly what it is, but aiming on mouse feels off. I've had a similar feeling in BF2042. I have a pretty beefy rig with a high refresh monitor, and I'm not experiencing these issues in any other shooters. Tracking feels very weird to me in this game.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "spirited1",
                    "body": "We need more games like this. AAA are great, but not every single game has to be AAA. It's unsustainable for devs and it loses its charm with how saturated the market is. \n\n\nA fun game that doesn't require long term commitment because of fomo is good enough and can probably be devolped in a much shorter time.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "I_am_not_Asian69",
            "body": "idk after playing all the recent cods this one feels too weird to play, the gunplay feels really stiff it feels like i’m shooring bb bulets, the movement also feels too floaty a bit like battlefield but not as refined",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Guilty_Jackfruit4484",
                    "body": "I had the same thoughts. COD has always had very good movement mechanics. I enjoy xdefiant but I honestly don't see it competing with COD in the long run.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "UrbanAgent423",
            "body": "I've played it a bit and been keeping an eye on discussions about it, it seems to be kinda split for opinions. Some people praise it as the best modern/new arena shooter currently available, some others seem to say it just doesn't feel right for gameplay, too floaty and all that (that's where I stand), and yet some others hate it completely. And there seems to be roughly even amounts of each. Best way to see if you'll like it is to try it yourself, which at least its free",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zippopwnage",
            "body": "IMO, I don't know. I wanted to play this, but I just don't like how gunplay feels. I feel like I'm shooting nothing. The guns seems to not have any \"weight\", the bullet impact feedback is not there... it's just weird for me.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "HowdyHoe26",
                    "body": "I feel the same, extremely floaty.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Exciting-Rise-1666",
                    "body": "yea that instantly turned me away when I tried it for the first time months ago. Just did not feel satisfying at all.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "QQninja",
                    "body": "This game isn’t supposed to feel weighty or have an impact in gunplay. There has been plenty of games that want to push realism. In my opinion this game is looking to grasp the arcadey feel in essence of black ops 3/4, boot up shoot some shit log off and call it a day. Honestly I’m all for it.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SmurfinTurtle",
                            "body": "It's not about realism at all. People just want good feedback in any game when using a weapon.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "DaytonF7",
                            "body": "I disagree, if it's a shooter the guns need to feel good because that's all you're doing; running around and shooting. It's not a matter of realism, it's a matter of satisfying gameplay which goes out the window if the guns feel like water pistols, at least for me.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blacksun9",
                                    "body": "I'm actually enjoying the game bye there's zero audio and rumble feedback to shooting someone which makes it feel unresponsive. Thankfully those should be easy additions",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "blitz_na",
                            "body": "okay but the guns still have to feel good to shoot. even if there's no recoil on the mw3 acr 6.8, thing felt like a beast",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Radulno",
                            "body": "COD games still have much better gunplay than this",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "poofynamanama2",
                    "body": "sounds like Battlefield 2042",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "CallM3N3w",
            "body": "Congrats to the team, but I have a feeling that no matter how much people like and play it, most will go to CoD when BO6 releases.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Relo_bate",
                    "body": "True but if Ubisoft plays their cards right, they can utilize the period where cod fans keep complaining about the game to get fans into xd",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CallM3N3w",
                            "body": "Fans have been complaining for over a decade and every competitor they have/had fell hard 🙃",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "CallM3N3w",
                            "body": "Fans have been complaining for over a decade and every competitor they have/had fell hard 🙃",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ZombieMadness99",
                    "body": "As the gameranx review pointed out, I think they need to go much harder on their IPs and focus on themed mechanics to set themselves apart",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "AReformedHuman",
            "body": "It's nothing special, but it's scratching the right itch. I will also say that the level design isn't mindblowing, but it's highly intuitive with very little of a learning curve, I felt comfortable on a first play of a map.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Stuf404",
            "body": "I'm having a blast. It's the old school cod x overwatch I've wanted.\n\nLevel design is excellent. I love seeing old ubisoft games getting levels made out of them. The Divisions desperately need an FPS mode now.\n\nTimes square and the crashed plane in Washington as an FPS map is just 🤌",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dacodaque",
                    "body": "Yea, i really like their Escort game mode. I feel that it is a fairly organic way to get players to play the objective.\n\nMost of the games I used to play on MWII and MWIII, people where just interested in being sweaty, and shooting you in the face..",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HelghastFromHelghan",
                    "body": "Yeah this is one aspect of the game I think is quite frankly brilliant and don't see many people talking about it. It's a pretty cool concept taking locations from various IPs (including singleplayer ones) and turning them into MP maps. I really hope we will get an Assassin's Creed season, the possibilities for maps are endless.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "FlyingTurkey",
            "body": "Its fun, but the worst part is the abilities and incendiary bullets. Fun gamemodes and I think it feels alright gunplay wise",
            "score": 1
        },
        {
            "depth": 0,
            "author": "soul_punisher",
            "body": "My experience so far has been pretty mixed but leaning towards positive: The biggest thing this game does better than COD MW3 is map design - 90% of MW3's maps run the gamut of middling to terrible. As far as the fundamentals of moving, shooting, etc. go.... there's really nothing about it that's outright better than MW3 aside from visible enemy health bars which I am a fan of.      \n      \nI want the game to be good, as COD really needs competition, (and also I want more games like it that are good) but the problem is the game just feels dated. And given Treyarch's track record, Black Ops 6 is on track to be a more refined version of this very game, but obviously we don't know enough about it to judge.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "JuanMunoz99",
            "body": "Please don’t let it die please don’t let it die please don’t let it die! (I say that to both the players and the dev)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AccomplishedOyster",
            "body": "I don’t think this is as much of a challenger to CoD more than it is one to Overwatch. I’d rather play this than Overwatch any day of the week. It’s Overwatch with a CoD skin if you will. I like the game and am having fun unlocking stuff and just playing an arcade type shooter. The maps are where this game shines though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LessThanDan",
            "body": "I'm really enjoying this game and can see myself spending more time in it. I just wish it wouldn't cause my PC to hard crash. I look forward to them (hopefully) fixing that, as well as fixing some of the hitreg issues and other bugs.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueberryForsaken635",
            "body": "Its a fantastic experience so far. Really love the gunplay and how easy it is to pick up and put down. As well, it's so fun to move in this game. They really nailed all of the movement mechanics and doing a mid are juke is an incredible feeling. Only downsides is that it takes way too long to level up guns.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ajxtt",
                    "body": "Yeah people have written it off since it’s Ubisoft but it’s very fun to play except the hitreg and the levelling like you mentioned",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TimeTroll",
                            "body": "Im writing it off because its not on steam and I aint downloading a launcher for just one game.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bigfootbehaviour",
                                    "body": "Being a Steam loyalist will only mean you miss out on many great experiences",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AccomplishedOyster",
                                            "body": "Not just that, but it’s such a narrow minded approach boarding on a toddler who only eats chicken nuggets. I have GOG, steam, acti/blizz, and MS Gamepass on my PC.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheRealTofuey",
            "body": "Good first impression for me. It feels like classic cod. Fun and mindless, stuff to grind and earn. Hope they double doen on copying the things that made old cod fun to grind. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FinalBossRock",
            "body": "Free CoD like game. What's not to like?\n\nLoving it so far",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rcpz93",
            "body": "I've only watched a few streams of this, and I see no reason to play this if I could be playing CoD instead.\n\nEven if I didn't have an alternative, gunplay looks pretty mediocre overall, TTK is too long for my taste and and I am really tired of hero shooters.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "XboxMorrowind",
            "body": "Maybe it's salt or a skill issue but I couldn't play it for more than an hour.  Everyone's just using the wall hack abilities non-stop.  I mean it's an fps, positioning is like 90% of the game.  With everyone seeing everyone else the whole time what exactly are we even doing?  Also no killcam in a f2p game is a recipe for wild aimbot degeneracy \n\nHappy CoD has some competition though.  Also nice to see Ubi launch a successful healthy MP game, they've had some rough ones",
            "score": 1
        },
        {
            "depth": 0,
            "author": "voidox",
            "body": "eh, release numbers for a game (especially a F2P one) that is trying to tap into the CoD market with no real competition releasing around the same time and has marketing in twitch drops, sponsored streamers, etc. really don't mean anything. We'll see how the numbers look a few weeks later when the launch hype dies down. \n\nalso, this number is \"sources have told Insider Gaming\", and \"within 2.5 hours of launch\" means during the server issues period where a lot of ppl where just waiting in menus... so ya, grain of salt and all that.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Raidoton",
                    "body": "It still means many people have checked it out, which is not nothing. Time will tell how many will stick but it's important to get many eyes on your game first.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "bobo0509",
                    "body": "Yeah but i assure you the game is doing really well, it's in the top 10 most played game on playstation in the us and in the top 5 in France, Uk, Germany and Spain. It has excellent twitch numbers views, and a shit tons of  big youtubers are making videos about it, a lot of them are praising the game vividly.\n\nI don't know how well this game is going to do in the long run but i'm pretty damn sure it's going to find a public.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "voidox",
                            "body": "right, what part of \"release numbers\" did you miss from my OP? \n\n> It has excellent twitch numbers views\n\nlol, ya let's just ignore twitch drops, sponsors and release hype.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lord-Aizens-Chicken",
            "body": "It’s very decent. But I am a major fan of arcade shooters like this, I don’t like battle royal. This is free, not a big download, I can play some matches here and there. Works perfectly for me, especially on nights after work where I want to game but don’t want to play any game that requires a robot of investment r",
            "score": 1
        },
        {
            "depth": 0,
            "author": "oilfloatsinwater",
            "body": "I tried to play it for the last 2 days and i still can’t join a match, at this point i just gave up.\n\nIts a shame cuz i kinda wanted to scratch that COD itch i had without forking 70$ for one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Minnesota_Arouser",
            "body": "I haven’t played COD in over a decade but I’m having fun.  I’m holding my own in the welcome playlist, maybe I’ll start getting destroyed once I graduate out of it.  I do somewhat miss the steady stream of unlocks from COD games I used to play, perks, attachments, new guns, camos for guns, etc.  XDefiant is more just getting kills to unlock weapon attachments, and earning XP to level up the battle pass.  I think the battle pass is only $5 though, so I’ll probably get it eventually.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KevM689",
            "body": "I don't understand how The Finals isn't getting as much love. It's a fantastic fast paced fps, great destruction, the devs aren't scummy.",
            "score": 1
        }
    ]
}