{
    "title": "Alone in the Dark Reboot Flopped, Embracer Says After Laying Off Staff",
    "comments": [
        {
            "depth": 0,
            "author": "TheMisterAce",
            "body": "I played the game (Alone in the Dark) at release. I paid full price. I don't think it's a bad game per se, but if you compare it to titles like the Resident Evil remakes, it just isn't that good. It's not as fluid and it's very clear it has a lower budget. If you go into it knowing that, you'll probably have a good time (like I did).",
            "score": 491,
            "replies": [
                {
                    "depth": 1,
                    "author": "JamieReleases",
                    "body": "Yeah, I felt exactly the same as this when playing it. It has an interesting story, but could have been much better. Combat was probably its weak point. One of the better Alone in the Darks of the last decade or so though.",
                    "score": 91,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LittleRudiger",
                            "body": "There’s been one other Alone in the Dark in the last decade …",
                            "score": 71,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ImpactThunder",
                                    "body": "So you are saying it’s in the top 2 alone in the dark games in the last decade?",
                                    "score": 62,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Soyyyn",
                                            "body": "It's the best Alone in the Dark game relased this year. \n\n\nSo far.",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DeltaFoxtrotThreeSix",
                                                    "body": "its definitely one of the alone in the dark games of all time",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FatalFirecrotch",
                                                            "body": "I have never felt so alone in the dark.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Hattes",
                                                                    "body": "So that's it? What, we some kinda Alone in the Dark?",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "hoppyandbitter",
                                                    "body": "Might even be the best in the last 2 years",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DeltaFoxtrotThreeSix",
                                                            "body": "only until 2 alone 2 dark comes out",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "JamieReleases",
                                                            "body": "ok, I think it's better than New Nightmare haha.",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Catty_C",
                                    "body": "The burning chair one?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bigblackcouch",
                                            "body": "Nope, worse. Burning chairs was in 2008, on the PS3.  There was actually a much, *much* shittier one in 2015 called [Illumination](https://en.m.wikipedia.org/wiki/Alone_in_the_Dark:_Illumination).\n\n\nWhich is kinda impressive considering other than some fucking hilarious voice lines, 2008's game was pretty bad.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "blegar1",
                                                    "body": "2008 i put in that category of it tried something new. Like holy hell I enjoy the actual systems. Like the inventory system and injuries. (also the music and that 1 car chase) But yeah otherwise it's not that good but it did have some cool systems.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sweaty-Professor-187",
                            "body": "Definitely one of the Alone in the Dark games of all time though.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "aspindler",
                            "body": "Are there any great Alone in the Dark games? The ones I played were always ok/good, but none was great.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Narishma",
                                    "body": "I remember the one on the PS1 being great.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sweaty-Professor-187",
                    "body": "That was my impression too. Never bought it because it always felt to me like a $40 game that they were charging $70 for because it has the guy from Stranger Things on the cover.",
                    "score": 32
                },
                {
                    "depth": 1,
                    "author": "VisualPersona95",
                    "body": "I do plan on getting it eventually when it’s at a reasonable sale but it is a shame that between this, Alan Wake 2 not having made back it’s budget and Dead Space 2 Remake not happening it’s a shame that Resident Evil has no competition in the AAA horror genre.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hordak_Supremacy",
                            "body": "Well, this wasn't an AAA game to begin with. Definitely AA.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Brainwheeze",
                                    "body": "When I first saw the game I thought it was an AAA comeback due to the celebrities they got to play the protagonists, but upon watching gameplay footage of the game it became clear to me that it really is more of an AA title.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sharkattackmiami",
                                            "body": "Also if we're being honest David is not a big get. He was a main side character on a popular show, had a glorified cameo on Black Widow, and starred in a critical and commercial failure with Hellboy which was his only lead role I know of\n\nSo a AA game feels right where I would expect to see him",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FatalFirecrotch",
                                                    "body": "He was the lead in violent night recently.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Quetzal-Labs",
                            "body": "Crazy to me that the Dead Space 2 Remake isn't happening. That first one was so much fun. The improvements they made to the world design, the story and characters, as well as the enemy encounters were all fantastic.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lafajet",
                                    "body": "The unfortunate reality is that most survival horror games don't sell enough to justify the cost of developing them to that level of quality, at least not in the AAA space. Resident Evil is a huge outlier in the genre in terms of sales, and it remains to be seen if even the second biggest pillar of it (Silent Hill) can make a significant comeback with their upcoming titles. Personally, I have my doubts.\n\nIt seems to me that we're in a situation where for the foreseeable future the genre will be RE, smaller efforts from indie teams like Signalis and that's about it unless someone can somehow strike absolute gold with a new title at the precise right time.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "PM-ME-DAT-ASS-PIC",
                                    "body": "Such a bummer.  I knew I wasn't going to get to Dead Space 1 Remake for awhile, but I still bought it at release in the hopes of helping their numbers.  Sad to see the remake not coming out.  I wonder if there is a high-res pack on PC for the original.  It had amazing visuals at the time of release, so maybe a high res update is all it needs.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Chronis67",
                            "body": "RE has the advantage of being the marquee horror video game franchise. No matter how good or influential the other games you mentioned are, they have an incredibly tough mountain to climb. The only other horror series that might be able to even approach RE is Silent Hill, but considering that it's own fan base seems to be turning on SH2R, that probably won't happen ",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "verrius",
                                    "body": "I'm convinced 90% of Silent Hill \"fans\" have never played Silent Hill, and instead just have watched Youtube videos about people discovering their first video games with subtext.  I get that Bloober Team is divisive, but the loud complaints about the combat seem bizarrely tone deaf, considering how awful the combat is in just about every game in the series, but especially in 2.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Chronis67",
                                            "body": "That used to be the defining feature of Persona fans, until P5. Now it's only about half of them. Lol",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Stevied1991",
                                    "body": "Wait what's going on with SH2R? I thought it was being pretty well received so far?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheMisterAce",
                                            "body": "Silent Hill 2 Remake is being developed by Blooper Team. Aside from the general concern that a remake of the game would not be good, Blooper Team is not well-known for their handling of mental and psychological themes in their games.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "UncultureRocket",
                                            "body": "Head in sand?  The promotional footage looks like ass.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Stevied1991",
                                                    "body": "Just not my type of game so I haven't gone out of my way to see it.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Nexus_of_Fate87",
                            "body": "Alan Wake 2s financial performance on PC is being hamstrung by being exclusive to EGS. That immediately removes it from the largest segment of PC users. I understand *why* it's EGS exclusive by the way, but that doesn't change the predicted end result.\n\nHowever, it is also Remedy's fastest selling game to date, so it may likely end up turning a profit in the end.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "VisualPersona95",
                                    "body": "I feel there are many factors towards Alan Wake 2 “underperforming”.\n\n- PC exclusive to EGS\n- no physical edition\n- a 14 year sequel to a niche game\n- A horror game (unless if it’s Resident Evil AAA horror games don’t really sell as well)\n- Being a very unique game (one of it’s strengths tbh)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Revealingstorm",
                                            "body": "It's definitely very unique compared to the first one but I think that's what makes it great",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ParkInternational418",
                                    "body": "I think AW2 is incredibly overrated. I completed Max Payne 1 and 2, AW1 and American Nightmare and Control with its DLCs and after 4 hours of AW2 I am struggling with caring about continuing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dinosauriac",
                                            "body": "Couldn't continue after a few chapters, it's just painful. The hallucinations or visions etc. induce headaches and the sound design is full of annoying jumpscares. The characters all act like they've been lobotomized and Alan Wake himself is barely in his own game. \n\nI'll always have a soft spot for the first, but think I'll probably just watch the rest of AW2 on YouTube sometime.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Samurai_Meisters",
                                            "body": "Completely agree. Bad combat, hand-holdy puzzles, brain-dead exploration that puts all the \"hidden\" collectibles on the map, and a story that was told in an obnoxiously repetitive way.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheNewFlisker",
                    "body": ">  if you compare it to titles like the Resident Evil remakes, it just isn't that good\n\n\nYou could apply that to virtually all horror games",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jasta85",
                            "body": "Pricing is the biggest thing hurting this game.  Most popular Horror titles on steam range from like $10-$40.  The only ones that really got away with charging $60 at launch were the Resident Evil Remakes, so that's the bar of comparison for games at that price.\n\nI think a lot of gamers are willing to wait 6 months to a year to get a game they want for half off.  There are a ton of releases these days so it's not hard to find someone else to play in the meantime.",
                            "score": 12
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "UncoloredProsody",
                    "body": "The end of the game was a huge letdown for me, the story climax and resolution felt dumb compared to how amazing the rest of the story and the atmosphere was. Also yeah, not worth 60-70 euros.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "SeparateIron7994",
                    "body": "In today's over saturated games market games just cant afford to be mediocre",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "twistedtxb",
                    "body": "too many games, too little time",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CallM3N3w",
                    "body": "I think gaming has fostered a culture where when people hear the word 'remake', they'll expect a full blown, multiple hundred million, AAA title.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Svorky",
                            "body": "More like if you ask AAA prices they expect AAA effort. It was $60 at release.",
                            "score": 81,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ICBanMI",
                                    "body": "That hasn't been true even going back to the 1990s. People are spoiled thinking that way.",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sharkattackmiami",
                                            "body": "In the 90s I couldn't get games like Helldiver's 2 for almost half the price of a major release. And indie games as we know them today didn't exist then. People paid full new game price for what would be a patch now. See the Street Fighter series\n\nIt's just a terrible example",
                                            "score": 6
                                        },
                                        {
                                            "depth": 4,
                                            "author": "eyeGunk",
                                            "body": "The idea of AAA games didn't exist in the 90's.  It really emerged in the latter half of the 00's during the PS3/360 Gen.  So you're right, but missing important context.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Real-Human-1985",
                                            "body": "it's just about choice. they can price what they want but clearly not many felt it was worth it. far better games are available for less.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "innovativesolsoh",
                            "body": "I think it’s because that’s what many consider to be the only worthwhile reason to do a remake, largely because for many who want remakes the most it’s because the original was important to us in some way and so it becomes our ‘baby’ and begin to focus too much on infinite possibilities rather than what is likely to be actually on the table",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "GalvenMin",
                            "body": "I mean, that's sort of the difference between remake and remaster these days. I'll probably get this one eventually as I was a huge fan of the series back in the day, but shelling out 60 bucks for something you've already played feels hard to justify, even though I get the idea (hiring high-profile actors, revamping the graphics, etc.).",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "arijitlive",
                            "body": "Well, if it is advertised as \"Reboot\", then of course gamers has certain expectations.    \nEven 'Remake' should have certain expectations. Remastered can get away with minor touch-ups.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Real-Human-1985",
                            "body": "the game was AAA price.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "we_are_sex_bobomb",
                            "body": "I don’t know much about the IP but it just didn’t look that interesting compared to Resident Evil or Alan Wake. It just looked kind of generic, without any kind of a hook. Maybe it was a failure of how the advertised it.",
                            "score": 0
                        },
                        {
                            "depth": 2,
                            "author": "_PM_ME_PANGOLINS_",
                            "body": "Have these people never heard of Nightdive Studios?",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "djcube1701",
                                    "body": "Nightdive do remasters, not remakes. And they're appropriately priced.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kered13",
                                            "body": "System Shock was pretty much a full remake.",
                                            "score": 6
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Zekka23",
                                    "body": "Probably not. Their remakes/remasters aren't putting numbers of the big boys.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "summerteeth",
                    "body": "I paid full price and was excited to play it and I don’t think it was a good game.\n\nIt’s super unpolished and the combat never feels good and then they ramp it up and it feels worse and worse as the game goes on.\n\nThe game has several promising elements but never really comes together, both narratively and at a design level. I have a hard time recommending it to anyone.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Hordak_Supremacy",
                    "body": "Well yeah, it's an AA game, not AAA.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ThaNorth",
                            "body": "But the same price as a AAA game",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BeholdingBestWaifu",
                                    "body": "I can't believe this is necessary but someone should explain executives how pricing works and why more expensive prices doesn't necessarily translate to bigger profits.",
                                    "score": 6
                                },
                                {
                                    "depth": 3,
                                    "author": "ICBanMI",
                                    "body": "Price is not tied to budget. We live in a great time, where you can buy incredible indie games for cheap at release, but that $60 price point has never been tied to budget.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "APRengar",
                                            "body": "Of course. But like, you understand how telling people \"You can buy a high budget AAA game for $60 or a decent budget AA game for $60. Budget does not and has not dictated prices in this industry.\" sounds right?\n\nEven going down to $50, which is likely not proportionate to the decrease in budget, would do MUCH BETTER in selling the game to consumers.",
                                            "score": 9
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Mitrovarr",
                                            "body": "It should be. If you price your game at $60 I'm gonna compare it to other $60 games, both in terms of quality and things like scope, production values, etc. If you can't hack it at that level, don't charge $60.\n\n\nI can't believe more companies don't know that yet. We had some great successes this year that I don't think would have been successes had they charged $70 - Palworld and Helldivers 2. They're great games but they don't have the scope and production values of a AAA so they price appropriately. Meanwhile, games like Immortals of Whatever (Aveum? I don't remember) from last year tried to play in the big boys club and charge full price, and got rejected because they couldn't hack it at that price and didn't want to sully themselves by playing in a league they were competitive in.",
                                            "score": 9
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BeefyQueefyCrawlies",
                            "body": "I'm looking for AAAA games, ever since Skull & Bones.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Babar669",
                                    "body": "Do you mean skull and bones?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BeefyQueefyCrawlies",
                                            "body": "Yes. I was 80% sure it was the wrong name but I was too lazy to look lol",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jansalol",
                    "body": "TLDR; Worth when~50% off?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rgamesburner",
                    "body": "It was $60CAD in a time where most games are $100 after tax. I had a $50 mall gift card and got it from GameStop, no regrets. I knew it wasn’t gonna sell, but I somehow expected THQN to give the studio another shot.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "Real-Human-1985",
                    "body": "Honestly in this current landscape there is no point to rebooting any old horror game that's not Resident Evil(YES, silent hill as well). You can add them all up(literally) and they're not as popular as any RE game. Why remake them in this modern AAA boom or bust landscape?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "renome",
                    "body": "While it's been ages since I played it, wasn't that Resi comparison also true for the first 3D Alone in the Dark?",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheMisterAce",
                            "body": "Alone in the Dark (1992) predates Resident Evil (1996). AotD was even an inspiration for the first RE game. Thanks to AotD's influence the fixed camera angle was used instead of a first-person view. [You can find more details on Resident Evil's Wikipedia page.](https://en.wikipedia.org/wiki/Resident_Evil_(1996_video_game\\)#Production)",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "renome",
                                    "body": "Ohh, I forgot the first one was already 3D.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "tawmawpaw",
                            "body": "It's true AitD predates RE, but it's also true about the comparison. Far more people knew about RE as I recall. That said, AitD (original trilogy anyway) has always been more puzzle focused than RE, similarities aside they're pretty different games.\n\nWhich is why this bombing is a bummer for me. I really like the pacing of this remake (so far, haven't finished it). It's pretty true to the original in that way, and as a huge horror game fan there isn't a lot filling that space right now.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Revo_Int92",
            "body": "Why waste budget with a Hollywood actor? You can model any human character, there's no reason to waste money with such dumb gimmick. Instead of injecting that money on marketing or, even better, on the actual game to improve things... nope, let's hire the Stranger Things dude",
            "score": 380,
            "replies": [
                {
                    "depth": 1,
                    "author": "weirdshitblog",
                    "body": "I feel like Calisto Protocol also did this. If it had been a $30 game it would have done better, I think. The combat is samey, the story is just okay, but it's not horrible. They really didn't need to hire Josh Duhamel and Sam Witwer if they wanted to save money.",
                    "score": 136,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sweaty-Professor-187",
                            "body": "While I agree with you in spirit, saying even 5% of the Callisto Protocol's budget went to the actors is probably stretching it, let alone something like 50%.",
                            "score": 20
                        },
                        {
                            "depth": 2,
                            "author": "Grill_Enthusiast",
                            "body": "I wonder how much time and money they wasted on all those ludicrously detailed death animations alone. \n\nThere are so many of them, they all last for like 10 seconds, and you won't see 90% of them because the game just isn't that hard.",
                            "score": 41,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Geno0wl",
                                    "body": "Only game I feel that tons of death animations were actually worth the money was L4D with the hundreds of death animations. Because you mow them down dozens at a time so it is super noticeable when animations repeat.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "shreksaget",
                                            "body": "I think he was talking about the animations for all the ways the player character could be killed, not for the enemies.",
                                            "score": 16
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "laughingheart66",
                            "body": "Also Sam Witwer was >!was such a waste considering he “dies” almost immediately and then is just a mindless monster for the rest of the game with barely any lines!<",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PaintItPurple",
                                    "body": ">!Actors are normally paid for the amount of work they do, so if Sam Witwer didn't do that much acting, that just means they didn't pay that much for him.!<",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "laughingheart66",
                                            "body": "Yeah but I assume they still had >!to mocap him since the monster looked like him until the final mutation. Even still, Sam Witwer for five minutes is more money than most VA’s they could’ve gotten for such a small speaking role. But you’re right in that its less money for the role because was less time!<",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "AL2009man",
                                    "body": "Oh yes, >!the Godzilla (2014 film) approach!<.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "laughingheart66",
                                            "body": "I always thought it was a brave choice to have >!a death scene so random and vague it feels like they just ran out of money to pay for Cranston and cut him from the rest of the film!<",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "kingdead42",
                                    "body": "Sounds like Patrick Stewart getting killed 10 minutes into Oblivion.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ChrisRR",
                            "body": "I think you underestimate how much game development costs if you think not hiring 2 actors would've halved the budget",
                            "score": 72,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NewLu3",
                                    "body": "Not only that, but probably vastly overestimating how much Josh Duhamel and Sam Witwer cost as well",
                                    "score": 72
                                },
                                {
                                    "depth": 3,
                                    "author": "weirdshitblog",
                                    "body": "You're not wrong, I have no idea how much game development costs. I didn't say I thought it would half the budget. I just think they could have spent the budget more wisely and make a less expensive game that cost less.",
                                    "score": 17
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Impossible-Flight250",
                            "body": "Callisto had very high production value though. It’s not like all the budget was blown on actors and nothing else.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "kikimaru024",
                            "body": "If it had been a $30 then internet cretins would've complained that \"it's obviously a shit low-budget game, waiting for $15, **NEXT!**\".",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "ertd346",
                            "body": "Its doom with meele combat shits",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ralod",
                                    "body": ">meele combat shits\n\nWait, it had combat shits? I might be in.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Muha8159",
                            "body": "> Josh Duhamel and Sam Witwer\n  \nI can't image that much. I had to Google both of them and still don't know who Witwer is.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "apaksl",
                    "body": "one could argue that hiring the Stranger Things dude was a kind of marketing strategy. I'd bet there are a lot of people who only remember/know of the game because he's in it.",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stonekeep",
                            "body": "That's me, I only remember that the game exists because of David Harbour.\n\nAt the same time, I really don't care whether a game has big-name actors or not. This game is just not my cup of tea so even if it had my favorite actors in it I wouldn't be interested in playing it.",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "Revo_Int92",
                            "body": "Fair, but it's a unusual strategy all the same. You rarely see games attempting this kind of gimmick in recent years, feels like a waste of resources",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Commercial-Falcon653",
                                    "body": "Remember 12 Minutes?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Patison47",
                                            "body": "I wish I haven’t",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "PredOborG",
                                            "body": "Remember \"Crime Boss: Rockay City\"? Don't worry, nobody does.\n\nhttps://www.youtube.com/watch?v=CpoGODP_TVQ&ab_channel=Xbox",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Disordermkd",
                            "body": "I was a huge Alone in the Dark fan in the past and follow most game releases and yet I didn't even know this remaster existed until today. So I don't think their marketing strategy was that good, lol.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Truethrowawaychest1",
                            "body": "Death Stranding probably wouldn't have been as much as a thing if Norman Reedus wasn't in it",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kiboune",
                    "body": "Some game developers even change whole story of the game, just because they want to feature one breathtaking actor",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "callmekizzle",
                    "body": "The money was injected in marketing though… that’s why you hire a high profile actor…",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EdliA",
                            "body": "Well the strategy didn't work out apparently.",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "gmishaolem",
                    "body": "Patrick Stewart at the start of Oblivion was a masterclass move, though. It can be worth it.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "JamSa",
                    "body": "I mean my girlfriend is interested in playing it at some point because of David Harbour, it doesn't seem like that bad an idea. It doesn't look like this game has anything going for it besides having David Harbour in it.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HIVnotAdeathSentence",
                    "body": "Just hire Sam Lake.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cable_Salad",
            "body": "Couple days ago I checked the sales numbers for AitD 2024, Outcast 2 and Homeworld 3. All three seem to have sold poorly.\n\nI wonder what will happen to the studios, esp. the Outcast studio. Man, that game's sales numbers are _abysmal._ And it was probably very expensive to make.\n\nI was very interested in all of these games and didn't buy either. They're not even bad per se... they're just not good enough for me. It must suck for AA games, but I don't see a reason to buy these if there are so many other, better games.",
            "score": 69,
            "replies": [
                {
                    "depth": 1,
                    "author": "spindash-",
                    "body": "Outcast 2 doesn’t even have a wiki page… something really failed here. Launching between FF7 Rebirth and Dragons Dogma 2/Rise of Ronin also probably didn’t help. The beginning of the year was stacked with games. Even Alone in the Dark launched 5 days after Outcast 2. Not great decisions from THQ.",
                    "score": 48
                },
                {
                    "depth": 1,
                    "author": "ThnikkamanBubs",
                    "body": "Outcast getting a sequel 20+ years later is still the most \"WHY?\" In gaming I've had for a long while. Barely anyone even knows the original existed. Did the remasters AND remake even sell alright?\n\nI am completely baffled that the game exists",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Chronis67",
                            "body": "I don't know what Outcast is or that any remakes, remasters, or sequels exist so you may be onto something.",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Quetzal-Labs",
                                    "body": "I was a fan of the first game despite it being... \"a mixed bag\", to put it nicely.\n\nAnd I had no idea the sequel even released.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pussy_embargo",
                                            "body": "The first game is an endearing Eurojank all-time classic. The new one looks and apparantly is absolutely soulless",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "creamweather",
                                                    "body": "Yeah and the things that made it interesting are the 3d world and graphics engine.  It was unique in a way that games really can't be anymore.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheBigLeMattSki",
                            "body": "I tend to have a decent knowledge of game releases and it took me this far into the thread to realize that everybody wasn't talking about Out*l*ast 2, so I can see why you had those questions.",
                            "score": 11
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DeadBabyJuggler",
                    "body": "The pricing is a failure for one thing. A lot of reviews stated Outcast was a solid game but the price was too high. I imagine the same was said for AitD.",
                    "score": 23
                },
                {
                    "depth": 1,
                    "author": "MarkWorldOrder",
                    "body": "100% the pricing. I get that game development is expensive and they have to recoup the money but I am never going to buy a game like the three you mentioned for the same price I paid for AAA releases like FF7 Rebirth and God of War Ragnarok. Those games would have sold more if they sold them at budget prices because like it or not, those are budget games. I saw Outcast 2 and the price and just laughed. These companies are insane.\n\nAlone in the Dark was like a 5-6 hour game for full price. They are nuts.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mitrovarr",
                            "body": "Better to sell your game at $30 than not sell it at $60.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "cheapsexandfastfood",
                            "body": "IMO the price would be fine at any other time. Premium games are now $70. I happily paid $60 for AA games in 2010.\n\n\n\nBut the double whammy of inflation eating into game budgets and the market being saturated is really hitting these AA studios now.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "neoKushan",
                    "body": "I bought homeworld 3 because it's where I get my namesake from. I kind of feel obligated.\n\nIt's not great.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "panix199",
                    "body": ">  It must suck for AA games, but I don't see a reason to buy these if there are so many other, better games.\n\nYeah, that's kind of the point. Market is oversaturated with quality games. Meanwhile also cost of living is rising, so videogames are taking less priority than in the past.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sharkattackmiami",
                            "body": "And I'm already getting 3-10 free games every month from whatever subscription service you have and there's generally at least a couple worth playing",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Zephh",
                                    "body": "Yeah, and most people by now know that these are the types of games that will eventually be bundled into these sorts of deals.\n\nDecent name recognition draws attention and it being overpriced at launch makes for a good \"you're saving X dollars in this bundle\" tag.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kucukeniste13",
                    "body": "Where do you check sale numbers?",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Mr_smith1466",
                    "body": "It's been extremely telling to me that nobody has bothered to write a plot synopsis for alone in the dark on the Wikipedia page.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "JamSa",
                    "body": "I have never heard of Outcast 2, no idea what it is.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LavosYT",
                            "body": "Sequel to an old 3D game which was pretty much a precursor to open world games.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "hopeful_bastard",
            "body": "It's a decent game. Horrible combat and a bit too reading-heavy, but it's definitely not without its bizarre charm. Closest we might get to a Deadly Premonition 3.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "NamesTheGame",
            "body": "This game wasn't marketed very well at all. Even though it was lower budget it certainly could have ridden the coattails of the recent resurgence of survival horror games (and remakes). Aside from unrealistic expectations of AAA game production, it seems many of these investor groups (and publishers) have unrealistic expectations for mid-tier games. The industry seems to want games to have the impact and sales of top-tier AAA games but the development time and budget of AA games. No wonder the industry is currently imploding.",
            "score": 128,
            "replies": [
                {
                    "depth": 1,
                    "author": "Defiant-Operation-76",
                    "body": "Explain what you mean by “wasn’t marketed very well.” I see comments like this a lot on games that didn’t perform and really would like to understand what you think “well” could have looked like in this instance.",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "-oldmanvhshand-",
                            "body": "I didn’t even know the game came out. I was excited for it, the last time I heard about it was when it was delayed, I forgot when it was delayed to and and am just finding out now that it’s been out since March",
                            "score": 67,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Elf3niona",
                                    "body": "Several big youtubers were invited to a special event (Angryjoeshow, Pewdiepie etc) that was recorded and put on their youtube as a special promotion",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "JillSandwich117",
                                            "body": "Youtubers/streams being used like this alone doesn't do much. A one-off, obviously sponsored video for a game that isn't exactly in their wheelhouse. Reminds me of the one paid stream Bethedsa did for FO76, which featured Ninja with Rick and Morty, only remember now as a meme. \n\nIt is better to pay a lot of people to stream it at once to cast a wide net, or go to channels with an audience that would be receptive to the genre at least. I follow a handful of survival horror heavy channels, and only one of them really covered the game, with a basic stream.",
                                            "score": 31
                                        },
                                        {
                                            "depth": 4,
                                            "author": "djcube1701",
                                            "body": "I had no idea those people were still making videos.",
                                            "score": 13
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EmeraldJunkie",
                            "body": "The problem is that there's so much money at the top end of gaming that people expected every title to have massive marketing campaigns that consist of high budget trailers at every major event, gaming or otherwise, a massive ad presence on websites, tie-ins with other games, and a dozen other marketing tactics I'm missing.\n\nThe problem is that all of that is ludicrously expensive, so mid and low budget titles rely on the very bare minimum.\n\nAs an example, look at the recently released Hellblade II; Hellblade II has had trailers at every Xbox event since it's announcement (as far as I'm aware) as well as a presence on the Xbox dashboard for the past few weeks, alongside a miriad of other marketing tools such as pre roll ads on YouTube and other social media sites, yet every conversation about it on Reddit was dominated by people stating it was not being marketed enough. Not to say that Hellblade is a mid-budget title, by the way, I'm just using it as an example.\n\nIn this very thread you'll see people who state they engage with gaming media frequently, yet they either didn't know the Alone in the Dark reboot had been released, if they even knew about it at all.\n\nIt's a really fascinating little thing to look at because it makes you question how we should be marketing these titles.",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Damnae",
                                    "body": "Ads? I'm not gonna see any, welcome to ad blockers. If all that's left is being on xbox dashboard and events, then I guess only xbox enjoyers will know about the game.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MVRKHNTR",
                                            "body": "How are you going to criticize something for a lack of marketing while also making sure you don't ever see marketing?",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cattypatter",
                                                    "body": "This is when you realise that even in the internet era, the majority of gamers and fan bases simply exist in their own small influence bubble of friends and favored content creators. If your marketing doesn't break through to them, to them it might as well not exist.",
                                                    "score": 14
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "paulcoatsink",
                            "body": "I can only speak from personal experience but I was an ideal mark for this game. My partner loves watching me play scary games. She learned of this game and showed me a trailer. We watched several more to see if it would be something we'd be interested in and what we came away with was:\n\nIts got 2 famous people in it.\n\n?? \n\nSo?! Is it scary? What do you actually do? \n\nBesides the occasional shot of janky monster combat, and a creepy girl being weird, there was absolutely nothing scary in any of the marketing. Just came off as a boring detective story game with potential for a monster encounter.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Korribuns",
                            "body": "This post is the first time I am learning about this game and I'm on this subreddit alot.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sgthombre",
                                    "body": "First time I learned about the game was someone posting the Fully Ramblomatic review in this sub.",
                                    "score": 6
                                },
                                {
                                    "depth": 3,
                                    "author": "InsanityRequiem",
                                    "body": "How long have you been in this sub? Years or months? Do you come to this sub multiple times in a day, or maybe just 20 minutes a day at most? Do you stick to the front page or do you visit /new constantly?\n\nAlone in the Dark was heavy in this sub when it was announced, when trailers were dropped, when gameplay footage was released, and when the game was released. Saying “a lot” means nothing if you are not in this sub 24/7 refreshing constantly on new.",
                                    "score": -1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DigitalSchism96",
                                    "body": "Well the purpose of marketing is that it is supposed to reach people. You can put out all the trailers you want but if they don't generate buzz then its bad.\n\nBut honestly I think that is beside the point. The real reason people on reddit think the game wasn't marketed is that a lot of them use ad blockers (me included). So even if the game put ads on the front page of every website in existence it wouldn't mean much to the average reddit user because they don't see them.\n\nThe only marketing that reaches them is whatever posts make it to the front page or a streamer they like plugging the game.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aradraugfea",
                    "body": "I never saw a single ad for the game, but a random streamer I half follow got a crazy multi layered puzzle box cooler than the actual game.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "m2thek",
                    "body": "I didn't know it came out or even existed until now",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "weealex",
                    "body": "The only marketing I remembering seeing was a pair of youtubers from Japan being invited to England for a sort of escape room thing as an add for it. It's not like kson and demondice are small, but I'm not sure the actual roi given their audiences",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Alastor3",
                    "body": "it wasn't marketed very well because they knew it wasn't very good",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GabMassa",
                            "body": "It's alright, though.\n\nIt doesn't do anything amazingly well that you can't find in other games, but it's not deeply flawed in any way as well.\n\nGood get from a 50% off sale, or Game Pass or something like that.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kradendarkstar2",
                                    "body": "This is what I’m waiting for. From the demo I knew right away it was a discount get or game pass title. Sucks the team has to deal with lay offs because embracer didn’t want to put more money into it.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GabMassa",
                                            "body": "Yeah, the industry is too \"risky averse\" nowadays.\n\nMediocre budgets, mediocre ideas and mediocre sales.\n\nSomething similar is happening to the movie industry too, but that gave rise to mid budget movies with wild premises that are paying off for the production companies that are investing in them, like A24.\n\nPeople want good stuff, and that takes originality and commitment, which seems to be rare.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AT_Dande",
                                                    "body": "The main difference is, I think, gaming doesn't have its own A24 or Neon. It's not as... centralized, I guess? Closest thing I can think of is Annapurna Interactive, with hits like Stray and The Outer Wilds. But most publishers aren't bankrolled by Megan Ellison, so they can't afford a laundry list of (admittedly great) games that underperform and almost no one has ever heard of.\n\nThe AA gaming space needs commitment and originality, yes, but you also need brand awareness with a decent track record. Annapurna and Devolver sorta have that, but they also have realistic sales goals. I assume they do decent market research since they haven't done a series of layoffs after layoffs, so their stuff sells, is priced decently, marketed well, etc. Like, it makes absolutely no sense to me that Embracer expected this game to do super well. Alone in the Dark has been dormant for over a decade, and the game looked decent, at best. Why did they put so much money behind it? Why did they sell it for $60? Boggles the mind, like just about everything else Embracer have said since the Saudi deal went belly-up.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "davidreding",
                                                            "body": "Idk Devolver Digital and New Blood remind me of A24.",
                                                            "score": 2
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "GabMassa",
                                                            "body": "Yeah, it's far too complex of an issue to address in a few reddit comment chains. But I do wish to see smaller games with more out there concepts.\n\nStuff like Disco Elysium, Balatro, Iron Lung, etc. Those are some of the best games from the past few years, simply because they take their concept to its extreme.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ManateeofSteel",
                            "body": "sounds like 90% of Embracer's output",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "InsanityRequiem",
                    "body": "Do you have an ad blocker? Do you interact with the internet in any capacity outside of your own bubble? If the answers are yes to the first and no to the second, the argument of “the game wasn’t marketed” is hypocritical. Alone in the Dark marketing was all over the internet, including this very sub multiple times.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "fiero-fire",
                    "body": "I watched a playthrough of it not too long ago. If they didn't get David Harbor you could have convinced me it was made by a solo dev",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "goodnames679",
                    "body": "Games that are just *decent* aren't worth spending excessive marketing budgets on. Yes, they could have spent a lot more on marketing and sold more copies... would they have made more profit, though? No, probably not.\n\n[Marketing is not why most sub-AAA games fail](https://www.youtube.com/watch?v=LCzhyUsDHPE). This video is about indie titles, specifically, but it highlights many of the flaws with that logic that I believe are applicable to all lower-budget games as a whole. He says it best in this line:\n\n> \"It's not that most [low budget] games fail to market their product, it's that most fail to make a product that is marketable. Their production and scope is not competitive with the top of their genre, so most of their marketing efforts gain no traction\"\n\nAlone in the Dark actually received a fair amount of marketing for a game of its quality, but few paid much attention to it because the game just wasn't that interesting.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Syssareth",
                    "body": "> This game wasn't marketed very well at all.\n\nCase in point: TIL there was an Alone in the Dark reboot.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "BoneTugsNHarmony",
                    "body": "Horror games just don't sell too well, anyway, unless it's has an established title like resident evil. Even dead space didn't do well enough according to EA, so I also don't think silent hill will either, but time will tell. Why companies still hang on to old game names that haven't had a hit in nearly 30 years is mine boggling, then tie it in with an average selling genre, you're gonna have a bad time",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Hellknightx",
                    "body": "I didn't even know this game existed. It probably would've helped if they hadn't just called it Alone in the Dark, which makes me think it's the original game.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "NeonYellowShoes",
                    "body": "These kinds of situations always feel like a \"we tried nothing and we're all out of ideas.\" The game got basically zero post launch marketing as far as I'm aware. Alone in the Dark is already a niche game in a niche genre so the real question is what did they do to make people even aware the game exists and what the game even is? Feels like companies basically expect to be able to just release a game and have it do well with no support.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Three_Froggy_Problem",
            "body": "It’s a bummer that this game wasn’t better and I think it was really dumb for them to waste money getting big name actors. I love the setting and Lovecraftian horror vibes of the AITD games and I would love for the series to make a proper comeback.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "official_duck",
            "body": "Absolutely unsurprising news, though disappointing all the same. \n\nWill this be the last Alone in the Dark reboot? Who knows. Probably not.",
            "score": 27
        },
        {
            "depth": 0,
            "author": "AnyImpression6",
            "body": "The last single-player Alone in the Dark came out in 2008 and was an infamously terrible game. That probably has something to do with it.\n\nYou have to do more than a mediocre game with a celebrity actor to make people care about the IP again.",
            "score": 23
        },
        {
            "depth": 0,
            "author": "mistadoctah",
            "body": "They should have actually remade the original AOTD, Not this weird soft reboot thing they do. Nothing against David Harbour but also I never ever really find myself wishing for A listers in any game. Imagine how much went to their pay packet alone.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "FunBuilding2707",
            "body": "There's an Alone in the Dark reboot?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "chase2020",
            "body": "Why did they make this? They did a full budget reboot back in 2008 and that bombed. They did a weird online thing in 2015, that bombed. Why do they keep thinking this will work?",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "LavosYT",
                    "body": "Why not? It wasn't the same studio I believe, and it's an established IP with history for the horror game genre. Would the game have worked better without the IP?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dreamweaver_duh",
            "body": "While I did enjoy the game, for me, the game was a buggy mess at launch. I can look past the rough janky gameplay and the lower budget, as I did enjoy the story and cutscenes... but I had the game tank its frame rate several times, had the game full on crashed on me (sometimes at specific cutscenes that were actually significant to the story), and ran into a bug that forced me to replay two hours of the game.\n\nAnd you know what about that last part? Apparently, that wasn't the worst bug. There was actually two other bugs that were way worse. Both of them were probably fixed by now, but for at least a month, these two bugs were present. One of them softlocked you by requiring you to use a set of keys that you get in Chapter 1 to use in Chapter 1 and Chapter 2... only for some reason the keys were coded to be used only three times total instead of one time at three different doors, meaning if you used the key on the same door in Chapter 1 (because it glitched and locks itself), then when you get to Chapter 2, you can't use the key twice, and the only option at the time was to restart the whole game if you didn't have a backup save.\n\nThe other? Way worse. In the beginning of Chapter 4 of 5, which is around 6-8 hours into the game (and damn near the end since Chapter 5 is about 20 minutes), you're meant to be locked on rails and can only go through a very specific door to trigger a cutscene. Well, what happens when that door is glitched and is also locked? For a month after launch, there was literally nothing you could do. Even the guy who had it happen to them posted a video of them restarting a save from the end of Chapter 3 and playing it again, and it still didn't fix it. At the time I was at the Discord, it wasn't fixed, and I haven't bothered to check if it has.\n\nLike, I honestly thought me replaying two hours of Chapter 4 was bad, but at least it fixed the game and I was able to finish it. \n\nAlso, for a game that was $60, it was lacking in content. Sure, horror games were short, and there's two campaigns, but the only difference is literally cutscenes, one singular gun, some collectibles (not even all, just some), and one specific flashback section of the game. That's it. What's worse? No unlockables. No skins, no filters, no developer commentary... unless you pay for it. Yes, you can't get anything like the classic 3DO skins, the horror filters, and the ability to hear what the developers were thinking when they were working on the game unless you pay for it. Even RE2 Remake threw you a bone with the classic costumes, unlockable weapons, and 4th Survivor/ Tofu Survivor with multiple Tofus to play as.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Sir_Von_Tittyfuck",
            "body": "I didn't even know this had come out, went and checked the release date: \n\nA month and two weeks after Helldivers 2. \n\nAt that point I had bought HD2 like a week or so beforehand.. so I was launching directly into the game and not looking at the store - I'm sure plenty of people here did the same thing which is why we missed it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PileOfSandwich",
            "body": "Why is it so hard for companies to set their expectations realistically? It's a reboot of Alone in the Dark. It's niche. The sales weren't ever going to be huge.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "some1stoleit",
            "body": "This is a reason I'm not a fan of remakes in established series. There's no guarantee the remake series will see it to the end outside of big series like Resident Evil. So it just ends unfinished\n\n\nTake the  Medievil remake, they did the first and radio silence or the Dead Space 1 remake, not good enough for EA so Dead Space 2 remake is probs not happening.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "wingspantt",
                    "body": "The issue is also actual momentum. I doubt anyone under 30 has ever heard of Alone in the Dark, and even people in the 35-45 range... what % of gamers have played the original? Like 2%? I have never met someone other than myself that mentioned the old game.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stinkmeaner92",
                            "body": "Yeah, NOBODY asked for this remake ",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MillorTime",
                                    "body": "There are a lot of things no one asked for that are great and do well, but they need to be great to do that.  That last part is what matters, and it sounds like that's the part that's missing.",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CultureWarrior87",
                            "body": "That's what I'm saying. Everyone is all \"The marketing sucks, this could have ridden the current survival-horror wave\" but it's like, hardly anyone cares about Alone in the Dark. Even when it was bigger, it quickly got overshadowed by other survival horror series like Resident Evil and Silent Hill. Easy enough to go and read about on Wikipedia. By the time the second game was ported to consoles in 1996, it was already being compared unfavorably to Resident Evil. Even the reviews for most games in the series aren't particularly stellar. Remakes like this make me scratch my head and assume that they're primarily made because some higher ups with a fondness for the original series forced it into existence. \n\nA lot of the current survival horror popularity seems to come from younger gamers too, like people in their teens and 20s, Gen Z kids who played a lot of Five Nights at Freddy's growing up and watched horror reaction youtubers. I'm not gonna pretend I'm super hip or anything like that, but I just can't see that audience getting excited about a remake of a horror game from the early 90s that's also set in the 1930s. Something about it just doesn't feel like it has a very large appeal.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "HappyVlane",
                            "body": "Alone in the Dark is more than the original. There is the reboot from 2008 which is more relevant to today's audiences.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kasakka1",
                                    "body": "Yet I'd say only the 3 first games are relevant and everything else has been just increasingly terrible.\n\nAs a fan of the original, I didn't expect much from a remake and also felt it wasn't necessary. Resident Evil has basically taken over that genre and done it better.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Nexus_of_Fate87",
                                    "body": "16 years ago. That's when the last game released. It was also a critical and commercial flop. The last Alone in the Dark title that wasn't was in 2001, 23 years ago. Resurrecting a franchise that hasn't had meaningful relevancy in a quarter century is always a gamble.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "APRengar",
                            "body": "The only reason I know of the series is some YouTubers I watch meme on the 2008/2015 remakes.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "wingspantt",
            "body": "I was a teen when the first came out and I never figured out what people liked about it. The original was clunky and I never thought there was enough hype to justify a remake to begin with!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Mishashule",
            "body": "Played this at release a bit and quickly dropped it\n\nThe controls felt off, the male va's voice acting ranged from grating to downright bad to me, experienced a number of glitches both visual and gameplay related but the one that got me to stop playing was when it played a loud static sound in my left ear for no reason for the third time\n\nMaybe I was just expecting something akin to how the old games felt and maybe that's on me. Oh well, the old games are still there to be enjoyed",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Rialmwe",
            "body": "Embracer will keep exploding like a frag grenade. Until they become nothing. It's so amazing how many bad decisions can they take just because of cheap money. I would love to understand who it's willingly to keep putting money in that empty box. But hey id they realease Gothic Remake and Titan Quest, maybe there is a little chance that I might be interested in those two games, during sale.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Elden-Cringe",
            "body": "I really wanted this game to succeed especially since the writer behind SOMA (one of the most haunting experiences I had in any medium) was in charge of this game but when they put out that sorry excuse for a demo, which is literally 5 minutes long and tells absolutely nothing about the game, I was concerned for it.\n\nIt's a shame that this game supposedly didn't elevate beyond being a janky, forgettable B version of Resident Evil. Still, I would probably pick it up at a deep discount and it's the best offering in the AoD franchise released over nearly 2 decades...which isn't saying much.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "realblush",
            "body": "That's sad. I liked the game, it was a good AA survival horror game, far exceeded my expectations. Yea gameplay wasn't perfect and performances \"eh\", but it had great setpieces and some really fantastic scares. Absolutely worth a try.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "AdmiralVenture",
            "body": "I think it would have done better if it came with a little tiny book full of pictures you needed to reference in order to install the game.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Snugrilla",
                    "body": "I appreciate this reference.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SanguinolentSweven",
            "body": "Asking $60/$70 for a 8 hour game doesn't do it for most people. It should have been priced more reasonably. I absolutely love Resident Evil but even I wait till they're half price cause the campaigns are short. They should have dropped the Hollywood names cause no one truly cares (a good game is a good game) and priced it $30. At least this way, part of the budget wouldn't have been wasted on paying Hollywood actors.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yourenzyme",
            "body": "This is the first time I'm even hearing about a reboot. Guessing it had zero marketing?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Blood-PawWerewolf",
                    "body": "Yup.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kaosxandra",
            "body": "I'm not surprised. From the very first trailer it reeked of a middle of the road experience... And that's fine, not everything needs to be some bloated bag of production; but with budgets these days, expectations from corpo overlords, etc, it's hard to see a game like this standing up to scrutiny from both the corpo folk, or the people it's meant for - for different reasons of course. It also certainly wasn't helped by having 2 entirely pointless celebrity faces/voices jammed in... DEVELOPERS, please STOP doing that crap.\n\nFor me, The New Nightmare is - and still is - the only good game in the entire franchise.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "pnwbraids",
            "body": "All this talk about marketing in this thread has me thinking about Yahtzee's \"Hype Paradox.\" The more your game needs marketing and hype to promote it, the less likely it is that the game is actually good. Meanwhile, something genuinely good doesn't need much marketing at all.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "NGAnime",
            "body": "That's too bad, I usually wait to get games on sale and I'm still looking forward to playing this at someday.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "K1nd4Weird",
            "body": "I didn't even know this had come out. \n\n\nAnd I'm not surprised it flopped at all. It looked niche as hell and for some reason they went and grabbed a Hollywood actor. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MISFU88",
            "body": "No reason for them to use a Hollywood actor for the main protagonist.\n\nAlso, I find it so fucking cringe that The Gamers essentially want to get rid of medium sized games with lower budgets and only want Spider-Man again, again and again. Shit like “hmm wish it was $30 instead” - how about we make video games free, only those costing bazillion bucks can earn a price tag?! \n\nNobody expects Alone in the Dark to sell as many copies as a remake of the most acclaimed Resident Evil game. There’s no fucking way they’d come even close to selling half of that. But Alone in the dark also costs money to make and they somehow have to make it back. Therefore no, they can’t sell it for fucking 20 or 30 whatever dollars.\n\nAlso, the game is really good and people who like horror games should play it. But I bet those people finished it already and sadly, it’s not going to appeal to Spider-Man and Nu-Resi fans, because it simply isn’t a blockbuster.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Late_Cow_1008",
            "body": "I bought it for 20 bucks a few weeks ago and figured I would try it out. I haven't played it yet but I heard it was okay just not very amazing.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Tacdeho",
                    "body": "Damn. Where did you get a deal like that? I’m a longterm AITD fan and wanna play this regardless of reviews, but I also don’t feel like dropping $70 on it lol",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Late_Cow_1008",
                            "body": "Gamestop had it on sale for the pro members. It was 20 or 25. Don't remember. Also got Lords of the Fallen for around that price.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "UncultureRocket",
                            "body": "The only way you could get a decent price right now is if you buy it off key sites that discount new games like Gamers Gate and Fanatical.  Sites like those you can get it for less than $50.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BottleRich3597",
            "body": "So what's the chance Atari would buy the rights back to this series? They bought back some of their sold off stuff, such like GT interactive, why not this.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "chase2020",
                    "body": "Atari isn't related to Atari so them buying back an IP the old company used to own wouldn't really do anyone any good. They have no knowledge or expertise on how to make an Alone in the Dark game. They are literally just some random people who bought the name Atari to try and cash in on their name.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pgtl_10",
                            "body": "Atari is a little more than that. Not the same people but Atari has been broken up in many forms over the years. \n\nThis company was once called Infogrames and was fairly noticeable early 90s/2000s. Made Godzilla and some Dragon Ball titles.\n\n  \nThey also own Nightdive Studios.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "chase2020",
                                    "body": "but what they don't have is any sort of connection or expertise with the IP. There is no reason for me to believe that they would do a better job with it than any other studio would. In fact with their track record I'm sure there are lots of studios I would rather have a shot at it.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Chronis67",
                    "body": "Atari is trying to coast on buying low priced IPs so they can put out budget compilations. Embracer isn't going to part with the license for cheap, so it wouldn't make sense for Atari to buy it unless they have the ability to put out new games using the name.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pgtl_10",
                            "body": "Or use Nightdive to remaster old titles.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "McFistPunch",
            "body": "I want to play it but it's expensive and I work full time.  Too many games and I can't support them all as interested as I am :(",
            "score": 1
        },
        {
            "depth": 0,
            "author": "armonzki",
            "body": "I finished Alan wake 2 and was looking for another game in that vein. Is this comparable?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LavosYT",
                    "body": "It's much lower budget and has jankier combat. Check out videos.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "wra1th42",
            "body": "Played the demo at PAX and was not impressed. Plays very slowly, but not difficult. The puzzles are very simple find the right item for this [lock in a different shape]. The accents are very exaggerated. Just really had nothing to grab me besides the switch back and forth between the dream world and real world, which has been done plenty of times before",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OverHaze",
            "body": "There was an Alone in the Dark reboot?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "matheww19",
            "body": "I didn't even know it was out yet. It was so weird how they handled marketing for this. There was a big marketing push a year before it was released and then mostly crickets when it launched.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dan_t_mann",
            "body": "Another one?!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HIVnotAdeathSentence",
            "body": "With Alone in the Dark and other games underperforming, sounds like the layoffs were expected.\n\nThe series has rarely had good games since the original, so low sales seem in line. It was horribly marketed, I barely remember this being released.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MoogleLady",
            "body": "I don't really understand why they're so dead set on pushing alone in the dark as an IP. Is it really going to sell copies due to the name? I think most people associate it with bad games at this point.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LavosYT",
                    "body": "Because at its inception it was still a franchise that kick-started a lot of survival horror tropes and influenced games like Resident Evil, I suppose.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "chuputa",
            "body": "Honestly, I never saw the point in bringing back the ip. It never really had something that set it apart from the rest of horror games, all the value of the franchise comes from being one of the first horror games. Considering even Dead Space didn't reach sales expections, I don't think an Alone in the dark game would have done better even with more marketing budget.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "apollo_software",
            "body": "Solid game, bad pricing.  Harbor and Comer both did fine acting and mocap work. I played as the girl and am just over an hour in.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ducklord",
            "body": "It was evident by the trailers that:\n\n1. They didn't know which direction to take the franchise, since after the original created the concept of adventur-ish survival horror, others - like Resident Evil - built and improved on it in various ways. Apart from changing perspective (make it first-person, top-down, etc., that others have already done), tweaking the inventory (that others have already done), putting more or less emphasis to either the story or action (that others have already done), what COULD they do? Ah, yes...\n2. ...hire pro-level actors \"to make it more cinematic\". And, in the process, I guess they blew most of their budget on those, let's be realistic, good-but-not-top-tier actors (for they're surely not Bale and Blanchett), to give half-assed performances, for non-gamers rarely take the medium seriously.\n\nAll the while, Miss Juergens gave an Oscar-level performance for the two Senua games (OK, \"the first game and the new tech demo\"), while being... er... one of the company's graphic artists and video editors?! I can safely guess she was also paid peanuts compared to Alone In The Dark's protagonists.\n\nDamn, even the ancient Riven's cinematics felt more \"lively\" than the main characters' voices in the new AitD.\n\nSo, to recap:\n\n- Same old setup as the originals, and dozens of games that followed.\n- Same old \"formula\" of action, puzzles, and mediocre storytelling.\n- Atrocious performances by actors who obviously phoned it in for the paycheck.\n\nGee, \"it failed\"?!? Vat eh sahprize!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gonline",
            "body": "Watched a let's play of it. Had great ideas, and great VA's but the animation was really mediocre and the gameplay wasn't very interesting.\n\nI didn't really enjoy the idea of how they conveyed the dark world. I much preceded the original with the mansion vibes. \n\nA shame.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WickedRaccoon",
            "body": "I really liked how when you approached a locked door, the games goes first person and zooms in on the door, the character says \"I need a key.\" in the exact same way every time, then it goes back to third person. Really well done and not immersion breaking at all.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HenkkaArt",
            "body": "I was interested in the game when I heard about it. But then I saw that once again there were real actors used for the character faces and it immediately turned me off. I just don't want to see a real person there. We have these amazing technologies at our disposal and we could create iconic characters and instead we are still trying to chase that movie prestige bullshit.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Golemhorho",
                    "body": ">instead we are still trying to chase that movie prestige bullshit.\n\nIt has nothing to do with that though? I don't understand why it's not part of the \"amazing technologies\" that we have used real actors or done FMVs and the sort. Hell, a [certain fighting game series](https://www.youtube.com/watch?v=Tj3_0AmiJbg) kickstarted a whole trend about using real actors for fighting games. Adventure games have also used real actors, such as Christopher Lloyd in Toonstruck.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HenkkaArt",
                            "body": "Argument for FMVs can be made for using real actors because the alternative was drawn still images or images with very limited animation (see Dune 2 vs. Dune 2000).\n\nMortal Kombat's use of real people has nothing to do with having Mark Hamill or Gillian Anderson's faces in Star Citizen, other than Chris Roberts' incessant desire to make a movie game (see Wing Commander games). Or having that Stranger Things' dude's face as Edward Carnby in Alone in the Dark. Or Kojima's games featuring real actors. They are absolutely unnecessary and break the immersion and are there to stroke the egos of the developers. I'd rather have custom-made characters that don't resemble real people.\n\nI suppose you could argue for the adventure games' usage of real people as some of them can be quite bizarre, seeing how Toonstruck has similar odd vibes as something like Who Framed Roger Rabbit.\n\nTo me, the \"amazing technologies\" mean creating something new, something not possible with cinema or TV. And yet, developers seem so hellbend on chasing that Hollywood flair that they do the most boring thing ever, using real faces.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Golemhorho",
                                    "body": ">To me, the \"amazing technologies\" mean creating something new, something not possible with cinema or TV. And yet, developers seem so hellbend on chasing that Hollywood flair that they do the most boring thing ever, using real faces.\n\nI don't really get this argument. Cartoons and CGI exist for both forms of media, making the exact same things possible. What kind of characters are only able to made within games? Pixel characters?\n\n>They are absolutely unnecessary and break the immersion and are there to stroke the egos of the developers.\n\nDo voice actors do the same thing to you then? They are much the same real people, some which might be personally chosen by the directors for their roles - perhaps even speaking quite blatantly in their normal tone. Does it not break immersion, for instance, to have Mark Hamill voice act? Is Mark Hamill allowed to voice act only within the space of cartoons and not in video games? I'm scratching my head over how this works. I can understand the argument that it's blatantly throwing money in the budget towards largely unnecessary things, but as an argument for immersion I don't really get.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "HenkkaArt",
                                            "body": "Might be just me but I feel like you are making these questions in bad faith.\n\nNo one was talking about voice actors/acting. It's an entirely different subject matter. Generally voice acting is less intrusive even if the actor is using their normal voice because most people don't recognize voice actors' voices the same way they recognize even a semi-famous actors face. I doubt most people see Nolan North's face every time Drake talks. But if Drake had North's face, it could be off-putting, especially after years of being in the spotlight of being the generic male 01 voice. And talented voice actors can change their voice when creating the character.\n\nBut Mark Hamill will always look like Mark Hamill if his face is in Star Citizen's Squadron 42. And it is miles more immersion-breaking. Because it's no longer the character in the universe of Star Citizen, it's Mark Hamill acting as the character in the Star Citizen universe. And to me it is a detriment. And it becomes even more so if the actor is someone I'm not terribly fond of.\n\nAnd with video games we have the tools to avoid these situations, truly create memorable characters but instead we just push forward towards some sort of cinematic legitimacy, as if the industry ever needed to be held to the same \"lofty\" standards like the movie industry.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "PapstJL4U",
                            "body": ">  Hell, a certain fighting game series kickstarted a whole trend about using real actors for fighting games. \n\nJust the fighting game infamous for having the worst animation in the genre. I am not sure this makes an argument for using actors.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "arielzao150",
            "body": "Could it be an Epic exclusive issue? Alan Wake also undersold, despite being a great game",
            "score": -11,
            "replies": [
                {
                    "depth": 1,
                    "author": "dieserhendrik2",
                    "body": "It's on Steam.",
                    "score": 20
                },
                {
                    "depth": 1,
                    "author": "demondrivers",
                    "body": "PlayStation and Xbox also exists, AW2 has a long tail and is on its path to profitability, AAA horror games not called Resident Evil historically never did super well, and Alone in the Dark is a Steam exclusive game on PC: [https://store.steampowered.com/app/1310410/Alone\\_in\\_the\\_Dark/](https://store.steampowered.com/app/1310410/Alone_in_the_Dark/)",
                    "score": 30,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "arielzao150",
                            "body": "I'm aware it also released on consoles, but with a limited release on PC makes it so there's less discussion of the game between people. I don't know of anyone that played this game, and my friends that played AW2 did so on Game Pass.",
                            "score": -20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "demondrivers",
                                    "body": "How they played Alan Wake 2 on Game Pass if the game isn't on the catalogue yet?",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "arielzao150",
                                            "body": "I did a quick google before leaving that comment as saw some results of it being on Game Pass. I did it again and it seems many misremember of it being available there, and as my friends also play on Game Pass (I don't) I misremember that too. My bad.",
                                            "score": -9
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Alastor3",
                    "body": "Wake wouldnt exist without that exclusive",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ericmm76",
                            "body": "That doesn't negate the issue though.\n\nIn a weird way I feel like people would be more willing to buy a PS5 to play a game than to install a new game installer like Epic.\n\nThe game's on PC. Why do I need to install ANOTHER program to play a PC game on it? At least a PS5 is something new.",
                            "score": -5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MVRKHNTR",
                                    "body": ">In a weird way I feel like people would be more willing to buy a PS5 to play a game than to install a new game installer like Epic.\n\nNo, they absolutely would not. You guys are just really weird about Epic.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ericmm76",
                                            "body": "(not denying that I'm weird about Epic)",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BigfootsBestBud",
                                    "body": "I just moved to PC and I really don't get all the fuss about Epic ",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Rayuzx",
                                            "body": "Pc gamers  just really REALLY don't like using different launchers. Valve is seen as the holy beacon of gaming, therefore it's morally bankrupt to challenge the company in any way.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "NightmareFiction",
                                            "body": "The Epic storefront launched offering lower fees compared to Steam and other monetary entitlements to entice developers to use their storefront, but also locked them into exclusivity contracts (typically, for at least 1 year). It was the first time in recent history where a company has actively tried to introduce \"storefront exclusivity\" in the PC gaming market and people are against that, arguing that exclusivity contracts like those are anti-consumer. \n\nThis is all against the backdrop of the current segmenting of streaming services, due largely in part to exclusivity.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BigfootsBestBud",
                                                    "body": "I don't get why it's anti-consumer though. I just have to boot up a separate launcher on my PC and I play the game. Is it ideal? No, i'd prefer everything be on my Steam Library. But it isn't a big deal to me.\n\n\nI understand the second part though. ",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Mitrovarr",
                                    "body": "But that was literally an option. Alan Wake 2 launched on Epic *and* the PS5.\n\n\nMost Epic published/exclusive games are released on consoles too.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Zekka23",
                    "body": "AAA or even expensive AA horror games typically don't sell that well or make that much money. You either have to Resident Evil or Last of Us, be one of those indie Horror games that are cheap as hell, or be one of those multiplayer viral horror games.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Rayuzx",
                    "body": "Bare in mind, Allen Wake 2 did not undersell, while it hasn't made it's money back yet [Remedy has reported that they are satisfied with the results](https://investors.remedygames.com/announcements/remedy-entertainment-plc-financial-statements-release-january-december-2023-challenging-year-results-in-two-established-franchises-after-the-successful-alan-wake-2-launch/).",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CoelhoAssassino666",
                    "body": "In Alan Wake's case it was likely because they predicted the game would fail and the Epic exclusive deal made it worth it. It likely would never have been considered otherwise, the first one wasn't exactly a success.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jancappa",
                            "body": "Alan Wake 2 didn't have an Epic exclusivity deal the game was literally published by Epic",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CoelhoAssassino666",
                                    "body": "Yeah, but what I said still stands, they likely accepted that because they never expected AW2 to sell well.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MVRKHNTR",
                            "body": "It was published by Epic.",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "jordanleite25",
            "body": "People say they want AA games from mid-sized studios, don't buy them, and then shocked pikachu face when there's layoffs/closures and blame the evil suits.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "robotoboy20",
                    "body": "We want AA games that are good. This game got a 63 on metacritic. It was not good. Just because a game has a smaller budget, team and scope doesn't make a game exempt from criticism. \n\nYou can't just be like \"why didn't you go out and buy this AA game!?\" when the game you're presenting was terrible. Hi-Fi Rush was amazing, and people did buy that game (based on what Microsoft was saying when it launched).\n\nThis take is so reductive to the point of AA games being what people want. Hell you could argue that plenty of Nintendo stuff is AA... and a lot of that is pretty damn good.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jordanleite25",
                            "body": "Games like this are not going to score well on Metacritic, especially if they're going for a \"realistic\" look and feel. Hi-Fi Rush and Nintendo are \"stylized\" which is fine. But if you want games like this you gotta pay. I bought, played, and enjoyed Alone In The Dark...I'm doing my part!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "StealthyCockatrice",
            "body": "Thats what happens when you spend more time hiring actors and marketing the game instead of...you know...making an actual good game?",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "junttiana",
                    "body": "Idk about the marketing part either, I had no clue the game had even released before I saw this post",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "BloodstoneWarrior",
            "body": "I didn't even know this game came out, and any game that just shoves celebrities in for no reason actively pushes me away.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "GhostDieM",
            "body": "Will the original Alone in the Dark was received kinda poorly if I remember so dunno what they were expecting lol",
            "score": -1
        }
    ]
}