{
    "title": "Warhammer 40,000: Rogue Trader - Official Void Shadows DLC Teaser Trailer",
    "comments": [
        {
            "depth": 0,
            "author": "Jancappa",
            "body": "Got my boys the Genestealer Cults as new enemies\n\nLove how Owlcat went for the less common factions in this game like Drukhari and GSC",
            "score": 29,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheVoidDragon",
                    "body": "Hoping Leagues of Votann show up at some point, they're the least common of the all the factions...",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KindlyBullfrog8",
                            "body": "They're the newest faction so I'm not sure if they're fleshed out enough to appear in anything yet",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "android223",
                    "body": "Yeah, the focus on Drukhari in the main game was pretty cool. \n\nA little sad there are no Orks though.  Love those goofy boyz. Maybe the next dlc.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Galle_",
                            "body": "There are no Orks *yet*.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Temporary-Fudge-9125",
            "body": "I really love this game.  It has flaws but it has so much soul.  And it's a truly great RPG where you really feel like you are assuming a role in the world and can shape your character.  If you are into 40k lore this is a dream game.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chance_Fox_2296",
                    "body": "For me, this was one of those rare games where every single day I booted it up after work and played I was just constantly thinking \"I can't believe this game is real. I'm actually playing a fully fleshed out CRPG IN THE WARHAMMER 40K UNIVERSE!\" Like you said, there are flaws! but the absolute amazement and joy I got from playing an RPG in WH40k completely overrode the flaws. Truly was one of my \"once in a generation\" games!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Temporary-Fudge-9125",
                            "body": "Yeah it just was very clear to me the dev team loves 40k and they poured a lot of that passion into the game.  There have been some great 40k games but nothing that deep dives into the world like this.  I'd even say the game is a better experience of 40k than the vast majority of the 40k books.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chance_Fox_2296",
                                    "body": "100000% agree! I love every Warhammer book written by Dan Abnett, but whew, lordy, there are some stinkers out there from other authors lmao.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Chataboutgames",
            "body": "This is the first time I'm really making an effort to not do a full run of a CRPG until it's patched and fully DLCed and it's *brutal.*  Glad to see these announcements on schedule as it means I'll likely be able to play in December.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SOUTHPAWMIKE",
            "body": "Very cool. Looking forward to this. Looks like the new companion might be a [Deal Cult Assassin](https://wh40k.lexicanum.com/wiki/Death_Cult) which is kind of a deep cut.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Eldryth",
                    "body": "This is correct, they actually announced that much a while back when they gave [a broad overview of the Season Pass's two DLCs.](https://store.steampowered.com/app/2687230/Warhammer_40000_Rogue_Trader__Season_Pass/)\n\nThe second DLC will add an Adeptus Arbites companion.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Chataboutgames",
                    "body": "IIRC they announced that as the plan when they first did the DLC roadmap.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BacucoGuts",
            "body": "I wish the combat system was different, I discovered I dislike owl combat system, too much \"useless\" info, having to stack abilities and buffs and debuffs so I can use x ability or in order to have a chance, too many numbers and abilities that needed to be used together. The RPG aspects is really fun tho, I was having a blast in everything that wasn't combat",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chataboutgames",
                    "body": "It uses a completely different combat system than Pathfinder, and neither of them are \"Owlcat\" systems, they're adaptations of the respective tabletop games. \n\n\n\nIn Rogue trader on normal difficulty you can absolutely just focus on \"shoot and chop\" abilities and not worry about any buffing.  It isn't focused on pre buffing like Pathfinder is.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DavidsSymphony",
                            "body": "I would have never been able to bear playing Pathfinder WotR if it weren't for mods that make the game a lot more enjoyable, such as the one auto buffing your whole party pre fight with just one click. Saves you countless hours.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "BacucoGuts",
                            "body": "Not really, I played on normal and there were boss fights that I had to try and use the max of my abilities and if it wasn't for the navigator op abilities, I would probably have even less fun.And I played fear and hunger, I can deal with boring trial and error and tough unfair fights, just all the numbers and synergies turned me off",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chance_Fox_2296",
                                    "body": "Your criticism is completely valid regardless, but as soon as I saw you mention Fear and Hunger, I relented any argument I thought about engaging you with, hahah. Definitely a case of \"this game just isn't fun for you.\" And that's that. At least you gave it a try! I actually bounced off their Pathfinder games multiple times, but my love of WH40k has driven me through this entire game. I loveeeee the story and writing and characters and choices, but I do not love the combat either.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BacucoGuts",
                                            "body": "I played like 30 hours before realizing I was pretty bummed everytime I had to do combat, and u have no idea how much I pushed myself to play the game! I love Warhammer!!! One of my favorite games is total war warhammer :( . But yeah maybe 1 day I'll enjoy the combat more. But yeah kinda of a shame I discovered and entered the fear and hunger rabbithole ( and I am playing it again as of now) and I didn't even finish rogue trader, a game I was very excited for. That's life sometimes!!!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Chance_Fox_2296",
                                                    "body": "Yeahhhhh true that. Total War Warhammer 1 2 3 has consumed 3000 hours of my life since 2017 lmao. I beat Spacemarine back when it released and didn't really like it. After the delay of Spacemarine 2 I decided to get Spacemarine complete edition on pc and holy cow I'm loving it this time around! If only WH 40k Fire Warrior held up...that's the first ever experience with Warhammer for me!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "BacucoGuts",
                                                            "body": "Can't wait for Space marine 2!! One of my favorite action games, it's what introduced me to Warhammer when I was a teenager! We are eating good, even better if that Amazon tv series turns out to be good",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GentlemanBAMF",
            "body": "How's the console port for this? I really liked Kingmaker and want some more Owlcat goodness.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "dishonoredbr",
                    "body": "They were pretty rough when they launched but nowdays is pretty stable.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bujakaa92",
            "body": "How is the game? Worth picking up?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Avenflar",
                    "body": "It's good but was rushed IMHO. If you have the patience I'd recommend waiting for a good Definitive Edition, then it's a 100% yes.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EhCanadianZebra",
            "body": "How is this game now? Steam reviews are sorta still mixed on it. I know there were some issues at launch.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "KobraKittyKat",
                    "body": "It’s in great shape last I played a few months ago all the patches made a world of difference.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "Complete-Monk-1072",
                    "body": "its phenomenal writing, i made it to act 2 last month, but the game mechanically really hamstrings you into certain builds. For example psykers really struggle hard in the early game and its designed to really push the player into playing melee fire buff type char or you essentially hamstring yourself the entire game into only using 1/2 your total actions per round.\n\nStuff like that really mechanically wont ever change and its a shame because all it does it hurt the player and force you to pretty much play the way they want you to and made me stop caring to come back. But again, i didnt see alot of bugs and writing was still top tier.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Avenflar",
                    "body": "Basically the game is great for 3/5, and then it immediately feels like it's development was rushed out of the door. Suddnely no companion interactivity, events are being managed with text-based aventure slides, you're revisiting limited sections of places even if they're changed due to your actions.\n\nHonestly I'd wait for a Definitive Edition so the game is more complete, which will doubtlessly happen.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sawaian",
            "body": "Curious on if I need to do a new play though to access this content?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Myrlithan",
                    "body": "The Owlcat Community Manager said this on the Rogue Trader subreddit- \"The DLC will be integrated even on a loaded game, but depending on the point you load it from, you may skip some or even almost all of the content, since it starts rather early in the game.\"",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sawaian",
                            "body": "Sounds like I’ll need to start a new game. Beat it months ago. Guess I’ll try out Heresy.",
                            "score": 3
                        }
                    ]
                }
            ]
        }
    ]
}