{
    "title": "Warhammer 40,000: Space Marine 2 - Official PvE Co-Op Mode Gameplay Reveal Trailer | Skulls 2024",
    "comments": [
        {
            "depth": 0,
            "author": "KobraKittyKat",
            "body": "This looks a lot more then I was expecting I just thought the campaign would be co op but having extra mission is also great t",
            "score": 63
        },
        {
            "depth": 0,
            "author": "TheVoidDragon",
            "body": "Game looks fantastic, looks like it'll capture the scale, tone and atmosphere of the 40k setting very well. Having a co-op more is going to be great too, and the Multiplayer in the original game was a lot of fun. So much about the game just looks awesome.\n\nDo slightly feel like i would have prefered the Tyranid invasion be the focus for the whole game though rather than having chaos involved yet again and taking away from that side somewhat. Chaos forces being involved / behind something has become a quite common thing to happen in 40k stories, so it's something that has become a little repetitive and uninspired at this point, really. \n\nVery much looking forward to the game anyway, great that space marine is getting a sequel after so long.",
            "score": 37,
            "replies": [
                {
                    "depth": 1,
                    "author": "Stofenthe1st",
                    "body": "Does become pretty memey when something is going on but then it turns out Chaos was actually pulling strings yet again. It’s a bit more excusable here since they’re able to recycle the Space Marine assets and simply reskin them for new enemies in the campaign and for the multiplayer.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Chataboutgames",
                            "body": "I get that it's memey but I feel like it's hard to do a Space Marine game without them.  So much of the violent religiosity is just best explored through Chaos. \n\n\nPlus I think people get a bit bored of fighting monsters at some point, they want to fight other humans (insofar as Chaos marines are still human). I think things like Eldar would also scratch that itch but depicting them in a game like this seems super expensive.  Also kind of a lore LOL moment if the character single handedly kills like 500 Eldar.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Herby20",
                                    "body": "> Plus I think people get a bit bored of fighting monsters at some point, they want to fight other humans (insofar as Chaos marines are still human).\n\nThe thing is, Tyranids have Genestealers Cults and the hordes of different levels of hybrids that come with them. This is particularly of note because Genestealers Cults had roster/lore updates in the somewhat recent past that could have been explored too. It would be very easy to incorporate those sorts of enemies into the game to keep that more \"human\" element available as an enemy.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Gorudu",
                    "body": ">Chaos forces being involved / behind something has become a quite common thing to happen in 40k stories, so it's something that has become a little repetitive and uninspired at this point, really.\n\nI agree from a story perspective, but from a gameplay perspective it would get pretty repetitive facing only nids the whole game. \n\nI'd definitely prefer a different faction... always thought Necrons would be a unique faction to fight. We already fought Orks. Dark Eldar are another option. Then the other Xenos factions would feel bad to fight lol. Killing Tau as a Space Marine wouldn't feel... uh... well you wouldn't feel like the good guys. I know that's a major thing in 40k, but it might be harder to pull off for sure, and I'm not sure how they'd be involved with nids anyway.",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "shadyelf",
                            "body": ">Then the other Xenos factions would feel bad to fight lol. Killing Tau as a Space Marine wouldn't feel... uh... well you wouldn't feel like the good guys.\n\nThey've fought each other extensively in the Damocles Gulf Crusade, with it ending in a stalemate because the Imperium had to go deal with the Tyranids. I imagine from a gameplay perspective it'd sort of feel like fighting the Automatons in Helldivers 2 and then going off to fight the Terminids. Tau are noted for being really annoying long-range combatants, generally trying to kill you before you can get to close-range combat where they're not as strong.\n\nIn general there's no real lore reasons that would restrict enemy types (but who knows with Games Workshop when it comes to video games and the licensing, they can sometimes get really strict with what is depicted).\n\nDawn of War Dark Crusade/Soulstorm basically had some kind of an excuse for fighting every other faction due to its more open-ended campaign (almost like a 4x campaign map). Even Imperial Guard fighting Space Marines or Space Marines fighting Sisters of Battle.\n\nThis [video](https://youtu.be/4WRFa5PXgGA?si=Ml8xQvqeNVfklTqE&t=3190) shows the post campaign victory text for an Imperial Guard battle against Space marines. Which is consistent with the tabletop because there are no rules saying you can't have Imperium factions fighting each other, and they often do in the lore (without it leading to full blown civil war).",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mitrovarr",
                                    "body": "Dark Crusade had such good writing. They actually managed to make the fight between the imperial guard and space marines actually make sense and neither side was really the bad guy, they just had their orders or responsibilities and they conflicted.",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Muad-_-Dib",
                            "body": "> Then the other Xenos factions would feel bad to fight lol. Killing Tau as a Space Marine wouldn't feel... uh... well you wouldn't feel like the good guys.\n\nOn the contrary I would love a game where you get to unabashedly remind the Tau that they are but a minor player in the galaxy.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gorudu",
                                    "body": "If it's done well within lore, definitely. It's a complicated thing to pull off from a storytelling perspective in video game. It's not the same medium as a book or a movie because it's more interactive, so you can't do the same point of view tricks you might do in other mediums.\n\nRemember, the Imperium thinks they *are* the good guys, and the tone would have to represent that without getting too satirical or campy (unless you're going for that kind of thing). Easier to say blue guys good so you can feel good murdering the obvious bad guys.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Muad-_-Dib",
                                            "body": "I think you are making it out to be more of an issue than it actually is, there are plenty of 40K games that don't bother trying to present a faction as justified in what it is doing, they just go with \"We claim this planet and might makes right\".\n\nDawn of War 2 Retribution for example lets you play as the marines, guard, eldar, orks, chaos, and tyranids without presenting anybody as any more justified than the others.\n\nGladius, Battle Sector and Battlefleet Gothic all feature multiple races too and they care little for justifying anybody doing anything beyond whatever faction you are playing thinking everybody else is below them.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Chataboutgames",
                                                    "body": "Yeah but DoW2 Retribution *barely* has a story.  It works  because it doesn't try.  \"I'm here for a reason, fuck that guy over there!\" Certainly not one that would carry a single player cinematic action game.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Gorudu",
                                                    "body": "I don't think it's a problem. I think it's hard to pull in general audiences with that kind of writing unless it's done well. I'm not saying it's impossible, and it's fine/less risky if your goal is a niche game for fans who are deeply invested. \n\nSpace Marine 2 does not seem like a cheap game. It's being marketed like crazy. They are going to take the safe routes.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheVoidDragon",
                            "body": "I don't see why it would, there is all sorts of things they could do to add variety, *plenty* of different enemy types, situations, mission types etc that can make it interesting for the whole game. If they can write entire novels about just tyranids, there's no reason a game couldn't work.\n\n> well you wouldn't feel like the good guys.\n\nThe whole point of 40k is there are no \"Good Guys\" though. They're all horrible in different ways.\n\nLeagues of Votann would have been interesting to show up following a Tyranid Hive Fleet, i think.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gorudu",
                                    "body": ">The whole point of 40k is there are no \"Good Guys\" though.\n\nI hear this argument from people all the time, so I don't want to write my usual long response out. \n\nA major theme of 40k is there are no \"good guys\" ***by our standards*****.** It sounds nuanced, but it's an important distinction. It would be insane to argue that Drukhari aren't more blatantly evil than Tau or their Craftworld cousins. \"The Imperium is Xenophobic and bad!\". Yeah, you would be, too, if you had Genestealer cults cropping up when you *do* open up too much that lead to a Tyranid invasions and the end of an entire system. The \"grimdarkness\" leads to a huge shift in the window of morality. \n\nAlso, you didn't acknowledge the rest of my comment:\n\n>well you wouldn't feel like the good guys. I know that's a major thing in 40k, but it might be harder to pull off for sure,\n\nI understand the world has nuance, but to safely pull that off can be a difficult thing when trying to win a bigger audience. Generally, people like to play the hero. It's the safer route from a storytelling perspective.\n\n>Leagues of Votann would have been interesting to show up following a Tyranid Hive Fleet, i think.\n\nDefinitely agree it would be an interesting story, but, again, much harder to pull off. Going from killing evil monsters to cute dwarfs would be a big shift.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Chataboutgames",
                                            "body": ">  The \"grimdarkness\" leads to a huge shift in the window of morality.\n\nYep.  The whole \"Inquisitors are fucking monsters\" thing looks different when you consider that literally one cultist could open some small tear that would let in a demon that would rapidly spiral to not just killing an entire planet, but damning their souls to perpetual torment. This isn't a universe where being a good person will save you, if you're some factory worker and a demon exerts its will on you or a Nurgle plagues comes through, you're fucked now and forever.\n\n\nAnd you'd probably be pretty xenophibic towards Eldar if on the regular they burnt entire Imperial systems because some prophecy said if they didn't then in 200 years a demon would be born there.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheVoidDragon",
                                                    "body": "Except the way the Imperium handles things like that and the way it treats its people in an attempt to stop things like daemons frequently causes and/or makes the problem even worse. \n\nEldar don't really \"regularly\" do things like that either.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TheVoidDragon",
                                            "body": "Regarding the Imperium at least, part of their theming is that a large amount the actions they take only make their situation *worse* than things could/should have been. They're their own worst enemy in a lot of ways. The grimdarkness of them comes partially from them being so convinced that they are in the right that they refuse to consider any other possibility as they only push themselves closer towards oblivion.\n\n> Also, you didn't acknowledge the rest of my comment:\n\nI wasn't quite sure what you meant specifically there, that's why I didn't say anything about it. I think that when it comes to 40k though, trying to portray anyone as \"good\" (which is different from just that \"heroic\" power side of things) sort of undermines the whole purpose of the setting and would give the wrong impression of what it's about.\n\n> Definitely agree it would be an interesting story, but, again, much harder to pull off. Going from killing evil monsters to cute dwarfs would be a big shift.\n\nI think that's really, really understating just who the Leagues are. They're greedy paranoid space dwarfs who follow hive fleets and watch without a care as they devour worlds just so they can take resources from those dead planets and/or the Hive ships afterwards.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Chataboutgames",
                                                    "body": ">  The grimdarkness of them comes partially from them being so convinced that they are in the right that they refuse to consider any other possibility as they only push themselves closer towards oblivion.\n\n\nI mean, it's an entire species in a position of Total War for centuries and centuries.  Doesn't really allow for a lot of introspection.  The Imperium is fucked, but there doesn't really seem to be any way to unfuck it without making things worse.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TheVoidDragon",
                                                            "body": "Maybe not so much on a big scale, but even Guilliman recognized that they make things far worse than necessary for no particular reason, telling Dante he should improve things when they rebuild Baal after defeating the Tyranids there.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Violentcloud13",
                                            "body": "Yeah the whole \"there are no good guys, *especially* the Imperium of Man\" shit falls completely flat on its face when you look at how terrifying and evil almost every other faction is by comparison. I'm beyond done with the media literacy crowd and their demands that I take this shit as satire. I'm gonna play it straight and enjoy myself doing so.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Chataboutgames",
                            "body": "Necrons aren't the faction I know best but they don't feel super fun to fight.  By and large slow, tanky and powerful doesn't seem like a satisfying foe in this sort of game.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "narfjono",
                    "body": "It's Tzeentch so far right? It's a slight change from Nurgle of the past couple of years at least.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ChiefQueef98",
                            "body": "Yeah, we get to fight the Thousand Sons. I don't think they've featured prominently in any other 40k games compared to the other traitor legions. I'm all for it.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Powerfury",
                    "body": "I bet once you sever the Tyranid synapse then the Shadow of the Warp will be diminished, and then chaos can now bleed through.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "LostInStatic",
            "body": "Oh my god I thought this was just a level based shooter. Repeatable co-op strike missions and new weapons/class loadouts? Holy shit.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hellknightx",
                    "body": "Three player co-op with unlockables, progression, and customization?\n\nLooks like Dawn of War Last Stand just got a spiritual successor.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Turbostrider27",
            "body": "Looks like this game will have a season pass.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "narfjono",
                    "body": "With MP PVP, involving customization, most definitely it is to be assumed.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "xepa105",
                            "body": "\"We are happy to announce the new Raven Guard customization pack!\"\n\n\\*crickets*\n\n\"Uhhhhhh, I mean, Black Templars!\"\n\n\\*Cheering*",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "narfjono",
                                    "body": "Actually busted up laughing to that",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Yarzeda2024",
            "body": "I'm only vaguely aware of Warhammer 40K, but I like this one more and more every time I see a new trailer.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "narfjono",
                    "body": "Dawn of War 1&2 PC games, first Space Marine title, and Mechanicus are excellent starter games for the franchise if interested. Currently discounted.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Herby20",
                            "body": "I would throw in Darktide as well if you happen to have some friends to play it with. It is in such a better place than it was at launch. I want to emphasize the friends to play with part though, because randoms can be... frustrating at times.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SirMcsquizy",
            "body": "Okay can someone answer this for me.\n\nIs the Main Campaign co op?\n\nOr is the Co op campaign completely separate?",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Scruffy_Nerfhearder",
                    "body": "Yeah, They confirmed the entire campaign is playable in coop last year. This trailer just confirms extra modes for the game alongside the main campaign.\n\nMain campaign - single player or co op\n\nOperations - co op\n\nEternal War - 6v6 pvp.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "LostInStatic",
                    "body": "Steam store page says this is entirely separate from the main story, you make your own guy for the PvE and PvP modes.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SirMcsquizy",
                            "body": "Damn was also hoping to do the Main Campaign with a friend",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Benjammn",
                                    "body": "You can, but the campaign you only play as Titus and other Ultramarines.  In the separate co-op mode, it looks like you can style your character as whatever chapter you want.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "GrimLucid",
                                    "body": "Main campaign is coop as well i believe",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "powerofpie",
                                    "body": "There's a slightly longer version of this video on YouTube that says 3 player main campaign. Along with 3 player co-op and 6v6 pvp.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Scruffy_Nerfhearder",
                            "body": "The campaign has full coop they confirmed it last year. These are just extra modes for the game.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "JesusRice123",
            "body": "I’m new to Warhammer 40k but how popular is the series in general? Looks very interesting and think I’ll pick this up since September is looking light on releases anyways. Was just wondering if the game can expect strong sales granted the gameplay is fun/good.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheVoidDragon",
                    "body": "40k is one of the most popular tabletop sci-fi franchises, it's existed for over 30 years and has only become more and more popular over time. This is one of the most anticipated 40k video games as it's a sequel to one from back in 2011 that was considered to be one of the best, I expect it'll sell quite well especially as what they've shown looks great.\n\nI'm not sure if Space Marine 2 is a good place to start getting into it though, it might be better to play a few other games first, especially as you can get them cheap due because of the Warhammer Skulls event which focuses on the video games.",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JesusRice123",
                            "body": "Alright thanks for the info and reply! I’ll check out the franchise then in preparation for Space Marine 2! Looks really fun and me and the pals have been itching for a coop shooter for ages.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheVoidDragon",
                                    "body": "The Dawn of War series is considered a pretty good place to start as it covers lots of areas of the setting, albeit it's a bit out of date by now as quite a bit has changed since its release. Same with Space Marine, which is a great game.\n\nReading some 40k novels is generally a good place to start too. Specifically the Ciaphas Cain, Gaunts Ghosts or Eisenhorn books.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ChiefQueef98",
                                            "body": "Dark Crusade is still my favorite, but I think that DoW2 still holds up as a modern RTS. Especially with the expansions and the factions they add.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Knight_Raime",
                                    "body": "Just to add onto this (since I have the perspective of someone who's relatively fresh to the series) if you do end up playing Space marine please don't expect many Warhammer games to be that approachable.\n\nOutside of Space marine there's Dark tide and Vermentide.  Most of the really popular Warhammer games are RTS/ARPG in nature.  Also of note is that 40k is only a part of the overall Warhammer universe.  That's why Vermentide can be about murderous death rats.\n\nEDIT:  forgot Boltgun exists.  Also pretty approachable.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "JesusRice123",
                                            "body": "Omg now that you mention it Vermintide does have the Warhammer name in the title. I LOVED Vermintide and Darktide. This has got me even more hyped now xD excited to hop on in.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "indiecore",
                                                            "body": "Isn't the Warhammer planet doing it's thing at the same time as Warhammer 40k but it's in the middle of a warp storm so the outside galaxy can't get to it?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "BitingSatyr",
                                                                    "body": "Maybe, idk if that’s ever been confirmed. Plot holes are most easily avoided by assuming they’re separate yet similar universes.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "KerberosPanzerCop",
                                    "body": "If you have a halfway decent PC, the first Space Marine is on Steam. Its a 7th Gen game (PS3/360 era) and it still feels good to play. That was my intro to 40k",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Muad-_-Dib",
                                            "body": "> If you have a halfway decent PC, the first Space Marine is on Steam. \n\nEven my old 770 ran Space Marine just fine, anybody with a remotely modern card shouldn't have issues with performance unless the game is so old by this point that running it on modern hardware is an issue in and of itself.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "JesusRice123",
                                            "body": "I appreciate the response will definitely give it a try!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Simulation-Argument",
                                                    "body": "Darktide is also a great game. Not perfect but still getting pretty major updates and reworks. You don't play as a Space Marine but you and 3 other players kill A LOT of chaos. Game has an \"AI Director\" like Left 4 Dead did that will on the fly what crazy shit it should throw at you based on how you are doing. This makes each mission play very differently even though you run the same missions.\n\nCurrently it is 24 dollars on Steam. It is definitely worth that price.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "masterx25",
                    "body": "The Wahmmer 40k has been going for 30 years, and has really rich lore. I don't play the tabletop game, only read it's novels.  \n\nHowever good Warhammer 40k games are rare to come by. Ones I know of has been Dawn of War, Space Marine 1, and the recent Boltgun.  \n\nThe cool thing is nearly everything is canon to the story. Even the recent announcement has retcon Space Marine 1 into the lore in preparation for Space Marine 2.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Yarzeda2024",
                            "body": "I heard that the Mechanicus strategy game was pretty good, but I haven't played it myself.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "WitnessSecret1382",
                                    "body": "It is excellent, has an amazing soundtrack.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "MsgGodzilla",
                                    "body": "Mechanicus is very good, and has an amazing soundtrack.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "masterx25",
                                    "body": "Lot I haven't played. Waiting for the Rogue Trader to properly release before trying it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "KFJ943",
                                            "body": "What do you mean by properly release? It's out and it's received quite a few updates - It's not in early access.\n\nThere is a DLC coming that adds about 15 hours of content, though!",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Tedwynn",
                                            "body": "Full release was in December.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "narfjono",
                                            "body": "It's honestly a good time to get it now. The Skulls event discount and all that.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Gungnir111",
                            "body": "Darktide is good. Battlefleet Gothic Armada is a bit niche but if warhammer spaceship tactical combat is what you want, it’s pretty good. The Rogue Trader RPG is rough around the edges but is a good story and roleplaying experience for the most part.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AspirationalChoker",
                    "body": "It's not on the Star Wars or superhero genre type scale but considering where it started I'd say the lore/franchise as a whole is on the category below those as it has fans in games, videos, figures etc and will soon have a Amazon series as well",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "narfjono",
                    "body": "If interested, *Dawn of War* 1&2, *Mechanicus*, *Space Marine Anniversary edition*, *Rogue Trader*, and *DarkTide* are great intros to the tone and setting that is Warhammer 40k. All are currently discounted through the Skulls event.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Kgb725",
                    "body": "It's Sci fi Dnd but grimdark. I'd try the Crpg Rogue Trader Game first because it explains a lot of the world if you're unfamiliar with it and Owlcat makes good games",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "TheBatIsI",
                    "body": "40K is pretty niche but has an overly-large fandom compared to what you'd expect. A lot of fans don't play the tabletop game it is based on, but follow spin-offs and side things like video games or novel releases.\n\nIt has never quite hit mass appeal, but it has a very loud fandom that makes it seem bigger than it really is.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "F1reatwill88",
            "body": "Is this on the same engine as that Kingmaker game? Super excited for this and what comes down the line with how many units are on screen at one time.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "KFJ943",
                    "body": "It's not the same developer - This is built on the Swarm Engine which was used in Snowrunner and World War Z.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hoojiwat",
            "body": "That was a Heldrake flying by at the end? Amazing, I was only expecting some sorcerer's and Rubric marines but it looks like the Chaos forces have a lot of toys here too.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DiomedesTydeus",
            "body": "Man 3 is a weird size for a group game.  I hope that match finder works well so I can pug a person to play with me and my buddy.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hellknightx",
                    "body": "3 players makes me think this is like a spiritual successor to the Dawn of War Last Stand mode.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "bobotea",
            "body": "so is exterminatus mode making a return? they have pve \"operations\" but not sure if those are like missions or more horde mode type. Im hopping for the latter as that has more replay-ability than like set missions.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MisterStibbons",
            "body": "I put like 150 hours into the Space Marine 1 horde mode, it was so fun, I am going to play this so much",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FordMustang84",
            "body": "I hope you can play with just 2 people and it’s not horrible unbalanced. Would love to play with my wife but the idea of having to have a stranger tag along is awful. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mrturret",
            "body": "I really, really hope that the inclusion of co-op doesn't mean that the solo experience will be shit due to poor partner AI and balance. It's important to remember that designing a game to work equally well in both SP and co-op is extremely difficult, and rarely happens. The fact that it's drop in/drop out makes me especially pessimistic, as it means that more complex adjustments aren't going to be made for solo playthroughs. I absolutely loved the first game (and never touched the multiplayer), so I'm really worried.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hellknightx",
            "body": "Oh my sweet God Emperor, class-based co-op with customization and progression? I'm so fucking down for this.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Impalenjoyer",
            "body": "I need yall to be straight with me before I get too hyped because I didn't care about this game if it was single player, but now...\n\nIs there anything bad about about the developper or the publisher ? Can we expect the game to be a big disappointment like helldivers 2 ? \n\nThis looks too good to be true, holy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hilppari",
            "body": "No preordering. dont give them any money before reviews are out. Im cautious about this after they hired full woke man hating feminist writers on this project.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "buccanearsfan24",
                    "body": "Oh wow, didn’t know that. With this prolific knowledge you’ve bestowed upon me I’m putting my preorder in even sooner. Thanks!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Fluffy-Face-5069",
                    "body": "Gonna be a performance heavy game too. Will defo be worth waiting for reviews just for that alone IMO. WWZ was a bit of a mess on release and even after a few patches it wasn’t great.",
                    "score": 1
                }
            ]
        }
    ]
}