{
    "title": "The Sims 4 announces a new team to fix technical issues and core game performance",
    "comments": [
        {
            "depth": 0,
            "author": "tuna_pi",
            "body": "Interesting. I guess they're in this for the long haul then, doesn't seem to be the actions of someone winding down.",
            "score": 95,
            "replies": [
                {
                    "depth": 1,
                    "author": "Broad-Marionberry755",
                    "body": "They'll crank out stuff for this until Sims 5",
                    "score": 53,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gamemaster257",
                            "body": "Which I'm certain is why they're actually fixing the game since the more stuff you own for the sims 4 the more shit breaks, and they don't want to punish people for buying *more* stuff.",
                            "score": 47,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "spicesucker",
                                    "body": "That’s been the case for every Sims game tbf, Sims 3 runs like *shit* when all the expansions are installed ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "gamemaster257",
                                            "body": "Yup, which is why I’m happy to hear they seem to actually want to fix the sims 4. But damn I wish we had a modern open world sims style game that utilized modern systems to run better. I think the entire simulation of everything the sims does is still only on a single thread.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "gk99",
                                            "body": "Pretty sure Sims 3 ran like shit even with no expansions installed. My PC wasn't the best back in the day, but it was certainly above average and still struggling.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BLAGTIER",
                                                    "body": "Every expansion you installed the shitter it would get. It started as shit and just got worse.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ToothlessFTW",
                    "body": "This game has been out for almost 10 years, has an absurd amount of purchasable content, and has breached the mainstream like no other Sims game did before it. \n\nEven if Sims 5 was launching next year, that game won't be widely adopted for a very long time just because of how ingrained in the Sims 4 a lot of people are. So it doesn't really matter when that game actually launches, it's in their best interests to keep this game running smoothly, because those swathes of people are far less likely to jump ship to Sims 5 just because Sims 4 stops being supported/working. \n\nI can totally see them leaving a small team like this behind to keep updating The Sims 4 with bugfixes and improvements for at least a year or two after 5 is out.",
                    "score": 33,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Catty_C",
                            "body": "Breached the mainstream, weren't The Sims 1 and 2 the best-selling PC games of all time in their day?",
                            "score": 33,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "greg19735",
                                    "body": "Sims 2 sold less than 1. And both were similar levels to something like starcraft 1. \n\ntbf, he didn't say the others didn't breach main stream. More that this one breached it more. Which makes sense because it has been the main Sims product for the longest amount of time.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "eldomtom2",
                                            "body": "Wrong, the Sims 1 massively outsold Starcraft.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "greg19735",
                                                    "body": "https://en.wikipedia.org/wiki/List_of_best-selling_PC_games\n\nthey're at 11m each.\n\nif you want to try and look at the sources, go ahead. I just went on that",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Smart_Ass_Dave",
                            "body": "> This game has been out for almost 10 years, has an absurd amount of purchasable content, and has breached the mainstream like no other Sims game did before it.\n\nReally? I'm not calling you a liar or something, but at one point *The Sims* was the best selling PC game of all time. And that was back when games were only sold in brick-and-mortar stores so the numbers were much more easily tracked.",
                            "score": 26
                        },
                        {
                            "depth": 2,
                            "author": "GMorristwn",
                            "body": "Thank God because I've sunk a shitton of money on that content. A great no brainer present for my wife for the last several years.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "The_Reluctant_Hero",
                                    "body": "Same here. For her birthdays and Christmas, a few Sim packs do the trick every time.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "greg19735",
                                            "body": "every year or so i get the bundle of expansion, game pack and stuff pack. Gives me tons of fun for a few weeks and then i get bored until next year. Which is fine.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Profzachattack",
                            "body": "Its crazy to me the popularity of Sims 4 even with all the people ranting about how much better 3 or 2 is than 4.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "VFiddly",
                                    "body": "Well, a lot of those people are talking about gameplay. The Sims appeals to a lot of people who truly don't care about gameplay and are essentially using it as a virtual dollhouse. If that's what you're playing it for, The Sims 4 is the best option.",
                                    "score": 17
                                },
                                {
                                    "depth": 3,
                                    "author": "blolfighter",
                                    "body": "I will never forgive them for abandoning create-a-style. Found a t-shirt you liked, but it wasn't *quite* the right shade of red? Recolour it! Wanted that t-shirt to have a shag carpet texture? Apply a shag carpet texture!\n\nAnd I'm convinced they deliberately reduced customisation so they could sell you more DLC.",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "Worried-Explorer-102",
                                    "body": "It's because reddit is a loud minority. Everyone here hates the new assassins creed yet it became #1 best seller on Amazon for gaming category and that's just from preorders alone and we have no idea about gameplay or graphics that's just people pre-ordering from seeing cgi trailer.",
                                    "score": 10
                                },
                                {
                                    "depth": 3,
                                    "author": "greg19735",
                                    "body": "I feel like redditors didn't play the sims that much and that's why they loved 3 so much. Everything was so seemless. But it also ran worse the more you played as everything seemed to be loaded into the game at once, which allowed you to run alllll over town. \n\nSims 4 is a bit more focused and as a result performs a lot better on similarly aged machines.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrRocketScript",
            "body": "Sounds like the Stellaris \"Custodians\" team that only works on fixing or improving existing content and doesn't work on the DLCs. I think that turned out pretty well.",
            "score": 40,
            "replies": [
                {
                    "depth": 1,
                    "author": "turikk",
                    "body": "Turned out very well actually. Sometimes a narrow and realistic scope can be incredibly healthy. It's also a good way to onboard new employees.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "RollingDownTheHills",
            "body": "That's really good news. The game is great but many years of new content have definitely taken its toll on performance.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "AtsignAmpersat",
                    "body": "I hadn’t noticed any issues outside of the mods im running that glitch occasionally. But maybe it’s not the mods and it’s just the game.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "Paxton-176",
                    "body": "The core audience of the sims is female with apple laptops. I can see why they really limited sims 4, but computers have really jumped in performance and I think a modern Sims 3 would work better today.\n\nPdx is publishing Life by You which appears to be a Sims competition, but it might end up being something different in the end.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "greg19735",
                            "body": ">  but computers have really jumped in performance and I think a modern Sims 3 would work better today.\n\nPeople aren't buying those computers that often. at least the core audience of female gamers who only play the sims.\n\nA lot of them won't buy a new PC when TS4 exists.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mom_and_lala",
                                    "body": "> People aren't buying those computers that often\n\nOkay but the Sims 3 released in 2009, *fifteen years ago*. I'm willing to bet most people playing the sims 4 have bought a new computer since then. Even an \"old\" computer by today's standards is a big step up from what was available in 2009.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Paxton-176",
                                    "body": "The franchise honestly has a lot to playability. You can just create sims or build a house a house purely. People in the community also come up with various challenges.\n\nThe franchise is great whenever I just want to chill I load up the sims and expand my long running save a little more, but its owned by one of the worse publishers. Really sucks.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "HappyVlane",
                                    "body": "You need the architectural component. That is probably the biggest draw for the casual audience.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Adziboy",
                                    "body": "Of course this is all anecdotal, but I find younger players (kids basically) like to just create Sims, but anyone older (teen and up) tend to like creating houses more. I know nobody that actually plays the sim element.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "random6849",
            "body": "it'd be great if this helps the game function long-term. as much as people love sims 3 over 4, my experience playing it with all the dlc is that most of the systems don't function together at all. anything to stop 4 from collapsing under the weight of its own dlc would be great",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "RedBait95",
                    "body": "Seriously, this game must be a mess of conflicting code.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BetterFartYourself",
            "body": "I hope they add controller support for PC. My gf wants to play it on the steamdeck, but the controlls are fucking horrible. Even all those community layouts",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "starm4nn",
                    "body": "The thing that kills me is games that have console ports not supporting controller well on PC.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "conquer69",
                            "body": "Diablo 3 comes to mind and it's sad they stopped development without implementing it.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Lemon8Lime",
                    "body": "I'd love this too! I moved to PC TS4 last year after years of playing on Xbox. I'd love to be able to use a controller again as it's much more comfortable for my gaming setup (and my hands).",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "buzzpunk",
                    "body": "You can definitely make some very usable configs for it. But yeah the community ones are all shit. I would upload mine but I don't have the game installed anymore and I don't want to go through the whole install process when I don't even know if it saved my old config properly (due to it being a non-steam game).",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GarlicRagu",
            "body": "More service games should go this route. I can't speak to the sims but the live service game I've invested into/ need to do daily chores for is dreamlight valley. I enjoy the new content they add to it but god damn if the game isn't buggy and poorly optimized. I wish there was a secondary team like this devoted to cleaning up the mess. I fully expect that not to happen as it seems too hard to stop the train of new development and the money that comes with it. Investing in improved performance doesn't look good on a spreadsheet when it becomes harder to measure return.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Professional_Goat185",
                    "body": "Publishers just want to shortcut to \"get the money\", without doing \"make a good game\" and \"support it well\" step",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "prunebackwards",
            "body": "Possibly because there are a few games gaining traction that are attempting to be like The Sims. I wonder how much money they’d make if they made the base game free like it is now, but gave you access to all the extra content for a subscription. Seems to be the way most things are going",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Professional_Goat185",
                    "body": "I'd imagine anyone that ever wanted it got it already, it's not a new game.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Reasonabledwarf",
            "body": "This is... *very* strange. I mean, the game came out a decade ago. I understand it's had a staggering amount of DLC packs of varying sizes, but attacking underlying technical issues at this point seems like an odd move from a business perspective. If they're actually investing *more* resources into an old game, they must see money in it somehow; at the very least they might be wanting to raise enthusiasm about the brand and their stewardship of it. Alternatively, maybe this is a \"we won't be releasing more content\" announcement in disguise.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jagosyo",
                    "body": "Some EA exec finally noticed the Sims 4 is still making them an insane amount of money and said \"Hey we'd better put more than a shoestring budget on this.\"",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "tuna_pi",
                    "body": "Definitely not a \"no more content\", the EA ceo recently said they're putting out a lot of stuff this year",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "Gullible_Coffee_3864",
                    "body": "Paradox did the same with Stellaris, and that game is also a decade old.\n\n\nI suppose the DLCs for these games still make a decent profit with little investment, but the technical debt has grown to such an extend that it is slowing down the development of new content, and thus a \"custodian\" team might be worth it to keep DLCs coming at a faster pace. \n\n\nBesides that, EA just might want to appease the Sims community, given that multiple competitors are on the horizon now.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "VFiddly",
                    "body": "The Sims has a lot of fans who only play The Sims and nothing else. So you can keep selling them DLC basically forever. But at this point the game is a mess on a technical level and it feels like the recent DLCs have been limited because they can't do a whole lot without the game breaking. Honestly I think the game has been in need of fixing for a while but they didn't have anyone to do it.\n\nIt's also a game where a pretty sizeable percentage of players are trying to play it on old or underpowered hardware and many don't understand that they can't just keep getting new DLC without slowing the game down. So figuring out ways to help things run better would make a difference.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Zaptruder",
                    "body": "The reality is that game development has slowed down a lot over the last decade - as consumers pivot to mobile devices, visual quality and fidelity hasn't moved at as fast a pace - the amount of hardware in consumer hands to justify the increased investment in these games just isn't growing at the pace it needs to... and thus you hear all this AAA shit falling down business wise.\n\nOn the flipside, evergreen titles have established a strong foothold in gaming culture... Minecraft, League of Legends, Fortnite... these are platforms that are popular year after year after year... and except for Fortnite, they don't need massive tech upgrades... and Fortnite does it because its parent company is Epic whose business is game engine tech development.\n\nIn amongst all this... Sims 4 is just one of those titles, sitting on the periphery of traditional gamer consciousness, doing its thing, without plans on going anywhere, because it looks good enough for its target audience.\n\nPlus the mods. It's grown up doll house fun for all ages. I don't think Sims 5 can repeat the level of depth/content that exists in Sims 4 and provide a solid upgrade to it, until years after its launch.\n\nSo if that's the case, then you might as well ensure the older one is still cranking out money for you while you build up the newer one so that your business can continue surviving for another 10+ years.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "poply",
                    "body": "People buy The Sims for decades after they come out. People still purchase Sims 1 and 2.\n\n\nWith their new game coming out (eventually), I think they just want to leave The Sims 4 in a good state for the next 100+ years people will be playing and purchasing their hundreds of expansions.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Aeiani",
                    "body": "They’re likely planning on continuing to support the game with more content releases for years to come.\n\nThe game runs like complete ass the more expansions and content packs you pile onto it concurrently, and there’s a ton of them. Having a team focused on sorting that out as their main job isn’t the worst idea ever long term.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "BLAGTIER",
                    "body": "> but attacking underlying technical issues at this point seems like an odd move from a business perspective.\n\nIf someone spends $100 on Sims 4 content and runs into a bunch a bugs the odds of them spending another $100 goes down.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "buzzpunk",
                    "body": "The game is alive as ever. The modding community is pretty huge at this point and EA are still pumping out content themselves as well.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CookieEquivalent5996",
                    "body": "> they must see money in it somehow\n\n[The Sims 4 is among the top 10 most played games across PC and console](https://www.youtube.com/watch?v=YlsDoGVwPbs&t=1045s).",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Paxton-176",
                    "body": "I think the game was originally a mobile game that pivoted into PC. The sims community in general sees 4 as a down grade in a lot of features compared to 3.",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "greg19735",
                            "body": "> I think the game was originally a mobile game that pivoted into PC. \n\nI don't get this argument. If the game released in 2014, we can probably assume at least 3 years of development time.\n\nIn 2011 there's no way a game like the sims could be imagined on those phones. Like, maybe it was originally going to be on phones. but when the actual coding began there's just no way imo",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tuna_pi",
                                    "body": "It wasn't mobile, it was supposed to be an always online mmo.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "greg19735",
                                            "body": "I guess more like Sim City remake rather than their actual MMO The Sims Online?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "tuna_pi",
                                                    "body": "I think more like second life or imvu, here's a [video](https://youtu.be/h2IPZDJ-pt0). Sim city flopping did make them pivot back to offline though\n\nhttps://simsvip.com/2021/01/30/the-blue-plumbob-inside-the-troubled-development-of-the-sims-4/",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SmireyFase",
            "body": "LMFAO, I don't really play the Sims but I know how much they didn't give a fuck about people's complaints about the game. Awfully convenient that they suddenly care now that there are real games about to overthrow Sims. XD",
            "score": 1
        }
    ]
}