{
    "title": "Devolver: You're invited to Volvy's 15th Birthday Party. Devolver Direct June 7 @ 5PM Pacific",
    "comments": [
        {
            "depth": 0,
            "author": "Drew_Eckse",
            "body": "15 years already? Crap, I'm getting old lol. Following all the controversy with the cancelled Volvy reboot, I'm hoping this showcase is relatively drama-free",
            "score": 26
        },
        {
            "depth": 0,
            "author": "superwawa136",
            "body": "i love volvy, but gwimbly had the upper hand in the mascot wars back in the day with his iconic victory dance and accompanying catchphrase, \"oOh oOh oOh!\"",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "giulianosse",
                    "body": "Fun fact: my uncle was a proctologist and he unknowingly had a Volvy plushie at his office. I'm positively sure he had no idea it was even a mascot, let alone one that did *not* have anything to do with his occupation.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "WarlockWabbit",
                    "body": "Yeah im not sure why the devs thought Volvy gurgling like he's using mouthwash would catch on as an iconic victory catchphrase",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Drew_Eckse",
            "body": "Their remaster on Volvy's games were awesome, but how the fuck did they forget to give the Volvy Blaster Remaster ultrahigh monitor TATE support in the year 2024? \n\nProof that the devs utterly did NOT give a crap, and I hope they address it at this year's Devolver Direct. It's just sad",
            "score": 10
        },
        {
            "depth": 0,
            "author": "batterylevellow",
            "body": "Wait? 15 years??  \nI only now realize Volvy is still underage. And while Volvy years work a bit different than human years, Volvy must've also been underage when starring in some adult entertainment movies for Vivid, right?  \n  \nI know it was a dark period in Volvy's life, when as a video games mascot, Volvy was totally replaced by Vylvo, Volvy's left-handed brother.\n  \nBut still, I can't imagine this will be talked about at the birthday party, just like the tragic events of the whole VOLV•E reboot.",
            "score": 1
        }
    ]
}