{
    "title": "Smash Bros. Ultimate Creator Says Every Character Has Roughly The Same Win Rate",
    "comments": [
        {
            "depth": 0,
            "author": "laz85",
            "body": "Feels to me like this has much less to do with balance and instead the skill based matchmaking working as intended.",
            "score": 519,
            "replies": [
                {
                    "depth": 1,
                    "author": "IrishSpectreN7",
                    "body": "I would imagine that Ultimate matchmaking has looser restrictions than many other games, considering that it looks for players who also have similar preferred rules as you, in addition to finding a player with a similar GSP.",
                    "score": 108,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AltDisk288",
                            "body": "Given the popularity of Smash though and the pool of players in each skill-bracket, its probably not really a big deal.",
                            "score": 41
                        },
                        {
                            "depth": 2,
                            "author": "FrakkedRabbit",
                            "body": "I hate that the internet has condition me to read \"looser\" as \"loser\".  I was fucking confused when I realised that you actually meant \"looser\".",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "seruus",
                                    "body": "As a non-native speaker, the fact that \"loser\" is pronounced as \"looser\" is one of those horribly confusing things that I had to accept about English. Some of the common misspellings of homophones (like principle/principal) feel easier to me to avoid because I get their etymologies and can make the distinction in my native language, but loose/lose just feels like there's a gremlin tryin to make the English language as ambiguous as it can be.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Falcon4242",
                    "body": "Yeah, when it comes to fighting games with a ranked system, character win rate means very little. In Tekken 8, what many people considered to be one of the the worst characters for a while (Panda, because she's just a worse Kuma) had the best win rate. Likely because the people who actually played her were either highly skilled players who wanted a challenge run up the ladder, or they were longtime bear players that just decided to stick with Panda, while many Kuma players were likely newer at the franchise.\n\nHow prevalent a character is at higher ranks means more (Panda was one of, if not the, lowest represented characters at higher ranks), though can still be misleading. Generally, a bad character won't be as common in higher ranks because their mains can't climb as high, though that can lead to strong characters being slept on or \"easier\" or \"gimmicky\" characters being overrepresented.\n\nTournament results are the best way to judge character strength.",
                    "score": 40,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BunBunSoup",
                            "body": "We were seeing this kind of thing a lot the past week or two when the SF6 patch changes were being discovered and people realized Honda's specials were being nerfed hard. Why was Honda getting hit so bad? Nobody plays him, he was a gimmick character that wasn't that hard to deal with once you knew the gimmick. Then you see the stats showing he dominates in the lower ranks because, well, people that rank don't know how to counter the gimmick. These games are so wildly different throughout the ranked tiers that a general win rate across the board doesn't tell you much.",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "acideater",
                                    "body": "Honda dominates because his plan is simple and consistent and hard to counter.   Honda has the best win rates in all the ranks all the way up to Master.\n\n\n  Even if you know the gimmick, Honda can switch up timings of the move to throw your counter off or make you guess with a command throw. For the not tournament players it's enough. He had the best win rate in regular masters at one point.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kurolilith69",
                                            "body": "To add onto this, tournament and ladder winrates are also completely different things.  In tournaments, you pick a character where you need to perform well in individual matches. A single loss is game over.\n\nIn ladders...the losses doesn' t have the same value, even if it' s harder to comprehend. The objective is to keep your win-rate above 50% over your loses! So, even if you happen to find a guy that knows perfectly how to counter Honda...most people will not!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Chronis67",
                            "body": "Same with some other games also. I played a ton of Overwatch back in the day. Symmetra was one of the \"worst\" characters and was non-existent in league play. Meanwhile, I had a win percentage of about 68% using her.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Cold-Recognition-171",
                            "body": "Also, who labs bears? \n\nWell... After Rangchu won a tournament with I've the pros did",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "SageOfTheWise",
                            "body": "> In Tekken 8, what many people considered to be one of the the worst characters for a while\n\nYeah, and it can work in the opposite direction too. When a character is considered the best or especially OP, for every player actually making waves and tearing up the competitive scene with them, there will be a dozen newer players hoping the character is an instant win button and losing tons more games because they haven't learned how to take advantage of the character yet.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Smart_Ass_Dave",
                    "body": "Good call out. Balance can be nearly impossible in a game like this when a character might be fantastic at a high skill level and trash at a low skill level.",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "J0rdian",
                            "body": "> Balance can be nearly impossible in a game like this when a character might be fantastic at a high skill level and trash at a low skill level.\n\nYou are joking right? That's how winrates work for literally every game out there. A moba like LoL has the exact same issues. Id argue even worse issues due to pro play being not the same as regular play.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Smart_Ass_Dave",
                                    "body": "When I say \"for a game like this\" I'm including LoL.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "J0rdian",
                                            "body": "Yeah but that's just normal? What game is not like this with lots of characters.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Smart_Ass_Dave",
                                                    "body": "Look man, if you're gonna ask me to defend a post I made while still in bed, two sips in to my morning coffee, the answer is no.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "J0rdian",
                                                            "body": "Then just say you don't know lol, or nothing. Not like I'm expecting an essay",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sesor33",
                    "body": "Smash by far has the best matchmaking of any game i've played. Matches near my GSP always felt balanced and weren't the usual SBMM rollercoaster of stomp one game, get stomped next game.\n\nIf you want an example of bad SBMM, go play Splatoon 3. One game you'll face rank X players and get demolished. Next game you'll face brand new players and clean up ez.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Illidan1943",
                            "body": "It's not Smash getting SBMM right, it's the fact that's 1v1, play basically any fighting game or RTS like StarCraft 2 in their 1v1 ranked modes and this will be the average experience after the games have found where you belong, team games are much harder to get it right and from the system the stats may indicate it's balanced, but how the system found that \"balanced\" state may end up resulting in a battle that doesn't feel balanced",
                            "score": 19
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SpiritLaser",
                    "body": "Dear god, imagine how sweaty must the players be… This Masahiro Sakurai person should learn a thing or two about making games, I’m sure the brightest minds at Twitch and especially Kick can educate him on the evils of skill based matchmaking.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gmishaolem",
                            "body": "> and especially Kick \n\nTheir VC money hasn't run out yet? Impressive, I guess.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ExtremeMaduroFan",
                                    "body": "it isn't VC money in the traditional sense its gambling money",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Freakjob_003",
                            "body": "[Sakurai's YouTube channel is an absolute gem](https://www.youtube.com/@sora_sakurai_en) for learning about game design and the games industry in general.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "DapperSandwich",
                            "body": "\"Redditors Understand Sarcasm Without It Specifically Spelled Out For Them\" Challenge, once again, failed.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Timey16",
                    "body": "Also: Tier lists usually don't matter for the average player unless a character is truly TRASH. Tier lists typically only matter once you completely mastered the game.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "dule_pavle",
                    "body": "Good point.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "uishax",
                    "body": "A player who spams meta characters will get rated as 'higher skill' and thus matched against tougher players. Is this how it works?\n\nThis does sound pretty genius, and works for every player except those at the bottom (where nuances of characters don't even matter) and at the pro level top (with all similar skill, character power becomes dominant)",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Falcon4242",
                            "body": ">This does sound pretty genius\n\nIt's how basically every other fighting game has worked for, like, a decade. It's really not a genuis concept, it's just a ranking system. It's the standard.",
                            "score": 19
                        },
                        {
                            "depth": 2,
                            "author": "g1ng3rk1d5",
                            "body": "Iirc you have a different MMR for each character, so it mainly goes off that.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "PapstJL4U",
                            "body": ">A player who spams meta characters will get rated as 'higher skill'\n\nNo - It's 1-on-1, so players will rated based on winning and not on character choice. There is (probably) zero character weighting.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IIvoltairII",
                                    "body": "Each character in smash has is own mmr. So I can be high ranked Mario but bottom tier with Luigi.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rayschoon",
                    "body": "That’s a really good point actually. We can’t tell if their ELO (or whatever metric they use to match) is inflated by their main or not from this data",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Happyberger",
                            "body": "Elo, not ELO. It's a guy's name not an initialism. Arpad Elo.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MissingLink000",
                    "body": "Ironic with Nintendo's penchant for undercooked online that they would have pretty good matchmaking. Such a far cry from games like Apex Legends where I've played for 1500 hrs and have like a <10% win rate because I'm constantly getting matched with pro-level players",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MetallicDragon",
                            "body": "It sounds like Apex Legend's matchmaking is working, then? In Apex Legends you're competing against 19 other teams, so if you assume everyone in a match is equally skilled you should expect a 5% win rate. If you got a higher win rate than that then that would mean you're being matched against weaker players, on average.",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "IntrepidEast1",
                            "body": "It doesn't take \"good\" matchmaking, it's just the basic way in which skill based matchmaking works. You could play any random mobile game like Clash Royale and as long as you're not deliberately losing you *will* win/lose 50% of the time on average, essentially as statistical fact.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "brolt0001",
            "body": "I believe this is public matchmaking.\n\nA comment pointed out that a person with a worse character in skill will likely study the character more, so this makes sense.\n\n(Correct me if im wrong)",
            "score": 108,
            "replies": [
                {
                    "depth": 1,
                    "author": "Brendoshi",
                    "body": "You'll also see the opposite. If a character is popular (because it's good) people will flock to it, which also results in a lot of poor skill players picking them up",
                    "score": 42
                },
                {
                    "depth": 1,
                    "author": "th5virtuos0",
                    "body": "Yep. Same issue as LoL. For example old Aurelion Sol (a niche and low tier character) is “balanced at ~50% winrate” but only because anyone who plays him knows everything about him and have a 51-52% WR to balance out the new players",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "imthefooI",
                            "body": "League has posted dev blogs where they talk about this issue and how they look into champion winrate curves by MMR and also winrates by games played, to get a feel for the full picture, rather than just looking at win rate (which will be ~50% if you have a working SBMM system)",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "cpyf",
                            "body": "I follow league balance closely and the developers actually say this is a huge misconception. A sol also just got reworked last year so he’s actually quite strong atm but that’s besides the point. Riot August one of the champ designers and occasional spokesperson for the balance team said that A Sol actually has a revolving door of players and there are not as many A Sol mains as the player base thinks they’re are. He cited that many A Sol wins are from players with less than 10 games on him, and that his old inflated win rate with low pick rate is due to the enemy players being unfamiliar with his kit. When you vs a champ 1 out of 100 games, you’re not familiar with their power spikes and trade pattern so it makes sense. This was one from his streams from last year.\n\nThe only champion that has their win rate inflated solely by their mains is Katarina and they say it’s not even by a whole percentage. Kat’s win rate is inflated only by half a percent by its mains. All champions have their win rates deflated by new players.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Unpacer",
                    "body": "On a random video about game balancing on his game dev channel? Almost certainly not.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "hornplayerKC",
            "body": "Given GSP ranking system is done per-character, it makes sense that all characters would have roughly 50%. What would be much more informative on the srrength of the character (at least in an online environment) would be the average GSP. I GUARANTEE that a character like Aegis has a higher average than Bowser Jr. or Piranha Plant.",
            "score": 41,
            "replies": [
                {
                    "depth": 1,
                    "author": "Majaura",
                    "body": ">  Aegis \n\nWho in the fuck is Aegis? I've never seen this character.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CosmicMcRad",
                            "body": "Pyra/Mythra as a set are colloquially called Aegis for simplicity (it’s a reference to their game)",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "nachtspectre",
                            "body": "I would assume Pyra or Mythra. As that is the weapon that they are the spirit of.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "radclaw1",
                    "body": "Thats not how statistics works",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "timmoose1",
                            "body": "Why do you say that?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Noilaedi",
            "body": "A big character roster will always tend to have wacky balance when it comes down to actual skill being involved.\n\n\nMarvel Vs. Capcom 2 had a massive roster of 55+ characters but since the game was a mishmash, less than 10 of those ended up being viable for competitive play. Ultimate orovab\n\n\n\nIn a way it's not surprising Steve was going to end up broken, they've said they had to work on every stage in order for them to function with the block system. Credit to them for even making him fuction as well as he does for being a platform fighter. ",
            "score": 25
        },
        {
            "depth": 0,
            "author": "KF-Sigurd",
            "body": "That's a pretty awful metric to determine if your game is balanced, especially if they're not separating free-for-fall vs. 1 v 1 or controlling for like character popularity. Now, for the vast, vast majority of characters, unless an incredibly easy to execute strategy exists, player skill trumps character difference by a large margin until you get to a certain skill level.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "sesor33",
            "body": "That's not a good measure of balance though, imo. Mainly because if you take _every_ player into account, you have a significant amount of players who legitimately don't know how to play outside of spamming smash attacks and specials. Hell, I'd wager less than half the player base online knows what tilt attacks are.\n\nA better stat would be the winrates of characters based on the players being in the 60th percentile or higher. And if you go to conventions (anime, furry, gaming, etc) that have smash setups, you'll see it all the time. In 8 player smash you'll have 2 players who are really good, 2 who know what they're doing, and 4 players who are just button mashing. It doesn't really make sense to take button mashers into account when determining balance. Theres a reason most devs ignore stats under gold rank",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Phonochirp",
                    "body": "You are correct that it isn't a good measure of balance. He does, to an extent, take the players skill levels into account. It's the opposite of what you'd think though.\n\n\nThere are many cases of a character getting nerfed because they were broken in low level play, despite being considered low tier by anyone who knows the shield button exists. Little mac and K. Rool immediately come to mind as examples of characters who got gutted because casual players couldn't deal with them. \n\n\nMeanwhile, it's very rare for a character who's only strong in high tiers, but weak in low tiers, to get nerfed. Like Steve. The only exceptions that I can think of is diddy's \"ding dong\" getting gutted, and Bayonetta's everything. The latter of which only happened because someone played her during the beta period, live on stage in front of Sakurai. If I remember correctly, he said he had no idea she could do that stuff and nerfed her to the ground.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ipokeyoumuch",
                            "body": "There was also a funny story of Sakurai watching Japan Evo and was surprised a the combos and weird boxes Metaknight, ZSS, Pac-Man, and Diddy Kong could do, in the next couple patches those characters got hit. ",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Phonochirp",
                                    "body": "Thanks for the confirmation, in my head \"the only time a top tier character gets nerfed is when Sakurai watches a tournament\" but had no data to back it up lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DMonitor",
                                            "body": "E3 2018 is another example, when MKLeo Bayonetta combo'd Plup a few times. People that were there say  they saw Sakurai shaking his head when it happened",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DMonitor",
                    "body": "Even the button mashers matter, to an extent. You don’t want to have pub stomper characters that just throw out knowledge checks that are annoying to fight against. Ultimate’s biggest strength is that it is very well balanced at the casual level, so casuals can just pick a character without worrying.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -14,
            "replies": [
                {
                    "depth": 1,
                    "author": "EnoughDatabase5382",
                    "body": "Here is a translation of a Famitsu column that Sakurai previously wrote about how he analyzes data in Super Smash Bros. Ultimate.\n\n\nhttps://nintendoeverything.com/sakurai-talks-smash-bros-ultimate-online-mode-victory-rates-character-usage-more/",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Thundahcaxzd",
                    "body": "\"The methodology used in their statistical analysis\" lol.  It's a win rate.  # of wins / # of matches played.",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "Frexxler",
                    "body": "It's just the win rate, I don't think any other stats are going to be as important as that one.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "verrius",
                            "body": "Not really.  Straight win rate, especially if there's skill based matchmaking, and players able to make choices about which character they play, isn't going to show problems unless they're incredibly egregious.  Skill-based matchmaking alone would obfuscate it to the point of noise, since it'll just mark low tier characters as \"low skill\" automatically, and only have them go against people who are bad with the high tier characters, to the point they have a 50/50 shot at winning, while pairing up high tier characters against each other.",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ultimafatum",
                    "body": "The amount of people responding to your extremely reasonable response to try to come out against it is alarming.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "40WAPSun",
                            "body": "\"alarming\" lol. God forbid people not take statistical analysis of character win rates seriously",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ultimafatum",
                                    "body": "I've played enough competitive games to know that this is patently false LOL\n\nYou might not care, but plenty of people do. And they're allowed to. Why are you even responding to this thread if statistics don't interest you wtf",
                                    "score": -5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LieAccomplishment",
                            "body": "Sod off with that crap. \n\n\nHe is overcomplicating a simple statistic and acting like its insufficient to support a conclusion the statistic never meant to conclude int he first place. Then he implied sakurai lied. What asinine bullshit. \n\n\nSakurai conveyed a very simple set of info. That winnrates, a simple stat, is close to 50 percent. No more no less. No one implied all the characters are balance against each other in the first place, merely that the systems in aggregate has managed this set of win rates ",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SoldnerDoppel",
                                    "body": "It's just not a very meaningful statistic, and it is generally going to be misinterpreted as \"the roster is quantifiably balanced\" when it decidedly isn't.\n\nIf Sakurai is sick of people bitching about character balance, he should just reiterate that it's a fucking party game, not a competitive fighting game.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Ultimafatum",
                                    "body": "Well then that statistic is meaningless, isn't it? If you're angry at the premise of someone not trusting a developer at their word idk what to tell you. Showing us the numbers would be invariably better than Sakurai just saying \"trust me bro\" lmao",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LieAccomplishment",
                                            "body": "why would that be meaningless?\n\nIt means the way the system, balance and player behavior interact to ensure that people are having matches that are competitive, and therefore enjoyable\n\nThat's the main takeaway. The majority, likely including sakurai, doesnt give a shit about balance in a competitive setting. You wanted to make this about that. It was never that\n\n>Showing us the numbers would be invariably better than Sakurai just saying \"trust me bro\" lmao\n\nIf the basis of your argument is that his word isn't trustworthy, why would him providing any numbers change that? What makes the numbers he provide any more trustworthy than him telling you what it is?\n\nIf he does produce the stats and you don't like it, what are you going to ask for? That it be audited by a 3rd party?\n\nYou have zero evidence he lied, but is making accusations because you don't like what you want to believe he is implying (which he isnt even implying). What an idiotic take.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Ultimafatum",
                                                    "body": "If you're citing numbers as evidence to prove an argument, that usually means that you're ready to show them. Being presented this information is not an unreasonable expectation to have. It's really not that deep.\n\nAlso people like numbers. *I* like numbers. Why are you alleging that I would be unsatisfied or suggesting that I would want an *audit*. You are being weird as fuck.",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": -15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "siltydoubloon",
                                            "body": "Please read our [rules](https://www.reddit.com/r/Games/wiki/rules), specifically Rule #2 regarding personal attacks and inflammatory language. We ask that you remember to remain civil, as future violations will result in a ban.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "robotoboy20",
            "body": "Inputting difficult button combinations, in a strict timing... and maintaining that pressure while utilizing meters and gauges and keeping track of that - will always be a stronger measure of skill in a head to head fighting game.\n\nWatching smash and knowing what buttons they're pressing when they do stuff... I translate it to watching a person play chess or something. Watching somebody play a traditional fighting game is like watching somebody play an insane piano piece. Both require skill... but one requires skill and dexterity in a way that smash players don't really have.\n\nIt's the reason I hate Modern controls in SF6 and the dumbing down of a lot of modern fighting games. When you simplify shit you are removing skill checks. Smash is one of the most simplistic \"fighting\" games I've ever played or watched be played. Sure it require skill, and there are people who are just better than others... but at the end of the day a lot of Smash players cannot translate their skills at smash into a traditional fighting game.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Peakomegaflare",
            "body": "Balance in smash has less to do with winrate and more to do with HOW the character is played. Infinite combo joker/bayonetta or desynch wobble ice climbers as clear examples. People complained about MetaKnight in Melee, however there were FAR worse things to contend with.\n\nEdit: Meant to say Brawl for Metaknight, going to leave it as is for my own mistake.",
            "score": -8,
            "replies": [
                {
                    "depth": 1,
                    "author": "DMonitor",
                    "body": "> MetaKnight in Melee\n\nMeta Knight was in Brawl, and was by far the worst thing to contend with in that game. Eventually, I think some chain grabbing characters got competitive with him, but only because the entire competitive ruleset was designed to prevent meta knight from cheesing games with his BS\n\nThe consensus best character in Melee is Fox, but he’s so difficult to maintain at a high level that even the best players will drop games with him. He’s a good top tier because his dominance comes from his high skill ceiling, and he has some difficult matchups against other top tiers.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Peakomegaflare",
                            "body": "My B, I meant to say Brawl, got caught up in my rant! But yes, the point I wanted to make though is that there's a distinct difference in skill and balance in Smash... that drastically differs from nearly anything else.\n\nSkill applies to characters like Fox for sure (Absolutely love that matchup, even when I get my ass handed to me) Compared to facing like... I'll use IC again. It doesn't actually take all that much skill to desynch and chain grab. A day of practice to get it down, and then just learning the timing for each character. \n\nBayonetta/Joker comboing is actually interesting to watch at least.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "R4msesII",
                    "body": "Nah there’s nothing worse than brawl metaknight, not even Steve",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kalecraft",
                            "body": "I'd say Bayo was worse just because of how easy her win condition was. She could basically win off of any hit. Meta Knight still played the game somewhat but he was just playing a different game than the rest of the cast lol\n\nThat's just my opinion and my even more subjective opinion that made Meta Knight better was because he was fun to play and usually fun to watch. Bayo was just a cringe lord and basically killed Smash 4. (Though technically Ultimate is what really killed it)",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}