{
    "title": "Insomniac Games about Marvel's Wolverine: \"We'll share news when the time is right, and the right time isn't now.\"",
    "comments": [
        {
            "depth": 0,
            "author": "ToothlessFTW",
            "body": "Was anyone expecting news? Everything we've seen about this game is very far off, if the leaks we did see are anything to go off, they're far more likely to talk about the Venom game out next year according to the leaked schedule. \n\nThis just kinda feels like an empty post, \"no news\" is I guess news, but not much to talk about.",
            "score": 191,
            "replies": [
                {
                    "depth": 1,
                    "author": "BenHDR",
                    "body": "I'd imagine the Spider-Man 2 DLC will take priority at the moment in terms of announcements, *potentially* with a Venom tease",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cuckingfomputer",
                            "body": "Assuming we even get Spider-Man 2 DLC. We haven't had any official news on that front.",
                            "score": 24,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BenHDR",
                                    "body": "True, although I believe the Insomniac leaks did show us there was at least a plan for three DLC's at one point in time. The first featuring Beetle, the second focusing on Carnage, and a third revolving around Spider-Verse.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cuckingfomputer",
                                            "body": "Right, but that's all leaks, and there's a good possibility that at least 2 of those things got yanked into the Venom game.",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Pheonix1025",
                                                    "body": "That Carnage side quest in Spider-Man 2 just abruptly ends before anything meaningful happens, I really hope they don’t pull the Carnage DLC into Venom.",
                                                    "score": 14
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DMPunk",
                    "body": "People just have Wolverine on the brain with the new Deadpool film coming in two months. Though it's been a very long time since video games had any sort of synchronicity with other media like that.",
                    "score": 32,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MumblingGhost",
                            "body": "Not only that, but X-men '97 too. Here's hoping Marvel is secretly publishing a new throwback X-men beat 'em up in the style of TMNT: Shredder's Revenge to release in the meantime. They gotta strike while the iron is hot!",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Flynn58",
                                    "body": "According to the licensing terms, I think Insomniac and Sony would be the only one with the rights to make and publish an X-Men game of any genre.\n\nHowever, if the game featured Marvel as a whole outside of just the X-Men, the terms of the agreement allow X-Men characters to be included, however they cannot be used as a console exclusive for Xbox or Nintendo.\n\nSo, new X-Men beat-em-up is probably out of the question, but a Marvel beat-em-up that includes X-Men characters would be perfectly allowed under the exclusivity deal that was included in the leaks.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BenHDR",
                                            "body": "You've missed that in said licensing agreement, there are a series of X-Men titles from the 90's that are exempt from the rule. They specifically make an exception for them, so I'd wager that there is indeed a non-PlayStation retro beat 'em up collection on the horizon\n\nYou're right however in that no *new* X-Men games can be published without Sony's approval outside of games that have team members as part of an ensemble cast. So stuff like Ultimate Alliance or Marvel vs Capcom can still feature X-Men characters\n\nAnother notable exception is that Deadpool is not listed among the characters that PlayStation have permission to use as part of these future X-Men titles",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Flynn58",
                                                    "body": "Yes I didn't think that needed to be mentioned since the person I was replying to explicitly was asking about NEW games, so re-releases of old games didn't need to be mentioned, because the discussion was about new games.",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "MumblingGhost",
                                            "body": "No wonder Midnight Suns wasn't strictly an X-men game. Ugh. I really hope Insomniac's next Marvel game hits hard with fans, because if not we might end up down the same rabbit hole that Star Wars landed in with EA.\n\nDont get me wrong, I'm a big fan of SW: Battlefront and Fallen Order, and a lot of what Insomniac has done so far, but I'm tired of franchises being restricted to specific devs like this.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "brutinator",
                                                    "body": "TBF, in addition to that, Marvel had just come off a LONG campaign of character assassinating X-Men, as I dont think they ever expected to get the rights back from Fox. \n\nMarvel basically tried to replace Mutants with Inhumans, and set up a lot of story lines in the comics between 2007 and when Disney acquired Fox that made X-men kinda suck (only really turning around in 2019 with House of X). Its why Kamela Khan was an Inhuman (though now they've hilariously retconned that either she's a mutant or both), and why in the shows they were setting up stories that were carbon copy mutant stories just as \"inhumans\" instead. \n\nFunnily enough, since 2019, Inhumans have basically vanished from the comics. I think Black Bolt has had less than 5 appearences since 2019, and he's one of the most important characters in the Marvel world.\n\nBasically, I dont know if Marvel or the developers were confident that having JUST Xmen characters would be enough when they've only recently been regaining popularity.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MumblingGhost",
                                                            "body": "Hopefully if Deadpool and Wolverine does well enough Marvel will remember what a massive cash cow the X-men franchise is and start going all in on it again.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "brutinator",
                                                                    "body": "Theyve been working on it, the House of X storyline was  one of the biggest comic storylines in a while, and really helped to re-establish the X-men as Marvel royalty",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Etherian",
                                    "body": "That would make me so, so happy. Which means it'll never happen.",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NoExcuse4OceanRudnes",
                    "body": "Yeah it's just a response to twitter spam, should have been ignored by Insomniac, should be ignored by us.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Sirromnad",
                    "body": "Probably just them getting ahead of all the upcoming shows (state of play, summer game fest) when people start clamoring for things. Let people know they won't see anything now so they don't get bummed when it's not there, makes sense to me.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Granum22",
                    "body": "The hack said it was coming out in 2025. If it was the 1st half of 2025 then maybe.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ToothlessFTW",
                            "body": "Nope, the leaked schedule places it in late 2026. Venom was slated for late 2025.",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "MegaGorilla69",
                            "body": "I thought it was venom 2025 and wolverine 2026?",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "literious",
                    "body": "I didn’t really expect anything from Insomniac, but I expected Sony first party studios to release games almost as often as they did it on PS4.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ShoddyPreparation",
            "body": "Leaks said 2026.\n\nLeaks also said they have a spiderman 2 mini sequel like Miles Moralas in 2025.   I will guess we won’t hear about wolverine until they reveal that spider man game.\n\nI could see next years Sony summer showcase having a big reveal for the Spider Man game announced as \"coming this holiday\" then cutting to a teaser for Wolverine coming in 2026.",
            "score": 56,
            "replies": [
                {
                    "depth": 1,
                    "author": "BenHDR",
                    "body": "The 2025 \"*mini sequel*\" as per the leak should be Venom\n\nThere's also mention of a Silk spin-off, which I'm guessing will likely be the \"*mini sequel*\" after Spider-Man 3",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "myyummyass",
            "body": "They have put out FOUR very high quality AAA games since 2018. If any developer deserves to take their time with their next game its them.",
            "score": 66,
            "replies": [
                {
                    "depth": 1,
                    "author": "BenHDR",
                    "body": "2016 - Ratchet & Clank\n\n2018 - Spider-Man\n\n2020 - Spider-Man: Remastered\n\n2020 - Spider-Man: Miles Morales\n\n2021 - Ratchet & Clank: Rift Apart\n\n2023 - Spider-Man 2\n\n2025 - Venom\n\n2026 - Wolverine\n\n2028 - Spider-Man 3\n\n2029 - Untitled Ratchet & Clank Project\n\n2030 - X-Men\n\n2031 - New IP\n\n*and* that's not including DLC, the Spider-Man: Silk spin-off, the (*cancelled?*) Spider-Man multiplayer game *and* the inferred future X-Men games in their exclusivity agreement either. If Insomniac manage to stick to this leaked schedule, I'll be extremely impressed",
                    "score": 72,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jataka",
                            "body": "Man, gaming kinda sucks massively for kids now with the dev time we're seeing. Imagine being 10 and playing Rift Apart and having to wait until you're an adult for a sequel. In comparison, Jak and Daxter 1 through 3 all came out in a 3 year span.",
                            "score": 38,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FlatDormersAreDumb",
                                    "body": "That's why Fortnite is so popular with kids. Constant updates.",
                                    "score": 34,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "imjustbettr",
                                            "body": "People wonder why f2p games are so popular but when I talk to Genshin fans it always sounds like there's a new small update every few months and a huge one every year.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Lord-Aizens-Chicken",
                                                    "body": "On the flip side I have seen people say single player games like BG3 are dead because no new dlc or updates… like not every game needs constant support lmao.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "imjustbettr",
                                                            "body": "I agree, I basically only play single player, \"completed\" games nowadays. \n\nI just think there's a hunger for that live service stuff because a section of gamers want constant updates.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Lord-Aizens-Chicken",
                                                                    "body": "Yea I’m not immune to love service stuff, I play Star rail and Destiny 2. But I find myself spending more time just playing single player stuff tbh",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Fyrus",
                                    "body": "> Imagine being 10 and playing Rift Apart and having to wait until you're an adult for a sequel. \n\nAs someone who watched my generation grow up with Pokemon and Harry Potter and then never move on from liking those things, I think it's good kids might have to actually force themselves to get interested in more than a handful of franchises.\n\njak and Daxter is a funny example since 3 had that abrupt switch to being \"adult\"",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Jataka",
                                            "body": "Jak 3 was just teenager-y. Like Warrior Within. I kinda wish we would see more of that these days, games growing up with their audience.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Fyrus",
                                                    "body": "I wouldn't necessarily say Jak 3 or Warrior Within were examples of growing up. It's like a kid's idea of what being an adult means. I was a teenager at the time and it felt pretty forced to me.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Jataka",
                                                            "body": "I agree. That's why I was saying teenager-y. I'm not saying the specific approach was great with both of them, but games at least aiming to evolve their subject matter as their audience grows up is a far more interesting thing than the alternative.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Nofutureinsales",
                            "body": "Excellent round up! And supposedly we're getting the free Spider-man DLC starting this year and maybe pouring over into the next. If that's the case we should hear about it at next week's showcase. If true, and if the schedule you posted above holds, then 2027 will be the only year for the next 7 years in which Insomniac is not releasing something.  Makes the Sony-mandated Insomniac layoffs even more puzzling.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "SireEvalish",
                            "body": "Is SM3 a PS6 title? The timeline would make sense.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cuckingfomputer",
                                    "body": "It'll probably be cross-generational.",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "pixeladrift",
                            "body": "What year is Sunset Overdrive 2 coming?! I don’t see it in your list, there must be some mistake.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Gxgear",
                            "body": ">New IP\n\nGimme Spider-Verse\\~",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Soyyyn",
                            "body": "That's a great schedule, but I sort of wonder what we can expect until the end of this year. Is 2024 just an emtpy year in terms of big releases other than Final Fantasy Rebirth?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BenHDR",
                                    "body": "In terms of PlayStation specifically, you have [Silent Hill 2](https://youtu.be/ayKICAIUHkA?si=dsf59UzvUk3v4yhU) on the way, alongside the *supposed* DLC for [Spider-Man 2](https://youtu.be/9fVYKsEmuRo?si=SCQ689Qkcvr0LNOP). There's also [Concord](https://youtu.be/Zb-xvCPecps?si=xjTGirVSzbUwHuJI), which is an FPS developed by one of Sony's new teams, [Firewalk Studios](https://www.firewalkstudios.com). As well as [Zenless Zone Zero](https://youtu.be/If7LQKe3C2w?si=COtSzZdb299xGhAV), the new title from MiHoYo (*if gacha games are your kinda thing*).\n\nSome smaller PlayStation exclusives releasing later in this year would be:\n\n• [Baby Steps](https://youtu.be/xcpEijrd98E?si=EGpBzw1wriGBCn-W)\n\n• [Sword of the Sea](https://youtu.be/KXUmt8SPfJk?si=sE_sF1Yg86a1czfL)\n\n• [Towers of Aghasba](https://youtu.be/NZt7faLIwyE?si=-TcjuWH-K-D1kasa)\n\n... and (*supposedly*) a new [Astro](https://youtu.be/33zqCAJ-qrE?si=m8opiHZxGHToxGT_) game that is going to be announced in the coming week.\n\n\nHopefully you find something more than FFVII to play!",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "errorme",
                            "body": "Damn, didn't realize it was going to be so long till the next Ratchet & Clank game.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Blackadder18",
                                    "body": "It might possibly be even longer. Some of the material suggested that Venom was actually targeting a 2027 release instead of 2025. If true then that means anything on that list could potentially be targeting a later window than original though.\n\nAlso worth noting this was before the layoffs, who knows how that has impacted timelines.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "The_Almighty_GFK",
                            "body": "Arent they making a Blade game as well?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BenHDR",
                                    "body": "No, Blade is being developed by Arkane Studios (*a company owned by Xbox*). They're the developers of Deathloop and Dishonored",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NoNefariousness2144",
                    "body": "To be fair three of those are basically the same game and some are pretty short.\n\nThe ‘expandalone’ genre like Miles Morales and Uncharted Lost Legacy is genius and I wish more studios did it as the gaps between AAA sequels are growing.",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Rough_Commercial_570",
                            "body": "Point stands",
                            "score": -14
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MadeByTango",
                    "body": "I’m in zero rush for their next title. They need to overhaul their encounter/mission design completely; this many games in and it’s a real drag how predictable and unengaging the encounters are because of their choice of an open ended progression system. You have to be able to beat evry ebemey and boss with the basic starting attacks and that’s rags down a lot of the mission design across the board.\n\nUnfortunately the leaks showed they’re copying that same spider/man enemy wave closet design for Wolverine, so hopeful more time will give them the chance to give that an overhaul or at least post the variety way beyond the current approach they’re using.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Zentrii",
                    "body": "I agree. It sucks that the game got leaked because it is making people even more impatient now. I’m fine with them taking their time because by the time it does come out I’m hoping the new  Steamdeck will be out and can run it really well lol.  ",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Thunder84",
                            "body": "Tbh the leaks probably helped with that by setting a realistic expectation of when we’re actually gonna see the game. Revealing Wolverine in 2021 and then not showing anything until 2025 at the earliest would’ve had people frothing at the mouth.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "lifeonbroadway",
                            "body": "Well it probably won’t release on PC right away so you will have an even longer wait lol.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Zentrii",
                                    "body": "That’s a good point but I’m in no rush because I don’t believe in FOMO anymore and thanks to the rise of more smaller developers making games than ever there will be plenty of great games to play in the meantime!",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ChrisRR",
                            "body": "I'm not sure how you figure that a steam deck 2 will definitely be able to run a game that's not even been formally announced.\n\nThe current steam deck already struggled with new AAA games, and I expect a new model to be similar.  Targeted towards mid-range gaming",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Howdareme9",
                                    "body": "Steamdeck will be able to run SM2 (if you’re okay with 30 fps), i think it’s a reasonable expectation for its next iteration to run Wolverine.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "aa22hhhh",
                                            "body": "I’m not too sure. It currently struggles to run Horizon Forbidden West and that’s one of the last cross-gen titles for the platform. SM2 is a full-on PS5 game, and while Spider-Man Remastered runs perfectly fine on there, that still has the foundation of a PS4 game.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Howdareme9",
                                                    "body": "https://www.reddit.com/r/insomniacleaks/s/9gvz55x7Lu\n\nThis is ofc an ‘unoptimised’ port, so i’d expect the real thing to do a bit better which should be enough for a constant 30fps",
                                                    "score": 3
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Halvus_I",
                                            "body": "It CAN run SM2 now…there is a PC build of the game from the leak.\n\nhttps://www.youtube.com/watch?v=N5W0tGS0hQ0",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "machineorganism",
                    "body": "i mean, all developers equally \"deserve\" to take their time with their next game. developers don't owe anyone anything when it comes to their games in development that haven't been sold yet. and no, purchasing their previous games does not make you a stockholder in the company, and they can spend the profits they made off you by burning it in a fire pit if they wanted to.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "KindlyBullfrog8",
                    "body": "High quality and game are debatable. Their last few \"games\" are basically cookie cutter on rails experiences ",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "politirob",
            "body": "I hate that these seasoned developers feel they need to respond to the whims of whiny online 12-year olds",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "Murmido",
                    "body": "If only if was 12 year olds.",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "Flowerstar1",
                    "body": "12 year olds are busy playing Roblox and Minecraft on their phones.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "KindlyBullfrog8",
                    "body": "Those people are their consumers so yes they kind of have an obligation to ",
                    "score": -12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Wachiavellee",
                            "body": "I don't know why some people think that the hyper online core of obsessive fans and anti-fans on twitter and reddit are somehow representative of some larger gamer market these companies have to appease. The vocal online types are a very loud but relatively small minority of their market. They often just don't matter that much.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KindlyBullfrog8",
                                    "body": "They're definitely a minority but theyre whales. The passionate fans make up a large chunk of your revenue and are the people who keep your name in the public zietgiest so yes they are very important",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "RogerAckr0yd",
                            "body": "They absolutely do not have an obligation to reply to random people on twitter",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KindlyBullfrog8",
                                    "body": "Oh sure but then don't get mad when their audience gets mad at them for ignoring their audience ",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "RadicalLackey",
                                            "body": "If you get mad over a game, that's on you. Also nobody Insomniac can do whatever their audience eats it up because their games have consistent quality.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "KindlyBullfrog8",
                                                    "body": "Lots of people can't unfortunately. I don't think it's quality do much as good marketing ",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "RadicalLackey",
                                                            "body": "You are getting into \"opinion\" territory, so can't comment on that. Insomniac fames are relatively held to a high standard by most reviewers and their financial success shows their audience buys their games.\n\n\nWhether some people dislike them, well, opinions differ.\n\n\nInsomniac doesn't owe people an announcement they never commited to. This is based on leaks, and those aren't fully reliable.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "KindlyBullfrog8",
                                                                    "body": "Fair enough. But the leaks werent like rumours and what not but full on hacked data. That's reliable so it makes sense for them to come out and quash the hype before it reaches critical mass. I'm surprised they didn't do it sooner tbch",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "RadicalLackey",
                                                                            "body": "They did come out and quash the hype. They mentioned iirc, that the information contained within was not meant to be seen becayse it's not final. Release dates change constantly based on how development progresses... That's the problem with leaks, even if they are real, the way people interpret the information can be extremely harmful.",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "RogerAckr0yd",
                                            "body": "I won't, that sounds like the last important thing ever.",
                                            "score": -2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "decemberhunting",
                            "body": "If there's a major news event or public controversy that genuinely needs to be addressed by them for the sake of PR, then sure. \n\nPeople getting restless on Twitter waiting for game development to finish doesn't qualify.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KindlyBullfrog8",
                                    "body": "I guess their pr team thought different",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dastrados",
            "body": "I wish they made more than marvel slop these days, Ratchet and Clank ps2 series is miles above everything they've made recently, save for the graphics.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Titan7771",
            "body": "I always wonder what effect (if any) having parts of your game leaked may have on internal development. Like if you get tons of negative feedback, do you consider changing course or do you just brush it off? 99% of the criticisms I saw about Wolverine came from people that don't understand a work in progress looks like, but I'm still curious if they listened to anything people were saying about it.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "schwabadelic",
            "body": "They will probably wait until after the Deadpool and Wolverine movie comes out so people are thirsty for more Wolverine.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Zilskaabe",
            "body": "Weren't those news already shared by hackers?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TheConnASSeur",
            "body": "Is this the same Wolverine that had its  early prototype released on warez sites?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "This_Pineapple_3225",
            "body": "Superheros are are inherently a bad premise for video games. \n\nHear me out: Progression. \n\nThe set abilities and static power level of the DC and Marvel heros makes progression in the games break the fundamental concept of those comic book worlds. The narrative, stories and conflicts are designed around villain-hero relationships in power level. This means that games with these characters diverge from the pathways in narrative that define their interaction in the world.\n\nPretty sure someone could write a thesis about this on the topic of ludonarrative dissonance.  \n\nSpiderman and Tony stark are the two I can think off that progress via technology. And you get rare moments of significant change.",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "darkmacgf",
                    "body": "Almost every superhero comic/movie has the hero getting stronger as the story progresses.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "This_Pineapple_3225",
                            "body": "I suppose my definition of progression might be different from yours and that makes sense. Mine is one of logarithmic growth over the narrative growth of wolverine who gets a metal skeleton. Of the physical aging of superman who comes more fully into his powers over time. Or thor getting a new hammer and blessing. Batman is a good example of technological and physical progression in skill but he is fundamentally limited by the capacity of human growth.\n\nDragonball is a good example of the progression that can exist when it is foundational to the ruleset of the world. Even better, consider Naruto: the entire premise of the show is about gaining strength and progressing in skills. Progression is built into the world and its characters. Marvel and DC heroes exist in a flat world where progression is not the premise of society at all. Training is undertake to use held power but it is certainly not to gain new powers.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "darkmacgf",
                                    "body": "Maybe not to gain new powers, but they discover new ways of using their own powers all the time. Plenty of superhero movies have montages where they're trying out their abilities and gradually coming to master them.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}