{
    "title": "Embracer Group expect to release more than 70 game projects before March 31, 2025, including at least three important unannounced titles.",
    "comments": [
        {
            "depth": 0,
            "author": "brzzcode",
            "body": "If you open the link you'll see the games their subsidiaries are going to launch. People don't seem to know but you'll never see the name embracer out there as its neither a publisher or developer.",
            "score": 114,
            "replies": [
                {
                    "depth": 1,
                    "author": "Frigidevil",
                    "body": "I think a hoarder would be the right descriptor at this point.",
                    "score": 53
                },
                {
                    "depth": 1,
                    "author": "PedanticPaladin",
                    "body": "*looks over list in link for anything interesting*\n\nWait, there's a Legend of the Five Rings video game coming?!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MisterBeebo",
            "body": "“Sorry, did we say 70 game products? We meant game studios. We’re releasing 70 of our game studios.”",
            "score": 253,
            "replies": [
                {
                    "depth": 1,
                    "author": "ShatterNL",
                    "body": "Releasing 70 game studios? We mean we will be releasing 70 employees, effective immediately!",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CaspianRoach",
                            "body": "per studio",
                            "score": 15
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "James-Avatar",
                    "body": "That’s what I thought it meant and didn’t question it at all.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "BusCrashBoy",
                    "body": "Underrated comment",
                    "score": -17
                }
            ]
        },
        {
            "depth": 0,
            "author": "goblin_humppa27",
            "body": "A bit surprised to see they're bringing back *Truxton*, a shmup from like 40 years ago. The Classic Game Room guy should be happy about that.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Xanthus179",
            "body": "I’m too lazy to look back at their earlier comments, but I bet they also had great expectations when they began gobbling up companies.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "_PM_ME_PANGOLINS_",
                    "body": "We all thought you couldn’t get worse studio management than Square Enix. Embracer asked the Saudis to hold their beer.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "Sh4mblesDog",
                    "body": "I honestly don't understand why they're so highly valued, hell their marketcap used to be significantly higher, the only game that has any cultural significance in their portfolio is Kingdom come, yet they're apparently worth billions of dollars for owning a Battalion of middle of the pack noname studios with games few people know? How can quantity over quality be worth so much money?",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "trident042",
                            "body": "Investors who know diddly dick about gaming but see \"a diverse portfolio\" and pop three-quarters chub",
                            "score": 9
                        },
                        {
                            "depth": 2,
                            "author": "pgtl_10",
                            "body": "They own a board game maker and lord of the rings.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "IgnoreMe733",
            "body": "I'm guessing it's too much to expect something Legacy of Kain related?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Party_Helicopter_224",
            "body": "Dont they have like 200 studios ? I looked into what they owned and a big chunk of them are no name studios with 0 games made. Im guessing a lot of these will be small scale pc only games and mobile games.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "michael199310",
            "body": "Sure, and then 50 out of 70 will flop, so they will be \"forced\" to close down more studios.\n\nEmbracer Group is becoming a meme at this point.",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "BarelyMagicMike",
                    "body": "Only 50? Optimist over here.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lupin43",
                            "body": "They didn’t tell you the other 20 will be merged down into 4, and oops where did all these redundancies come from how did this happen to us!",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "gk99",
                            "body": "I dunno, they make a *lot* of remakes and remasters. There's probably 20 successful projects in there somewhere considering acquisitions like TimeSplitters and all of Square Enix's western stuff.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CollinsCouldveDucked",
                    "body": "I wonder how many of these are being forced out the door unfinished to try and keep the plates spinning over there.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BitingSatyr",
                    "body": "What would the studios releasing those flops have done in the counterfactual where embracer didn’t buy them? Release giant hits and make tons of money?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Izzy248",
            "body": "Thats around 7 games a month for the next 10 months...granted, they still have a lot of studios they own even after all the cuts, but I dont see this being realistic. We've seen this song and dance before, and it usually ends up being a bunch of throwaways, or it turns out to be actually nothing except something to impress investors, but never actually materializes.\n\nI feel like I remember Phil Spencer saying, around the start of this current console gen, that Xbox would release around 100 games for their system within the next year, and did this 2 years in a row. I mean, technically it was true if you count 3rd party multiplatform games that went to everyone, but I dont remember 100 Xbox exclusives. These big numbers are more for the suits than the consumers.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "sumyth90",
                    "body": "Phil Spencer never said that in the context of exclusives.",
                    "score": 32
                },
                {
                    "depth": 1,
                    "author": "HelloOrg",
                    "body": "Not in any way an Xbox fanboy but I don’t get the point of your second paragraph when you’re saying “Spencer said he would do A for one year, and he actually ended up doing A for two years in a row. That said, he wasn’t doing B, so…”",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "TheMirthfulMuffin",
                    "body": "Did you click the link, which lists the games and their release dates?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "S4BoT",
            "body": "They seem to be recovering from their downward spiral? Or is it still too early to state this?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "scytheavatar",
                    "body": "It's about big hits cause it's not like Embracer didn't have successes like Remnant 2 or Valheim during their \"downward spiral\", but those are just too little too late. And not enough to make up for the losses in shit like the new Saints Row.",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "brownninja97",
                            "body": "I doubt that for the most part embracer is trying to dominate the European AA sector. Aside from their deep silver releases most of their games profit from 50k sales",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "scytheavatar",
                                    "body": "Just because they profit from 50k sales today doesn't mean they will profit from 50k sales forever, cause production costs are constantly rising. People are fooling themselves if they think the European AA sector is some goldmine and Embracer can avoid operating like other AAA publishers. Relying on a bunch of giant hits to pay for the majority of projects that don't make much money,",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "brownninja97",
                                            "body": "They have made increasing profit every year since they started. If they didn't blow billions on asmodee they wouldn't have debt so the strategy is working. AAA is very high risk high return right now, then being burnt by volition showed that big time for them. Owning AA is where they can shine it's worked in the past and I don't see a reason for them to change",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "meltingpotato",
                    "body": "If anything, saying 'we'll be releasing more than 5 games every month until march 2025 is them going down that spiral even more. They have the manpower to do it but not the time and money. Unless all of them are mobile games or some thing with 3 of them being from big IPs.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "A_Sinclaire",
                            "body": "The post includes a list with 33 announced games (though not all of them might be scheduled to release before March 25). Mostly they are either PC only or multiplatform. No mobile games at all.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "meltingpotato",
                                    "body": "I meant more in terms of quality.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "innerparty45",
                                            "body": "Quality has nothing to do with amount of games they release because Embracer is just a holding company. Companies that are part of the concern do their own quality assurance.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheOppositeOfDecent",
                    "body": "Trying to push everything in production out the door as quickly as possible to get cash coming in does not seem like a sign of recovery, imo",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Rialmwe",
                    "body": "They will keep going down. Unless one of the big games ends up being successful.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Heisenburgo",
                            "body": "If they don't release a remaster of the Thief games and Deus Ex 5 they're toast, that's what the people want the most. Do they still own Tomb Raider.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Relo_bate",
                                    "body": "Deus ex is going to lose them money. That franchise is infamous for not making enough money.",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "innerparty45",
                                    "body": "Yes they are toast if they don't release games in one of the least profitable genres ever, immersion sims.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "Rialmwe",
                                    "body": "Deux Ex was killed this year. And yes they still own Tomb Raider.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Falsus",
                                    "body": "No they sold the franchise to Amazon for like twice what they bought all Square IPs for like half a year after buying the stuff. \n\nThough just sold the franchise, not the studio making it so they are still part of it.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FakoSizlo",
                    "body": "The hoarded studios accruing massive debt based on a future Saudi investment that fell through. The downward spiral will continue because there is no way they can afford all the studios they acquired",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Augustor2",
            "body": "You guys are too negative, the games are not even out, embracer just happen to own these studios, if you don't even get excited about games at all, then wtf are you doing here",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "_PM_ME_PANGOLINS_",
                    "body": "I thought this was r/games, not r/hype.",
                    "score": -3
                }
            ]
        },
        {
            "depth": 0,
            "author": "tatooine0",
            "body": "I'm surprised that they're planning on announcing nearly 40 games in the coming months. The list given was only a little more than 30.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mr_Skeltal_Naxbem",
            "body": "Between the large number of projects and the failed deals, I feel like Embracer has spread themselves way too thin, as they keep bleeding cash, I fear that most of these will end up being unpolished or even cancelled",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Rich_Eater",
            "body": "Acquire studio, release a clearly unpolished product, shut down studio, abandon game.\n\nThat's the Embracer way!",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Biggu5Dicku5",
            "body": "I didn't even know they had that many games in development, and they expect to release them ALL in a year? Total nonsense lol...",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "b00po",
                    "body": "They have like 100 studios and most of them make budget or AA games. Some release multiple titles per year. Probably a decent amount of HD remasters of older games in the pipeline too. Not super outlandish.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "brzzcode",
                            "body": "its not thats around what they release between all of their subsidiaries. they own multiple publishers and studios that are contracted or publish their or other titles.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Vegan_Honk",
            "body": "70 goddamn games in 10 months?\nYou think flooding the fucking market is going to work in your favor?\nGoddamn that's a dumb decision. No wonder the Saudis pulled out.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "roehnin",
            "body": "How important can a game be if it's merely a small part of such a large mass of content?",
            "score": -11,
            "replies": [
                {
                    "depth": 1,
                    "author": "_PM_ME_PANGOLINS_",
                    "body": "Every game for the last thirty years has been a small part of a large mass of content…",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "HelloOrg",
                    "body": "When it comes to games I focus more on “fun” than “importance”",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Falsus",
                    "body": "Well one company owns several publishers it will end up being a lot of games. \n\nThey don't produce or publish titles, they own the companies who does that.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "roehnin",
                            "body": "I'm questioning importance, not volume.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Falsus",
                                    "body": "There is a lot of pretty good games in that list if we look at history. \n\nMetro, Tomb Raider, Kingdom Come, Hyper Light Breaker, Gothic Remake etc. And shitting on the games we don't know shit about yet just because they related to Embracer is terribly self absorbed.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}