{
    "title": "Totally Spies! Cyber Mission launches October 31 for PS5, Xbox Series, PS4, Xbox One, Switch, and PC",
    "comments": [
        {
            "depth": 0,
            "author": "Dagrix",
            "body": "Is Totally Spies popular or even known outside of France? In France it's famous among millenials who watched them on TV when they were kids.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "reevnge",
                    "body": "It actually aired in the US before it aired in France (despite being a French production), so I would say yes.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Hazeringx",
                    "body": "It was kind of well known in Brazil. I used to like watching it when I was a kid.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "havocssbm",
            "body": "Kind of odd to see this game get a physical edition that's on PS5/PS4 and Switch but not Xbox. Dunno if I've seen any other game skip just one console for a physical release when it's on all 3 + PC.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ArcherInPosition",
                    "body": "Xbox themselves have been shifting away from physical games. Xbox retail sections have been shutting down, and they didn't even do a Hellblade 2 physical.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "YourmomgoestocolIege",
                    "body": "Probably pretty easy for them to port it to the x-box, but aren't confident enough that it'll sell on the console enough to make physical copies",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "who128",
                    "body": "[Supposedly XBox was cutting the departments that work on physical releases.](https://x.com/JezCorden/status/1750590022842278391)\n\nThe other part is according to leaked number, Series S is outselling the Series X 3 to 1 so only a quarter of the current gen consoles they sell can play physical media.  I imagine a lot of publishers are going to skip physical on Xbox going forward.",
                    "score": 1
                }
            ]
        }
    ]
}