{
    "title": "MultiVersus - Official Jason Voorhees \"Weirdo in a Mask\" Gameplay Trailer",
    "comments": [
        {
            "depth": 0,
            "author": "ZombiePyroNinja",
            "body": "Jason looks like he drank the lake around him - all the same I love his design and the Jason X outfit!\n\nSo glad we're seeing a return of Friday the 13th considering the legal mess that tied up the rights for *so* long. \n\nBetween this and MKX I can't believe I have the chance to be a Jason main twice",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "AZRockets",
                    "body": "Time to make mother proud",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "CursedSnowman5000",
            "body": "I'm actually pretty tickled to see so many deep cuts of Jason lore be incorporated into his move set. Such as the call back to Freddy Vs Jason bed death and the sleeping bag rather than him just using a machete and that be it. Or the call back to part 6 and 7 with the trailer intro.",
            "score": 25
        },
        {
            "depth": 0,
            "author": "Overshadowedone",
            "body": "I love the sleeping bag special, and I hope that was a nano-machine install. I dont have high expectations for this game, but dang that was commical.",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "NoNefariousness2144",
                    "body": "One thing Multiversus does well is filling every character’s kits with fan-service.\n\nVelma is hillarious because instead of physically attacking she talks and makes big speech bubbles that hurt people. And Tom and Jerry are too busy fighting each other and their attacks can hurt others.",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "joe1up",
                            "body": "Tom and jerry were my favourite in the beta because of how well animated they were",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mjrballer20",
                                    "body": "Yep I didn't expect them to become one of my mains but they are fun and strong too!",
                                    "score": 12
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "xtremeradness",
            "body": "People rightfully bitch and moan about egregious monetization and WB being a troublesome publisher, but I can't help but love this game and hope it succeeds for a long time. Who thought we'd ever have a game where Jason could fight Shaggy and Wonder Woman?\n\n\nHere's hoping WB doesn't ruin a good thing.",
            "score": 85,
            "replies": [
                {
                    "depth": 1,
                    "author": "NoNefariousness2144",
                    "body": "It seems they are making good improvements so far by putting premium currency in the battlepass.\n\nNow the real test will be whether the battlepass is a grindy slog or not.",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ExpressBall1",
                            "body": "I wonder if they'll do that extremely scummy thing where, for example, the battle pass costs 500 points of in-game currency, but you can only buy 450 points of in-game currency for $10, and then the next jump is buying 900 points at $20. So you're essentially forced to pay double the amount you should because they deliberately choose scamming breakpoints.   \n  \nI seem to remember doing that last time they launched the game, but maybe I'm thinking of something else.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NoNefariousness2144",
                                    "body": "I remember there was a 450 pack but I think there was also a 1000 pack which was enough to get the battlepass.",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "Philiard",
                                    "body": "The Battle Pass costs 950 Gleamium. You can buy 1000 Gleamium for $10.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "RogueLightMyFire",
                                    "body": "I think they mentioned in the last update that they're will be enough in each battle pass to buy the next one",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MegamanX195",
                                            "body": "That's not what they're asking, though. What they want to know is if it'll be possible to buy the exact amount of currency to buy the Pass or not.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "oneshotfinch",
                    "body": "When coming from other F2P titles, paid characters seems egregious. But when compared to other fighting games, the majority of which cost €60 or more for entry, they're charging the same price for fighters. \n\nFunnily enough the fact that it's included with a battle pass instead of being a separate charge like Tekken or Mortal Kombat seems to have set off /r/games radar more than usual, just because it has the phrase \"battle pass\" in the deal.",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Blurbyo",
                            "body": "Yeah like you said, when it comes to other fighting games it is less egregious.\n\n\nThey seem to skate by quite often.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DMonitor",
                    "body": "> Who thought we'd ever have a game where Jason could fight Shaggy and Wonder Woman\n\nBe real. This hasn’t been a unique compelling concept since Fortnite started doing crossovers",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "xtremeradness",
                            "body": "It's quite a bit different because in Fortnite, they're all shooting guns and are reskins of each other. In this, you have Jason reenacting his iconic horrifyingly gruesome kills on Steven Universe and Bugs Bunny.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "-FackinCrazy-",
                                    "body": "I find this funny because  neither of the two meta weapons right now are guns. \n\nIts water bending and the chain of hades.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Plunder_Boy",
                                            "body": "I thought both were gone already?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "chimerauprising",
                                                    "body": "They came back a few weeks ago. \n\nAnd will disappear tomorrow.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Plunder_Boy",
                                                            "body": "Ah gotcha. Rip. Water bending was real fun",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "-FackinCrazy-",
                                                    "body": "today is the final day of the season",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "xtremeradness",
                                            "body": "Guess I'm talking out my ass then. I didn't realize they've added all those weapons haha. It's been a bit since I've played.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "-FackinCrazy-",
                                                    "body": "They usually add unique weapons with the big crossovers now so like this season we got\n\nAvatar skins with bending the elements.\n\nStar wars skins with blasters, bowcasters and Vader's light saber.\n\nGreek gods with chain of hades, Zeus's lightning bolts, wings of Icarus. \n\nTomorrow is the new season start and it's wasteland themed so we are getting fallout stuff like power armor skins, laser rifles, nuka cola, new vehicles and some other stuff that I can't quite tell what it is from the trailer.\n\n\nEdit. Oh and the map also changes and has events added so right now the map has mount Olympus, Hades like zone, empire bases and avatar temples.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "xtremeradness",
                                                            "body": "Very interesting, thanks for the info. So only players who buy X skin get the X weapon?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "_Valisk",
                                                                    "body": "No, the skins are only cosmetic. The weapons are lootable items in the game.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "yeahokaycommy",
                            "body": "And you know, *smash bros ultimate*",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Noellevanious",
                                    "body": "What on earth are you talking about? Smash bros ultimate is the best example of crossovers. Sakurai would literally dedicate ~30 minute long videos to talk about just how much effort he and his team put into each character to make them feel like how they feel in their home properties as much as possible. Sakurai's attention to detail puts any other crossover to shame.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "yeahokaycommy",
                                            "body": "Didn't gotta tell me, I agree with you!",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Limp_Platypus8000",
                                    "body": "Fortnite was an apt comparison there's no need to bring up a less impressive crossover",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Tacdeho",
                                            "body": "That ain’t a fucking thing less impressive about Smash Bros. The sheer amount of jumping through hoops that Sakurai’s team needed to get the licensing to Sora is nothing less than genius.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "-FackinCrazy-",
                                                    "body": "How is sora in smash not less impressive than the hundreds of equally impressive character crossovers in fortnite?\n\nHell he's probably gonna be in fortnite soon if the leaks are correct so..",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[removed]",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Bacalacon",
                            "body": "There's a huge difference between skins and having the actual characters with a designated moveset.",
                            "score": -1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pipsohip",
                    "body": "I want to like it so much, but it just feels so *bad* to play. The physics, the hits, all of it just feels bad to me. I wish I knew literally what the issue was so I could articulate why it feels so much worse than something like Smash, but I just can’t get into it.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PunishingCrab",
                            "body": "The animations are too floaty. Attacks never felt like they had weight behind them. Take any fully charged attack in Multiversus and it doesn’t come close to a forward smash Ganondorf, or a Falcon Punch. Smash has a “meaty” feel to attacks, combined with satisfying hit stop animation and sounds, and it feels great to fight.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "AltDisk288",
                            "body": "For starters, it physics are just too floaty. Its done intentionally of course, but its just way less satisfying to move your chatacter around than non-floaty physics.\n\n\nSecond of all, the animations and visual clarity in Smash are just unrivalled and always will be.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "overhillandoverdale",
                    "body": "WB *will* ruin a good thing.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Orpheeus",
            "body": "He kind of looks like the guy from Splatterhouse, who was themself inspired by Jason, so we've come full circle.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "spiritbearr",
            "body": "Couldn't wait for September to release him on a Friday the 13th? Actually considering Zazlav yeah do it now.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "tehace",
            "body": "Huh I didn't even realize Friday the 13th was owned by WB?",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "DawgBloo",
                    "body": "The rights are a mess. At one point they were distributing the movies but now the rights are split between two separate IP holders, none of which are WB. This is technically the game’s first true 3rd party character.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "-FackinCrazy-",
                            "body": "Yeah new line cinema owns the Friday the 13th name, the original writer owns the first movie minus the name, and horror inc owns everything else.\n\nThankfully because Jason is only really a character in part 2 onwards and already has movies where it's just \"Jason: subtitle\" horror inc can kinda dance around the issue by not referencing the events of the first movie which still sucks but isn't as bad as it could have been.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BunBunSoup",
            "body": "It's really hard to tell what to think about this game. Stuff like this looks great. I never played the beta, but it looks like it's full of personality. But then you see the gameplay they've been showing on twitter, and it looks like when you're playing Tekken and your opponent is playing on a pc that can barely run the game. I'll probably end up giving it a try regardless, but I'm very reserved on it right now.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "throwmeawaydoods",
                    "body": "FWIW during the beta I had similar issues with the gameplay footage but I found that it felt way better to play than it looked. Granted they’ve changed a lot since then and I’m not sure if I’m a fan of the crazy hitstun they’ve added on every move but I have faith in the dev team. \n\nI don’t think it’s a very good “esports” game compared to any other smash-like but it’s a lot of fun to mess around with, especially if you have a friend to play with",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "scarletnaught",
            "body": "Will there be a way to just buy all characters/stages straight up?  I've been trying to research this but getting conflicting information.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "DMonitor",
                    "body": "No. It’s a live service game with an infinite spending cap. To get all the characters, you need to buy them individually (with real money purchase or ingame earned currency), unless they’re currently in the battlepass which means you need to buy the battlepass. After the 2-month battlepass is over, you can then buy the character separately (same currency options as before).",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DICK-PARKINSONS",
                            "body": "Pretty sure they're putting out a challenge to unlock characters as well after their bp ends",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "2017moscatoa",
                            "body": "You can unlock them through play also after the battlepass is over",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "scarletnaught",
                            "body": "Alright thanks for the response, I'll pass.",
                            "score": -1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lazydogjumper",
                    "body": "I'm not sure if they have spoken about it but all characters were available in \"local play\".\n\nEdit: During the early access period",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Archyes",
            "body": "i dont know why they want to burn money. this game already failed onnce, it will fail again and burn a studio to the ground",
            "score": -19,
            "replies": [
                {
                    "depth": 1,
                    "author": "DawgBloo",
                    "body": "It didn’t need to fail that first time. The foundation and ideas for the game were solid but the developers were in way over their head when it came to supporting it. Which is why the game going on a year long hiatus and the team expanding is good. For their sake they better have learned the right lessons because there is a market for a free to play platform fighter featuring its own roster of iconic characters.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Philiard",
                            "body": "People to seem weirdly anticipatory of this game's downfall. There's been a lot of gloom and doom about its chances and its expected lifetime. Sometimes it feels like people are more excited to see a game fail than they are for it to succeed.",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}