{
    "title": "Atari Acquires Intellivision Brand",
    "comments": [
        {
            "depth": 0,
            "author": "BaileyJIII",
            "body": "I’m sure Tommy Tallarico’s mom is very proud. \n\nI’m surprised Atari aren’t scrapping the made-up console that Intellivision under Tommy came up with though.",
            "score": 775,
            "replies": [
                {
                    "depth": 1,
                    "author": "djcube1701",
                    "body": "> I’m surprised Atari aren’t scrapping the made-up console that Intellivision under Tommy came up with though.\n\nAtari have purchased the Intellivision name and various IPs, not the company itself. They're having nothing to do with the Amico. \n\nThe company is getting a new name and will be in charge of the Amico themselves. The deal allows this company to still use the Intellivision IPs that Arari now own on their scam console.",
                    "score": 225,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Link_In_Pajamas",
                            "body": "What a great deal for Atari then haha.\n\nKinda sucks that Tommy is getting some money out of it though.",
                            "score": 99,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JayRoo83",
                                    "body": "I can't get over how Tommy just keeps failing upwards no matter what terrible idea he has",
                                    "score": 64,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LordEdubbz",
                                            "body": "Vic with Electric Playground re-acquired their classic episodes and I've been watching them on their YouTube and the experience is slightly spoiled by how much of a shit I now know Tommy is.",
                                            "score": 33
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ccricers",
                                            "body": "Here are some Atari related statements that aged like milk, though: https://youtu.be/QNbhVCV_5Xg",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "hnwcs",
                                    "body": "TOMMY WANTS MONEY",
                                    "score": 85,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ACCESSx_xGRANTED",
                                            "body": "those guinness world records aint gonna pay for themselves.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "rabidferret",
                                    "body": "Is he? I thought he hadn't been involved with the intellivision stuff for a while",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Apprentice57",
                                            "body": "He hasn't been CEO for a while, but even on the Intellivision website he's still listed as \"Founder/Board Member/Investor\"\n\nhttps://intellivision.com/our-team",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Apprentice57",
                                    "body": "I suspect that the money for this is going to go to expenses that Intellivision (or whatever they call themselves going forward) already has. Tommy is selling (sold?) his house, probably for the same.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Spocks_Goatee",
                            "body": "How has the Amico company not totally folded by now? I doubt they have had any sizeable influx of money in over year.\n\nI need my American Greed episode!",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "djcube1701",
                                    "body": "They somehow keep getting new loans and investors.\n\nThis is definitely a last ditch effort, they're selling off everything valuable about the company. They already got rid of most staff and stopped using their offices.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Simpicity",
                                            "body": "Nah I can't wait to play the classic Smurf Rescue now with the Oof sound.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BaileyJIII",
                            "body": "That would explain it.",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "Asmor",
                            "body": "> Atari have purchased the Intellivision name and various IPs\n\n*Infrogrames* purchased the Intellivision name and various IPs. Just like they did the Atari name. The company currently known as Atari has nothing to do with the Atari everyone thinks of when they hear the name.",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Catty_C",
                                    "body": "To be fair I think Infrogrames has owned Atari brand longer than proper Atari lasted.",
                                    "score": 33
                                },
                                {
                                    "depth": 3,
                                    "author": "HeldnarRommar",
                                    "body": "I would much rather Infogrames be Atari than the OG Atari.\n\nIdk why people get so annoyed about Infrogrames using the Atari name when the original tanked the whole industry.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HeldnarRommar",
                                                    "body": "You are using your own anecdotal evidence to disprove a wildly documented crash: Just because you didn’t recognize the crash as a child during that time doesn’t mean it somehow didn’t exist. Your memories don’t dictate reality. There are plenty of other people who were alive also back then and recognize the crash.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[deleted]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HeldnarRommar",
                                                                    "body": "https://en.wikipedia.org/wiki/Video_game_crash_of_1983\n\nMultiple sources backed up by people who studied this AND LIVED THROUGH IT. But you are the only one correct. Narcissistic behavior",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "dropdan",
                            "body": "Atari posted this on Twitter: \"The former Intellivision will rebrand and continue distribution of the Amico console.\" I would share the link but I'm not sure if it's allowed. The official handle for the company is simply Atari in case anyone wants to check.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "StrategicRacoon",
                            "body": "They actually do they have said the former intellivision will rebrand and continue the distribution of the Amico console. [Here](https://imgur.com/a/F3iq2Qq)",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "djcube1701",
                                    "body": "Yes, that's what I said. Atari own the Intellivision brand name and IPs, not the company itself.\n\nThe Intellivision company (which will be renaming itself) will not be part of Atari, and will continue on with the Amico stuff under a new name.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BruiserBroly",
                                            "body": "I wonder if the money from this will help them actually get people the consoles they crowdfunded and pre-ordered? Probably not but I hope so for their sake.",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BobSlydell08",
                                    "body": "Lol at \"continue distribution.\" Can't continue something that never started in the first place",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hnwcs",
                    "body": "His mother's pride was included in the deal. She's now very proud of Atari.",
                    "score": 48
                },
                {
                    "depth": 1,
                    "author": "Tacdeho",
                    "body": "Every time I go into his dining room and see the fountain, it makes me have to pee.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "FishMcCool",
                    "body": "Because they can simply sell an Intellivision compilation on Steam and turn the Steam deck into a better Amico than the Amico (for a start, it actually exists).",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ToothlessFTW",
                    "body": "At this point it’s probably more of a headache to can it. They’ve sold pre-orders, games have been made already, they might’ve produced units already, it’s probably easier to just cut budgets and shove it out the door as soon as possible and they can move on.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Minsc_NBoo",
                            "body": "They have not produced any consoles, apart from a few prototype units cobbled together by hand\n\nThe console and pack in games were not finished. The mobile Cornhole game was just [patched recently](https://i.redd.it/onccwk0xo0zc1.png) as the career mode and AI was not finished, and didn't work\n\nIt was all lies...",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ACCESSx_xGRANTED",
                                    "body": "its not a console anymore. they're turning it into a shitty android/ios app, and its still in beta lmao. \n\nand the games cost like twice as much as intellivision was originally planning to sell them for. im sure tommy's mom is very proud.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Minsc_NBoo",
                                            "body": "I periodically check the Google store to laugh at the sales figures\n\nLast time I checked Cornhole and Astrosmash have 100+ downloads\n\nDart frenzy has 50.....\n\nThe App itself has 1000+ downloads, which means at least 90% of people immediately uninstalled when they realised you need 2 phones for a shitty single player game",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kennii",
                    "body": "Anyone got a youtube video or anything on what this all means. Im out the loop big time, but it asounds interesting",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TinyBreadBigMouth",
                            "body": "https://www.youtube.com/watch?v=0twDETh6QaI\n\nI swear, this looks unrelated but is in fact the video you want.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kennii",
                                    "body": "The scream had me crackin up😂\nI appreciate u. Gonna watch it soon",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sonicfan42069666",
            "body": "It makes me sad that Intellivision was actually controlled by people who originally worked at Mattel Electronics, until recently. It was a legacy brand that actually had legacy people behind it.\n\nObviously that was before Tommy took the name and ran it into the ground.",
            "score": 134,
            "replies": [
                {
                    "depth": 1,
                    "author": "ThetaReactor",
                    "body": "You know it's gone badly when we're all rooting for the re-animated corpse of Atari.",
                    "score": 52,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MelancholyArtichoke",
                            "body": "Re-re-re-re-reanimated corpse.",
                            "score": 28
                        },
                        {
                            "depth": 2,
                            "author": "Professional_Goat185",
                            "body": "We're not",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ThetaReactor",
                                    "body": "I'd think goats would be pro-Atari after their recent collaborations with Llamasoft.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SyrioForel",
                    "body": "What was the last product or service that Mattel released under the Intellivision brand? Because if it was “controlled”, clearly they controlled it right into the ground as the brand name means absolutely nothing to anyone who didn’t own the original console in the 1980s or isn’t some emulation ROM collector.\n\nAt least Atari still has a ton of name recognition and sells lots of merch and other things.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MyNameIs-Anthony",
                            "body": "Intellivision was for a long time owned by former employees of the brand who did a lot of preservation effort with what little resources they had.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "Sonicfan42069666",
                            "body": "I didn't say Mattel owned Intellivision. I said *people who originally worked at Mattel Electronics* did.\n\nKeith Robinson and Stephen Roney obtained exclusive rights to the Intellivision brand in 1997 under their company Intellivision Productions. They did exactly what you said - continued it as a legacy nostalgia brand.",
                            "score": 10
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "YourGodIsNotHelping",
            "body": "Woah, maybe we’ll see the Amico actually get launched? I’m joking of course, Tommy Tallarico’s fictional console went up in flames with the rest of his credibility.",
            "score": 159,
            "replies": [
                {
                    "depth": 1,
                    "author": "OneManFreakShow",
                    "body": "Um, have you not seen the Guinness records hung all over his walls? How much more credibility do you need?",
                    "score": 97,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sgthombre",
                            "body": "> have you not seen the Guinness records hung all over his walls\n\nNo because he keeps them on the floor",
                            "score": 90,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lycoloco",
                                    "body": "Oops, one of them just disappeared! How'd that happen?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "PM_ME_YOUR__INIT__",
                            "body": "He literally composed every single piece of music in every single game, and also the Jaws theme!",
                            "score": 23,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hnwcs",
                                    "body": "It's not something he's actually claimed (to my knowledge), but YouTube's algorithm has declared him [the composer of the James Bond theme.](https://www.youtube.com/watch?v=fvoUcrBgXWw)",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "desirecampbell",
                                            "body": "His mother's very proud.",
                                            "score": 11
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "rabidferret",
                                    "body": "He even made the oof sound that made Roblox succeed!",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "strongcoffee",
                            "body": "Hmm I'll have to call Fred Guinness to verify that",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "radclaw1",
                    "body": "Who is Tommy and why does everyone in this thread suddenly talk like hes this major guy. ",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nachohk",
                            "body": "About a year and a half ago now, a very popular YouTuber called hbomberguy released a two hour video which was primarily a grand exposé of Tommy Tallarico and his frequent lies and exaggerations about his career accomplishments, as someone who works on audio for video games. \n\nSince hbomberguy released a similar and even more widely-viewed and discussed exposé about the YouTuber James Somerton, a few months ago, the Tommy Tallerico video has gained even more exposure.\n\nAnd now it's become a whole meme to say that hbomberguy might make a career-ruining video about someone.\n\nTommy Tallerico's greatest claim to fame is now the total destruction of his career and credibility at the hands of a YouTuber previously best known for liking Transformers and Dark Souls II. \n\nhttps://youtu.be/0twDETh6QaI",
                            "score": 81,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Jataka",
                                    "body": "Best known for savaging Sherlock, Fallout 3, and RWBY, and explaining that Deus EX: HR is flawed but tried.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PM_ME_YOUR__INIT__",
                                            "body": "And saving Dark Souls 2",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Big_Yazza",
                                                    "body": "and FUCKING AQUAMAN",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "HugoRBMarques",
                                            "body": "And Pathologic is the best game ever. But it's also the worst game ever.\n\n\nAnd plagiarism is wrong.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "grarghll",
                                    "body": "To piggyback off of this: it's a fantastic video, but I think it should give people some pause that it's *the* sole source of information for most people. Every time reddit develops a new obsession, I have to wonder what YouTuber made a video that everyone's parroting, y'know?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nachohk",
                                            "body": "That is a fair point. \n\nHere's another video I watched, by Slope's Game Room. I'd recommend it to anyone who wants to be more informed, especially about the Amico side of things:\n\nhttps://youtu.be/8BgAarlzVD4",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ccricers",
                                                    "body": "And despite both videos being 6 hours long combined there is surprisingly little overlap/repeated information. It's a crazy saga.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "grarghll",
                                                    "body": "I'll check that out, thanks!",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "DuskShineRave",
                                    "body": "I intended to just watch a couple minutes of that and now 2 hours has fucked off.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Fortehlulz33",
                                    "body": "Harris also likes the Star Wars prequels.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Spocks_Goatee",
                                    "body": "Pat Contri aka The NES Punk has been riding Tommy's ass over this boondoggle of a product since 2018. Check out his podcast for dozens of videos covering the Amico disaster.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "ledailydose",
                                    "body": "His Dark Souls 2 video is less \"I like it\" and more \"actually its a very good game not bad you guys\" without ever touching on the valid criticisms of it OR making comparisons to the other titles. Imho it comes off as very defensive and one of his worst videos unfortunately",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "gumpythegreat",
                                            "body": ">comes off as very defensive\n\nYou mean the video called \"In Defense of Dark Souls 2\" comes off as defensive? weird",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ledailydose",
                                                    "body": "If you defend something you have to raise good points. His points weren't very good.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "gumpythegreat",
                                                            "body": "that's fine. I haven't played the game myself but enjoy his videos overall so I enjoy watching it. \n\njust poking fun at your choice of words!",
                                                            "score": 10
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Yamcha_is_dead",
                            "body": "If you have two hours, I recommend [this video](https://youtu.be/0twDETh6QaI?si=A4Gm2vfkq6ZMf9Rt). Probably my favorite of the last few years.",
                            "score": 59,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Imallskillzy",
                                    "body": "TOMMY WANTS MONEY",
                                    "score": 19
                                },
                                {
                                    "depth": 3,
                                    "author": "Brainwheeze",
                                    "body": "It's so worth it going down this particular rabbit hole",
                                    "score": 17
                                },
                                {
                                    "depth": 3,
                                    "author": "genshiryoku",
                                    "body": "People have time to watch youtube videos that last 2 hours? Why do people complain that they don't have enough free time and that everyone has multiple jobs?",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "starm4nn",
                                            "body": "How is that any different than watching a feature length film?",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "genshiryoku",
                                                    "body": "That's a social activity.",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "starm4nn",
                                                            "body": "So everyone in the history of the world has watched feature length films with other people, and nobody in the history of the world has watched a Youtube video with other people?",
                                                            "score": 9
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Les-Freres-Heureux",
                                                            "body": "Arguably, so is watching a video on a social media site.\n\nAlso, the best video game video on youtube is the 6+ hour long review of [boku no natsuyasumi](https://www.youtube.com/watch?v=779coR-XPTw)",
                                                            "score": 5
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "GeoleVyi",
                                            "body": "you know pause buttons exist, right?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ThnikkamanBubs",
                            "body": "His studio was EXTREMELY prolific for video game OSTs. Since the company is under hus name (Tommy Tallarico Studios) and is head honcho, he takes the credit for every piece the studio made. Leads to unmitigated narcissism and multiple crowd-fundings for a non-existent console. Guy is a real piece.\n\nMy personal anecdote with him is that he used to be on a TV video game review show and he was the most unabashedly biased person alive. Giving games extra points for having the main character named Tommy, for example.",
                            "score": 54,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jasonjumps",
                                    "body": "I used to love Judgement Day as a kid, old school g4 was a vibe",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Tacdeho",
                                            "body": "Judgement Day/Reviews on the Run was by a hot mile my favorite G4 show. It had a better review scale than X-Play and didn’t fall into the typical memes they did like about anime games. \n\nEven if Tommy or Vic hated a game, I liked to see two people with wildly different personalities doing reviews. \n\nAlso, Victor Lucas still does ROTR on YouTube. It’s a delight.",
                                            "score": 14
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "DMPunk",
                                    "body": "As a Canadian, it's always weird to see these references to Tommy in the wild. I thought Electronic Playground was just a thing I watched on the New VR on Sunday mornings after Three Stooges and Captain Power",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FolkSong",
                                            "body": "You might also be interested to know Victor Lucas still makes Youtube content under the Electric Playground brand. There are classic episodes on the channel as well.",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ThnikkamanBubs",
                                            "body": "EP was my absolute shit as a kid, more-so Lucas as he just seemed like a chill guy who really liked games",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "lexluthzor",
                                    "body": "Tommy on Electric Playground/Judgment Day was unhinged in his reviews because he'd either give very generous high marks or be extremely harsh on games he couldn't get in to.   \n\nThough the biggest review that aged like milk was their review of SSBM and Tommy lying that he gave it a good review despite him giving it a 2.5/10.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "outdatedboat",
                                            "body": "Lmao. A 2.5/10 for the best selling game on that console by a gigantic margin. A game that is nearly 23 years old, and still has a rabid competitive community.\n\nWhat a take",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Shilo59",
                                                    "body": "Dude was tripping.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Lunar_Marauder",
                                                            "body": "No, that's Super Smash Bros. Brawl. \n\n^I'llseemyselfout...",
                                                            "score": 12
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Nova_Aetas",
                                    "body": ">Giving games extra points for having the main character named Tommy, for example.\n\nOk but that's kind of hillarious though.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ThnikkamanBubs",
                                            "body": "Oh for sure. It just has stuck in my brain for 20+ years lol",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "DM-Mormon-Underwear",
                                    "body": "I have this deeply ingrained memory of whenever a game had bad framerates the show would go nuts calling it \"CHOPPY\"",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "ACCESSx_xGRANTED",
                                    "body": "so vice city is his favorite game ever?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "_PM_ME_PANGOLINS_",
                            "body": "He has the Guinness World Record for being the first American. His mother is very proud.",
                            "score": 23,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Imallskillzy",
                                    "body": "The first American to kiss sonic on his little mouth even.",
                                    "score": 10
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ItinerantSoldier",
                    "body": "They just won't let it die. Like they're desperate enough to keep hanging on to the few people left that are convinced its not a complete scam that they went out of their way to acquire rights to a brand just to scam people further. This is gonna make a great documentary in five years.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ccricers",
                            "body": "I thought for sure they would bankrupt in 2022, but here we are, still dragging along.\n\nAll the other companies that went bankrupt shortly after going horribly wrong and treating their customers wrong, at least they have the decency to know when to throw in the towel. But usually someone has to force their hand into doing so.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "junttiana",
                    "body": "The funniest part is that they released the games physically and they exist before the console ever came out",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TwilightVulpine",
                            "body": "What?\n\nDamn. The scam runs deep.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ccricers",
                                    "body": "Not really games but they were marketed as \"physical products\". Boxes with just a coin and a card with a IOU one game code when the console launches.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheMichaelScott",
            "body": "In case anyone is confused about the Tommy Tallarico comments and other random quotes. Here’s the video. It’s my favorite video I’ve watched in the last decade:\n\nhttps://youtu.be/0twDETh6QaI?si=XB6Jd7I1KYGL8x1Y",
            "score": 255,
            "replies": [
                {
                    "depth": 1,
                    "author": "katiecharm",
                    "body": "Me three minutes into that video:  \nWhat the fuck does this have to do with anything. \n\n\nMe 14 minutes into that video:  \nTOMMY YOU FUCK ",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GogglesTheFox",
                            "body": "One of my favorite things about this video is t the video itself but when it came out. Cause about the same time Defunctland’s Video about the Disney Channel theme came out as well and it’s the complete opposite of the Ooof Vid.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lycoloco",
                                    "body": "Ugh, that Defunctland video on the Disney motif is so good.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "I_SHIT_ON_BUS",
                    "body": ">in case anyone wants some context here’s a **2 hour** video explaining it",
                    "score": 183,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hnwcs",
                            "body": "It's worth every second, but if you don't have two hours to kill, here's the short version:\n\nTommy Tallarico was a video game composer in the 90s and 2000s and the founder of sound effects company Tommy Tallarico Studios. It's since come out that he's a giant narcissist who constantly lies about his own achievements and takes credit for the work of his employees.\n\nFor what's relevant to this thread: In 2018 he bought the rights to the Intellivision name and used it to promote a console named the Intellivision Amico, which is still nowhere in sight four years after it was supposed to release. When Atari says they bought the Intellivision brand, he's the one they bought it from.",
                            "score": 132,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rawbleedingbait",
                                    "body": ">if don't want to watch a 2 hour video, then here, read this 300 page essay about him I just wrote.",
                                    "score": -141,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "McCheesy22",
                                            "body": "5 whole sentences. I know it can be scary, but just sound out each word at a time and I think you can do it champ.",
                                            "score": 96
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Borkz",
                                            "body": "It's worth all 30 seconds, but if you don't have 30 seconds then here's the shorter version: Tommy Tallarico bad, own Intellivision",
                                            "score": 34
                                        },
                                        {
                                            "depth": 4,
                                            "author": "hnwcs",
                                            "body": "That was four sentences. Reading won’t kill you, buddy.",
                                            "score": 46
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Gullible_Goose",
                                            "body": "You must have felt so sly posting this embarassing comment",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "rawbleedingbait",
                                                    "body": "Couldn't make our names up if you tried.",
                                                    "score": -12
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "coldrolledpotmetal",
                                            "body": "Here’s a summary that’s short enough for your attention span:\n\nTommy Tallarico bad\n\nHappy?",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "rawbleedingbait",
                                                    "body": "No way I'm reading all that.",
                                                    "score": -12
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "mrtrailborn",
                                            "body": "reading sure is hard huh",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ioa94",
                                            "body": "I honestly couldn't make it to the end of your sentence without losing attention, so I just closed my eyes and clicked one of the vote buttons.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "PrintShinji",
                            "body": "Tommy Tallarico likes to boast about accomplishments he hasn't done, and said in an interview that his mom is proud.",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Markorver",
                                    "body": "said ***at every possible opportunity*** that his mom is proud.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ProkopiyKozlowski",
                            "body": "I mean, it's a quality 2 hour video though.",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "I_SHIT_ON_BUS",
                                    "body": "Videos a banger, I’ve already seen it. But being like “here’s some context” and linking a 2 hour video is psychopath behavior.",
                                    "score": 42
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "jimmy_talent",
                            "body": "Everyone on the internet watched his 4 hour video on plagiarism they can watch a 2 hour video on a sound effect.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "alchemeron",
                                    "body": "I didn't, and I won't.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "spetumpiercing",
                                            "body": "Honestly that's just your loss.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "thetwoandonly",
                            "body": "Don't act like you have anything better to do Mr shit_on_bus",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Dwedit",
                            "body": "Not to be confused with the [4 hour video about Tommy Tallarico done by Slopes Game Room](https://www.youtube.com/watch?v=8BgAarlzVD4).",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Horkersaurus",
                    "body": "Thanks for providing context.",
                    "score": 20
                },
                {
                    "depth": 1,
                    "author": "Hazeringx",
                    "body": "This is definitively one of his best ever videos.",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "overandoverandagain",
                            "body": "As opposed to his DS2 video, which might be the single worst one he's ever done",
                            "score": -7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "LapnLook",
                                    "body": "Eh, he goes a bit hyperbolic in the DS2 video during some parts, but I think he raises good points by and large.\n\nI've played through the entire series (Souls games, BB, Sekiro, Elden Ring) a whole bunch of times, even doing some basic challenges like SL1-melee-only and stuff like that, and DS2 is probably the most interesting one of the bunch imo\n\nNow, mind you, it also has the worst *sections* in any of these games (looking at you, DLC \"coop\" areas, especially Horsefuck Valley in the third one... plus lesser offenders like the first half of Iron Keep), but I don't think those are bad enough to dimish from the quality of the rest of the game",
                                    "score": 28
                                },
                                {
                                    "depth": 3,
                                    "author": "StrawHatRat",
                                    "body": "I think I watched a multiple hours long video on that DS2 video but I can’t remember what was so bad about his vid lol",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DrNick1221",
                                            "body": "> multiple hours long video\n\nLet me guess: *Mauler?*",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "StrawHatRat",
                                                    "body": "Yeah I think it was one of his. Just funny to think you could spend so long listening to two guys talk about a topic and how no memory of it at the end of the day. I haven’t even played DS2",
                                                    "score": 9
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "MarkoSeke",
                                            "body": "Bad faith arguments purely for the sake of contrarianism.",
                                            "score": 0
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ledailydose",
                                            "body": "To defend Dark Souls 2 you have to point out what's good about it against the other games in the series. He doesn't do this, he makes purely subjective points that dont make the game any better instead of objective\n\nDS2 has good pvp but it has nothing else that surpasses the other games. Invulnerability frames tied to a stat, gamefeel is sluggish and slippery, asset quality and type is all over the place, art design can't make up its mind as it greatly varies between areas, some of the worst areas in all of FROMs games, DLC is largely better than the vanilla game but still suffers from some awful areas",
                                            "score": -14,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "gumpythegreat",
                                                    "body": ">He doesn't do this, he makes purely subjective points that dont make the game any better instead of objective\n\n\"he expressed his subjective opinion, rather than his objective opinion, which is incorrect\"\n\nany judgement of a game being good or bad is subjective. full stop. he is very clearly expressing his opinion that it is good, and not bad. there is no objective review of a video game. \n\nyou might obviously disagree that dark souls 2 is good. you might even argue that he presents his opinions in a smug or poorly explained way. but to say that he's not objective is ridiculous. objectivity is not the goal.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "beezy-slayer",
                                                            "body": "Whenever people say that game reviews should be objective, that's a red flag for me lol",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "gumpythegreat",
                                                                    "body": "I like it. it's very helpful as a signal to just ignore someone and not bother trying to have a nuanced discussion with them. saves some energy",
                                                                    "score": 8
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "HO_BORVATS",
                                                    "body": "> To defend Dark Souls 2 you have to point out what's good about it against the other games in the series.\n\nWhy exactly? It doesn't have to be better than the other games in the series to be a good game itself.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ledailydose",
                                                            "body": "Dark souls 2 by any metric can absolutely be considered a good game when compared to other games. However his video was obviously made in response to DS2 being the black sheep of the series. The whole video exists to argue that it's really not as bad as people think it is but his takes are all focused on really unimportant aspects of the game probably just because of how weird it is. I've watched the video multiple times because I like hbomberguy but it's not a good video compared to his others. It comes across as if he likes DS2 simply because it's weird and janky compared to how polished the other games are",
                                                            "score": -6,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HO_BORVATS",
                                                                    "body": "Redditor discovers what an opinion is",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "noreallyu500",
                                    "body": "I generally disagree with his gaming stuff, funnily enough. They always seem way too hyperbolic and lack a bit of nuance. \n\nDude can write and make videos though, and I can't discredit how much effort he puts into these",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "noreallyu500",
                    "body": "General summary - This is a very popular video initially talking about who made the popular Roblox \"OOF\" sound - but ends up being an investigation of Tommy Tallarico, a composer that owned the studio that made that sound as well as president of Intellivision - not to mention a seemingly pathological liar.\n\nRelevant to this topic, after becoming the president of Intellivision in 2018, he intended to release a new console, Amico, in 2020. With incredibly unfortunate timing, one of the major selling points of the console would be that it had no online play.\n\nTo fund the project, he started multiple million dollar+ crowdfundings, sometimes using incorrect and misleading info on who was still on the team. He even went on record to say that the Karma System they were marketing was just \"some shit \\[they\\] made up\".\n\nI highly recommend checking out the video, because this doesn't even scratch the surface of Tommy's shenanigans. From lying about Guinness World Records to petty gaslighting over ancient review scores, he just does not stop",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "andehh_",
                    "body": "I feel compelled to watch this video every goddamn time Tommy hits the news again",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "Cragnous",
                    "body": "Oh shit this is a movie!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "RenzoAC",
                    "body": "What? That video wasn't about Roblox?? Why nobody told me? I would've watch it sooner!!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "OverHaze",
                    "body": "This might be my favourite youtube video ever that wasn't made by Bobby Fingers.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "nascentt",
                    "body": "Watched this for ten minutes before I realised it's 2 hours long!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Qegola",
                            "body": "30 minutes on the oof. Then 3 times more for Tommy Talarico being a massive narcissist with a bonus Harry and Kat accidentally getting rid of one of his Guiness World Records.",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Apprentice57",
                    "body": "I've followed Pat Contri/Ian Ferguson on the Completely Unnecessary podcast for a while now, and they were criticizing the Amico/Tallarico since almost the beginning (they gave a bit of leeway at the start, as is only fair).\n\nIt was really cathartic to see hbomberguy pick up the story, and for the criticism of Tallarico to go deservedly mainstream.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "yawn18",
                    "body": "Ah, yes, a random 2 hour video on a person I've never heard of or cared about \n\n(goes on to watch the entire video in one sitting)\n\nHonestly thanks for the recommendation that youtuber seems like a phenomenal gaming journalist and I now have a whole new depth of knowledge that doesn't benefit me at all, but will be fun to throw in randomly in conversations where it doesn't fit.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "_PM_ME_PANGOLINS_",
                            "body": "Tommy Tallarico is Gen X, and \"his\" stuff was big with Millennials.",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "radclaw1",
                                    "body": "Yes but the reason you all know about it is because of Youtuber beef which is very gen z.",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "_PM_ME_PANGOLINS_",
                                            "body": "Not it’s not…\n\nUnless you’re claiming that hbomberguy (a Millennial) only has a channel now because of his old videos about alt-right YouTubers?",
                                            "score": 8
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Boyahda",
            "body": "I'm surprised the reanimated corpse that goes by the name of Atari had the resources to acquire anything.",
            "score": 37,
            "replies": [
                {
                    "depth": 1,
                    "author": "GamingSophisticate",
                    "body": "They've been acquiring a lot lately",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ciserus",
                            "body": "Where do they get the money from? What does Atari *do* in 2024?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GamingSophisticate",
                                    "body": "Mostly licensing, and producing smaller games, all while keeping operating costs low",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AaronTheElite007",
            "body": "Intellivision is still a thing? I remember Venture being cool. That damn thing that hunted you scarred me as a kid. Yes, I said scarred. Not scared (it was much worse)",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "JillSandwich117",
                    "body": "The original Intellevison basically went dormant after a while. Someone bought the name to try and release a new \"family-oriented\" console, which has been an ongoing disaster for several years now. It was supposed to release 4 years ago, but they still haven't entered production. Most of the games were existing mobile games, with the few outsourced original games now on other platforms as the Recharged series.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AaronTheElite007",
                            "body": "Sounds like the Ouya. We all know how that went",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BruiserBroly",
                                    "body": "The Ouya was a success for the ages compared to that thing. Even if the Ouya was rubbish, people who paid for one actually got a console (eventually) which sadly cannot be said for the Amico.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AaronTheElite007",
                                            "body": "Oh well. For every success, there are thousands of failures",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "megaapple",
            "body": "Two of the biggest pre-Nintendo gaming brands merged.\n\nIt is like if Nintendo acquired SEGA long after its relevancy.",
            "score": 70,
            "replies": [
                {
                    "depth": 1,
                    "author": "djcube1701",
                    "body": "These companies have nothing to do with the pre-Nintendo Atari and Intellivision. They're completely different companies that bought the names.",
                    "score": 80,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "goblin_humppa27",
                            "body": "It's been long enough that most people don't remember that modern Atari is just Infogrames in disguise.",
                            "score": 62,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BruiserBroly",
                                    "body": "Tbf, there were different Ataris even back in the 80s that when someone refers to classic Atari you can't really be sure what they're talking about. Do they mean Atari under Warner that released the 2600? Or Atari Corp who made micro computers and the Lynx? Maybe Atari Games, the company that made classic arcade games like Paperboy, Gauntlet, and Primal Rage?",
                                    "score": 30
                                },
                                {
                                    "depth": 3,
                                    "author": "Delicious-Tachyons",
                                    "body": "Boo infogrames for destroying Sierra.",
                                    "score": 13
                                },
                                {
                                    "depth": 3,
                                    "author": "Cabamacadaf",
                                    "body": "I thought that version went under and there was another new company wearing the name Atari, but apparently they somehow survived and is still the same company.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Professional_Goat185",
                                    "body": "Or what infogames mean",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "djcube1701",
                                    "body": "They've recently brought the Infogrames name back to publish shovelware like Totally Reliable Delivery Service (which came out years ago, so is a really odd choice for their first game under the label).",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TwilightVulpine",
                                            "body": "I see Infogrames never changed, because they also used to release a lot of garbage way back then too",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FUTURE10S",
                            "body": "Atari under Wade Rosen has been absolutely killing it with not doing stupid shit, though, if they become as big as they were in the early 2000s as a mid-tier publisher, I'd consider that a hell of a redemption arc.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "goblin_humppa27",
                                    "body": "They even published a few DBZ games around that time. Won't be able to wrestle that license back from Namco though.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FUTURE10S",
                                            "body": "inb4 Driver 4",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AlexisFR",
                                                    "body": "Or TDU 3",
                                                    "score": 2
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Cabamacadaf",
                                                    "body": "You mean Driver 7?\n\nUbisoft hasn't done anything with the franchise since 2011, so that license might be easier for Atari to get a hold of, but I wouldn't hold my breath.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FUTURE10S",
                                                            "body": "Nah, I mean like an actual numbered sequel, although yeah, Ubisoft have done nothing with the franchise although Watch_Dogs was kinda similar.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BlueHighwindz",
                    "body": "It's like if Commodore bought Atari just a few years after its first bankruptcy.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "_PM_ME_PANGOLINS_",
                    "body": "No, it's like if MicroProse bought the names \"Nintendo\" and \"SEGA\".",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "myaltaccount333",
                    "body": "I don't know what you mean, -10 year old me is stoked for this",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "arahman81",
                    "body": "Except Nintendo's still Nintendo, not some other company wearing its hollowed husk.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ScootSchloingo",
            "body": "This is actually pretty good news. Atari’s made a huge turnaround over the past few years and has become pretty serious about games preservation. It can’t be overstated how different the company is now compared to when they were shilling NFTs and trying to build a hotel.\n\nAlso the Intellivision brand won’t be mishandled by Tommy Tallarico anymore.",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "the_light_of_dawn",
                    "body": "They’ve also been investing more and more into the retro game community that still rocks the 2600 and 7800 by producing the 2600+ console and even releasing new carts for it. \n\nI don’t plan on getting one but it’d neat.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "SexDrugsAndMarmalade",
            "body": "One of the unfortunate things about Tallarico's management of Intellivision is that the rights to the Intellivision IP and games have been split across multiple companies (making future compilations less viable). \n\nhttps://twitter-thread.com/t/1662195476702314497\n\n> BBG in Germany appears to now have the worldwide trademarks and copyrights to Shark! Shark! and Astrosmash. \n\n> On their own, neither Astrosmash nor Shark! Shark! have much IP value.\n\n> But within the Intellivision ecosystem, those were the headliners!\n\n> By splitting them off, they've devalued the entire catalog.\nYou're not gonna sell Astrosmash on its own, and you're not gonna sell Intellivision without Astrosmash. I truly believe this move has murdered this back catalog.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "BloatJams",
                    "body": "I could see Atari eventually buying those two games back, BBG releases games on the new VCS.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "duzkiss",
            "body": "This is a prelude to AMICO filing for bankruptcy!  All the assets are sold and won't be resold in a bankruptcy.  As for the unit and name that will be auctioned off.  6 months to 12 months tops!  I see it happening and there is no way to undo amicus fate.  Thankfully Atari was smart as content is king so is the older units that actually have name recognition and historical status.  Next is Coleco, Commadore, Amiga and many more.  Atari is preserving HISTORY and through that are the assets that have passed so many hands and in doing so are getting lost...the programming or no one knows who owns what anymore.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "SeekerVash",
                    "body": "Commodore and Amiga don't fit that though?\n\nThey were the PC market in the early years when the IBM PC was god awful expensive and severely behind in graphics and sound.\n\nTheir libraries were all third party, having the brands doesn't really do much at all for them as they can't ship any games with the units unless they license them from someone else.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "xaeleepswe",
            "body": "[Reminder that Atari burned down Intellivisions old offices.](https://www.youtube.com/watch?v=K3FYdk18oS4&t=868s)",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "nonstop98",
                    "body": "💀💀 that was hilarious",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Televisions_Frank",
            "body": "Infogrames goin' all Thanos with the '70s-'80s gaming brands.\n\nFairchild next?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Mygaffer",
            "body": "Wow, *the* Intellivision brand? \n\nI had an Intellivision and while there were some fun games none of them would merit a lot of interest from today's gamers.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "SeekerVash",
                    "body": "I agree with you, most of its draw was either the Dungeons and Dragons games, or the iMagic games.  Intellivision itself seems kind of worthless to me.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "DivinePotatoe",
            "body": "More like:\n\n\"Atari\" acquires the \"Intellivision\" brand. Neither are really the entities they have the name of.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Wazzup-2012",
            "body": "Atari should just pursue a merger with Bally's Corporation, and then sell themselves to Light & Wonder.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BlackBlizzard",
            "body": "Whoever owns the rights to Midway games can you bring Midway Arcade Treasures collections to modern PC.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "djcube1701",
                    "body": "Some Midway stuff was bought by Warner Bros, but most of it is stuck in a shell company with nothing being done.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "mrturret",
                    "body": "It's a mess. When Midway went bankrupt, its intellectual property was sold off to a number of different companies.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "AnotherDay96",
            "body": "I don't know what Atari is ultimately going to do with their current approach. But this is by far the most interesting Atari has been in age's. I do think there is a path of success. I think there is even a possible resurgence of an arcade if everything is done correctly. I hear they are making their first arcade games again this year since the eye popping mid-80's.\n\nTo me arcade machines should have user logins, multiple games to choose from at the cabinet and the games are rougue-lite in nature where as you play, you continue to build up your character, not start over from scratch like yesteryear. You pay by the 15 minutes.\n\nI think if all executed correctly, this could be a hit in social centers.\n\nThere are a number of indy arcade-like games that if some front end UI rework was done to handle a public environment they could be candidates.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MiGaOh",
            "body": "That combination of words is disconcerting. \n\n1979 is shaking the future by the shoulders, asking \"What did you do? WHAT THE HELL DID YOU DO?\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Professional_Goat185",
            "body": "...why ? who have nostalgia for it?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KingBroly",
            "body": "How soon before Microsoft buys them so they can bring back that Arcade...thing from the 360 days.  I forget what it was called.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Refflet",
            "body": "All these Yahoo and MSN repost articles really piss me off (except when they bypass a paywall, then I begrudgingly give it a pass). This is, I think, the original source article (Yahoo's is word for word the same):\n\nhttps://www.globenewswire.com/news-release/2024/05/23/2887219/0/en/Atari-Acquires-Intellivision-Brand.html\n\nAnd this is the official press release from Atari: \n\nhttps://atari.com/blogs/newsroom/atari-acquires-intellivision-brand\n\nEdit: People not understanding that amalgamating the internet into a handful of major networks isn't a good thing...",
            "score": 0
        }
    ]
}