{
    "title": "Warhammer 40,000: Mechanicus II | Announcement Trailer",
    "comments": [
        {
            "depth": 0,
            "author": "TH3_B3AN",
            "body": "By far the thing I'm most happy about is a new ost to have on loop. But playable Necrons is really cool.",
            "score": 187,
            "replies": [
                {
                    "depth": 1,
                    "author": "tetramir",
                    "body": "I really hope Guillaume David is back on board, his mechanicus and Ixion ost are incredible.",
                    "score": 69,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Avenflar",
                            "body": "He is, it's one of the highlighted section in the Steam page :D",
                            "score": 53,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Studwik",
                                    "body": "Get the fuck in!!!!",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Avenflar",
                                            "body": "'ERE WE GO",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SuggestiveEggplant",
                                                    "body": "'ERE WE GO",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "fizzlefist",
                                                            "body": "DAKKA ALL THE WAY",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "_Nextt_",
                                    "body": "This makes me so incredibly happy! He's an incredible composer",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "xepa105",
                                            "body": "The man is a genius. He was like \"I'm going to make a techno-gothic choir soundtrack\" and not only did it, but made it the tightest thing ever. Noosphere gets constant play in my Spotify. Shit's mesmerizing.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Left4Bread2",
                    "body": "Guillaume David, my beloved",
                    "score": 27
                },
                {
                    "depth": 1,
                    "author": "Saucyminator",
                    "body": "He made the OST to IXION game as well, it's really good!",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "superbit415",
                    "body": "To me parts of the OST sounded like it was from the TTS episode when Kittens diplomacies the Fabricator General. Love that song.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "OneWin9319",
                    "body": "Came in to say this. It is one of the best and most creative OSTs. Those organs and synth pads are so haunting.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Harabeck",
            "body": "A new OST from these guys alone is enough to excite me. Guillaume David really knocked it out of the park on the first game.",
            "score": 58,
            "replies": [
                {
                    "depth": 1,
                    "author": "Nalkor",
                    "body": "Children of the Omnissiah is such an amazing track, I mean they all are, but it's a killer track for a main menu theme to just leave on loop.",
                    "score": 31,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jadok",
                            "body": "> Children of the Omnissiah \n\nhttps://www.youtube.com/watch?v=ZLsX9WUdYnU",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "spamshannon",
                                    "body": "Noosphere is my favorite ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jadok",
                                            "body": "> Noosphere \n\nhttps://www.youtube.com/watch?v=yBEUwkvNbks",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "InquisitorJames",
                                                    "body": "Dance of the Cryptek!!",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "probabilityEngine",
                    "body": "If you haven't seen it they also made Ixion, which has an incredible Guillaume David OST as well",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hellknightx",
                            "body": "Wow, I never put that together! Crazy how different both games are, and yet they're both amazing.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "probabilityEngine",
                                    "body": "I played Ixion this year and went into it semi-blind and didn't realize it either at first until I heard the music. I heard the soundtrack in the intro sequence and thought, man, this music really reminds me of Mechanicus..",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "shadyelf",
            "body": "Dare I hope that we can play as Necrons in this one? My favorite faction in Wh40k, but sadly underrepresented in the video games. Other than Dawn of War 1 and Battlefleet Gothic Armada I don't think you've been able to play as them.",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "Avenflar",
                    "body": "The steam page of the game is up, Necrons are playable. \n\nIt sounds like the game is setup in a  Dark Crusade-style worldmap",
                    "score": 65,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "shadyelf",
                            "body": "Nice! \n\n>It sounds like the game is setup in a Dark Crusade-style worldmap\n\nEven better. I loved that sort of 4x style campaign map they had in Dark Crusade and Soulstorm. Modes like that add a lot of replay value for me.",
                            "score": 25
                        },
                        {
                            "depth": 2,
                            "author": "TheSnowballofCobalt",
                            "body": "The one and only thing I wanted from Mechanicus is playable Necrons. Thank the Silent King Szarek!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NoobJunglerGG",
                    "body": "They are playable in both Gladius and Battlesector",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "Hellknightx",
                    "body": "From the Steam page:\n\n> customise your own court of Necron nobles as Vargard Nefershah\n\nNecron is also my favorite faction, so I'm hyped AF",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "GunplaGoobster",
                    "body": "Dawn of War 1 is still my favorite Warhammer game. I'd love  a remake of it actually.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "westonsammy",
            "body": "From the store page it sounds like they're solving a lot of the flaws with the first one, which while the rest of the game was excellent the core gameplay loop had some serious issues in terms of difficulty curve and replayability.\n\nAdding more depth to both the strategy layer and the tactical layer with the planet 4x map and the cover system mentioned respectively sound like great changes to me. A big problem in the first game is that with the set mission structure every campaign played out the same, and while the combat system was intriguing at first it became really monotonous and you were just going through the same motions every fight. They also mentioned on their discord that making the combat more fast-paced is a priority, which is also great to hear because even easy fights previously would take ages.\n\nAlso the addition of new environments that aren't just some slight variation of \"Green Necron tomb\" is great.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "probabilityEngine",
                    "body": "I wonder if it will end up more challenging than the first game without having to use a ton of optional difficulty settings. In the first game your tech priests become incredibly powerful once you familiarize yourself with the mechanics and cognition management, level up a bit, and accrue more equipment. Combat basically turns into a puzzle instead of a threat, figuring out how to eliminate every enemy in a single round. Still a great game and great fun either way, though.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sithrak",
                            "body": "That's just part of designing a game. It is not easy to get the right balance, but usually it is achievable without any additional settings.\n\nFlexible difficulty settings are almost always a great idea, though.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "westonsammy",
                                    "body": "The problem is you can get to that point very quickly, around 30% through the main campaign. From that point onward you can cruise through most missions, and the campaign becomes very tedious. I don't think I actually finished a campaign because I just got tired by the third or fourth boss.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sithrak",
                                            "body": "Sure, this was an issue. Just saying it is an ordinary problem and might not need any special solutions.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Samurai_Meisters",
                    "body": "I hope they get rid of or totally revamp the mindnumbling dull exploration phase. I just wanted to get to the battles, which were quite good.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "westonsammy",
                            "body": "It doesn't look like there's any kind of exploration. The scenario for the 2nd game is that you're holding a Necron crownworld against an invasion as the Ad Mech, or playing as the invading force as the Necrons. It seems like the battles will happen on that 4x planetary map instead of inside of individual tombs or locations.",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Samurai_Meisters",
                                    "body": "Oh perfect!",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sithrak",
                            "body": "The map wasn't super inspiring but it was a small element. It is good to have a little context and this did not greatly outstay its welcome.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "alexkon3",
            "body": "Amazing. The first game was already one of the best 40k games imo having a second one where you can actually play as Necrons is just \"chefs kiss\". I especially cannot wait for another amazing OST",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Viper114",
            "body": "More Mechanicus with playable Necrons?  Yes, please!",
            "score": 8
        },
        {
            "depth": 0,
            "author": "iamdanthemanstan",
            "body": "I think the first overstayed it's welcome a bit but was a really interesting game overall. I'm glad they're doing a sequel.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "narfjono",
            "body": "The second game I finished on my Steam Deck, and basically what sealed me into the actual Warhammer 40k hobby, with Adeptus Mechanicus and Necrons as my first two armies...is  getting a sequel. \n\nMy Blessed Omnissiah! My body is so ready for this! \n*(Insert the Binaric cant of \"please don't be bad!\" on repeat)*",
            "score": 4
        },
        {
            "depth": 0,
            "author": "P1n3tr335",
            "body": "Never played it, never been a Warhammer guy, desperate to hear the music in this. God I love the OST for the first.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Kgb725",
                    "body": "If you like crpg type of games Rogue Trader might be for you",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "P1n3tr335",
                            "body": "Oh! I'm not! I'm just a fan of the music!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MsgGodzilla",
            "body": "Holy shit.  This one was unexpected.  Mechanicus was a GREAT game and very underappreciated.  Can't wait to hear the new soundtrack!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "IsD_",
            "body": "Very cool! I'm finishing up my playthrough of the first game so this is fun timing. I like Mechanicus but there's definitely areas for improvement and systems to flesh out for II. Being able to play as Necrons with their own side of the campaign is neat, and the Steam page says you can customize nobles similarly to the tech-priests, which is one of my favorite parts of the first game.\n\nAlso like how this speech is like the Necron mirror of the Mechanicus intro, including the BWAAAAM sound into the title card.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ins1der",
            "body": "I really liked this game but it definitely dragged on way too long and got very repetitive. Hope they have a tighter game this time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "smartazjb0y",
            "body": "Anyone have experience playing this on Switch? Looks like it's on sale on the eShop, may want to give it a go",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Nuya",
                    "body": "It runs okayish. It's turn based so framerate isn't super critical. I beat it on Switch. It's the best turn based 40k game I've played so far. I say go for it.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrFate99",
            "body": "1st game looks interesting, worth giving it a whirl? 40k games are very hit or miss",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Avenflar",
                    "body": "Do you like XCOM-style games ? Then you will like it. It's biggest sin is that you get powerful faster than in XCOM",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "n0stalghia",
            "body": "This teaser is good and all but as someone who never played any Warhammer games:\n\nWhat is the fucking genre, Lebowski?",
            "score": 1
        }
    ]
}