{
    "title": "Warhammer 40,000: Speed Freeks - Official Gameplay Trailer | Skulls 2024",
    "comments": [
        {
            "depth": 0,
            "author": "8-Brit",
            "body": "The alpha was novel and had good legs, if it maintains good polish and robust content through to release I think this'll be a good one.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "Gorudu",
            "body": "40k games always look cool, then turn out mediocre. I hope this game is good, because man does it look fun.",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "spud8385",
                    "body": "I think \"always\" is a bit harsh, there's been some gems. I've played a lot of both Dawn of War 2 and Battlefleet Gothic Armada 2 and thought they were both really good",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ganrokh",
                            "body": "DoW 1 and 2 + expansions will always be top tier strategy games to me. I love them so much.\n\nWhile I can forgive 3 for being bad because we have so much content between the first two games, I can't forgive it for being one of the last few games TotalBiscuit reviewed before he died.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Whocaresdamit",
                    "body": "Never played Space Marine? Or Boltgun? These are very fun 40k games.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Reasonabledwarf",
            "body": "The funniest thing about these Warhammer Skulls showcases, to me, is that it stands in stark contrast to where bigger \"trans-media\" properties like Star Trek, Star Wars, and Lord of the Rings are. Like, what's the last Star Wars racing game we've had? Lord of the Ring strategy game? These megacorps are schlorping up all these universes and then just occasionally squeezing out one shitty game that doesn't meet expectations, and then Games Workshop is shotgunning weird nonsense all over so that even if it's only good a quarter of the time, that's still plenty of fun games.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Scaevus",
                    "body": "Yeah Warhammer games have always been kind of the Wild West. \n\nThere’s a Warhammer American football franchise on its third game.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SailorsGraves",
            "body": "Anyone remember Speed Freaks on the PS1? \n\nTop 3 racing games of all time for me",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ThorAxe911",
            "body": "Why limit it to just Orks? A 40k twisted metal game with Tau, Necrons, Space Marines etc. would be so sick.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Trashmanifdeath",
                    "body": "Orks are really the only race in WH40k that have jury-rigged to the max vehicles and weapons which I think fits here.",
                    "score": 30,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EZReader",
                            "body": "It’s “jerry-rigged”\n\nhttps://www.britannica.com/dictionary/jerry%E2%80%93rigged#:~:text=Britannica%20Dictionary%20definition%20of%20JERRY,not%20built%20or%20designed%20well",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "11448844",
                                    "body": "nah, jury rigged came out as a term first and is a nautical based term\n\nhttps://www.dictionary.com/e/jury-rigged-vs-jerry-rigged/",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "EZReader",
                                            "body": "Thanks for this correction; I retract my own 😅",
                                            "score": 9
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Covenantcurious",
                    "body": ">A 40k twisted metal game with Tau, Necrons, Space Marines\n\nNot really something those factions would do and there is the fact that Gorka Morka exists.\n\nEdit: 2 hours later and you block me? Did they block everyone else who replied too?",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ThorAxe911",
                            "body": "Doesn't necessarily have to be a lore accurate thing. Sometimes fun should override something like that. Just like Mario Kart having baby mario/luigi/peach playable. Doesn't make sense but it's fun and provides more variety in the roster.",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Enozak",
                                    "body": "Comparing a game from an IP with an established universe with decades of written lore to Mario IP doesn't make sense",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Blajy-Chan",
                    "body": "Speed freaks who do stuff like this are already a thing in the lore of orkz",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Nrksbullet",
                    "body": "They've got two other big games coming out, I'd rather they focus more on a faction or two to do them justice. No doubt what you described would be fun, but this seems to be going for a much more goofy tone along with the Orks that wouldn't really fit Necrons or space marines driving around.",
                    "score": 2
                }
            ]
        }
    ]
}