{
    "title": "Weekly /r/Games Discussion - What have you been playing, and what are your thoughts? - May 19, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "TheDoodleDudes",
            "body": "**Hi-Fi Rush**\n\nReally enjoying this game so far but I'm thinking I might need to turn the difficulty down to normal. I think this game has had its praises sung a lot so I'm not sure how much I'm really adding to it but this game is a blast and honestly would have been worth full price if you ask me. The music is great, the art style is great, and the concept is a ton of fun. It feels like a game that was taken out of the PS2 era for all the right reasons.\n\nIt also really doesn't feel like a short game, at least not yet. I've been playing for a while on hard mode and I'm in the security center (idk if that's what it's called) area. I think some of that has to do with me playing on hard mode though, this game is pretty brutal on that difficulty and I really thought I'd be able to get through with minimal issues. The enemies introduced in this area are really tough but fair so while I might be turning the difficulty down I just think it's going to take a little while for me to get as good as I want to be.\n\nI'm really excited to see where the game goes, every level just feels like it was made by people who were excited to work on something like this and while I know they're shut down now this feels like a nice culmination of Tango flexing their creative muscles. It's a shame I might not see anything like this again soon, this is the kind of thing I wish there were more of in my gaming library.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "batbrodudeman",
            "body": "Been playing some classics on my MiSTer this weekend.\n\n\nCompleted Earthworm Jim 2 for the first time in a while, PS1 PAL version patched to 60hz.\n\n\nAlso completed Diddy Kong Racing, finally. Wizpig, you dick.\n\n\nResident evil 4 quest 3 VR again tonight. One of the best gaming experiences ever made, hands down IMO.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Logan_Yes",
            "body": "Death died and loops looped as I can state that I have finished **Deathloop**. It was fantastic! Loved the aesthetic, overall gameplay, setting and story. Gathering data to figure out what is going on, whole timeloop mechanic, exploring the areas at different times, multiple options of approach to take down enemies, from powers to decent arsenal of weapons to environment. However, one major flaw that does ruin a game a tad is lack of actual options when it comes to beating the game. To explain without major spoilers, you only have one way, one specific route on how to actually wrap up the loop and achieve your goal, which you discover not really from some massive exploration, no \"eureka!\" moment, you just have to do investigations. So all these investigations ultimately lead to opening up the way for you but...it just makes this whole system of exploring areas at different times, collecting all data and constantly \"playing the game your way\" pointless as you have to follow the guidance to beat it. Visionaries should have some sort of third option so you could make your way of beating the game. Without it it's really basic and ruins a tad whole setup. It's only A place where they are by default or B place you discover or setup to actually beat the loop. Even with that, I still recommend the game. Had great time with it, though again, whole \"break the loop\" does lack depth as mentioned above.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "nanohead",
                    "body": " I ultimately really enjoyed Deathloop also, but it took quite a long time to get there.  Hardest learning curve of any game I've played in a long time, and agree with your assessment completely.  At a high level, the whole scenario is completely non sensical...   \n\nI eventually played it a couple of times, and the second time, probably enjoyed it more, as I actually knew what was going on, and could really just groove on the gameplay and super drug induced rendition of the world...  it was actually super creative and ultimately incredibly cool and original.\n\nBut wow, I almost quit tons of times....",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "EverySister",
            "body": "**The Elder Scrolls V - Skyrim**\n\nMan, this game is good. I know, i know, that's gardly any news to anyone who's played it. But damn, this game *can* be *very* good. Just finished the Thieves Guild questline and it felt like such a rewarding storyline with plottwists and great character, I was blown away because I didn't know Skyrim had that in it. I was mostly just exploring and doing sidequests and felt like the game was starting to grow stale. \n\nAnd then! I ended up walking into a lighthouse where a family had apparently moved in a while ago but they where all dead and the notes and story put together there got me super emotional, loved it.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "starmapper",
            "body": "Heavens Vault, which I finally got round to playing. A really good puzzle game based around language, where you can either slowly bumble your way through to the  solution, or really think about it and get there quicker. The story is interesting enough to keep me hooked. It's quite a slow pace game and the travel between different locations gets boring quickly, but you can skip it, so nothing too wrong with it.\n\nGreat if you like puzzle games or something like Outer Wilds, as it has that kind of feel to it",
            "score": 4
        },
        {
            "depth": 0,
            "author": "SingleTaste8756",
            "body": "**Signalis** I grew up on the old school resi games so I love anything that tries to emulate those games. Not sure how long this one is but I've a few hours up on it so far. I've beaten 2 bosses. \n\nPlaying on the steam deck oled so it looks great. Creepy sound design really adds to the atmosphere when you play with headphones. The puzzles have been great. You have to think a bit so I feel clever when solving them lol;  but they're not too abstract that I have to look up a guide or anything. \n\nThe shooting is fine, can be a bit finicky aiming sometimes though. I know some people have complaints about the enemies coming back like the zombies in the resi 1 remake (one of my favourite games ever btw) but it hasn't been too bad so far and adds a bit of tension to the gameplay. \n\nStory wise: haven't got a clue what's going on 🤣 I knew the story was abstract before I got the game so I expected to be lost. I'm not really trying to understand it, just going with the flow and focusing more on the vibe/atmosphere. Looking forward to getting back to it.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Galaxy40k",
                    "body": "Signalis was a real gem of a game. It managed to really capture that route planning that's been lost outside of the classics in the genre. It's awesome seeing the indie scene finally starting to pick up classic survival horror as a genre. For a long while there we had like....nothing, lol. But now, indie devs are making new games, some of which like Signalis are really exceptional.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SingleTaste8756",
                            "body": "Agreed. Love the genre. I guess a lot of the indie developers are older too and want to recapture that feeling! I have Crow Country on my wishlist so any other recommendations you have would be great.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Galaxy40k",
                                    "body": "I'd say the best one I've played is Darkwood, that's easily Signalis-tier. But other ones I enjoyed are Tormented Souls, State of Decay, and Evil Tonight. And I haven't played these yet myself, but I've heard good things about Alisa, Them and Us, and No One Lives Under the Lighthouse. \n\nI also bought Crow Country and I'm excited to give it a spin too! Haven't got around to it yet though, finishing up some other games first",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SingleTaste8756",
                                            "body": "Nice one, thanks! I've played darkwood and tormented souls. Enjoyed both. I couldn't finish darkwood but that game has amazing sound design. So creepy. \n\nI'll stick the rest on my wishlist!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ardailec",
            "body": "**WoW: Mists of Pandaria Remix**\n\nIn Blizzard's quest to create as many versions of WoW as possible, they came up with this insane version of what I can only describe as \"Fuck it, we ball\" mode. It's 3 months of a bizzare version of Mists of Pandaria, but with Dragon Flight classes and talent builds, A barrage of wild abilities that you can gem into your armor that range from \"Yeah, you can be a Hunter with Blink.\" too \"Execute *anything* that has 10% HP. Including bosses. *Especially* Bosses.\"\n\nIt's probably the most jank, borked version of WoW I've played, with moon-logic scaling issues and a few weird bugs and bosses that aren't working properly. But it's been a fun ride as someone who skipped Pandaria to be able to experience a sort not-quite classic version of it. And some of the ideas they've experimented with a kind of neat. \n\nThey certainly knew how to bait the hook for people to try it too, since you can buy not only some exclusive mounts and cosmetics, but also some of the 1% mount drops, and some unobtainable cosmetic armors too. So there's something you can take home to retail from it too.\n\nUnfortunately, when I say Jank, I do mean Jank. There have been all kinds of wonky scaling issues and frustrations. It's lead to a lot of weird things such as a level 70 character doing 10% of the damage that a level 15 will do, boss damage being wildly overtuned to absurd amounts depending on who gets hit, resulting in an an attack doing anything from negligable damage to just outright one-shotting the raid, and now there's a bit of an outrage over what I will call \"Frog-gate\" resulting in some players being *wildly* more powerful and farther along than the rest of the community.\n\nIf this were a more permanant environment, I'd say a lot of these things are unacceptable. But as a clownshow \"Eh, it's 3 months, who cares?\" sort of side-project, I've had a ball just collecting the mounts and armor sets I've wanted. It's definately IMO better to just enjoy the circus for what it is.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Galaxy40k",
            "body": "**Astlibra Revision - Gaiden**\n\nFinished up the DLC. It offered me more of the slick combat and addictive grind as the base game, with a couple extra customizable bells and whistles, so I was very pleased. Astlibra is just a ton of fun to play, I'm definitely going to come back in a couple years and go for all achievements and clearing Impossible difficulty.\n\nAlthough, I am disappointed by the cliffhanger ending. The main game introduced this weaving narrative with a lot of elements and managed to tidily wrap everything up by the end. It was satisfying. The DLC doesn't add much to the story by virtue of being a \"side story\"....until it decides to end introducing a new cliffhanger element. \n\nI don't mind this in principle, but Astlibra was made by a solo developer who has said that he will never be able to make a game of this scale again and isn't sure if the story will continue. So it seems like such a strange decision to go out of your way to introduce a loose thread when there's no guarantee that it'll ever be followed. \n\nStill, I cannot recommend this game enough. It's definitely for a niche audience, but if the idea of Muramasa / Odin Sphere combat mixed with an endless grind and bonkers narrative sounds appealing to you AND you can deal with a lot of \"inexperienced solo dev jank,\" you've gotta check it out",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "jamoke57",
                    "body": "Could you explain the kind of grind involved?  I've been interested in the base game, but curious what kind of grind is involved and if there is post game content.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Galaxy40k",
                            "body": "Astlibra follows the FF9 progression system, where you unlock skills by leveling up armor. To unlock new armor, you need to craft it. To craft it, you need drops from the monster. So: The game involves killing lots of monsters for drops.\n\nThe word \"grind\" has a negative connotation, but I always had fun doing it. The combat in the game starts slow but gets progressively more and more engaging as you go, and so the very act of just \"fighting\" was a ton of fun for me. So the chase for drops was just an excuse to keep having fun with the game. But...it DOES involve going through an area killing the same dudes over and over, which I know some people will just never be able to get behind.\n\nAs for the post-game: It's massive. It's honestly so massive and involved I almost hesitate to call it a \"post-game,\" despite the game itself claiming that it's post game material, haha",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "notthatkindoforc1121",
            "body": "**The Elder Scrolls III: Morrowind**\n\nIt's funny to me, checking out the current Elder Scrolls community, they're pretty divided. ESO is still going strong, Skyrim mods are absolutely crazy now, and there is a constant dispute about which game is the best one, as they are all so so different.\n\nI grew up with Morrowind, and I can see how nostalgia blinds your perspective of older games. When people say \"Morrowind is great! Can be hard to get past the graphics, though\" or just \"Dated graphics\", that isn't the way I see it in my head. Back when I ran this thing on an original Xbox (I had no idea the number of issues the Xbox version had, I was a dumb kid that loved getting lost in a huge world) the graphics were mind blowing to me. \n\n* 3 minute load time (Yes I'm serious. Load times were often over 3 minutes)\n* Randomly corrupted save files\n* Thousands of bugs (Learned this in hindsight from recent patch mods)\n* Brickable save files (Killing NPCs that soft lock you. Often times they die from hilarious bugs, like NPCs changing locations slowly over time until they fall into water and drown)\n\nTons more issues existed I didn't even know were a thing\n\nI 100% recommend this to anyone wanting to get absolutely lost in a massive world, I couldn't even guess what your experience will be like compared to mine. Every aspect of this game early on made me think about who I am in this world, and let that decide my decisions. I could ramble about where my journey has taken me and who I met, and how I could restart and go about this absolutely differently.\n\nYes the combat feels very janky, the controller support even with OpenMW and mods is minimal (Remote playing with Steamdeck), but that doesn't stop me from getting absolutely lost and immersed in the story that is my character in this dark, racist, hostile world.\n\nYou start off weak as all sin. A rat can make you look like a bitch. Every townsperson uses racial slurs toward you. You don't have a place to sleep. If these people treat me so terribly, why should my character even be good? Stealing is clearly lucrative, why not do it? \n\nAnd as I get to the Mages guild, they're... kind? They offer me no services, but they're respectful to me. I want to join their guild. I travel to Balmora and they let me join. They're welcoming. Offer me free lodge, materials to get me started in this world. But I'm a Thief, my skills have no use here. But they offer all sorts of spells. Conjuring powerful weapons from nothing, walking on water, levitating to get on to rooves, lockpicking spells, stealth spells. I change my perspective of this world and go from equally hostile, to extending the Mages Guild treatment of the world as they have to me. I use my subtly with Magic, and practice many magical arts to increase my potential as a magic sort of nightblade.\n\nI'm sorry for such a weird description of my early journey, but it was this that made me so immersed in this world. If I played again I'm sure I could do a completely different experience. Establish myself in the world with strength. Start early training for the Arena in Vivec, be a brute Orc focused on strength and heavy armor alone. \n\nI know Oblivion and Morrowind have these options too, I can't say why with Morrowind it Immerses me so much. Maybe it's the incredibly racist, hostile world? Maybe it's the extreme lack of balance, so I consider every spell and ability I come across because I know I'll end up strong anyway? Maybe it's the lack of handholding? \n\nRegardless, 10/10 recommend. I'm shocked this grabbed me so much.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "HammeredWharf",
                    "body": "For me it's that MW is the last Bethesda game with great choice and consequence systems. And I'm not talking about choosing to blow up Megaton or other dialogue-based stuff, but letting you organically pick the right and wrong options. You can be a dumb, strong orc, but don't expect to easily become the leader of the mages' guild. You can be a wizard, but don't expect to hit anything with a sword. You can make a weird build (played through the game once as a pure enchanter/alchemist), but it might complicate things. You can go into a demonic cave as a lvl 1, but don't expect to survive any fights. \n\nMW's fast travel network is also a work of genius and I'm surprised barely any modern games replicate it. It's fun, intuitive and fittingly limited. And while MW's journal could be better, the way NPCs gave you real directions to points of interest is great. Like the aforementioned consequences, it makes you pay attention to the world. \n\nIt's one of the few open world games where the world is as interesting as the points of interest.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "jordanatthegarden",
            "body": "About two years ago I played all of **Wildermyth** and I just picked up the Omenroad DLC and started that last night. It didn't take long before I fully remembered just how much I loved playing this game and all of its witty, thoughtful charm. It has such a way with words. I turned the game back down to normal and started with some legacy characters so it's been quite easy so far but I don't mind as I had to remember how to play first lol. Will probably play through Omenroad at least twice and then maybe try the procedural variant of it. It's really a fantastic game.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "CrackedEggInKentucky",
            "body": "***1000xRESIST***\n\nIf you're a fan of mystery adventure games, this isn't one to miss. The gameplay is pretty light, probably slightly more puzzles than like *Kentucky Route Zero*, but still not many. There's basically two kinds of story sections, one where you wander around talking to people and others where you follow events more linearly. It's probably better to go into the story blind, but if you want a genre its Sci-Fi and a more specific teaser, its >!about an alien invasion and a disease.!<It's often been called *NieR* mixed with *13 Sentinels: Aegis Rim*, but I would say it feels more similar to works by Kotaro Uchikoshi (*999: Nine Hours, Nine Persons, Nine Doors*/*Ai: The Somnium Files)*. I wouldn't really normally want to just compare it to other games, but I think its hard to say what the games merits are without spoiling anything. I haven't seen much talk about this game, probably for that reason, but I really hope good word of mouth can spread this around just with \"trust me, play this.\"",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "pt-guzzardo",
                    "body": "I picked it up based on your comparisons, and I'm not gonna lie, my first impression was that the voice acting was *painfully* bad. But then I got to >!the rapping kid in the detention room!< and realized maybe it was an intentional choice to >!make all the future/??? characters more unsettling!<.\n\nI'm going to laugh real hard if it turns out >!Watcher stabbing Iris at the beginning was a flash forward to after Watcher has sat through this whole simulation and there's no deeper meaning besides Watcher  just being thoroughly sick of putting up with Iris's bullshit!<.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Izzy248",
            "body": "I have such a love-hate relationship with **No Rest for the Wicked** right now. On one hand, I love the art direction, premise, the feel of the game, and combat. But on the other hand...I absolutely hate the build and weapon customization mechanics as it stands right now. Ive gotten past the stamina and durability quirks I initially had, and the fact that this feels like platform souls is a little irksome too, but those are benign to how much I do not like how the builds and weapon customization work in this game so far.\n\nI dont mind that there are no direct classes as thats not uncommon anymore, especially for games of this nature. Pretty much in any soulslike game, even if you do start off with a class, its more of a stat point starting suggestion than anything, and then you can deviate immediate after. But right now, at the current state of it in EA, it feels like if you dont dump your points into a very specific, narrowed set of stats, you are screwed. So many builds you see people doing, they are practically dumping their stats into one thing just to get the max amount of damage. A popular consensus is that, your first character you make is always going to be a dud because you need to understand the game first, and you probably needlessly put points into a stat that you werent actually going to need. That screams bad design to me, that putting any amount of stats into another slot can wreck an entire character, even if you can create alt character, because why should my first character just become a test dummy because I put 6 points in a different stat so I could use a weapon, that a quest specifically told me to use, but I couldnt use it until I had enough points in said stat. Thankfully some form of respec'ing is coming, but still.\n\nWith the weapon customization...it just infuriates me how it works right now. Enchanting has the potential to make your weapon OP, or break it completely. You have the chance of getting mid effects that are just okay, or turn it becoming a Cursed weapon with OP stats, but completely ruining it at the same time. Like having it so that dying will result in gold loss, or exp loss, or stamina loss (which can end up stunlocking your character). But if you dont want to risk enchanting your weapon, you can always slot a bunch of gems into a white weapon for some random rolls of low-mid tier effects. But you can also upgrade your weapons to make them more powerful, up to tier 3. However, for some reason, upgrading doesnt work just one and done. No. You have to upgrade it constantly. You have to dump resources and money consistently. If I have a tier 2 weapon. I have to upgrade it 3-4 times to get it to tier 3, and then because of the state of it in EA so far, some items are sooo very rare to get, or practically not even in the game yet. So you are stucking farming for hours for certain materials, praying you have a upgraded Tier 3 vendor that will sell them, or wait 24 real time hours for them to restock with different items and hopefully have it this time. Then theres breaking my weapons completely, to get a single rune out of it to put into something else, but man...it all just feels like a bunch of micromanaging busy work, and maybe this is fun for some people, but its driving me up the wall. Break 1-3 weapons for specific runes to slot into this other weapon Im using, deciding if I want to risk enchanting and ruining it because this will also lower the amount of runes and gems I can even use for it, or just using a bunch of low-mid effect gems to enhance it instead. Then doing about 8 upgrades just to get it to a good enough tier x amount of times and resources and money later....Because so far, a common strat in the community seems to be buy/get about 10-20 copies of the same weapon until you get a version of it with x damage (because even the base stats on the items are randomized). Then once you get that, enchant those 10-20 copies until you get x randomized effects. Then after running through all those copies, slot in gems that also have a randomized percentage of stat effects on them until you get ideal one. Now youve got the OP meta stuff to take down the end of crucible boss. Yay.\n\nIts definitely got its fans, but despite how much I love the game so far, its also one of the most tiring parts of the games for me. But like many other soulslikes, dont go to the community and ask for advice because its most toxic defenders and detractors will come out the woodworks to fight you to the def and say, \"just play the game and youll get it bro\".\n\n/end rant",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "CloudCityFish",
                    "body": "> I absolutely hate the build and weapon customization\n\nOh my God, so much this. I was enjoying the game until I realized how \"builds\" work. For me the progression system is uninteresting and tedious at the same time. My biggest issue is the stats are so boring, considering 4 of them only contribute to weapon scaling. Worst of all, when you level up, all you get are stats - which is boring - so leveling up feels like I'm being edged.\n\nAdditionally, since weapon drops are RNG and you have a limited moveset, exploring and finding new weapons is unmotivating. At least in a game like DS, you have a variety of movesets that factor in hitboxes, speed, and unique weapon movesets. Neutral dodge attack, crouching attack, rolling attack different than running attack, etc. Grinding out weapons to equip the same effects you can add to any generic weapon means there are effectively no builds, because you can just add/grind the meta effects. \n\nI guess if your an ARPG fan, this is the stuff you're into, but for me I feel like they took the foundation of DS combat, but replaced the coolest aspects with ARPG grind, without the unique ARPG class/skill/talents. It's like the most boring aspects of each genre. It's still EA, but some of the issues I have seem core to the game's concept, so I'm cautiously optimistic.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "PopeLeonidas",
            "body": "I've been playing **Cortex Command**, which has been a bit of a treat. The game is pretty clunky and didn't age all too well, all things considered. But it's also pretty fun and engaging, certainly worth a few bucks on sale! I thought the game would be more strategic, since it looks like a base-building, but it's actually more like a 2D shooter. You control a single \"brain\", which you must protect. You can drop in different kinds of units with different kinds of weapons. You dig for gold to pay for new units, and your goal is to survive and destroy the other brains. You can swap control to different units and assign them basic behaviors (dig, sentry, hunt, etc). The campaign is nice, and I suspect the game would be a lot of fun with multiple players.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "iWriteYourMusic",
            "body": "**Dread Delusion**\n\nI booted up the 1.0 and... this doesn't feel like a 1.0. Maybe a Bethesda 1.0, which might be what they're going for. I've had to deal with a lot of ridiculous bugs like falling through textures (which in a game on floating islands means certain death), NPC's being permanently asleep so you can never talk to them, and certain shortcut elevators never working so your shortcuts never open up. \n\nThat brings up my biggest aggravation: travel. Even if the shortcuts worked, the game's layout is very confusing, so getting from place to place on foot can not only take a long time but it's also hard to remember how to get from place to place. I can tell they're going for a Daggerfall/Morrowind style, but even those games had \"fast travel\" in the way of riding animals.\n\nThere's a lot of good gameplay and ideas here, and it's definitely a creative and one-of-a-kind game, but personally the one thing that makes me drop games the quickest is when I feel like they *don't respect my time.*\n\nMaybe in a future revision they can fix some of these issues. \n\nSadly there isn't much hope for the world design. If you're going to make an open world game with no fast travel or quest markers (or map for the first few hours) then at least make the world easy to navigate!",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Klotternaut",
            "body": "**Rabbit and Steel** - a roguelike that combines shmup DNA with FFXIV-like skills and raid mechanics. Probably my favorite game so far this year. I've now completed Normal mode with all 10 classes, and I'm now trying to tackle Hard Mode. It ups the mechanics and adds more of a shmup feel than Normal Mode does. Lots of fun, especially with friends.  \n  \n**Animal Well** - Rolled credits on this and got all but the last 6 eggs. The base Metroidvania game is fine. The items are creative but some feel a bit finicky to use and none of the puzzles gave me any fun \"Aha!\" moments. I liked the final sequence of the base game, but I think it also could have grown really tedious if I didn't complete it quickly.  \n  \nPast that, I think the game is too obtuse for me (which I don't see as a negative, just a recognition that it's going for something that I don't find appealing) but I also find that it makes certain choices that actively push me away from engaging in the game. Some of these decisions are hard to talk about without spoiling things. But the map stopped being interesting to explore for me fairly quickly, and main rooms are set up in such a way that you always have to engage with them. That's fine the first ten times, but past that I'm just annoyed. Eventually I hit the point where I looked some things up so I could make more progress. And if I did that because the game felt exhausting to explore, I may as well just pack it up. So I did.  \n  \n**Arctic Eggs** - A weirdo game in which you cook eggs (and cigarettes, cans of tuna, and whatever else) at some strange Arctic base. Kinda goofy, lots of weird world building, but not the most compelling gameplay.  \n  \n**Lorelei and the Laser Eyes** - A neat puzzle game with very stylish art and great vibes. Lots of really nice QoL features (you have a photographic memory that allows you to view basically all the documents and whatnot you find from the status menu) but still has you writing all sorts of weird notes down. Difficulty has felt solid, some stuff feels tricky but not hair pullingly tricky. The core mystery of the game feels quite compelling. I will say that a back button for menus would be a bit of a godsend. As far as puzzles go, I find Lorelei and the Laser Eyes to be much more satisfying than Animal Well.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Western_Management",
                    "body": "About Animal Well: what do you mean by ‘base game’? There’s no DLC, is there?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mudcaker",
                            "body": "You can beat the 'main story' or whatever but there are still collectibles and puzzles to solve if you enjoyed it enough.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Klotternaut",
                            "body": "People often describe Animal Well as a game with 3 layers. The first layer being the core Metroidvania game, the second being a collectathon, and the third being weirdo secret hunting. I was referring to that first layer.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FlamingOtaku",
            "body": "I've finally gotten properly into Cyberpunk 2077 and I'm absolutely loving it. Definitely still has bugs, and you can feel how it feels like theres some content just kinda... missing, but I'm greatly enjoying it regardless!\n\nAlso the slang is worming into my head send help",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "KawaiiSocks",
                    "body": "Definitely try to lean into roleplaying: there are so many things that are specific to specific approaches. Even the most basic of GIGs typically have 3+ approaches and 3+ outcomes, depending on how you do them, with unique solutions, dialogues and sometimes even rewards.\n\nOn my fifth play-through last August I was still finding new reactivities and new interactions with NPCs, including multiple, very fun non-violent resolutions to quests, which had prerequisites that you are non-violent in quests that were like 60 hours ago. It took players 4 years to realise how good Cyberpunk is, but at least it is finally **Overwhelmingly Positive** on Steam, as it should be.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FlamingOtaku",
                            "body": "The gig i mentioned earlier was a job to take out Jotaro, sick bastard makin torture BDs with joytoys for victims. Crept into his parlor, flatlined him and a few guards, snuck back out. Later on, when I was doing one of the main quests at Clouds where you confront Woodman, I got an interaction saying \"Hey, remember what happened to Jotaro?\" And apparently Woodman thought dude died in a freak accident. Yhat was pretty fun leverage to use against him lol",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jsagray2",
                    "body": "I've never heard Choom so much in my life lol.  Also, I was the same as you, where you can tell that there is still stuff missing, but overall, it's a really enjoyable time.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FlamingOtaku",
                            "body": "I did a random gig completly undetected and after sneaking out and getting my pay, I instinctively went \"Nova.\". That was like 12 hours of playtime ago lmao",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "pt-guzzardo",
            "body": "**Animal Well**\n\nAnimal Well is like an ogre -- it has layers. The first layer is a cute animal-themed Metroidvania, and it's among the best I've ever played. The different tools you find to help you explore new areas and solve new puzzles are incredibly creative and have multiple wildly different uses that the game subtly guides you to discover organically. Of all the tools in the game, I only successfully predicted what *one* would be in advance. The others were all delightful surprises. 10/10 would recommend to anyone and everyone who will listen.\n\nThe second layer is a literal easter egg hunt. This layer starts out really fun and joyful, but collapses into a slog near the end when you've just got 3-5 left and the game is completely unwilling to provide any guidance on where to look, so you just have to wander aimlessly and pray. I would give this layer a 7/10, but it could be easily elevated to a 9/10 if the developer took a cue from Tunic's endgame and offered a way to ask the game for a vague hint if you're barking up the wrong tree. As it stands, I would recommend anyone who gets down to their last 2-3 eggs just look up their general locations in [a guide like this one](https://techraptor.net/gaming/guides/animal-well-eggs-locations) to save yourself hours of frustration.\n\nThe third layer and beyond consists of increasingly obscure Fez bullshit that I'm happy to watch other people solve online.\n\n**Honkai Star Rail**\n\nAh, the duality of gacha. When Star Rail is just being a JRPG, it's everything I'm looking for. It's got high production values, a cool setting, minigames, and fun background characters and environmental interactions to find with surprisingly engaging writing.\n\nAnd then once in a while it will slap you across the face with a reminder that it's a live service gacha game with all the obligatory trappings and it's time to pay the piper by leveling up your characters again, using a million different currencies that you have to farm using time-gated energy mechanics, and all of the joy drains out of it until you're caught up again.\n\nThere are the bones of a fun combat system here, but in practice the amount of time you spend actually engaging with it is negligible. The heavily vertical nature of progression means that you're almost never in the tiny band of the difficulty spectrum where your decisions matter. In practice, most fights are either so trivial you can let the AI autobattle it out while you browse Reddit on another monitor, or straight up impossible without more grinding.\n\nAt the end of the day, I recognize that games like Star Rail or Genshin, with their scope and update cadence, would not be created under any other business model, so I groan about it but ultimately tolerate it.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "caught_red_wheeled",
            "body": "**Finishing up Pokémon shining Pearl!** I mentioned I wasn’t sure what was the better game between it and platinum and might not know until after beating it a few more times. I’m starting to form an idea already though. Someone mentioned that Platium was a straight shot and Brillant Diamond and Shinning Pearl just let players do what they like. I think that’s a really good way of putting it. \n\nThere’s also the fact that other things such as a guide also mentioning that Platinum does not compensate for battles being moved around very well. Most notably, there was a boss that was a little bit past the halfway point in Diamond/Pearl and was moved to the earlygame in Platinum, even though the team still partially acted like they were at the original point. There was also a boss that pretty much could softlock a player due to being moved to a different area where the player could not heal or leave easily and given an upgraded team; the softlock never happened to me, but there were sometimes it got close and it very well could have. \n\nAnd there’s no ignoring that 2/3 of the Pokémon are unattainable without peripherals (some of which don’t even exist anymore) and if you don’t have the resources to play at a competitive level, a lot of the post game is blocked off. Pokémon brilliant diamond and shining pearl do not have that issue and still have a fairly lengthy post game (even though a lot of it was optional). There was even a small competitive area there for those that still want to partake, even though it’s nowhere near the size of Platinum.\n\nSo is Platinum the more polished game? Yes. Does Platinum have better teams in the main story? Yes. Is it more restrictive and does it run into post game issues because of the changes? Also yes. Does this mean it’s the better game regardless? Not necessarily. I think it’s pretty telling that when I play Platinum, I was pretty frustrated at some point and did not touch it for a while after completing it. I eventually went for 100% run that failed (mainly because I lost the game and had to restart, but I was also having trouble getting the last few things), a few challenge runs that also failed, a few successful runs for gaming events I was in, and a bit of transferring things up. But without the communities and transfer, I doubt I would’ve played it more than once. In contrast, I am playing Shinning Pearl on a challenge run, really enjoying it without any of the frustration, and I’m already planning to jump straight into another one, although I’m also also planning to take a break once I get some materials early in the game that would otherwise be hard to find (so I basically can continue from wherever I want and not get burned out). \n\nIt’s worth noting I wasn’t too impressed with Brilliant Diamond when it first came out, but I also had access to a modified version of platinum that was able to get everything without peripherals. So the game got overpowered by something that really shouldn’t have existed in the first place. It remains to be seen how the game compares playing the two as intended, but there’s a chance that might take the upper hand.\n\nRight now I’m focusing on the post game with flying types only. I’m just completing the last few areas, and then I’ll head back to the Elite Four rematchs. I do know I want to do the platinum teams, and I want to do one run for every type. However, I’m sure if anyone will get to the final version that happens when you beat the souped up teams 20 times. I had a team that did in brilliant diamond, but it was really hard because the player usually doesn’t get those levels. \n\nAnd this team already had some trouble with the Elite Four to begin with even though I cleared it the first time so I don’t think they would be ready. I do eventually want to try out different teams against those in a 100% run, but that wouldn’t be for a while. I’m planning on starting a steel type run after and doing the initials setup at least, but I’ll probably switch to a different game after that just prevent burnout.\n\nAs for my final thoughts in the game, it’s very solid, and I have a greater respect now that Scarlet and Violet went a completely different direction (still good, but different). I still wish it could’ve included most of the platinum content (the battle frontier might’ve been a bit much depending on the audience for that, but everything else seemed like it could’ve been doable) alongside the quality of life changes. It would’ve been interesting to see how platinum stacks up with the quality of life changes and if my opinion would’ve changed, but will never know that now. \n\nI would’ve also liked to see something from Pokémon Legends Arceus in reverse. Maybe someone from those games travels to the present time and decides to stay there. or all of the characters, seeing as they’ll never be seen again otherwise. but sadly, that doesn’t happen, even though Pokémon Masters had an event that sort of did this. It’s a bit frustrating because Legends had a lot of references to this game, but the reverse didn’t happen and I felt like there wasn’t really a conclusive ending for any of the characters as a result. A bit more about Cyrus and what he was like after the events of the game would’ve also been nice, even though the battle tower does this a little little bit if the player gets lucky and matches. But this also didn’t happen.\n\nOverall, it kind of falls in line with the other remakes because they didn’t include a lot of contents from the third versions. Heartgold and Soulsilver just remade events from the ground up but a lot of it was based off of the original games, Pokémon yellow got a reimaging combined with Pokémon Go and the original GBA remakes didn’t include anything from yellow at all, ORAS added some new content but didn’t include any emerald content, including shortening some things that were there (to the point where I prefer emerald over it), and this remake was deliberately faithful as kind of a side project for the team. a lot of it is par for the course, and it’s still a good game, maybe one of my top three Pokémon games, but I can’t help wanting what might’ve been. I believe it’s because platinum added a lot of things to the story and completely redid areas, whereas the other third games did not for the most part, but I can’t say for sure.\n\nIf I get to the point where I’m ready to take a break, i’m just going to try and finish up everything I can in **Super Mario brothers wonder.** it would involve doing two Yoshi runs back to back if I went straight through, but I feel like I’m close to being ready for that. I can’t do anything beyond Yoshi, so it’s going to the point where there’s not too much more new content for me to explore. I’m OK with that and I’m probably going to up with about 30 hours, which is pretty long for a standard Mario game. And there’s a lot of footage where I can watch things I missed. It would’ve been nice to try and get get the content I hadn’t been able to, but I still have a blast with what I could do!",
            "score": 4
        },
        {
            "depth": 0,
            "author": "The_Silver_Avenger",
            "body": "[Last time](https://reddit.com/r/Games/comments/1ckn1nu/weekly_rgames_discussion_what_have_you_been/l2pg4uu/)\n\n**Call of Duty: Modern Warfare 3** (PC) - The original one. I beat it on regular difficulty in a little over 5 hours. It's better than the second one but it's still quite a silly game.\n\nThe big issue is this - Modern Warfare 3 calls back to many previous levels in the Modern Warfare series but misses what made the original ones so interesting. There are two levels that are very similar to All Ghillied Up, but they don't quite hit the same highs as that one did. The answer for why, I think, is relatively simple - in All Ghillied Up, you can keep stealth going until the end of the level without ever breaking cover. With the stealth missions in this game, you always end in a massive firefight no matter what you do. It doesn't make the enemy feel as threatening if you know you're just going to successfully shoot your way out in 10 minutes or so.\n\nThis isn't an isolated incident - Iron Lady is another big offender. This mission switches viewpoints between the 'ground' and the viewpoint that was in 'Death From Above', but all of the dark satire and bleakness of that level has now been replaced with playing the scenario completely straight. It's such a strange level - at the end, there's a landmark that's on the verge of toppling over and I thought that the landmark would stay slanted as a cheesy kind of 'we're beaten down but there's still hope' sign but instead, it just topples over with no-one commenting on it. It's literally like a scene from Team America: World Police. 'Down the Rabbit Hole' is also like a slightly worse version of 'No Fighting in the War Room'. At least 'Turbulence' arguably improves a bit on 'Mile High Club'.\n\nNote that I've not yet mentioned the plot of the game. It does a decent job of rounding off the 'Modern Warfare' story, as absolutely insane as it is. We've gone from isolated-ish incursions in Modern Warfare 1 to the end of a Russian invasion of the USA and the beginning of a Russian invasion of literally all of Europe in Modern Warfare 3. To bridge the series, there's several 'scenes from previous games from a different perspective' that feel horrifically crowbarred in and end up retrospectively cheapening parts of the prior story. Makarov doesn't have a whole load of depth to him and the bonds between the main protagonists don't feel as strong as they could. They have a 'remember the new guy' character too which doesn't totally work. To balance this, there's the traditional voiceless player character who's part of the US army whose campaign is sort of interesting if a bit standard. Some of the set pieces are, admittedly, quite cool though with an impressive level of polish and detail.\n\nIn terms of the level design, I think I enjoyed it more than Modern Warfare 2. It's a globetrotting adventure which means there's more variety and some of the capital cities that I've been to have been fairly faithfully recreated (at least in tone if not necessarily in geography). One downside is I feel like there's far more enemies with rocket launchers this time around, which I suppose is in keeping with the nutty tone of the overall game. The gimmicks are fairly interesting, like the robot you can control, and I was shocked that some of them came back in later levels (like the night vision).\n\nI feel as though it's better than Modern Warfare 2 on the basis of spectacle alone but it's far, far below the original Modern Warfare. Parts of this are risible and it's perhaps a good thing that the trilogy is now over - things couldn't get much more mad in a Modern Warfare 4 (actually, if the last level in MW3 is any indication, maybe they could). Despite this I'm looking forward to Black Ops 2 - I feel as though the original mostly did a good job at walking the line between pulp and seriousness with some satirical elements thrown in so I'm interested to see how that one takes it further.\n\nUpdated ranking of the series (non-core games italicised):\n\n1. Call of Duty 4: Modern Warfare  \n2. Call of Duty: Black Ops  \n3. Call of Duty: World at War  \n4. Call of Duty 2  \n5. Call of Duty: Modern Warfare 3  \n6. Call of Duty: Modern Warfare 2  \n7. *Call of Duty: United Offensive*  \n8. Call of Duty  \n9. *Call of Duty: Big Red One*  \n10. Call of Duty: Black Ops Cold War  \n11. Call of Duty 3  \n12. *Call of Duty: Finest Hour*",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "jsagray2",
                    "body": "I dont think I've ever disagreed with so many reviews from 1 person before lol.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Schwimmbo",
            "body": "**Slay the Spire (Android and some PS5)**\n\nWe were away with our little family for a long weekend last week.\nEveryone went to bed early and I bought StS on Android.\n\nAs a father of 2, I always felt this was something to play on the go as I wanted to play \"real games\" during those few hours a week of gaming time I still have.\n\nMy god... The memes about this weren't lying. This game is so deep, clever, challenging and addictive.\n\nPlayed over 10h in 1 week, about 8 of those on Android. It's a bit clunky sometimes to make your touches register on the phone if you're trying to hit something really small (open your deck for instance). But overall very stable and reliable.\n\nJust won my first run as Ironclad. Will probably have a look at the 2nd character before trying Ascension 1 with Ironclad.\n\nAlso, I dealt 750 damage to the heart but nothing happened so surely there's stuff I haven't discovered yet.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "RoboChachi",
                    "body": "One of my all time most played games, I've registered over 3k hrs on my switch and I'm still terrible;)",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "weisswurstseeadler",
                    "body": "Don't wanna spoil anything but I recommend finishing a run with each of the first 3 characters!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Schwimmbo",
                            "body": "Will do!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Plus_sleep214",
            "body": "Needed something to tide me over until the Elden Ring DLC drops so I finally went ahead and started making my way through **God of War Ascension** on a used PS3 I picked up a while ago for $50 as it's the only GOW game I've yet to play. \n\nThe weapon mechanics are a bit of change from the series prior where you're punished for getting hit with a meter that once charged up will substantially increase your move combo length that's charged by every attack but goes down whenever you get hit. It's a weird change that doesn't work so well but if you can fill it up it is satisfying to then obliterate everything in your path with OP combos. Story wise I believe this is chronologically the first game with Kratos being tormented by some beings known as the furies with one of them actually helping Kratos out betraying the rest. Pretty standard GOW stuff but it's definitely not as exciting as GOW 1 or 3 by comparison. I'm having a good time with it now but I'm pretty sure I'm near the end at this point with my health/magic meter maxed out. \n\nThere's still another month until Shadow of the Erdtree though so I'll have to find something else to play. I've been wanting to play the Lords of the Fallen reboot as I bought it pretty cheap on the last EGS sale but I'm not about to play another souls like just before ER plus IDK if I'll finish it in time. I have a bunch of different games on the backlog though so I'll find something.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "OBS_INITY",
            "body": "**Talos Principle II**\n\nI didn't enjoy it as much as the first game.  I felt like a lot of the characters kept hammering away at the same debate points over and over.\n\nThe outdoor environments can be pretty big.  Sometimes this can mean walking several minutes to get to a puzzle that you solve in 15 seconds.\n\nI didn't try any of the gold door puzzles.  After completing 120+ puzzles, I just wanted the game to end.\n\n\n**Stellar Blade**\n\n\nI really enjoyed this.  It's most similar to Nier: Automata, but with better combat.  \n\n\nI've seen lots of complaints about the story and voice acting.  The story is fine for a video game.  I think the voice acting is fine from a performance standpoint.  Some of the dialogue is a bit wordy.  Characters in conversations are hand animated in a mediocre matter.  That would be fine in a game like Dark Souls that doesn't zoom in on talking NPCs, but here it just looks bad.\n\n\nPlaying NG+ can get annoying because it seems to be somewhat random on whether or not you can skip a cutscene.  Some story segments might be divided up into 4 consecutive parts, but you'd only be able to skip 2 of them.\n\nCertain parts have too much dialogue.  Talking to a merchant has 4 different voicelines every time you talk to them.  Interacting with the quest board has 2 voicelines before the menu pops up.  You can skip this dialogue line by line, but it's slow to skip.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "iWriteYourMusic",
                    "body": "Totally agree on Talos Principle II. It's like /r/im14andthisisdeep the game. If it were just the puzzles it would be fun, but the devs/writers were too full of themselves to allow that.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Coolman_Rosso",
            "body": "**Darksiders: Genesis** (PS4) \n\nI greatly enjoyed the first Darksiders game. It was a fun, if a little flawed, mix of Zelda and Greek-era God of War. As a series however, Darksiders takes some real swings and pivots. Darksiders II apparently focuses more on open world areas with the addition of a loot mechanic, while Darksiders III seems to be a Metroidvania game with combat based on the Soulsborne format. Genesis is no different, instead shaking things into an isometric twin-stick shooter dungeon crawler hybrid. However I'm not meshing with this one as well. The moment to moment writing takes a nosedive thanks to focus on Strife's marvelesque one-liners, and the movement speed is a little too slow for my liking. Two hours in and I'm not all that impressed. Perhaps if I had a co-op partner it might go a little faster, but I think this one will be a skip. \n\n**Moonring** (PC) \n\nA free download on Steam, Moonring is an interesting mix of old timey RPGs and dungeon crawlers. Unfortunately I only have a half hour down so far, but it's wild that this was a free game.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "professorMaDLib",
            "body": "**Oxygen not Included**: I just got back into my old save again. There have been a few new changes since I last played and I had some new projects I wanted to test out. I've figured out how to create a tardis rocket by melting steel, so now my rocket has a lot more space to work with and I'm planning to make a fully sustainable rocket with some tricks.\n\nGeotuners are another thing I want to test out. Klei released the bleach stone hopper a while back and bleach stone + salt water geyser = mad power and resources. I really want to start messing with that.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "LucasBouyoux",
            "body": "I have been playing Lethal Company. Still amazed how a simple game like this can be so much fun with friends",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "CCoolant",
                    "body": "I don't really mod games frequently, but Lethal Company is the perfect candidate for mod treatment. Playing it in VR is an absolute game-changer, for instance lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "vinoezelur",
            "body": "**GOW: Ragnarok** \n\nI loved the 2018 prequel of this, and recently completed it. So i was hooked from the get-go. The game is visually stunning, and the difficulty slowly paces up. The story is a big plus. Kratos being kratos smashes everything on the way, and it is so satisfying. The puzzles too are challenging. I am just 25% in, yet i see myself every day evening, switching the console on more regularly than ever. Considering am in my early 40s and game only casually, i am more than happy to note, that i am really enjoying this game.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "caesius6",
            "body": "**Animal Well**\n\nJust rolled credits and did some post game. Feel like it got kind of…hard to figure out quickly after that. I’m 90% sure I just don’t have what I need or I’m not looking in the right places, but I think I’m the kind of gamer that likes a little hand holding as opposed to “you’ll figure it out” or wait til you stumble upon it approach. Glad this exists for those on the opposite side of that spectrum.\n\nI fucking adored Fez and did a ton of post game. But I played that alongside friends, where the discovery and discussing theories and solutions was a huge push for me. Wish I had that here.\n\nIncredible art style, atmosphere and gameplay. Highly recommend.\n\n**Crow Country**\n\nConflicted on this one. Had a good time, but, in an opposite opinion from above, puzzle solutions felt very sponges to you. I loved the presentation of the game, but felt the execution left a bit to be desired. Enjoyed the story, though! In hindsight, would’ve waited for a sale. $15 feels like a sweet spot here, but I think most folks who are fans of the genre would be happy to plop down $25. \n\n**Star Wars: Jedi Survivor**\n\nJust started this. Struggling with the controls and combat A LOT. I don’t know why. Maybe I need to bump difficulty down…so far, struggling to pick it back up.\n\n**Dead Cells / Slay The Spire**\n\nFinding myself loading these both up to do a run once a day right now, despite having had more than my fill of these two many years ago. Dead Cells has had an incredible amount of updates since, so it’s been fun to see some of those. Need to buy the DLC! It’s so damn good.\n\nStruggling to beat Slay the Spire with the Ironclad and the Defect (talking all the way to the heart). Came close with the Defect twice (heart down to less than 10 HP - needed to take a long break after losing those two, ha), but just can’t find a good groove with the Ironclad. Either not doing enough damage or not having enough block. Tried exhaust strats, strength strats, a combo of the two…just can’t find a good groove. Has always been my least favorite character to play and my most recent playtime cements that.\n\nMan, Dead Cells is such a phenomenal game. Have I mentioned that?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Diicon",
                    "body": "Dead Cells has had such a grip on me for so many years now. Every time I think I've had enough of it it'll creep back into my rotation for a few weeks out of no where. There are few games that have had that kind of longevity for me, maybe Isaac and Terraria. I have yet to get that kind of obsessed with Slay the Spire, but I will one of these days. I've had some good runs, but I've never owned it outside of a subscription service, so it hasn't had the opportunity to get its hooks in me.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "caesius6",
                            "body": "The weapon variety, the bite sized, speed run metroidvania maps, the smooth controls, and so much more. Dead Cells just nails it. And a run doesn’t take too long! I think that’s what I appreciate more than StS, because a good run in StS can be a while, and then to lose it when the heart has 3 HP makes me want to cry. But I still love the loop. I’m a sucker for deck builders.\n\nI really, really need to pick up Isaac. Somehow it has evaded me all these years.\n\nHave you played the DLC for Dead Cells? How is it?",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Schwimmbo",
                    "body": "I just started StS and made a post at the same time as yours. You just confirmed my hunch that hitting the heart after finishing my very first run with Ironclad isn't the end point. Need to dig deeper!",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "caesius6",
                            "body": "You’ll get there! Keep climbing, and climbing and climbing….\n\nI’ve been playing for years on various platforms - Switch, mobile and most recently on Xbox thru cloud streaming to my phone (perfect game for this). I guess I’m a glutton for punishment starting over so many times, but I do like getting achievements.\n\nLet me know if you need any help. The subreddit is full of guides and deck ideas, too!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FitzTheBastard_",
            "body": "Replaying **Horizon Zero Dawn** since nothing is catching my eye now. I thought it would be a drag after playing Forbidden West, but the game aged well! The story is always a pleasure, the mechanics are great, Aloy is fun to follow and the landscape is still breathtaking.\n\nIt's not a perfect game, but I still will never understand the criticism it gets from some. Battling giant machines will always be a pleasure.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "bobasaurus",
                    "body": "One of my favorites.  I need to play forbidden west, I have it for PS5 (never started it though) and am debating if the PC version is worth forking over the money for now.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Im_gary_the_witcher",
            "body": "Rolled credits on animal well and started mullet madjack. Animal well is a phenomenal puzzle metroidvania and even if I don't play much of the post game still such an obviously lovingly crafted game. \n\nMullet madjack is a lot of references and high octane fun so kind of the polar opposite. Playing both back to back is interesting.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Rivent",
                    "body": "Man, Mullet Madjack is my kind of game on paper but I couldn't take all the visual noise. I felt like I couldn't see shit the entire time I played, lol.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Im_gary_the_witcher",
                            "body": "Lots of seizure warnings for a reason. It's really garish in that way but I personally think it fits well with the in your face nature of the aesthetic. Totally get that it's a sensory overload though",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Cuddlesthemighy",
                            "body": "I hit floor 50 and something always gets me.  Losing 8 floors of progress because I landed on top of a guy and got stuck or killed a guy and got forced forward into an insta kill fall feels terrible (or that one super long jump that if you don't time pretty much perfectly you'll miss the ledge.  Thematically I love it, its dripping with style and cool visuals.  But I got sick of it very quickly because replaying samey levels on repeat is as obnoxious as it is in any roguelike.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mnemosense",
            "body": "I'm playing **Vampire the Masquerade: Swansong** at the moment (PS Extra) and I'm so confused by why it has so many 1 star ratings on the PS store. I'm having a great time with it. It's been a long while since I played a detective game that had serious consequences and stakes.  \n\n1 star ratings should be for unplayable shit or substantial performance issues at the very least. I get why something like Sable has 1 star ratings, because the fps was all over the place and ruined the experience. Swansong doesn't deserve the hate.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Vast_Performance_225",
                    "body": "I can't speak for anyone else, but I gave it a 1-star rating because it was in fact unplayable. It crashed repeatedly and eventually ate my save. Very glad you aren't having the same issues--hopefully they've permanently fixed the issues it had early on--but I have no desire to risk it again.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mnemosense",
                            "body": "Did you play it when it came out, or years later? I'm assuming it released in the typical state most games do in this era (which is why I never pre-order or play games upon release). I've experienced zero bugs so far and am almost finished with it. Benefits of being a 'patient gamer' I guess.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Vast_Performance_225",
                                    "body": "It was after a few patches, assuming they were numbered in any logical way.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "caesius6",
                    "body": "Glad to hear you’re enjoying this, I just picked it up recently. Haven’t seen much discussion about it at all.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mnemosense",
                            "body": "It's one of those games that are stingy with XP points and special meters. There was this one level where I felt good because I'd solved a bunch of stuff, and then when I was leaving it all went horribly wrong and many people died lmao. It just made the story more cinematic as a result.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Whoopsht",
            "body": "**Elden Ring**\n\nThis is my first From Software game and I finally get it. I get why people live these games and the worlds they create and the super tough boss fights, I have finished multiple boss fights and realized that my heart is pounding.\n\nI think I'm maybe a little over half way through the game, I've reached the Atlus Plateau and have been fighting the bosses and dungeons around there.\n\nPlaying an almost pure melee build with a sword and a sheild and if I have a complaint about the game, it's that some bosses feel like they were not designed with melee in mind. Specifically the >!Valiant Gargoyls at the end of the Aquaduct who constantly barf poison all around their feet!<",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Galaxy40k",
                    "body": "While you should play ER in whatever way you feel is most fun, I wouldn't shy away from mixing some magic into your build. ER really pushes players into having some sort of ranged option more than any other game in the series, with a huge share of unique weapons having split scaling, customizable weapon affinities letting you give any non-unique weapon scale with your build, and weapon arts encouraging everyone to put some points into Mind anyway. And I do personally feel like the game is at it's best when you're fully engaging with your toolset.\n\nThe reason I give that little speech is because I know there's an unfortunately large contingent out there who are very vocal about how you're not getting the \"real experience\" if you're not doing a melee-only two-handed-only never-summon run, which I think can color new player's perceptions. So I wanted to say that in case you happened to fall into that camp where you were only doing melee because you thought it was \"the right way to play.\" But if you're doing it just because you find it most fun, by all means, stick with it!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Schwimmbo",
                    "body": "I hated that boss haha. Great level though and what comes after that boss was so awesome too. It's all about the atmosphere and scenery for me in FromSoft's games.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "knirp7",
                    "body": "If you haven’t beaten that boss and want a hint: >! You can pretty easily stagger those gargoyles. Do drive-bys with jumping attacks or guard countering the last hit of combos. Most bosses who feel impossible to get in close like those two are easily staggered. !<",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "iWriteYourMusic",
                    "body": "That boss is hard even for veterans. By the way, it sure helps if you switch into some kind of ranged attack like either magic or even just using spirit ashes effectively.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ConstableGrey",
            "body": "I've finally gotten around to the Dead Space remake and I totally loved it. Great choice to flesh out the story now that Isaac can talk while still feeling familiar to the original game. And the lighting is so, so good.\n\nOnce small thing, but the game has this \"quick resume\". It like loads your file during boot up, so pushing Continue on the main menu insta-launches you into the game like it was just paused. Small thing but great touch.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Charrbard",
            "body": "**Ghosts of Tsushima**\n\nThis is one of the most polished games I've ever played. I never paid much attention to it since it was a console exclusive. But this may top Uncharted 2 as the best Sony game. The art direction is down right beautiful. Combat is simple but feels good. The writing, acting, everything is landing at a 10. \n\nWeirdly, its the game I was going to wait for a discount on. But $50 is now feeling like a deal.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "WeeziMonkey",
            "body": "**Rabbit and Steel**\n\nIt's 1 am. I have an alarm at 7 am. I haven't drank anything in 3 hours, I have only been playing this game. It has 0 loading screens, so I never feel like taking a break. \"Just one more run, I'll beat the boss this time for sure!\". I just played it for 8 hours in one day. \n\nTo describe it in one sentence: A roguelike where Touhou meets Final Fantasy XIV raids, except you can also play it solo (which I'm doing on Hard mode). As a FFXIV raider that's right up my alley.\n\nThe game feels very polished, art is great and intuitive, gameplay feels good, it is so easy to get into yet has lots of room to master higher difficulties. I think this is my favorite roguelike I've ever played. If I had to give one criticism, it's that there doesn't seem to be much item variety on a single character, if you're stuck on a stage then every run feels very same-y.\n\nI was planning to play XDefiant and Wuthering Waves this week too....",
            "score": 4
        },
        {
            "depth": 0,
            "author": "waku2x",
            "body": "**Persona 3R**\n\nLove the game but as people mention, Tartarus is a slog. Still isn’t as bad as something like Tactics Ogre POTD\n\nAm pleasantly surprised the music is pretty damn good ( 5>3>4 ). As the characters are more grounded and serious than something like Yusuke (p5) story or the steamy bathhouse in (p4). That said though, it does give more variety in dungeons and story than just one Tartarus dungeon\n\nOne thing though that I didn’t like is how tight the social links are. People mention that you need a guide to do it one play through which is crazy as there isn’t much way to minmax it without it ( as in if you are short in getting the next lvl social link. Yes you can pray but still waste a day ).\n\nAside from that, for me, a solid 9-9.5",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheAdamsApple",
                    "body": "Yes they were still trying to figure out how social links worked when they made that game. Lots of social links only found in school (making exam weeks rough), tons of days off during the semesters, and only 2 (!) evening social links. It makes me appreciate 4 and 5 a lot more in terms of their social links. Still love 3 though and reload makes 3 even better!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "PositiveDuck",
            "body": "**EA Sports FC 24**\n\nGenuinely terrible name aside, it's been the only game I've played for the past few weeks. It's incredibly frustrating at times but the game is just a lot of fun. I really wish they put some more effort into it though, it's buggy as hell. I tried opening Ultimate Team mode just to open the stupid pack that everyone got for free and the game wouldn't load it properly so I just gave up and went back to Manager Career. It's a great game mode but it's also buggy. It gives you quick sim option to skip less important fixtures but your players become unhappy if you use it. I have 2 strikers that each play 45 minutes every game to keep them both rested and one of them (crucial player) is very happy with his game time while the other (rotation player) is unhappy with his game time, even though they literally play the exact same amount. Transfers are also a bit annoying because the tiniest differences in 2 prices can actually fuck over your transfer. A club will turn down 30mil offer and ask for like 20% sell-on clause but remove the clause and add another 50-100k onto that and they're happy. The board will give you 3 seasons to sign 2 youth players to the first team and play them in 10 games but will complain you haven't done so already after 1 season. I'm managing VfB Stuttgart atm and I played 2 games vs RB Leipzig where both teams wore home kits. Normally that would be fine but both home kits are white which made it literally impossible to tell the two teams apart. The music that plays between the actual matches slaps, most of the songs are really good. Overall, it's been a lot of fun but a little extra effort could turn it into a genuinely great game.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "redmenace007",
                    "body": "With how long EA has been developing Fifa games, they get more buggier and buggier every year. I have completely stopped buying them since Fifa 21. Also the scripting in career mode is what really kills me.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Schwimmbo",
                    "body": "\n>I'm managing VfB Stuttgart atm and I played 2 games vs RB Leipzig where both teams wore home kits. Normally that would be fine but both home kits are white which made it literally impossible to tell the two teams apart.\n\nHow is that even possible lol.\n\nYou reminded me of a tradition we used to have with some mates. After a night out in the pub we'd finish off by having a last beer on the couch and play drunk FIFA, both obliged to pick our hometown team and play in the same outfit.\nAbsolutely hilarious and extremely confusing.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PositiveDuck",
                            "body": ">How is that even possible lol.\n\nI have no idea. The first time it happened, I tried to find a way to change kits during the match (lol no) and then ended up subbing every single black-skinned player I had (Leipzig didn't have any) so I at least could tell 3 or 4 of my players apart. The second time I just simmed the game to the end because I was just annoyed and ended up dropping 3 points there and all my players were unhappy.\n\n>You reminded me of a tradition we used to have with some mates. After a night out in the pub we'd finish off by having a last beer on the couch and play drunk FIFA, both obliged to pick our hometown team and play in the same outfit.\n\nLmao that sounds great, I wouldn't have had an issue with it if it was a game with my friends, we'd just fuck around anyways but this was just dumb vs AI.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Schwimmbo",
                                    "body": "The fact you can't even change the kits... Incredible haha. \n\nAs you said, we did it by choice for the lulz, in your case it was forced upon you by bad coding I'd guess.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "No_Doubt_About_That",
            "body": "Assassin’s Creed Mirage mainly.\n\nJust like exploring the world.  Admittedly haven’t been caring much for the story.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Machinencio",
            "body": "Danganronpa 2, very good game, I read that Paranormasight is kinda like the Dangaronpa games, is it true?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "migigame",
                    "body": "Insofar as that it's a japanese mystery visual-novel-like game, yeah. But it's much closer to an adventure game or a linear visual novel than Danganronpa; There are no gameplay sequences or trials as in Danganronpa and it's much more grounded (even if it has its supernatural elements and crazy stuff, Danganronpa is much more out there and anime). Definitely would recommend it though.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Machinencio",
                            "body": "Thanks, I'll have to check it it seems.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GameBytesBlog",
            "body": "How many games do y’all play at a time? I’m currently on:\n\n- Tears of the Kingdom\n- Elden Ring\n- Cyberpunk\n\nPlus FIFA/EAFC and my MP usual: Halo.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "sinciety",
                    "body": "All three at glorious games enjoy man!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GameBytesBlog",
                            "body": "Thanks! The backlog was piling up. \n\nI forgot to add the RE4:Remake, so far it’s the one I’m most hooked on.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sinciety",
                                    "body": "We have like the same taste in games haha RE4:Remake is amazing. Throw in Baldur's Gate 3 and you're cooking with gas.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Diicon",
                    "body": "Recently started playing one main game with a side game that I'm less committed to. I realized recently that I finish very few games when I'm playing a lot at once.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gnarwhale471",
                    "body": "It's not unusual for me to be actively playing 2-3 games at a time (I'm currently playing **Animal Well**, **The Great Ace Attorney Chronicles**, and **Balatro**) but there's no way I could handle those 3 huge games at the same time. Three open-world action/rpg games that can be 100+ hrs is nutty. I can only do one of those at a time. I finished Balder's Gate 3 a few months ago and I always need a break from expansive RPGs after I finish one. That being said I'm also 31 and have a lot going on in my life lol.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GameBytesBlog",
                            "body": "I agree, back when I had all the time in the world I would take my time with each but now I just focus on the story. \n\nI might have to set Elden Ring for later though, that game is stresseful lol.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SkinnyObelix",
            "body": "**The Planet Crafter**\n\nI like the progression system and the concept of the game, but I don't like the world... Either you hand build the world, and make it a lot better and bigger, or you have a procedural generation. Games like this thrive when you have to adapt your build to the world you find, and this will be a one and done game for me. It kinda reminded me of satisfactory and subnautica where I was slightly frustrated by the fact that it would be always the same world, but there the world is big and diverse. This game feels like a good start by an inexperienced, but I want a game like this to be a bit more refined. It's a bit too much a random scattering of assets than it is an immersive world.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "trillykins",
            "body": "**Prey 2017**\n\nI loved this playing through this the first time, aaand... yeah, still do. I think my only real gripe with it is that progressively more powerful enemies respawn in areas you revisit? Anyway. As a System Shock II fan, it's what I had hoped BioShock had been back in the day. \n\n**Steam Deck OLED**\n\nI've been trying to get some use out of this gigantic device I bought half a year ago by playing Prey a bit while I'm away from my computer, but it's not exactly making it easy. I thought this thing had been made so that it would sync your save on suspend, but that's just something I've dreamt up apparently and what happens when you try to continue on a PC is that you get a warning that it hasn't synced shit. So, what you're supposed to do is save and exit the game, wait for sync, and then restart Steam on your PC anyway because apparently cloud sync is really difficult to implement, and *then* you can continue where you left off. Or, to put it in other words, it's not exactly a seamless transition. Also doesn't help that I've played on PC so long that I've once again forgotten how to use a controller for anything that isn't racing or a Souls-game.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "MsgGodzilla",
                    "body": "Have you played the System Shock remake?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CCoolant",
                    "body": "That's interesting. You shouldn't have to restart Steam on your PC. You should be able to close the game on your Deck, let it upload your save file, then just open the game on your PC after it detects the change.\n\nI've been using the Deck since release, and have only had a couple hiccups with Cloud Saves being a little funky (nothing catastrophic).",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "trillykins",
                            "body": "> You shouldn't have to restart Steam on your PC.\n\nUnfortunately it kept throwing the 'cloud sync error' until I just gave up and restarted Steam. Even without that, though, having to exit the game on my Steam Deck feels pretty inelegant to me. \n\nI found out that I *had* read that games would be able to sync on suspend, called Dynamic Cloud Sync, however it needs to be implemented on a per game basis (meaning it's basically an unsupported feature). I have not been able to find a list of supported games and Valve has not made a label for it to distinguish the games that do.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pt-guzzardo",
                                    "body": "The only game I've played that did Dynamic Cloud Sync was Dead Cells and it was, if anything, even less reliable than the regular cloud sync. I don't generally have a problem going Deck -> PC the way you do, but PC -> Deck is hamstrung by the fact that the Deck seems to take 10+ seconds to connect to wifi when I wake it from sleep.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "theuglypotatoo",
            "body": "can someone give me a game recommendation i was hoping for something with skyrim vibes and maybe as good...i know that skyrim has too many mods and can be into a newer experience but i think it is time to move on",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "notthatkindoforc1121",
                    "body": "If PC I'd highly recommend Morrowind or Oblivion. Morrowind moreso, just make sure to run it with OpenMW as it makes it a lot more playable (Game is from 2002).\n\nIt's a lot more immersive than Skyrim with an incredible world and overall story, and an extensive and interesting spell/potion system, with pretty terrible combat. World is full of racists treating you like actual dirt, pretty different vibe.\n\nIf you don't want to run a game THAT old, Oblivion is a decent middleground. Still more RPG elements than Skyrim",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Monkey-on-the-couch",
            "body": "**Cyberpunk 2077** on PS5. I got into this game a couple of months ago, after all the controversy and post-updates and improvements. And holy shit this game is absolutely incredible. I’m not sure how bad it was before but it’s a truly amazing experience for me right now. It’s such an immersive, fully-realized setting with some of the most compelling worldbuilding I’ve come across in the medium. \n\nThe gameplay is fun and varied, and the skill tree lets you go in so many different directions. For my first play through I did tend to go for a more generic shooter style play through but I’m adding a bunch of skills and implants where I’m slow-motion running around the battlefield headshotting everyone, and then dashing up close to slice ‘em up with Mantis blades. It’s satisfying as hell. \n\nAnd on an LG OLED the game looks absolutely jaw-dropping. I love just riding my bike around the city taking the sights in.\n\nIf I have one nitpick it’s that sometimes the game world feels a bit empty. Unless you’re in a quest, nothing much seems to be happening. Other than that though I’m really loving the game overall.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gnarwhale471",
            "body": "**Animal Well**\n\nThink I might be stuck? Not sure yet I need to do some poking around the edges of areas I have been already to make sure I didn't miss anything or puzzles that I may be able to solve now with new equipment. Lovely game though, the vibes are immaculate, the puzzle solving is engaging, and I haven't played something in this genre for a while (closest thing would be probably be Metroid Dread when that came out). So far I'd give it a 7.5/10, although based on reviews I'm sure that number will go up by the time I finish. \n\nI currently have unlocked the >!frisbee, yoyo, flute, firecrackers, slinky, and bubble wand!<. I also have >!attained the green flame!<. I can see >!the red and blue flame near the top of the map, but am unable to solve the otter puzzle to get the blue one!<. In addition, I have >!3 kangaroo pieces. Seems like once I met this creepy asshole he just pops up randomly now. I figured out quickly I have to firework their ass to drop some pieces, because there were fireworks planted around where you first meet them. But yeah I've run into them 3 times since seeing them the first time, not sure how to trigger that event but I think I only need one more piece.!<. Also, I've been trying to get the >!mock disc over to the new shrine I found over by the dogs, but I can't seem to get there fast enough after I snatch it from the cat shrine. I tried for a while and will try again soon but even with teleporting with the flute (biggest 'a-ha' moment so far for me) I seem to struggle to get there before the ghost cat gets to me. Oh, also I have about 25 eggs I think.!<\n\nAnyways, not quite at the point where I need to ask for help or look up answers yet but might be soon if I can't find any new avenues to explore. \n\n**The Great Ace Attorney Chronicles** \n\nBig fan of the OG Ace Attorney games and replayed the collection a couple years ago on Switch (I haven't played the Apollo Justice games or the other 3DS ones). I really, really love the setting and characters far in this game. I've seen all the rave reviews for this duology and I can see why. I believe I'm on the beginning of 4th case? The one with the stabbing in the street. \n\nI think this game starts off a bit slow for me, although I understand I need to get to know these characters and it needs to set up the overarching narrative connecting each of these cases. I just think it over-tutorialized some things but I also know this could potentially be someone's first AA game so I get it. I was finally excited to see the jury system finally come into play in the third case, and see the \"corrections\" feature in the second case.\n\n Anyways, can't wait to see where the story goes from here. The 3D animations really brings these characters more to life and uplifts the tone and humor in the franchise that makes it work so well for me and so many others. \n\n**Pokemon Unbound**\n\nI'll start off by saying my love for Pokemon has waned hard as I've gotten older and the franchise not changing much. I'm not one of those angry reactionary redditors that bitches on the Pokemon sub about how Game Freak has ruined everything, but I'm simply just not interested in spending money on the newer games that seem relatively hollow imo. I understand it's a franchise marketed for children. That being said, I beat Pokemon White around January, that being the first mainline game I've beaten probably since Gen V originally came out (I did complete a nuzlocke of Alpha Sapphire a few years ago and hand a great time, I played Sun and dropped it after a few islands, and I got six or 7 badges through Shield and dropped it). All that to preface I'm really liking Unbound!!\n\nThe Pokemon in the starting areas are nicely varied (e.g. one route being all 'mons that evolve through friendship), the GBA pixel art always will be my favorite so that's really hitting for me, but most of all the QOL improvements are what make this game stand out to me. I know people love the narrative for this game and I'm interested in it right now but it's not blowing me away or anything (I'm only a little past the first badge), but really it's the gameplay that is pushing me forward so far. The narrative beat I just had is a great example- I'm in a volcano chasing the baddies down and halfway through I get a tagalong buddy. Makes for fun double battles and he heals my party *after every encounter*. Inventory management and running back and forth is not what makes Pokemon fun, so having a partner there to change up the battles for a while and not making random encounters annoying for me while I'm balls deep in a volcano is great! Smaller things like that, the difficulty settings it sets up for you, etc., all make for a smoother experience that is a breathe of fresh air and is enough to keep me going. Also, I found and caught a shiny Caterpie (1/4096 odds), so I'm riding that high from yesterday still. \n\nAlso shoutout to Delta being on iOS now. I'm never a phone gamer outside of doing Wordle, Connections, and Knotwords occasionally, but this might change that. Also, anyone know if I could set up a cross-save feature on my PC? Doubt it, but might as well ask. \n\n**Balatro**\n\nI think I now have about 85 hours in this game.. I don't consider myself a huge roguelite aficionado, but this is the biggest one since FTL to really sink its teeth into me this hard. \n\nCampfire go brrrrrrrrr",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Due_Recognition_3890",
            "body": "[I'm currently having an existential crisis because of this boss in **Stellar Blade.**](https://streamable.com/j4hc77) I realised after this I had a gear equipped that took 23% more damage but I still feel like I'm playing some overpowered optional superboss in a JRPG. It doesn't help that the Google results is full of people calling this game too easy. It doesn't help that EVE just sometimes doesn't respond to my button inputs to do a perfect dodge.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CCoolant",
            "body": "Animal Well\n--------\nWrapped up my time with this game on Saturday evening. I enjoyed it immensely, though I found the conclusion of Layer 3 to be rather underwhelming. I wasn't planning on even attempting Layer 4, so I looked that up afterward.\n\nFor those who don't know, the game has four \"layers\" of puzzles. The first layer is puzzles presented as puzzles, the second layer is the \"100%\" collectible stuff, third layer is more observation-dependent puzzling, and fourth layer is a mixed bag of things that are very obtuse and not really meant to be found.\n\nAnyway, layers 1 and 2 are fantastic and I found them to be extremely satisfying. The ending of layer 1 is probably the peak of the game, in terms of cinematic elements/immediate rewards, but layer 2 also has a nice conclusion and some fun exploration. There should probably be a radar or something to help you with wrapping up your egg hunt, once you hit a certain threshold, but if you have been consistently observant throughout the game, and maybe taking some notes, it's really not all too bad. The one egg I was missing ended up being overlooked because I forgot to note a location that very overtly signaled it had an egg in it. The room for those curious: >!Turtle room.!<\n\nEntering layer 3, I had found over half of the \"collectibles\" in it already, and the cleanup after that was rough. By the time I had 2 left, I made sure to get some \"general area\" hints: >!the one where you have to move the vines and the crows.!< One I just needed progressively more overt hints because the solution was just wild: >!floor is lava!<\n\nAfter figuring out the final puzzle, I also had some help with >!the entry method for the code.!< I was definitely at the point where I was ready to be done lol\n\nThe conclusion after that ended up being underwhelming, imo, >!and while there's probably some use for what you're given, I just didn't imagine the game would be able to make me feel like spending more time with it would be worthwhile.!<\n\nIf you enjoyed layers 1 and 2, maybe take a shot at layer 3, but don't expect a ton more from the game. I *would* recommend trying a little speedrunning though; seems like the routing can get wild.\n\nRabbit and Steel\n--------\nFrom one rabbit game to the next. Been playing this with friends a bit. I am *very* bad at reading the patterns, and playing on Hard is painful. I've been playing Wizard, since the rotation is pretty easy, and you're ranged.  That's been helpful, but I still need to get more comfortable with reading patterns and reacting quickly to them. I'm sure I'll improve with some more practice.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mudcaker",
                    "body": "I played Animal Well for a few hours, it nails the controls which is fundamental to me enjoying this kind of game. It definitely feels like I am moving on from areas with some unfinished business.\n\nOne possible criticism is >!infinite height with the bubble gun!<. I googled and apparently a lot of people think it's an exploit but it's intended. It was so simple to work out and do and it feels like I am bypassing a lot of puzzles. But I assume from what you and others have said, there's still a lot of game left to solve.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CCoolant",
                            "body": "Oh yeah, the >!bubble tech!< is 100% intended. And no matter how thorough you are on your first pass of any given area, you'll probably have to retread, so it's really up to you how you want to approach exploration! I would recommend trying to at least enter each room though, at the very least. :)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mudcaker",
                                    "body": "Yeah, it does make some things confusing like I will get further than I \"should\" but then get blocked anyway. Like in the dog area, I could just fly over them instead of doing it properly. But so far it's pretty nice to explore, but I need more matches!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Xenrathe",
            "body": "**Kingdom Come Deliverance (PC)**\n\nTo get the negatives out of the way, there’s some jank, some bugs, and some restriction of player agency/freedom: Limited saves, framerate dropping to 10-15 fps in certain cutscenes, bad collision detection with arrows, getting stuck on terrain, quests being unfinishable, crashes. I quickly modded save-anywhere/anytime, infinite carry weight, ranged crosshair, and a few others; put in some custom .cfg settings; and switched to a less ambitious UV/OC profile.\n\nAnd I also pretty quickly decided to focus on the main campaign. There really isn’t enough depth or variety in the exploration, economy, or mechanics to support much sidequesting. This has proven to be a wise choice, as I’ve noticeably felt more eager to play.\n\nInitially, I loaded this up because of how much praise I read from players, in the announcement threads of the sequel: “best RPG I’ve ever played” and such. Alas, I don’t feel the same way and would expect that to be a fairly common response. It’s a solid thumbs up, 7/10 or 8/10.\n\nI could add more criticism, but I’d rather focus on the positives: the game has a clear vision and executes on it faithfully. This is EXACTLY what I want from the gaming industry, even though that means not every game is going to be for me.\n\nKingdom Come is a historical RPG, faithful to the time period. You play as Henry, a blacksmith’s son who can’t fight for shit - there’s a hilarious early cutscene of Henry testing out a new sword and looking like a fool. He can’t even read, to start, and hurts himself when he first shoots a bow.\n\nBut something happens that liberates Henry from the mundane course his life was taking and motivates him to learn these skills. I knew as much going in, but I did not expect how much of a detective Henry ends up becoming. The main quest stuff I’m doing now is a lot of “Investigate this attack on a nearby village - who, why, and where did they go after” or “Go find the who and how of this counterfeit currency” or “Infiltrate this monastery.” There’s a definite Count of Monte Cristo vibe / inspiration here, with the revenge story, Henry’s humble origins, and the investigative element.\n\nThere’s just some really cool moments, like when you read a monk’s medicine book in order to diagnose a recent outbreak. It’s obviously not modern medicine (‘balancing the humours’ and all that) - yet it’s clearly a serious and even useful text. It’s that medieval authenticity that gives KCD its shine. For better AND worse. I mentioned that infiltration of a monastery earlier, and it’s a brilliant sequence that aims to truly capture the day-to-day of being a monk, including praying for HOURS straight, which - no surprise - is TEDIOUS, even in a video game in which you can instantly ‘wait’ 2 hours.\n\nI also think the combat is amazing. I’ve read a TON of complaints about it and y’know it frustrates the hell out of me sometimes too. But it’s made me appreciate just how difficult it is to combine RPG stats with skill-based combat. Because of various mechanics, you quickly realize to be successful that you need to A) be a mongolian horse archer or B) learn how to use master strikes and fight defensively to create an opening that you then punish into. Movement and terrain positioning is also absolutely essential for multi-opponent combat. The enemies are incredibly aggressive and will encircle and outflank you if you don’t fight at choke points or keep moving.\n\nAll said, I’m happy this game was made and was successful enough to warrant a sequel, even if I’ll be taking a ‘wait and see’ approach to that sequel. It’s just that historical settings are wasted on me. Give me giant mushroom trees or a demi-god with a dragon-head for an arm or a gryphon so I can jump on its back and stab it repeatedly in the head.\n\nAs a final note, this was my first game played on my new monitor (curved ultrawide, upgraded from 1440p flat), and it’s been an immersive joy. On my flat screen, I was used to having the whole view within my primary vision, but with the ultrawide, the edges start entering peripheral vision territory. It helps create a sense of being IN the world, rather than staring AT the world. It’s not going to make the difference between liking or hating a game - or even liking or loving a game - but if a gamer looking to upgrade monitors asked my advice, I would definitely advocate for curved UW.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "PontiffPope",
                    "body": "> framerate dropping to 10-15 fps in certain cutscenes, \n\nAre you playing in Borderless Mode? If so, it is a known issue of causing the frames of the cutscenes to significantly drop. Playing in Fullscreen-mode in turn fixes this issue.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Xenrathe",
                            "body": "I fixed it, with some .cfg setting or other. Turning off vsync perhaps.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "doonwizzle",
            "body": "i've been diving into hollow knight recently, really drawn into its dark, yet strikingly beautiful world. the art and sound really frame the mood. it's tough but rewarding to unlock new parts of the map. speaking of maps, did anyone else get turned around a lot when they first started? feels a bit like trying to read a map in the dark sometimes. reminds me of the labyrinth scenes in the movie pan's labyrinth.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "gnarwhale471",
                    "body": "Yeah the first time I played Hollow Knight I bounced off of it actually because I got lost pretty easily. When I came back to it a couple years later I used that charm that shows you on the map and that helped me immensely. One of my favorites of all-time now.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "daveyisscarecrow",
                    "body": "Just got in on game pass. Absolutely love the aesthetic and atmosphere but the gameplay loop hasn’t fully pulled me in yet. I’m extremely early though so I’m sure that will change.\nI just came from Dead Cells though so I think that set the bar too high in terms of tempo.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "porncollecter69",
            "body": "Cyberpunk.\n\nHaven’t played since 1.0. I’ve been addicted. \n\nI also got the DLC but I’ve just been doing all the side missions and taking it pretty slowly.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hyphen_Elite",
            "body": "Finished Stellar Blade and Another Crab's Treasure. I'll start with Stellar blade. The combat in the game felt great, especially when you unlock the later combos and can chain them together. I wish the platforming was more finely tuned. like Eve will just over and under jump sometimes. I've seen pornography with a better story. And I had similar feelings with Another Crab's Treasure: loved playing it, the platforming in the last area almost made me quit the game, the story was pretty good in my opinion.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Monkey-on-the-couch",
            "body": "Currently splitting time between **Cyberpunk 2077**, **Elden Ring** and **Alan Wake II** on PS5. I honestly feel spoiled as fuck lol, all these games are such insanely high quality. I’m taking my time with cyberpunk and Elden, just immersing myself into the world and exploring as much as possible. Honestly two of the coolest game worlds I’ve ever experienced.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "acab420boi",
            "body": "Playing **Yakuza 5** and **GOD HAND** for the first time. Both great games so far, but a bad combo as GOD HAND can't help but highlight how bad Yakuza 5's combat is.\n\nI remember Woolie talking about some fighting game and exasperatedly exclaiming that something was \"unsafe on hit,\" meaning if you successfully landed it, you would be open to counter attack. Most Yakuza games are Woolie repeatedly exclaiming \"UNSAFE! ON HIT!\" over and over. It's a real shame too as I can't help but feel like they would be more than late blooming cult hits (which I love) if they had even pretty good combat.\n\nThe PSP games developed by the same folks who made the Def Jam games got ok combat right, but they were JP only so they don't get the discourse they deserve. I hear Lost Judgment is a big budget game that finally gets it right, but they canceled the series, and I've still got a ton of work to do on my Yakuza play though before I get there myself.\n\nThat aside, if you never got around to GOD HAND, it is everything they say and 100% worth your time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nanohead",
            "body": "Last week, I finished the main game playthrough of **Horizon Forbidden West on PC**.  Where Horizon Zero Dawn is one of my all time favorite games, Forbidden West for me at least, is a forgettable bloated and bland sequel.   I put close to 130 hours in, did the whole main story, all side quests, almost all upgrade jobs, errands, etc.  The gameplay, which is pretty decent, was completely ruined by a completely cringe script, horrific voice acting, unbearable facial expressions by most of the games characters, and the overall tone of the game.   Most of the time when you start a mission or conversation, it felt like a social media therapy session filled with modern tortured cartoon like internet memes.  So much of the writing is simply insufferable.   Where Aloy felt like a one woman wrecking ball in the first game, in the second game she feels like she's about to start crying, hugging or punching people all the time.   Just awful....    I imagine the writers actually thought they were gonna teach us all something about the world......\n\nOn the good side, the world/map is amazing, ruins are better than ever, and we get to see Lance Reddick again as Sylens (one of my favorite actors of all time  RIP).  The climbing mechanic is horrific, the skill trees (if you can call it that), are convoluted and make no real sense, and the weapons are a mess compared to the first game.  The machines and machine killing is great again, and the PC port is stable and well done.   I tried to start the DLC Burning Shores, but just could not go on.  I had my fill of the whole thing.....\n\nI then, like many people, watched the Fallout TV show, and then felt the urge to play those games again.   I decided this time to replay **Fallout 4**, which I had (according to Steam) about 450 hours in from many years ago.  I have about 1000 hours in Fallout 76, which I enjoyed over many years of its maturation, and about the same in Fallout 3 and New Vegas.\n\nI forgot most of Fallout 4, and as I'm now about 20 hours in, Its amazing what a deep and giant world it is.  There's simply so much to find, explore, and do, and I actually barely remember any of it.....   So far, its been great.  Loaded a couple of mods (the reload time mod is a must), but am playing mostly vanilla for this playthrough.  Just a load of fun so far.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ravinglt0",
                    "body": "Combat was the only thing that kept me going. I felt so overloaded with information that I just always got confused who is who and there is so much dialogue that one point you just stop paying attention when every npc you talk to has so many options",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Volkor_X",
            "body": "**Valley**. It's a game about running real fast with robot legs and bringing dead rabbits back to life with magic.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Aggravating-Ice9203",
            "body": "I've been playing lethal company. It's a really good game for people who like multiplayer or people who game with groups of friends. Really cool graphics and pretty hardcore compared to most games.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Greenzombie04",
            "body": "Just random thought: I dont want consoles to go away. I dont like cloud, it works well but it doesn't work well 100% of the time like a console. I also dont like the idea of playing on PC. I have had annoyances playing on PC.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "daveyisscarecrow",
                    "body": "Don’t know why you’re getting downvoted. I play console and PC. Console gaming has a special place in my heart and the slow death of physical media is so depressing to me. Going into the city and buying a game - especially when they used to have manuals - was so special.\nIt feels so soulless just clicking to download now.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bludcee",
            "body": "**World of Warcraft - Panderia Remix**\n\nCame out Thursday and been playing it off/on.  I started in Legion so questing through all the zones has been pretty fun since I'm experiencing the stories for the first time.\n\nLove that transmog, repairing, etc. is free, each quests gives a chest for rewards, and flying is unlocked from the start.\n\nI am finally getting a bit bored of it, around level 40~ now, so might stick it out to get to max level then drop off, since raiding seems to be the main appeal late game and that doesn't appeal ot me in WoW anymore.\n\n___\n\n**League of Legends**\n\nNew split started, and with that new updates and some other stuff.  For note, I am a JG/Supp main that plays other rolls to fill as well\n\nThe good - Big fan of the ADC item rework.  Getting to crit in 4 items feels good as an ADC.  I like the new boots to get to recall to base faster as a support. \n\nThe bad - New champ mastery system is pretty bleh in comparison to before. Not a fan of the new icons, getting mastery grades are harder, and the numbers aren't a direct translate so it's hard to feel good/bad about being a high mastery champ.  Additionally I had a person goal of getting mastery 7 on all champs, but that drive went away since it's not as clear what's a \"high\" and \"low\" mastery anymore.  Like 50 is just as high as 100 is just as high as 300 as is 500.\n\n___\n\n**FFXIV**\n\nBack on to grind out the PvP Series.  Up to rank 17, going for 25 as usual for the cosmetics.  Just doing 1 frontlines a day, then will grind out the remainder as needed.\n\nWorks out since the new Mogtome event is out as well, so gonna get some rewards along the way.  The rework of this even to give little \"quests\" to get more mogtomes was great and really helps give me some other stuff to do while I wait for Dawntrail.\n\n___\n\n**Lethal Company**\n\nI love this game so much with friends.  It's the right amount of horror, thriller, and silly.  We finally went to some \"end-game\" moons as we've always been just doing the free moons, and the planets just to get to the facilties are so cool.  I love the winter one where you have to following light beacons to the facility back and forth.  I kinda wish there was just some stuff outside of the facilities to get back for money too, maybe not as valuable but makes exploration outside not a total waste of time.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Latro2020",
            "body": "Recently I got around to playing **Sker Ritual** & as someone who grew up playing COD Zombies, I’m happy other devs are having ago at that format. It may not quite feel as polished/smooth as COD (obvious considering the difference in budget), but it does a great job at capturing what people enjoyed about the mode to begin with (atmosphere, arcadey gameplay, Easter eggs).",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Bowsupreme",
            "body": "Who else believes the Brothers in Arms series should get a reboot? I’m playing through Hells Highway right now and forgot how much fun I had playing this game years ago when I was a kid. Lots of nostalgia. The games play like a band of brothers type thing. Honestly the games are super underrated and should be brought back",
            "score": -1
        },
        {
            "depth": 0,
            "author": "INFINITI2021",
            "body": "I've been playing this game every day. I did bad today tho\n\n[https://www.kwizzy.app/share?t=719&n=Infiniti20](https://www.kwizzy.app/share?t=719&n=Infiniti20)",
            "score": -5
        }
    ]
}