{
    "title": "Dave the Diver - Godzilla Content Pack Launch Trailer",
    "comments": [
        {
            "depth": 0,
            "author": "The_Stealthy_Archer",
            "body": "This looks so sick. I've been having a great time with the base game after it got added to PS+ so I'm definitely looking forward to this.",
            "score": 45,
            "replies": [
                {
                    "depth": 1,
                    "author": "TalentedStriker",
                    "body": "I'm disappointed.\n\nI loved the first half of this game and they'd just expanded on that it'd have been amazing.\n\nI hated the boss fights and the story generally.\n\nI just liked exploring and discovering new types of fish and shit.\n\nWas really hoping this would be a new area with loads of new fish.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "billskelton",
                            "body": "Yeah, the first 20 or so in game days are short dives, new fish, new gameplay. Then the dives get really long and I'm talking to mermaids about their flowers.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TalentedStriker",
                                    "body": "Yep. Basically everything up to the village is awesome. \n\nThen it’s all down hill. \n\nI still remember first time coming across a big shark and how fun exciting that was. Wish they’d done more with that sort of stuff.",
                                    "score": 7
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tokyotochicago",
            "body": "Crazy that they got the right not only to Godzilla but to the OST of Minus One which is an absolute banger!",
            "score": 124,
            "replies": [
                {
                    "depth": 1,
                    "author": "Paidorgy",
                    "body": "Especially considered how difficult Toho can be, if I remember correctly.",
                    "score": 32,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "masterkill165",
                            "body": "Toho might be one of the craziest companies when it comes to having weird, complicated copyright, especially related to godzilla.\n\nFun fact toho has such a thing for trademarks they actually have a unique trade mark stamp for almost every kaiju that has ever appeared in any media.  This includes monsters as obscure as Bagan, a monster that only appears as the final boss of the game super godzilla and the Godzilla Movie Studio Tour game as a cool looking picture. https://wikizilla.org/wiki/Trademark_icons",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SwayzeCrayze",
                                    "body": "I grew up seeing these slapped on action figure packaging, books, etc and was always weirdly obsessed with them. I've always been a massive G Fan, so I've debated getting one or two as small tattoos one day.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DMPunk",
                                            "body": "Get all of them on your back. We'll go together.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "masterkill165",
                                                    "body": "I feel bad for the wrist of any tattoo artist who has to do that much line work.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RareBk",
                                    "body": "What the fuck, there's one for Krystalak.\n\nToho no one wants Krystalak.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "masterkill165",
                                            "body": "When I was writing the comment I was originally going to use krystalak as my example of crazy stuff toho took the effort to make a special trademark stamp for but I knew no one want to be reminded of krystalak.  \n\nMan, I wish godzilla unleashed was not so terrable, especially with its required motivation controls if you want to play the version with the intesting roster.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Magnus64",
                    "body": "Not to be that guy, but that's been Godzilla's theme since 1953. Minus One was just the latest film to use it - and even then, the version used in this trailer is an older rendition and not from Minus One.\n\nBad comparison perhaps, but it's like calling the Star Wars theme that we've had since 1977 the theme from Rise of Skywalker instead. 🤮",
                    "score": 58,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tokyotochicago",
                            "body": "Damn dude I didn't know, the only other japanese Godzilla I watched was Shin Godzilla and it didn't have it. Interesting that the theme always had a pretty hopeful tone.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "masterkill165",
                                    "body": "Actually, Shin did have it.  But it's totally understandable with how hype the scene it plays during is to not remember it if you were hearing it for the first time.",
                                    "score": 30
                                },
                                {
                                    "depth": 3,
                                    "author": "Yoshi_r1212",
                                    "body": "The song says in Shin when his third form, the tall one, reappears from the ocean and starts walking towards Tokyo.",
                                    "score": 7
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nietzkore",
                    "body": "Minus One was a great film too. Recently watched it and was very impressed.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MsgGodzilla",
                            "body": "You should watch Shin Godzilla if you haven't.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "Vegan_Honk",
                            "body": "I also love that Nolan and Spielberg raved about it, making the director feel he had died and gone to meet god.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Ikanan_xiii",
                            "body": "It's a godzilla movie where if you take out all godzilla related stuff it would still be a great movie.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CertainDerision_33",
                                    "body": "Yeah, the secret is that it's not really a \"monster movie\", it's a movie about returning home from war, and Godzilla is just the prism through which that's explored. Superb film.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "YesImKeithHernandez",
                            "body": "Was fortunate enough to see it in IMAX when it released in a theater. >!When Goji first does his beam on land was a wild moment.!< That movie was really damn good.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mattinva",
            "body": "Does anyone know if this is something that gets added on to the end game or more weaved into the storyline and best seen with a new game?",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "D4shiell",
                    "body": "I'm watching streamer playing it, you need to complete ch5 which is end game.\n\nEdit: It's only about 70 mins long it seems.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "ThorAxe911",
                    "body": "I'm also curious about this. I haven't beaten base game yet and never installed the dredge dlc so i'm not sure how this works.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kenshin200",
            "body": "Ugh I wanted to like this game so much but something about it just didn’t click, I will maybe try again a few years later. Hollow Knight didn’t click for me the first time and then years later it was my favorite game",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "ARandomDepressedGuy",
                    "body": "Same here, the story didn't interest me and while I enjoyed the runs in the beginning it got old kinda fast and the new unlockable game mechanics as you progress didn't seem to affect the the base gameplay loop much. As wide as the ocean but only as deep as a pond.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "GovTech",
                    "body": "I also gave up on it. But it's a very different game than Hollow Knight. \n\nHere are the things I don't like about Dave the Diver:\n\n1) It's tedious. I know some people like games with tons of different things to do. To me, it feels like a second life. I don't want to manage 1,000 things. I already have my real life for that. I'm playing a game to get away from that. Why they thought it was a good idea to include so many mechanics is beyond me. It's trying to do way too much.\n\n2) The sandbox aspect of the game is pretty weak. The ocean world isn't that randomized. It's more or less the same underwater map every time and there's not much to get excited about in terms of what you find. At first it seems really cool and open-ended and then you realize there's nothing rare to find and the things that are rare are basically in set locations.\n\n3) The game is way too prescriptive in when you're allowed to do things. For a game that seemingly allows you to explore, it's fairly linear. Events happen according to a preset timetable, not when you make a discovery. When a new thing does happen, there's a cutscene and a bunch of dialogue and it's suddenly more like a JRPG than an open-world adventure game. The game has an unending string of procedurally generated fetch quests, if you want them - not my idea of a good time. \n\nI get why some people love the game. It has some charm. It does a few things well, but it wasn't the gameplay I wanted. I was hoping for Terraria meets Pokemon in the ocean, and it's not that. It's more like 15 games crammed into one. For people who love RPGs, I imagine all of this is a lot more palatable, but for players like me who value pure gameplay and freedom above most other things, the game disappoints a bit.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "JJMcGee83",
                    "body": "Hollow Knight didn't click for me either but Dave did. The trick with Dave for me was to play it for like 30-40 mins a day, basically do one in game day per day because it was very repetitive and very easy to feel grindy if you play it for too long.\n\nEven then not every game is gonna click even if it is hugely popular.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "AltonIllinois",
                    "body": "Everything is well made but the primary gameplay loop just isn’t fun to me.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "hoppyandbitter",
                    "body": "I checked out when the restaurant segment started. It was just not the level of stress I want to deal with in a casual game.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "kingeryck",
                    "body": "I played it in early access and right towards the end of that, I had the same problem I did with games like Terraria. You have to keep going deeper and deeper and it takes longer and longer each time and (that's what she said) it just gets so repetitive.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "PaulFThumpkins",
                    "body": "Hollow Knight is one of the few games I didn't love until literally post-game content.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "memelordxth",
            "body": "Is the DLC limited time means we can only play the DLC in the limited period or just available to get on this period of time?",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Stroxtile",
                    "body": "DLC will be delisted by November 23 2024\n\nhttps://www.pushsquare.com/news/2024/05/dave-the-divers-new-godzilla-dlc-to-be-delisted-in-november",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "adidlucu",
                            "body": "So, as long as I claim it before November 23rd, then I will have it forever? Even the games get reinstalled?",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KindlyBullfrog8",
                                    "body": "Forever is a long time. You never know with Sony. I'm sure you'll be able to download it for the foreseeable future but once the PS6 launches who knows? Sony has completely removed purchased games/shows from download before",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "JJMcGee83",
                                    "body": "In thee same way I still have a PS3 with PT on it \"forever\" then yeah sure.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "memelordxth",
                            "body": "Nice, thank you for the info",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "UnrulyRaven",
                    "body": "It has to be claimed before Nov 23, 2024 when it will be delisted. It can still be played after that date, but it can no longer be added to your account after that date.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "TechSmith6262",
            "body": "Fair warning: The midgane to Dave the Diver is absolutely mindnunbingly boring.\n\nIf you check achievement stats across all platforms, once players hit the chapter eith the sea village 50%+ of players drop the game because that's the point where it becomes boring and you realize this ocean is a mile wide and an inch deep.\n\nThe game gets glowing praise based on its arsthetics and the first few hours of gameplay.\n\nThis content is at the end of the game, so to access it, you really have to put yourself through some exceedingly poor content that over half the people who have ever played this game said \"nah not worth it\".\n\nOf the 2 \"indie\" ocean games released in recent memory, Dredge outperforms Dave the Diver in every metric possible.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GreatGojira",
            "body": "Is this only on PS? I will buy it for Steam if possible!",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ullallulloo",
                    "body": "https://store.steampowered.com/app/2841140/DAVE_THE_DIVER__Godzilla_Content_Pack/",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "AngryBiker",
                    "body": "You can't buy it on Steam unfortunately.",
                    "score": -8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Martini1",
                            "body": "Yes, you can.  It's free too.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AngryBiker",
                                    "body": "That's what I mean, it's free, you can't buy it.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Martini1",
                                            "body": "How is that unfortunate then?  It's unfortunate that it's free?",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Skylighter",
            "body": "It's really awesome that I can buy a game in two years then get to hear from other people about a limited time DLC that I missed out on forever because I didn't FOMO. Games are so great now.",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "shadowjeffknowsbest",
                    "body": "You don't have to own the game to claim the free dlc. Just did it myself on the PlayStation app.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Skylighter",
                            "body": "Not on Steam. It says you must own the base product.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -78,
            "replies": [
                {
                    "depth": 1,
                    "author": "fb_holzbaum",
                    "body": "It is a very fun game with a lot of interesting ideas and an awesome presentation. The game loop feels very rewarding in the beginning as you constantly upgrade your gear to dive deeper/longer and catch more fish.\n\nIn the late game it throws a lot of different gameplay mechanics and quests at you, at which point the game begins to suffer a lot in my opinion. It feels like there is no longer a rewarding gameplay loop, only busy work.\n\nI would have loved for them to focus on the core mechanic instead of introducing new stuff constantly. But I heard from a lot of people that they love exactly that aspect of the game.\n\nI had a lot of fun with the game for 10 - 20 hours, but never bothered to finish it.",
                    "score": 39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "overandoverandagain",
                            "body": "I had the same experience, game was solid and the diving-sushi loop was really satisfying, and then suddenly it felt like every time I blinked I was getting thrown into a different, relatively simple minigame I rarely felt invested in",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mrnixxin",
                    "body": "Different people like different things.",
                    "score": 56
                },
                {
                    "depth": 1,
                    "author": "whatevsmang",
                    "body": "It's really fun and unique. The gameloop between dive fishing and sushi bar tycoon managing is addictive.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "badgarok725",
                    "body": "its fun",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "CupHalfEmptyGamer",
                    "body": "It has exploring underwater, time and resource management in the sushi bar, a decent story with memorable characters, and very good pixel cutscenes, even farming elements.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Inignot12",
                    "body": "Idk I've played through it twice now, it's a great combination of spear fishing, management sim and some action thrown in. The animation and design is tight for a pixel style game, and it's got a great sense of humor and personality. It's both charming and addictive. Plus, if you like marine biology, it's a a cool experience, so much varied wildlife featured.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Moist-Minge-Fan",
                    "body": "Maybe it’s just not for you",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Cuddlesthemighy",
                    "body": "It gets the high reviews because the put in the effort...maybe too much effort.  The animations are impressive the core gameplay of get fish to sell in restaurant to get upgrades to progress farther is a good hook.  The usual complaint I see for this game isn't that what's there isn't good, but that it goes too wide.  You'll hit the village and that'll be the break point for a lot of people.  What was at first go get fish, now needs me to do fetch quests for eight people and decide which of multiple different subsystems I want to progress.  But at the point where its got that much going on for a cute pixel art game, it meets the burden for what most people (myself included) give a thumbs up to.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "sloppymoves",
                    "body": "Chill game genre is becoming more and more a thing. The renaissance for it started with Stardew Valley and Animal Crossing. More and more people like simple accessible games with progression systems, a bit of whimsy charm, and something they can play in small bursts.\n\nAlso taste is subjective and the amount of people who play games these days are in the high millions.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "jinreeko",
                    "body": "It's a cozy game.  It's chill and ambient and fun",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "PaleHeart52",
                    "body": "That's fine if you don't get it. Not every game is for you.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "BearComplete6292",
                    "body": "If you like a well made game with a nice chill vibe that gives you lots of busy work, this is it. It's not for everyone.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "lazydogjumper",
                    "body": "No offense, but as a video game player you should understand that \"you won't understand until you play it\". You could listen to any number of us expound on what is good about it but only YOU can decide whether it's fun to play. Case in point: I didn't like playing the new God of War. Just wasn't the game for me. But I loved watching others play through it.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "BLeePPeeLB",
                    "body": "I haven't played the game, either (it's in the backlog), but I do feel like the internet at large chilled quite a bit on the game. I think a lot of the early buzz and excitement tapered off with the general consensus now being that the game gets repetitive quicker than it should. OR should end sooner than it does.",
                    "score": -12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "laz85",
                            "body": "How do you measure the general consensus? Recent reviews on steam for instance are still at an 95% positive which is overwhelmingly positive.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "NoNefariousness2144",
                            "body": "Same vibes as Untitled Goose Game. The internet hyped it up so much when it was pretty mid and got dull after an hour.",
                            "score": -10
                        }
                    ]
                }
            ]
        }
    ]
}