{
    "title": "Digital Foundry: Senua's Saga: Hellblade 2 - DF Tech Review - The Next Level in Real-Time Visuals",
    "comments": [
        {
            "depth": 0,
            "author": "Im2oldForthisShitt",
            "body": "Their article:\n\n> Senua's Saga: Hellblade 2 is a defining moment in the evolution of real-time graphics\n\nhttps://www.eurogamer.net/digitalfoundry-2024-senuas-saga-hellblade-2-is-a-defining-moment-in-the-evolution-of-real-time-graphics",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ShadowRomeo",
            "body": "And the more impressive thing about it is that it runs surprisingly well on PC version, especially considering the very heavy system requirements that it had, but after seeing multiple benchmarks of it on internet, the game is running well on the likes of RTX 3070 on 1440p DLSS which is being able to do lock 60 FPS most of the time with mix of Medium - High - Max settings.\n\nKeep in mind that a RTX 3070 is a midrange GPU that is already reaching 4 years old and the fact it is being able to do 60 FPS on games like this at that graphics settings is just astounding TBH..\n\nAnd in my PC with a RTX 4070 Ti it runs well even at 4K, as the game is surprisingly vram efficient even at high resolution and the 4070 Ti just locks it at 4K 60 FPS with DLSS and mix of High of Max settings as well.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Herby20",
                    "body": "Ninja Theory is a really talented team with tons of experience. They are basically the textbook example of how, if a dev team takes the time to learn an engine, you can really push what people thought was possible while maintaining playability. There are way too many developers in today's industry who know how to make great games in every aspect *except* the refining of performance.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "we_are_sex_bobomb",
                    "body": "I thought for sure it would chew up my 3070 and spit it out, but it runs smooth as butter. I’m legitimately shocked.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SergeantPugsley",
                            "body": "I've only played one seshion of an hour or two so far but for me, the fps has dropped multiple times to 10 at certain places randomly. I was only able to fix it by fiddling with some settings until inevitably it dropped again, not sure why..\n\n3070 aswell.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AtsignAmpersat",
                    "body": "I’ve been running it on 1440p on a 2070s and getting like 40-50 fps. I didn’t even check my settings as I was happy with how it looked and ran right off the bat.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Goodbye_Galaxy",
                    "body": "I'm running it on a 1070 and even on low settings it's gorgeous.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GeekdomCentral",
            "body": "The whole game looks amazing, but the facial animations especially are out of this world. They’re so much more intricate and detailed than anything we’ve ever seen before",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aspiring_dev1",
            "body": "Coalition next Gears graphics rumoured to be off the charts. Looks like Xbox will hold two graphical powerhouses.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Barantis-Firamuur",
                    "body": "Three counting Playground Games.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DuckCleaning",
                            "body": "Fable is gonna be using the Forza engine, so it may or may not be a good graphical showcase.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Barantis-Firamuur",
                                    "body": "Judging by the graphical fidelity of all the games on the Forza engine, plus the fact that the trailer we saw last year was in-game, I would say it is a pretty safe bet that Fable will be a graphical showcase. It may or may not play well, since Playground has never made that type of game, but it will absolutely look good.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DuckCleaning",
                                            "body": "Im sure it'll look good. But whether it will be up there with the best of the best Unreal Engine 5 games remains to be seen.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "coldrolledpotmetal",
                                                    "body": "If they can make everything look anywhere near as good up close as the cars in Forza I’d be very happy",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JaguarOrdinary1570",
                    "body": "coalition's technical talent is top notch. microsoft is wasting it on an effectively dead IP.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ohfrickdude",
                            "body": "Even if you think Gears is a dead IP (it's not) the newest game in the franchise will do better than a completely new IP at this point in the Xbox lifespan.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BruhMoment763",
                                    "body": "New IP in general seems like a risky investment right now. It feels like people just want sequels and remakes more than ever.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "darkmacgf",
                                            "body": "People love new spins on old IP, like Palworld.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "JaguarOrdinary1570",
                                    "body": "I never said put them on a new IP. They should just be on one that's more relevant in 2024 than Gears, where new titles sell a fraction of what they used to.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "arex333",
                            "body": "I think they would generate a lot more excitement for the gears IP if they released a MCC style remaster of all the gears games before gears 6.\n\nAs someone who has never owned an Xbox, I'm interested in gears but several of the games aren't available on PC and I wouldn't want to just jump into the middle of the series.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "metalgearrrr",
                            "body": "Nah, Gears is awesome. Can’t wait to see the reveal in a couple weeks.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ManateeofSteel",
                    "body": "if only Coalition was put to work on basically anything other than Gears 😔",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mauri9998",
                            "body": "According to rumors they did, and then it was canceled",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FudgingEgo",
                    "body": "Lets wait and see Naughty Dogs first PS5 game.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Barantis-Firamuur",
                            "body": "What does Naughty Dog have to do with this conversation?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "TimeGoddess_",
                            "body": "They already made one, The last of us Part 1. It looks no where near this good. It doesn't even have RT lighting at all, in challenge areas like bills garage and leaving the sewer ir literally looks like a ps4 game because of the limits of rasterized real time lighting. This looks like an actual film",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "smithdog223",
                                    "body": "It looks like a PS4 game because it's built off the engine and assets of The Last of Us Part II which is a PS4 game, Naughty Dog's first proper PS5 game built from the ground up to utilise the power of PS5 will look much better than The Last of Us Part 1.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TimeGoddess_",
                                            "body": "It's still a PS5 only game built solely for the PS5 (and PC)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "smithdog223",
                                                    "body": "You're being disingenuous if you think the The Last of Us Part 1 couldn't run on a PS4, the only reason it wasn't released on the PS4 was to sell PS5s. My point is Naughty Dog's next game that takes advantage of the PS5's power fully without being built off a PS4 game will look much better than The Last of Us Part 1.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "kuroyume_cl",
                                    "body": "Don't forget it also runs like shit on PC.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AbusedPsyche",
            "body": "The game is gorgeous, but the whole time I was thinking this could be a movie. The only parts missing would be the basic combat and overly simple “puzzles”.\n\nNow that I type this can they actually release these as movies? 4k Dolby Vision and Atmos and all that. Would even let more people experience it at its full visual fidelity (and possibly better audio quality) vs an Xbox Series S or less powerful PC.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "GolfIsGood66",
                    "body": "They should but youcm can always just watch a full walkthrough I guess.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MISFU88",
            "body": "Finished the game already and really loved it. Had my girl play it, sat back and watched and this fucking game is just unreal. Every single second of the game is unbelievably good looking. But also, the game is fucked depressing to the point that my girlfriend dropped it right before getting out of the first area, because it was nonstop horror for her eyes, but especially her ears. This game is ugly in the sense, but extremely beautiful at the same time. Love this game, though they’ve not improved on anything but graphics since the first game, which is a HUGE missed opportunity.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Due_Engineering2284",
            "body": "This is hands down the best looking video game of all time. I have no idea how it got an 82 on metacritic, must be Xbox tax.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CJDistasio",
                    "body": "Graphics aren't the only criteria for a review. The first game has similar reviews and an 81 Metacritic rating with almost near identical negatives (combat, puzzles, etc.)",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Affectionate_Owl_619",
                    "body": "This dude seriously can't comprehend that there's more to game ratings than graphics and instead blames an \"xbox tax\" lmao",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Shiirooo",
                            "body": "nah he is right, there is also the nintendo buff: it gives you automatically +10pts in Metacritic (only works if Nintendo develops the game itself).",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fmal",
                                    "body": "Fucked up and duplicitous of Nintendo to make good games that people enjoy playing and rate highly.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TristheHolyBlade",
                                            "body": "Fucking shadow government out here making us play GOOD games smh",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Due_Engineering2284",
                                                    "body": "Lina Khan is mad that she lost the case on Microsoft's ABK deal so now she's pulling strings in the back.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Flowerstar1",
                            "body": "Game bad because gameplay is walking sim. Where open world, laundry list of side quests and 3rd person combat with talent trees?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "conquer69",
                    "body": "Because it's not much of a game. Even John says it in the video.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Imaybetoooldforthis",
                    "body": "Why are people making out that 82 is bad? \n\nI find it baffling. 82 is a really good score.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "millanstar",
                    "body": "Must be the sluggish gameplay that is somehow a step backwards from the last game...\n\nNice graphics and all but if is the only thing going for it for a short game then I might just be watching a movie instead...",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "smithdog223",
                    "body": "Hellblade 2 is a glorified tech demo for UE5, sure it looks good but it's lacking in other areas.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GolfIsGood66",
                            "body": "It's not lacking at all. It's pretty much perfect for the type of game it is.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "smithdog223",
                                    "body": "I feel like the combat especially could be more engaging.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GolfIsGood66",
                                            "body": "For me it's perfect for the game, I love how cinematic the fights are.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sturgeon01",
                    "body": "Probably because a lot of people who play games seem to strongly dislike cinematic experiences like this which don't focus on gameplay. \"Walking simulator\" is practically a bad word around here. Personally I love the idea of an interactive movie, and I feel that this one is the first with the graphical fidelity to really pull it off, but clearly that opinion is not shared by everyone.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ClearTacos",
                            "body": "I haven't played this, just read some reviews and watched a few videos, but by all means, gameplay wise this is a stagnation, according to some a regression compared to the first title. \n\nBigger issue though, from what I've watched, there are segments of minutes long walking that feature 0 challenge, no small things of any interest, lore or item or whatever, just staring at the screen and holding stick forward through predefined corridors, with nothing to pique your interest and interact with.\n\nTo me, that's not cinematic, or an interesting use of the medium - the interactivity doesn't seem to add anything over a movie.\n\nI don't hate games that try to do something interesting, but the execution here doesn't really fit my idea of using the medium well.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sturgeon01",
                                    "body": "Personally I got plenty of enjoyment from walking around admiring the incredibly detailed environments and flawless character animations. I'd also argue this section (I assume you're referring to the beach) serves a purpose in highlighting how run down Senua is. Her movement is sluggish and each obstacle that she encounters makes it clear that she is suffering from extreme pain and exhaustion.  Is it thrilling gameplay? No, but it certainly worked for me to set the mood and tone for what was to come. \n\nAll the other walking sections I can think of are either very short, or you're with other characters who are talking to you and giving you exposition.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "kingpin_dxb",
                            "body": "As a game, it's not good. I was impressed with the graphics for 3min but the start of the game has you limp for 30min. Refunded the game immediately.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "GolfIsGood66",
                            "body": "I agree, I loved it. Fantastic graphics, locations, voice acting and themes. The only thing I don't like are the puzzles. 9/10",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Due_Engineering2284",
                            "body": "It's really disappointed that critics are so biased. They should evaluate a game for what it is instead of giving it a bad score because they don't like that type of game. Goes to show why critics can't be trusted.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sturgeon01",
                                    "body": "I don't know that I'd extrapolate that critics can't be trusted from that. 81 is still a good score, and plenty of critics scored it higher than that. If this game didn't work for them as a cinematic experience, I don't think that means they are biased.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SDRPGLVR",
                                            "body": "Bias just has a negative connotation, but there is absolutely bias present in game reviews specifically because of genre/playstyle. But gamers get bent out of shape if a game they like gets a bad score. If you already own the game, does the score matter all that much? \n\nIf I reviewed a 4X game that was good, it'd get a good score. But I like 4X games. I *don't* like RTS games at all though, so if I had to review one for IGN or whatnot, I'd give it a bad score regardless of its quality as an RTS game as I just don't like them. My opinion of an RTS game really isn't very interesting, so why include it? I'd argue the only ones I should be reviewing are games like Total Warhammer because they're a combination of 4X and RTS. If you knew my preferences, you'd know I was coming at the review from the angle of someone getting their pickles in my peanut butter and just how palatable I find that. \n\nI've never really paid much mind to game reviews for this reason. I like reading the blurbs in the big review threads because I get a better sense of whether *I'd* like it from those quotes than I'd get from a simple 1-100 score. Those scores are just for dick-measuring. If my favorite game of the year gets a 60 on metacritic, it's no less my favorite game of the year.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BitingSatyr",
                                                    "body": ">so if I had to review one for IGN I’d give it a bad score\n\nIn that case that would be a failure of IGN to assign the review properly, and might indicate some foul play on the part of the editor if they had done it intentionally",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Mahelas",
                                    "body": "Ah yes, biased critics, that's why What Remains of Edith Finch got 89, Return of the Obra Dinn got 88 and Outer Wilds 85. They just hate walking simulators !",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "KingOPork",
                                    "body": "I'm half way though it now. Compared to the first game the graphics are a lot better. The gameplay got worse and it wasn't great in the first one. It's wonderful to look at, but playing the game itself feels like you're just going through the motions. It's like a great interactive tech demo you'd expect to get with the launch of a new console.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fmal",
                    "body": "You could probably read all the reviews that talk about all the shit that's wrong with it to find out lol.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Hotel_Coffee",
                    "body": "The entire time i was playing the game i was asking myself this question.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Maloonyy",
                    "body": "Because the gameplay is dogshit and the story mid.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Barantis-Firamuur",
                            "body": "I don't think you've actually played it, because you are incredibly wrong.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Falcs",
                                    "body": "I'm nearing the end of the game and the number of combat encounters is in the single digits. It's honestly a let down since this is coming from Ninja Theory of Ninja Gaiden and DmC heritage.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Maloonyy",
                                    "body": "Great theory buddy, making a statement I can't disprove.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "trenderkazz",
                    "body": "People want more than 5 hours of gameplay",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "conquer69",
                            "body": "5 hours of GAMEPLAY is more than enough as long as the gameplay is tight, interesting and innovative. Portal 1 was 2 hours long.\n\nNow if Portal 2 was also 2 hours long and didn't expand the gameplay in any way, it would have been negatively received.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Barantis-Firamuur",
                            "body": "They seemed fine with it for Miles Morales, though.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "smithdog223",
                                    "body": "Mile Morales is longer than 5 hours lol especially if you do the side content and also has engaging gameplay.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Barantis-Firamuur",
                                            "body": "Different people have differing opinions on what constitutes \"engaging gameplay.\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "smithdog223",
                                                    "body": "I agree but it's definitely more engaging than Hellblade 2 lol.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "returningtothefold",
                                    "body": "The difference is that in Miles Morales you do more things than walking.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Barantis-Firamuur",
                                            "body": "You seem incapable of grasping that there are different genres of games, with different styles of gameplay. One kind of game is not superior to another.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheOnly_Anti",
                                                    "body": "You were the one who brought up a different genre of game though. Just arguing to argue",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "returningtothefold",
                                                    "body": "Wow, I didn't realize that. Thank you for the explanation.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "trenderkazz",
                                    "body": "There was a shit ton more game in MM.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Dallywack3r",
                                    "body": "Miles Morales was 12-15 hours long. Literally twice the length of this.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CanofPandas",
                    "body": "first one was offensive to people with the mental illness they were trying to portray, yet they continued on their self righteous high horse and got so lost in the fidelity sauce they forgot they were making a game not a terrible interactive mini series that demonizes PTSD idiotically.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DanOfRivia",
                            "body": "You know they worked with people with psychosis and doctors to make the games, right? \n\nIf you think the game demonizes mental illness then you're exactly like the main antagonist of the game.\n\nYou're the typical person getting offended on behalf of a group than is not even offended in first place.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CanofPandas",
                                    "body": "Lmao yeah and many people I know including myself who suffer found it infantilizing and portrayed a narrative that Senua as a person with PTSD was dangerous and unreliable because of her suffering. It's a shitty angle to hammer in over two games.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DanOfRivia",
                                            "body": "Except she doesn't have PTSD? She have psychosis. You hadn't even touched the game don't you?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CanofPandas",
                                                    "body": "Psychosis is a symptom my man",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "AdditionalRemoveBit",
                                            "body": ">infantilizing and portrayed a narrative that Senua as a person with PTSD was dangerous and unreliable because of her suffering\n\nOne of the goals of the first game was reducing the misinformed stigma surrounding psychosis, and you reducing psychosis as some *ostentatious* form of PTSD is ironic.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Barantis-Firamuur",
                            "body": "The game isn't even about PTSD, lmfao. If you are going to be a hateful troll, at least get your facts right. They also developed the game in partnership with psychosis, and the overwhelming consensus is that they did an accurate and respectful job of representing psychosis.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LongLiveEileen",
            "body": "This tech demo showcasing what graphics the Xbox Series can achieve is so cool, wish they made a game out of it.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "blackmes489",
                    "body": "I think that’s the thing, you can’t right now. This is essentially an ‘on rails’ experience. Having game systems outside of line up your cursor with the screen and press either a or b to defeat the enemy would require for processing power and resources. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MASHED_POTATOES_MF",
            "body": "Man John writing off the poor image quality by saying it gives the game a \"soft, filmic look\" is pretty disappointing. It's so bad unless you have a PC and modify ini files which only partially fixes it and should not be necessary. Seems like he has allowed his excitement about new thIngs to override objective analysis in the last few vids he's made, feels like the least reliable person at DF",
            "score": -56,
            "replies": [
                {
                    "depth": 1,
                    "author": "busybialma",
                    "body": "Why not just take him at his word; that his vision isn't clouded, and he just likes the look?",
                    "score": 37
                },
                {
                    "depth": 1,
                    "author": "sturgeon01",
                    "body": "It's not like extremely sharp visuals with zero post-processing is some objective standard for a good image. The game is clearly going for an extremely specific aesthetic and mood and the visuals match that pretty well I'd say. Movies and TV add noise and post-processing to the image all the time for aesthetic purposes, why is that not allowed here? Sure, it could be argued those features should be toggles, but there's obviously an artistic vision here and all the post processing is a big part of that.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "pbesmoove",
                    "body": "Poor image quality? We must have played different games",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MASHED_POTATOES_MF",
                            "body": "They literally call out soft image quality in the video, they just spin it as a positive lol.\n\nAlso:\nhttps://www.reddit.com/r/hellblade/s/E9tN5HSysM\nhttps://www.reddit.com/r/hellblade/s/R5EarbJspg\nhttps://www.reddit.com/r/hellblade/s/PDKhYCTan4",
                            "score": -22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TimeGoddess_",
                                    "body": "Two of those are the same person, and They are playing at 1080p with Upscaling of course its going to be soft. Im a snob for image quality and I hate CA and blur and even to me nothing stood out as bad in terms of IQ playing at 4K DLSS quality mode high settings. Things looked pixel perfect crisp",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "XtMcRe",
                                    "body": "Remove Chromatic Aberration, Film Grain, Depth of Field and Motion Blur (via the Engine.INI file). Once you do that, the game looks absolutely incredible on PC. Again, this is only for the PC version. The console version will look like a blurry mess.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SDRPGLVR",
                                            "body": "Saving this for when I finally get to turn it on. Thanks!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Hotel_Coffee",
                    "body": "Best looking game I've ever played.",
                    "score": 24
                },
                {
                    "depth": 1,
                    "author": "blackmes489",
                    "body": "I agree, the new word for horrid TAA is ‘soft and filmic’ like they’ve never seen a movie in 4k.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "mixape1991",
                    "body": "Try it on PC then.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Substantial-Curve-51",
            "body": "ill take art direction and gameplay over graphics every time. this game will be grewatto watch on YouTube",
            "score": 1
        }
    ]
}