{
    "title": "Embracer cut ties with more than 4,500 employees and cancelled 80 projects over the past year",
    "comments": [
        {
            "depth": 0,
            "author": "GameHoard",
            "body": "I think if anything puts how crazy the Embracer buying spree was in perspective, it's this paired with the announcement of 70 projects set to release in the next 10 months. That's 150 in such a short amount of time. Reminds me of the Blumhouse method, just fund so many things at once and bank off the ones that actually find an audience, it just ain't panning out here.",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wild_Loose_Comma",
                    "body": "The Blumhouse method works partly because all the projects are really small (read: cheap) and they concentrate on the most profitable genre (horror). They also don't buy up a ton of smaller production companies that are all doing their own shit. If you look at the [list on wikipedia for the acquisitions Embracer made](https://en.wikipedia.org/wiki/List_of_mergers_and_acquisitions_by_Embracer_Group#cite_note-29), they bought up dozens, maybe up to a hundred companies. The two biggest being 1.2 Billion$ for Gearbox and 2.75 Billion€ for Asmodee with a bunch of smaller ones between 1-300 Million$. \n\nThe proper Blumhouse version would have been giving 2 or 3 dozen small studios somewhere between 1-10 million each to **publish** a smaller indie game over 1.5-3 years. If they develop great relationships with specific studios maybe scoop them up. But trying to buy 100 studios in 4 years and expecting anything but absolute chaos makes no sense.",
                    "score": 13
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ultimafatum",
            "body": "Thousands of people lost their jobs over the fact that Embracer claimed to have money they did not have when they went on an acquisition spree. How this isn't criminal is fucking beyond me. They have caused so much damage to an industry and people's livelyhood over nothing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tlor180",
            "body": "Don't forget they also saddled board game publisher asmodee with all of their debt and washed their hands of it.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Party_Helicopter_224",
                    "body": "They didnt washed their hands of anything. Thats not how debt works. They took out a loan with 1 company and paid all their debts with it to simplify things. Banks dont give loans that are unlikely to be paid back. They will just pay it back.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "-JimmyTheHand-",
                            "body": "Next time I have debt I'm just going to saddle someone else with it and wash my hands of it",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BitingSatyr",
                                    "body": "It’s not really “someone else” though, it’s a wholly-owned subsidiary",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "-JimmyTheHand-",
                                            "body": "Well if you move your debt to a company you own you haven't washed your hands of it.\n\nLike the other commenter said it's just consolidating debt.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}