{
    "title": "Warhammer 40,000: Space Marine 2 - PvP Multiplayer Gameplay Reveal Trailer | Skulls 2024",
    "comments": [
        {
            "depth": 0,
            "author": "Left4Bread2",
            "body": "Did not see a 6v6 mode coming. Super excited to try that out, I hope you can change your loyalist faction as well. I see a good variety of the CSM but the trailer (understandably) only focuses on Ultramarines unless I overlooked something. Would love to play as Dark Angels.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "xblood_raven",
                    "body": "There is Dark Angel at 1:26 in the PVE trailer. He has the hood look that the Dark Angels usually have (when he overheats his Plasma Pistol, you can see him much clearer).",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Left4Bread2",
                            "body": "Maybe it's the plasma lighting but I thought his armor still looked a little blue - but I think you might be right. At the very least tabards robes and plasma is enough for me to be happy cosmetically.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "xblood_raven",
                                    "body": "I found this [image online](https://cdn.wccftech.com/wp-content/uploads/2024/05/WCCFwarhammer40kspacemarine22.jpg). That's definitely the same guy in the trailer (there is a Dark Angel sniper at 1:11-1:12 the PVE trailer as well).\n\nIf the customisation is the same as it is was in Space Marine 1 in terms of colour, armour and all that, I'll be very happy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Left4Bread2",
                                            "body": "It's perfect, whew",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kellervo",
                    "body": "The coop trailer showed different loyalist marines, so I would expect to be able to use them in PvP, too.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BitingSatyr",
                    "body": "The first one had full color customization, it felt a lot like painting warhammer models",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "xblood_raven",
            "body": "Campaign, Horde and pvp multiplayer is great to see. Let's hope this can surpass the original (speaking of, why has the original never appeared on modern consoles?).",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "ECrimsonFury",
                    "body": "Yah hoping it can surpass the original as well...the trailer looks good probably pick it up and try it regardless.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Penakoto",
                    "body": "I really doubt the original would be that well received if it was released today, it ends with a QTE \"boss fight\" which is the most looked down on Gen 7 thing ever.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "JesusRice123",
            "body": "Man this is giving me such Gears of Wars vibes. Was “most likely” going to pick it up. Now i’m for sure getting it haha.",
            "score": 15
        }
    ]
}