{
    "title": "Space photo of the week: Warped 'hummingbird galaxy' guards a cosmic egg",
    "comments": [
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[Space photo of the week: Warped 'hummingbird galaxy' guards a cosmic egg](https://www.livescience.com/space/astronomy/space-photo-of-the-week-warped-hummingbird-galaxy-guards-a-cosmic-egg)\n\n\nHere we can see [a picture of colliding galaxies](https://cdn.mos.cms.futurecdn.net/hsXrp8Xs3dq8CVPo25KATK-1920-80.jpg), this one on the bottom NGC 2937 is definitely much older (oval and yellowish) and as such surrounded by thick coat of dark matter. It looks smaller but it's actually much heavier just thanks to invisible field of dark matter around it. The  NGC 2936 galaxy \"above\" it is younger (the pink clouds of molecular hydrogen are still forming in it) and being lightweight it collides and wraps around dark matter field of NGC 2937 galaxy at distance. Like if the old galaxy would be surrounded by a thick coat of invisible jelly or something similar.  \n\nThe visible matter separating effect of dark matter manifests itself just with [distinct color pattern of galaxies](http://i.imgur.com/UFsfUZb.jpg). The core of most of galaxies (including Milky Way) is formed with yellowish older mature stars of high metallicity, despite the concentration of interstellar gas is maximal there. These stars remain cold and yellow, because they're starving of interstellar gas which is kept hot with dark matter so that it can not gravitate into stars and power nuclear fusion there.\n\nWith compare to it, the galactic arms have blue color, which means, they're formed with hot short living and freshly formed stars. The extreme example of this paradox is the [Hoag's object](https://en.wikipedia.org/wiki/Hoag's_Object), which is probably merger of two galaxies of very different age. See also:\n\n[Dark Matter Can Interact With Itself, galaxy collisions show...](https://www.space.com/29115-dark-matter-interactions-galaxy-collisions.html)",
            "score": 3
        },
        {
            "depth": 0,
            "author": "superdude500",
            "body": "I think over the next 200 years us humans will figure out a way to go faster than the speed of light, or at least a way to get around the speed of light by creating wormholes or something like that. Man I wish I had been born in 2088 instead of 1988. I wish I could live in the future when humans are spreading out across the universe in spaceships.",
            "score": 2
        }
    ]
}