{
    "title": "University professor cancelled by students sets up a 'faculty for common sense' at rival institution to fight wokeness",
    "comments": [
        {
            "depth": 0,
            "author": "riufain",
            "body": "How is this science or technology related?",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "redpaladins",
                    "body": "I've noticed anything with \"truth\" or \"uncensored\" is a signal for right wingers that it's a safe space for them to do culture war stuff",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "successiseffort",
            "body": "The politically correct movement equates to the death rattle of the enlightenment movement. PC compliance requires a mind to deny objective reality and embrace ignorance or be denied existence.",
            "score": 84,
            "replies": [
                {
                    "depth": 1,
                    "author": "THEFLYINGSCOTSMAN415",
                    "body": "\"PC compliance requirements\" lol you're free to say whatever want.  No one is gonna lock you up.  But you aren't free from the consequences of your words.\n\nAnd I'd argue that the point of PC movement is to not let narrowminded folks decide what objective reality is.  \n\nI'll be the first to say PC shit can go way too far but everything you stated is just so backwards.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "successiseffort",
                            "body": ">And I'd argue that the point of PC movement is to not let narrowminded folks decide what objective reality is.\n\nThe point is to control speach.\n\n\n>say whatever want\n\nSo long as its approved language \n\n>But you aren't free from the consequences of your words.\n\nOr face the bolshevik lynch mob",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Forsaken_You1092",
                            "body": "Experiencing vindictive behaviors for saying something against groupthink is not a true \"consequence\".",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "InfernalGriffon",
                    "body": "\"PC Culture\" is 30 years old at this point. Can you explain how it's different from \"wokeness\" or is this just more old men yelling at kids to \"get off their lawn\".",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "successiseffort",
                            "body": "PC culture seeks to control speach for the sake of feelings. Concludes with everyone thinking you are a dick for being insensitive\n\nWoke is a form of activism. Typically the woke make up a mob when somone transgresses PC culture. Concludes with demanding your job and mostly peaceful celebrations",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "718Brooklyn",
                    "body": "Eh, it mentions at the end of this article that the guy quit because students found him offensive. It wasn’t an administrative thing. If young people aren’t responding to how you’re teaching, then you might want to consider that you’re just a crotchety old man who doesn’t like this generation or kids. It’s been this way since the beginning of time. Virtually every person in the US would be the most woke person in most places 100 years ago. My ‘far right’ mother in law certainly believes in women’s right to vote, work, go to college, wear whatever they want, marry whomever they want, have legal rights without a husband, credit cards for women, her son is gay and she loves him and doesn’t hide it, and yet she HATES the woke left. If this were 1923 she’d be the most woke person in Kansas by far , but today she’s a Trumper. The point is, it’s always been like this and always will be. Old people hate change. Trust me, I’m old. It’s hard. I have a teenager. But my parents thought the same shit when I was in middle school.",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mijaomao",
                            "body": "No, this generation has unfortunately been influenced by delusional idiots. What you've wrten is progress, what young people are doing is regression.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "718Brooklyn",
                                    "body": "What has regressed? I have a middle schooler who will defend every marginalized person in a way that seems crazy to me, but it’s because I’m in my 40s. I don’t relate to the way her generation looks at race and sexuality and gender.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mijaomao",
                                            "body": "Is such a fixation healthy for a young person? It seems like indoctrination. The regression happens w the cancellation of differing opinions. Many times has wokeness been called authoritarian, anybody that strays from the narrative gets a torrent of abuse. The confusing thing is that they say they stand for marginalised people and so on, which is not bad, the problem is the methods that they chose. Whenever you question them, you get called a rasist or transfobe, bc ofc they are antirasist by default, so then you must be rasist or whatever bad word, bc they are never wrong. A lot of the time it doesn't seem to be about the issues themselves, but about wielding power over others, cancellation is their favorite weapon. There was a podcast w a North Korean woman that studied at a American University, and she said the social presure to conform was just as bad at uni as in NK.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "718Brooklyn",
                                                    "body": "I honestly don’t know anyone who she’s cancelled, other than maybe Trump (this is NYC after all, he was cancelled way before it was trendy:) \n\nI agree there is often times an over aggression to what is often times people not understanding, people attempting to be funny, those of us who are just 30 years older than them and are now 10 years older than Homer Simpson is supposed to be. I hope I’m teaching my kid about rape in a way that any gender or any generation could agree with. I certainly don’t think false rape claims have ever been cool. I think the NK woman just maybe, maybe, was spouting North Korean propaganda. Go spend a few weeks there and tell me if you think it’s similar 😉",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mijaomao",
                                                            "body": "The NK woman is and American that escaped Nk, and as a free woman went to uni... Yoenmi Park. She's been on a few podcasts in recent years, very interesting woman.\n\nThe cancel culture is a problem, bc people have stopped listening to anything that goes against their logic (this used to be a right-wing thing), so all they are left w is their dogma. Things like gender is on a spectrum. Ask a biologist if that's true, they will laugh at you, but then they will be cancelled. Striving to find the truth has become problematic, even w simple things. \n\nToxic masculinity is another, it started off as a description of certain types of really bad behaviour, but then slowly ballooned out to describe men in general. Men should just act more like women... the consequences of that is that young men don't approach women any more, bc ofc they don't want to be toxic. There's a whole list of problems that come w this.\n\nThere's the one where men and woman are the same, their are no sex differences. I'm always stunned when this has to explained. I still don't understand why people are so offended if men and woman are different. \n\nHow exactly this shapes and will shape young people, I don't have first hand experience, but from what I hear it's not good. Probably bc a lot of people have to lie to themselves to fit in.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "THEFLYINGSCOTSMAN415",
                                    "body": "Boomers are still in control of government, big business, major institutions but somehow its young people regressing everything.  \n\nIt's baffling how your generation can simultaneously believe you've been the best thing to happen to this country, but also it's gone to shit under your watch and in the fault of the generation you raised. \n\nLmao it's sad.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mijaomao",
                                            "body": "I don't know what your talking about.",
                                            "score": -1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "successiseffort",
                            "body": "This has nothing to do with my comment",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Ecronwald",
                            "body": "There is a difference. Until now, actual progress was made. The woke ideology is to some extent regressing.\n\nThe woke has more in common with religious extremists, than with the average Joe.\n\nDraw a picture of the prophet, and watch what happens. Say biological sex is binary, and watch what happens. \n\nHypersensitivity is not a virtue.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "TypicalAnnual2918",
                            "body": "Pretty clear the students have mental illness problems.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Inner-Cockroach7075",
                                    "body": "\nWe are all centralists just divided. All humans have a uniting common sets of beliefs that we are separated from by indoctrination. Only the select few minority are split from the norm. There is a uniting force among humanity but the internet has fractured this divide giving the viewpoint of false radicalism where the radicals are actually few and far between. The only thing separating people truly is intelligence and ignorance where you can see intelligent people collect into similar places of higher wealth and less intelligent people collect into areas of lower wealth at least that is my viewpoint and my truth from real world experience.\n\nYes gen Z is mentally I’ll and causing a cultural shift backwards -this post was written by a gen Z in the flesh.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "triggered_discipline",
                    "body": "I mean, can you believe that we’re calling Catholics and Mormons Christian? Words have meaning, you can’t just change them because they “identify” as Christian. The woke mind virus has just gone too far.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "This was the dumbest, hyperbolic, totally unmoored from reality statement I've read all day. \n\nThe right wing grievance machine is out of control. The side that enthusiastically supports Trump, the worst thing for western democracy in our history, is so, so upset about identity politics, they're willing to tear down democracy and embrace core fascists principles, all while whining about cancel culture. \n\nThe right cancelled bud light. The right organizes and deploys politically motivated boycotts constantly. They always have. This whining over cancel culture just makes you look like an ill informed baboon. \n\nBut right the western enlightenment itself is at risk because of some over zealous progressives. But we aren't even going to discuss the far more concerning trends on the right. Brain broke bullshit. \n\nThe religious right has been forcing certain language and practices on us for ages. God, they want to strip abortion rights from people. But you're worried about people getting upset when you use the N word...",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "successiseffort",
                            "body": "TRUUUUUUUUMP!!!!!!!!\n\nDude nice rant",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "zaplayer20",
                    "body": "1+1= racism in Political Correct culture. Math, is racist, biology is sexist and homophobic, anatomy is all from above, sports is transphobic etc. It is sad to see that scientific proven stuff is being considered -ist/ -ic. \n\n&#x200B;\n\nMeanwhile mumbo jumbo pseudo science is considered facts.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "dumineitor",
                    "body": "Hilarious comment",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "sexyshortie123",
                    "body": "Interesting.",
                    "score": -6
                },
                {
                    "depth": 1,
                    "author": "Effective_Pack8265",
                    "body": "600 years of enlightenment done in by political correctness…",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "This is the way.",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dumpietheclown",
                    "body": "...to get cancelled again",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "paintfactory5",
                            "body": "That’s going to start losing meaning real soon, the way it’s being thrown around.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sewkzz",
                                    "body": "Just like the word \"woke\"",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mastermide77",
            "body": "That entire article, all those words. Just to say absolutely nothing lol. Just another conservative who said some shit that got him in trouble (not even that much btw he's the one who quit), and is now trying to be another Jordan Peterson",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "SupaHardLumpyNutz",
                    "body": "It’s a legit business model.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "THEFLYINGSCOTSMAN415",
                    "body": "Gotta lean in now",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "ahern667",
                    "body": "If one even refers to “woke” in their daily vocabulary non-ironically, common sense was not there for them to begin with.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "CorHydrae8",
                    "body": "This basically boils down to \"waugh, waugh, people dare criticize me for the things I'm saying. There is no open debate or free speech anymore!\"",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "sexyshortie123",
                    "body": "I hate Jordan Peterson but he has legit mental health issues and is being abused by the Republicans.  I'm trans and he hates me but I can put my hand out there for that. This guy is just a bigot.",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TwistedBrother",
                            "body": "I dunno, have a look at his latest talks. He’s just back to being an asshole.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sexyshortie123",
                                    "body": "That's after he had a breakdown and the Republicans got him.  But every talk he has ever boils down to either that's what lobsters did with a massive reach.  Which then boils down to God.  Everything he says.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": ">I'm trans \n\nL, go cry somewhere",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "freestyla2077",
                                    "body": "You shouldn’t project. Most people aren’t as miserable as you",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "sexyshortie123",
                                    "body": "Crying huh?  I was putting context onto my question.  Don't need your whiney broke ass near me.  Now shush go away",
                                    "score": -1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "phucyu142",
                            "body": ">  I'm trans and he hates me\n\nWhere does Jordan say he hates you?",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sexyshortie123",
                                    "body": "Lmao",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "phucyu142",
                                            "body": "Ok, so Jordan never said he hated you.\n\nI had a feeling you were lying.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "sexyshortie123",
                                                    "body": "Interesting",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "phucyu142",
                                                            "body": "What's interesting?  That you're a liar?",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "sexyshortie123",
                                                                    "body": "Lmao read your comments you are 12",
                                                                    "score": 0
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "sexyshortie123",
                                                                    "body": "Lol no.  Maybe you should read context of a sentence?  What are you 12?  Cause at this point you sound like you are 11....",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "phucyu142",
                                                                            "body": "Interesting",
                                                                            "score": 7
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "robotmonkey2099",
                                                    "body": "https://www.newsweek.com/elliot-page-tweet-jordan-peterson-banned-twitter-pride-sin-1720899\n\nhttps://www.newsweek.com/jordan-peterson-slammed-implying-he-avoids-trans-nonbinary-people-1782603",
                                                    "score": -2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "kpatsart",
                                    "body": "https://www.newsweek.com/transgender-jordan-peterson-trans-women-men-1810519\n\nWhile not directly saying the word \"hate,\" he is definitely not ok with transgendered people co-existing with other people. He fears global depopulation in an overpopulated world. Like what?! He believes in the institution of marriage without grasping the level of divorce rates on a global scale. Has a weird/great replacement theory type of take on language and identity as well:\n\nhttps://beta.ctvnews.ca/national/politics/2022/5/18/1_5910090.amp.html\n\nAll in all, he despises more people than he likes. He's also a millionaire post teaching because he knew he could turn himself into a business. He also needs to dive further into the far right narrative to keep his audience and money rolling in. He's not a businessman he's a buisness....mannnn.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "phucyu142",
                                            "body": "All I see is gaslighting from you.  \n\nNowhere in that article has quotes from Jordan as saying he hates trans people.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LikeThePenis",
                                                    "body": "Is it possible to infer that someone hates you without them saying the words, “ I hate you”?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Most_Image_1393",
                                                            "body": "Not with a high degree of accuracy. Mind-reading is notoriously difficult.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "freestyla2077",
                                                                    "body": "Who said anything about mind reading? His actions towards trans people make it blatant.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Most_Image_1393",
                                                                            "body": "\"hate\" is a feeling, albeit a pretty vaguely-defined feeling. It's not clear, besides killing someone out of anger or saying mean slurs at people, or saying explicitly that you hate them, what behaviours express \"hate.\"",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "freestyla2077",
                                                                                    "body": "It really isn’t that difficult to infer from his words and actions towards trans people that he hates them.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Most_Image_1393",
                                                                                            "body": "Yea for leftists it's not difficult. But for people with some shred of intellectual curiosity and ability to critically think (the antithesis to leftist \"thought\") it's not clear at all beyond baseless mind reading.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "FakeLoveLife",
                                                                                                    "body": ">But for people with some shred of intellectual curiosity and ability to critically think (the antithesis to leftist \"thought\") it's not clear at all beyond baseless mind reading.\n\nfor people WITHOUT an ability to critically think its hard to read between the lines\\*",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "phucyu142",
                                                            "body": "Yes",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "robotmonkey2099",
                                                    "body": "Canadian clinical psychologist Jordan Peterson has claimed on Joe Rogan’s podcast that being transgender is a result of a “contagion” and similar to “satanic ritual abuse.”\n\nhttps://nypost.com/2022/01/27/joe-rogan-guest-jordan-peterson-says-being-trans-is-a-contagion/",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "phucyu142",
                                                            "body": "That quote was probably taken out of context.  Without knowing what the broad scope of the conversation was, then that quote doesn't mean shit.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "robotmonkey2099",
                                                                    "body": "Yah of course you wouldn’t care \n\nHis feelings about trans people seem pretty clear from his words and actions. You’re just refusing to admit it.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TheManWithThreePlans",
                                                                            "body": "The rise in people identifying as trans, especially young girls undergoing puberty, may point to it being in part due to social contagion.\n\nThere's been no research that I know of into this rise, but the NHS performed a rapid pull back in their gender affirming care model in order to allow research to be conducted to make sense of the rapid rise.  Are there just that many more trans people than initially expected, or are people that aren't trans shopping around until they get a diagnosis to receive care?  \n\nPeterson has a fixation on blaming society's impending collapse on one thing.  Usually it's \"post-modernism\".  He raises valid points, but the arguments are typically shallow or just bad faith.\n\nI believe it's a sore spot for him, since he was initially \"cancelled\" (very broad definition of this, since he's financially doing better than ever) for misgendering someone.  \n\nIt's likely that he's a bit transphobic, but he's a hardline Christian tradcon.  People shouldn't expect him to have the most liberal opinions when it comes to the LGBTQ+ community to begin with.  \n\nAbsorb what's useful and true and discard what isn't.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "robotmonkey2099",
                                                                                    "body": "I’d rather not absorb anything else from middle class Christian’s. I’ve had enough of their bs. I don’t need some big headed blow hard to tell me to clean my room, there are much better teachers out there.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "TheManWithThreePlans",
                                                                                            "body": "That's fair.  I prefer not to filter out any voices, since they may say something useful.\n\nBut if somebody is fairly regularly going after your existence, I can understand.\n\nI think Peterson was more useful when he first started making a name for himself.  Ever since he got off the benzos, dude's been making increasingly bold claims based on research that hasn't been replicated or even conducted, using his credentials as a shield.  Then he's confused as to why his university is requiring him to attend social media training or face a complaint against his license.  As if he isn't a direct representative of their institution.\n\nIf I were to make wild public claims in my field of expertise, but the quality of the information was dubious at best, my company would just tell me not to come into work in the future.",
                                                                                            "score": 2
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "phucyu142",
                                                                            "body": "I'm not refusing to admit anything.  \n\nName another person who implied hate but didn't say it outright.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "hydrocarbonsRus",
                                                                                    "body": "Oh shut the fuck up you pathetic little political copy cat. Stop pretending like you’re playing some political game of choosing words. You live a sad pathetic life and you take your hate out on trans folks and others demonized by the media you consume. \n\n\nYou aren’t an intelligent person but you are over confident- that’s pretty gross",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "phucyu142",
                                                                                            "body": "Lol, you mad?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "hydrocarbonsRus",
                                                                                                    "body": "Disgusted yup",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "phucyu142",
                                                                                                            "body": "Ok, stay mad",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "hydrocarbonsRus",
                                                                                                                    "body": "Not mad, but mad disappointed in the person your parents clearly failed to raise well",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "phucyu142",
                                                                                                                            "body": "Stay mad",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "hydrocarbonsRus",
                                                                                                                                    "body": "Stay sad",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "phucyu142",
                                                                                                                                            "body": "ok angry guy",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "hydrocarbonsRus",
                                                                                                                                                    "body": "Angry but not lost",
                                                                                                                                                    "score": 1
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "robotmonkey2099",
                                                                                    "body": "So you’ll only accept it if he’s said straight up “I hate trans people”? What a ridiculous thing to argue. You’re not here to argue in good faith so I’m not wasting anymore of my time",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "phucyu142",
                                                                                            "body": "How come you didn't answer my question?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "robotmonkey2099",
                                                                                                    "body": "How about the biggest asshole of all? Can you find a quote of Hitler saying “I hate Jews”?",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Rupdy71",
                                                                                    "body": "Did Hitler say the words \"I hate Jews\"?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "phucyu142",
                                                                                            "body": "Probably",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Rupdy71",
                                                                                                    "body": "Agreed, probably the same for Peterson.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "phucyu142",
                                                                                                            "body": "News and communication were much different during Hitler's time so you can't compare the two.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "robotmonkey2099",
                                                                                            "body": "I said the same thing but dude wouldn’t answer lol",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "hydrocarbonsRus",
                                                    "body": "So he has to say “I hate trans” for you to shut the fuck up?\n\nEver heard of inference? Sounds like you’re nothing more than a hateful little cuck",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "phucyu142",
                                                            "body": ">Sounds like you’re nothing more than a hateful little cuck\n\nLook in the mirror",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "hydrocarbonsRus",
                                                                    "body": "Shut the fuck up. No compassion or kindness for evil fucks anymore",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "phucyu142",
                                                                            "body": "You're the one spewing hate",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "hydrocarbonsRus",
                                                                                    "body": "Spewing facts my dude, straight facts",
                                                                                    "score": -3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "phucyu142",
                                                                                            "body": "You were spewing spiteful hate",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "hydrocarbonsRus",
                                                                                                    "body": "Gaslighting is the name of the pathetic game",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "phucyu142",
                                                                                                            "body": "You're pathetic",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "hydrocarbonsRus",
                                                                                                                    "body": "You’re so original too",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "phucyu142",
                                                                                                                            "body": "You're so pathetic",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MalevolentIsopod23",
            "body": "Surprising, isn’t it, how many “question what you’ve been told” people are politically and economically conservative? \n\nIt’s almost like rebellions that are neutral or supportive of the people in power are tolerated because they are harmless, but any ideas that threaten our rulers are silenced.  \n\nIf the Daily Mail supports you, or the other way round, you’re not a rebel.  You’re being told you’re a rebel so you don’t, you know, rebel.  \n\nBut hey - that Epstein vaccine alien transgender lobby, am I right?",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Tradtrade",
            "body": "I’m being deplatformed cries man on national msm platform",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "HesNot_TheMessiah",
                    "body": "Exactly. No one has been cancelled or deplatformed for decades. Not black people, not women, not gay people, not trans people.\n\nRight?\n\nAfter all you see them on tv all the time. They write books. They're in the media. Therefore none of them have been deplatformed or cancelled.\n\nIf we're being consistent.....\n\nOr perhaps it's a little bit more complex than you're making out.....",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LikeThePenis",
                            "body": "Has this specific man in the article been cancelled? Is so, how?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HesNot_TheMessiah",
                                    "body": "I mean.... you could just read the article if you want to know about the man in the article.\n\n> The move follows what he believes to be a five year campaign to oust him from Birkbeck for his right-leaning views on ethnicity, national identity, left wing ideology and religion. He quit at the end of August following a 20-year-career.\n\n>  'I was cancelled by 1,000 cuts. Academia should be about the advancement of knowledge but you're not allowed to advance theories which go against the progressive narrative. If you have a different viewpoint, you're in the crosshairs.\n\n> 'The climate at British universities has worsened because morally absolutist, often younger, illiberal progressives are using pressure, public reputational attacks and social media to limit academic freedom.\n\n> 'You've got to be in line with the orthodoxy, you can't deviate from dogma. It's an Orwellian threat to the enlightenment - free speech, equal treatment, due process, objective scientific truth.\n\n> He has faced:\n\n>  Social media pile ons, on Twitter, now X, organised by hostile students\n\n> An open letter to the Master of Birkbeck denouncing him and calling for him to be fired 'for his defence of white identity politics and his countless attacks against Black Lives Matter and other activists and scholars of colour on social media'\n\n>  Denunciations from a junior colleague who resigned because of the 'impact on Birkbeck staff and students of being in such close proximity to his [Professor Kaufmann's] far right followers' dragging him into an embarrassing media storm\n\n> A number of hostile student course evaluations and letters, which he believes were a coordinated attack, resulting in three damaging internal inquiries\n\nSo kind of similar in a way to how Elen de Generes had her show cancelled when she came out. All it is is people applying pressure. You might think it's ok. I think it's kind of scummy behaviour. Disagree with people by all means but let them live their lives.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LikeThePenis",
                                            "body": "There was a five year campaign to oust him, but he wasn’t ousted until he resigned on his own? His students gave him negative evaluations and he pulls the principal Skinner, “no it’s the children who are wrong.” Saying it’s a coordinated effort against him. He’s such an asshole that a colleague quit rather than be associated with him, and he still got to keep his job even though he’s driving off other professors. It’s not like how Ellen’s show got canceled because he kept his job and his classes weren’t canceled.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HesNot_TheMessiah",
                                                    "body": "Lol! You've never met him. You have no idea what his views are or what he's even said but you think he's an \"asshole\" because other people who you have also never met have accused him of... something (but you're not quite sure what that is).\n\nOh yeah. \n\nCancel culture does not exist.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LikeThePenis",
                                                            "body": "You haven’t met him either have you? Have you met his students giving bad reviews or the colleague that resigned? All either of us have is a shitty Daily Mail article so if you’re going to jump on me about jumping to conclusions, maybe you should do the same.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HesNot_TheMessiah",
                                                                    "body": "The difference is I'm not passing judgement on him.\n\nYou are.\n\nBased on what? \n\nYou don't know.",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "eatsh_it",
                                                                    "body": "I believe a teacher needs to be objective about matters of debate, and keep a tone of emotional intelligence.  That this article does not tell us exactly what this person said about or against \"ethnic diversity\", for example, shows it is biased and more of a puff piece than an example of objective journalism, ironically.  \n\nThe right did not invent freedom of speech, they merely co opted it.   What the hell is a \"liberal conservative\" anyway?  Sounds like someone that I would like to smack in the face already.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "hiroshimaokonokiyaki",
            "body": "That professor is the biggest snowflake I have ever heard of.  He gets negative evaluations from students and some colleagues avoid him so he says he is being \"canceled\".  No, dude, people just don't like you.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "CrimsonBolt33",
                    "body": "Exactly, its your typical nonsense grift.\n\n&#x200B;\n\nFor anyone who thinks it's real...please define \"woke\" and \"wokeness\"",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Striking-Pipe2808",
                            "body": "The belief that all disparities in outcome are due to discrimination.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Mountain-5734",
                            "body": "in educational  contexts i it's where the purple haired DEI  clowns run the show.   reality and  logic is replaced by insane far left ideological  nonsense.    they claim it's about equality but really, certain groups get preferential treatment while others  are guilty of perceived  infractions just based on gender or skin color .",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Dasmahkitteh",
                            "body": "A trait characterizing something which insists on social justice and political correctness at the expense of quality, merit, or functionality in an ends-justify-the-means kind of way\n\nI won't ask you to define woman in return because you'll just gaslight. But there's your definition to pick apart, any more brain busters?",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CrimsonBolt33",
                                    "body": "That's not the definition though you moron...That's the made up definition that the right thinks it is.\n\nAlso last time I checked it wasn't \"woke\" people banning books and taking away people's rights and generally being anti human so it's weird that you talk about woke people forcing things on people.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dasmahkitteh",
                                            "body": "Lol you just didn't like the definition because it ends your whole \"this nebulous term is hard to define therefore the criticism is invalid somehow\" game. Remember: you asked what our definition was.\n\nAlso, if that's wrong somehow, please correct it. My definition is how it is used in common parlance. If I forgot part of the meaning, by all means complete it. Lmao",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CrimsonBolt33",
                                                    "body": "The actual definition is below\n\n&#x200B;\n\nwoke  \nverb  \na simple past tense of wake.   \nadjective  \nhaving or marked by an active awareness of systemic injustices and prejudices, especially those involving the treatment of ethnic, racial, or sexual minorities: In light of incidents of police brutality, it’s important to stay woke.He took one African American history class and now he thinks he’s woke.This generation of kids is trying to make woke choices in life.  \n**Disparaging. as used by political opponents, of or relating to a liberal progressive orthodoxy.**\n\n&#x200B;\n\nYou might be surprised but your fellow right wingers have many many different meanings for the term...even the dictionary can't define it as you use it other than  the fact that it is used as a dispariging remark.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Dasmahkitteh",
                                                            "body": "That's synonymous with my definition. It prioritizes those mislead virtues (social justice, or \"injustices\") at the expense of other priorities. It's also a derogatory term like it mentioned, I forgot that part but I agree. This definition is basically mine except it adds that it's \"important to stay woke\" lol, which is a clue of what kind of bias the writer has. But yeah I agree, this definition is the maximum soft version of mine but they get at the same points\n\nHow is this a gotcha again?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "CrimsonBolt33",
                                                                    "body": "It's not synonymous...its an insult you apply whenever or wherever you want on someone or something you don't like.\n\n&#x200B;\n\nThe first (actual) definition is an internal thing...you are or are not woke...it's not something you put on other people. Notice how all the examples it gives are related to an individual, not something anyone is doing to anyone else.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Dasmahkitteh",
                                                                            "body": "You don't get to tell other people what their own definitions of words are lol. I read the one you provided and I agree with it. That's what it means. Again how is this a gotcha?\n\nAnd even if it were impossible to define, do you think that invalidates the criticism somehow? Mind explaining how that works?",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TendieTrades69",
                                            "body": "You mean banning porn books from elementary school libraries? The books that parents would read excerpts from in school board meetings, full of only adults, and the parents would get shamed and kicked out for reading such vulgar stuff in public. They want that same book to be available to your 4th grade child in the school library. \n\nWho's \"rights\" are they taking away?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CrimsonBolt33",
                                                    "body": "Man you really are dense...giving children porn is a crime\n\n&#x200B;\n\nIf it was ACTUAL porn...people would be in jail.\n\n&#x200B;\n\nAlso you have any proof of any claims you are making? Can you name any books that contain \"porn\"? do you even know what sort of books are beingh banned? Do you even have kids?",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Eldetorre",
                                    "body": "What a joke. You presume Social justice comes at the expense of quality or merit without proof that it does.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dasmahkitteh",
                                            "body": "Does prioritizing one thing necessarily take resources, effort, and focus from other priorities? Or can we have multiple top priorities like Dwight schrute",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Eldetorre",
                                                    "body": "The false premise is that one comes at the expense of the other. Social justice helps the other priorities.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Dasmahkitteh",
                                                            "body": "I'm sorry that's just not how anything works. Also you'd need a source to say that, since you demand one of me\n\nPrioritizing something new does take from the previous priorities. There's no way around that and you haven't attempted even to explain your response to that point, you just keep repeating that it doesn't, so I'm not going in circles anymore\n\n> what's your top priority?\n\n> I have SEVEN. \n\nThat's a joke a writer wrote thinking it was so ridiculous on its face that most people would laugh at it, realizing it's a joke. You're here saying that in a literal sense, totally serious and not as a joke",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "mathruinedmylife",
                                            "body": "https://www.cbc.ca/news/canada/prince-edward-island/pei-tyler-desroches-women-paramedics-1.6987117\n\na member of parliament got dropped for commenting that after targeting female paramedics and firemen, there’s been a significant increase in “lift assists”\n\nyes, social justice comes at the expense of quality or merit",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Eldetorre",
                                                    "body": "Linking to an article you didn't read. The member of parliament said he was wrong. His info was wrong.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mathruinedmylife",
                                                            "body": "i read it and he’s not wrong. he backpedaled after the idiot mob came after him for stating the obvious.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Eldetorre",
                                                                    "body": "But it simply wasn't true.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "mathruinedmylife",
                                                                            "body": "he was speaking from his own experience. sure, we’d like it to not be true, of course\n\n> \"I just notice a lot more females in the profession now and we get a lot of calls for lift assist because — don't get me wrong, they're great, some of the women that are doing it are unbelievable — but I went to a lift assist the other day because both the females that were working the bus were 105 pounds and the man was 300 pounds and there was no way they were going to get him up.\"",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Eldetorre",
                                                                                    "body": "His own limited experience of hearsay",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "mathruinedmylife",
                                                                                            "body": "> \"I just notice a lot more females in the profession now and we get a lot of calls for lift assist because — don't get me wrong, they're great, some of the women that are doing it are unbelievable — but I went to a lift assist the other day because both the females that were working the bus were 105 pounds and the man was 300 pounds and there was no way they were going to get him up.\"\n\ncome on man… again, yeah, we’d like it not to be true cuz it feels nicer but we’re victims of circumstance from billions of years of evolutionary biology. there’s nothing wrong with these women. they’re just human and can’t lift as much weight.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Eldetorre",
                                                                                                    "body": "That was outright bullshit. The standards had not been lowered.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "mathruinedmylife",
                                                                                                            "body": "we’re talking about the outcomes here which, from his experience, have diminished as a result of adding too many women. it also tracks with our biology so it’s not that hard to believe",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Eldetorre",
                                                                                                                    "body": "They have to meet the same standards. Furthermore biologically women have better stamina than men.",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Seditional",
                                    "body": "That was a really good definition. The only problem is that there is not a concrete answer to that question and everyone makes up their own definition. Excessive encroachment on individual rights. Woke. Losing contracts because your accused of rampant sexual assault? Also woke. Therein lies the problem.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "kutkun",
                            "body": "What’s your definition?\n\nSince you think people should provide a definition.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "seamusmcduffs",
                                    "body": "The problem is that there isn't one. The definition is \"anything I dont like\"",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CarBombtheDestroyer",
                                            "body": "I settled on, at least from the people who use that word directed at “the left”, it means unable to see basic logic over their cause, unyielding self righteousness while being ignorant to other opinions and discussion. This is generally what I think a person is trying to express when using this word weather they are right or not is another matter.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "GHOST_OF_THE_GODDESS",
                                                    "body": "Nah, people who use the word 'woke' as an insult are basically asleep at the wheel. You will just accept whatever \"facts\" are handed to you, never use any critical thinking skills or look into anything further (unless it's your favorite Facebook or YouTube propagandist, of course). Your brain is asleep.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CarBombtheDestroyer",
                                                            "body": "Ya that’s just not accurate at all and you just fit my description perfectly. This is probably around half the population you are talking about and the way you’re talking about them describes exactly what you’re doing right now. Someone said that to you once and you just accepted that as facts, never put a though into it, never questioned it, asleep at the wheel as you say. Now, would this lead me to say every woke person is asleep at the wheel? No that would make me dumb and ignorant.",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "seamusmcduffs",
                                                    "body": "Sure, it might be one valid definition,  but it's pretty useless when in popular right wing media it's being use to describe things like having black mermaids,  having barbie feel empowered, and having more than two genders in your video game. \n\nThere are real and accurate definitions to the word,  they just aren't being used",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "define woman",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DovaDit",
                    "body": "Also, he quit the job , no one fired him, his speech was protected by law",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Strong_Bumblebee5495",
                    "body": "You are minimizing from my perspective, I’m guessing that you have never been the subject of an investigation by your employer Hiroshimaokonokiyaki",
                    "score": -15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mastermide77",
                            "body": "Most people don't tend to say racist shit over and over again",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MrOaiki",
                    "body": "What is his take?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tripdoctor",
            "body": "What a thin-skinned bitch",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Musicferret",
            "body": "What a piece of crap.  Stop whining, treat everyone kindly, and consider therapy.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[University professor cancelled by students sets up a 'faculty for common sense' at rival institution to fight wokeness](https://www.dailymail.co.uk/news/article-12582107/University-professor-cancelled-students-sets-faculty-common-sense-rival-institution-fight-wokeness.html)\n\n*[Professor Eric Kaufmann](https://en.wikipedia.org/wiki/Eric_Kaufmann) is launching war on woke at University of Buckingham*\n\nA bit too late, one would say...;-) The problem is, many professors and Academicians collaborate with trend under silent hope, they will be sparred or even they could somehow profit on it - until they realize, they became its victims too. For instance they hire immigrants with [compliance with mobility action ](http://ec.europa.eu/research/participants/portal/doc/call/h2020/h2020-msca-itn-2015/1622613-itn_2015_-_guide_for_applicants_v1_en.pdf) under belief, they'll get cheap labour force which will not compete their tenured positions. See also:\n\n* [University professor cancelled by students sets up a 'faculty for common sense' to fight wokeness](https://www.dailymail.co.uk/news/article-12582107/University-professor-cancelled-students-sets-faculty-common-sense-rival-institution-fight-wokeness.html)\n* [Simon Evans, Paul Cox and Nick Dixon discuss a story from The Daily Mail.](https://www.youtube.com/watch?v=CkxQwgGeK5M)",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Effective_Pack8265",
                    "body": "Wow. This dude’s had it rough…",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kithyen",
            "body": "Lol dude wasn’t cancelled, he quit. Boohooboobhoo nobody likes me because I’m an insufferable jerk. Woe is me.\n\nAlso the people comparing this to Ellen getting cancelled because she came out as Gay? Thank you for that laugh. Not even remotely in the same ballpark. \n\nYou should have compared it to when people told Ellen to F*** off when it was revealed she was completely out of touch and a complete ass to her staff.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "kpatsart",
            "body": "So he's trying to be the British Jordan Peterson? 🤣 Weird move, let's see how it plays out for him.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "HesNot_TheMessiah",
                    "body": "Lol! He is Canadian.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kpatsart",
                            "body": "Oh shit, so he's literally trying to be Jordan Peterson lite.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "oceaniscalling",
            "body": "What I can’t understand about PC/Woke culture is how much they embrace tribalism over universalism.\n\nTo this article, his opponents aren’t left wing, they’re posing as left wing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Short-Acanthisitta24",
            "body": "Good",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GHOST_OF_THE_GODDESS",
            "body": "Imagine being in education and actually using a term like \"wokeness\" as a bad thing. He can fuck right off.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueLanternSupes",
            "body": "What a bitch.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HotNubsOfSteel",
            "body": "All because he couldn’t just say the n word. Smh",
            "score": 0
        },
        {
            "depth": 0,
            "author": "BeeNo3492",
            "body": "Good on him... maybe don't?",
            "score": -3
        },
        {
            "depth": 0,
            "author": "starwalkerz",
            "body": "I like laïcité.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "JCSterlace",
            "body": "Why are his statements all in the second person? It sounds so unprofessional.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "51674",
            "body": "thats awesome lol good for him",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "What a shame. Common sense is one of my morals and is severely lacking these days.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Amen",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Travellinoz",
            "body": ".... Science",
            "score": 1
        }
    ]
}