{
    "title": "New engineered bacteria could destroy plastics in seawater",
    "comments": [
        {
            "depth": 0,
            "author": "ColemanV",
            "body": "I'm pretty sure there was a novel or movie with the background story where something like this ate up every plastic after the seas were plastic-free and society collapsed given how much our everyday life is reliant on plastics.",
            "score": 84,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gravelsack",
                    "body": "It's the end of The Andromeda Strain. The disease mutates and starts digesting plastic. Although they just kind of leave off with a manned spacecraft breaking up in midair as all the plastic degrades.",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Killercod1",
                            "body": "Maybe it evolves into a flesh eating bacteria since our skin is in contact with plastic all the time. There's also microplastics everywhere, including the air.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gravelsack",
                                    "body": "You'd have to ask Michael Crichton",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Gravelsack",
                                                    "body": "Technically it's too late",
                                                    "score": 8
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "XeLLoTAth777",
                                    "body": "Yay, blood cleaners!",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Rechuchatumare",
                            "body": "i think is the book adaptation of mad max.. the bacteria eats plastic, then when plastic is gone start to eat petroleum and derivations",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "It mutated on Earth to digest plastics but was still a lethal microorganism.   The vulnerability was alkaline water like in the ocean where the cloud was disbursed using artificial rain.\n\nWhat they did not consider:  organisms adapt!  Oceans evaporate and form clouds that rain on land.\n\nResult:  all plastics will be rotting and destroyed like car fiberglass, cheap housing exteriors like siding, iPhones. Computers, medical device technology, etc.\n\nOooo… apocalypse by plastic destruction!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "stridernfs",
                                    "body": "Honestly would prefer this over the mainstream plan of just continuously pumping out plastic everywhere.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Lishio420",
                    "body": "Its kinda the backstory of the video game \"Stray\" as well",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Unhappy_Flounder7323",
                    "body": "I saw this movie before, it will mutate and start destroying fossil fuels. \n\nYay. lol",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ColemanV",
                            "body": "\"Yay\" I suppose xD\n\nImagine a world where first everything plastic starts to fail and disappear.\n\nLike non-rubber gaskets, certain containers holding virus samples, all the seals and vial-plugs that meant to contain them, and hazmat suits, all the sterile gloves and filters.\n\nAlso how many industries we have where without seals that contain plastics things would go boom?\n\nI think after a couple dozen nuclear reactor failures across the globe, and various industrial failures with consequences the fossil fuels related issues would be our smallest problem :P",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "Rechuchatumare",
                            "body": "i think i read it from mad max book adaptation or comics adaptation..",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BOW57",
                    "body": "Aplasticopalypse. I can't wait!",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "destroyer1134",
                    "body": "Or it starts eating is from all the microplastics in our bodies.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NOBOOTSFORYOU",
                            "body": "Maybe if we eat the bacteria it will allow us to digest plastic.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gullible_Bar_9165",
                                    "body": "Mmmmmm, plastic…",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "raistlin49",
                                            "body": "Maybe they can make fruit flavored plastics for us to eat?",
                                            "score": 6
                                        },
                                        {
                                            "depth": 4,
                                            "author": "XeLLoTAth777",
                                            "body": "I too enjoyed Crimes of the Future.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Javanaut018",
                    "body": "That was my first thought: What could possibly go wrong?",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Green__lightning",
                    "body": "Exactly, and what would it take to make a plastic which won't be eaten until it undergoes some other process, then it can be? Until it can do that, this stuff should be kept in a very big vat somewhere that we throw all the plastic in ourselves.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Accurate_Summer_1761",
                    "body": "America almost did this a long ass time ago to. I belive it would have turned the soil to an alcoholics dream if I recall.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HopefulBackground448",
                    "body": "And so it begins.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Slave4uandme",
                    "body": "Or ultimately it mutated to feed on humans",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ptypitti",
            "body": "And what are the side effects?",
            "score": 52,
            "replies": [
                {
                    "depth": 1,
                    "author": "MrSpotgold",
                    "body": "Please come back in 10 years.",
                    "score": 56,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "turriferous",
                            "body": "After we release it.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "technicallycorrect2",
                                    "body": "so.. 75 years?",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ptypitti",
                            "body": "Why? I’m asking a simple question. Everything has side effects, the medicine you take, the food you eat. I’m just asking what are the known side effects, i haven’t said this isn’t great.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "EmergencyHorror4792",
                                    "body": "I believe he's taking the piss about thinking of future effects, we'll find out for sure in 10 years when the side effects are present",
                                    "score": 16
                                },
                                {
                                    "depth": 3,
                                    "author": "BOW57",
                                    "body": "I think they were serious. It's a bacteria, a living organism. It may evolve to eat plastics insanely fast and then all our plastic boats will disappear (/s but also a hint of possibility in there). Chuck it in the sea and in 10 years we'll know how much impact it has had",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Marrok11",
                                            "body": "That reminds me of the Aussie scientist who chucked a bunch of cane toads in the wild for eating vermin. Not sure how many years it took him to go \"oh, wow...\"",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ptypitti",
                                            "body": "Ok",
                                            "score": 0
                                        },
                                        {
                                            "depth": 4,
                                            "author": "BeetHater69",
                                            "body": "I would love it if a creature just ate all plastic on Earth and we couldnt use it anymore",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CyclicDombo",
                                                    "body": "Until cars and trucks stop working, farm equipment stops working, buildings collapse, computers stop working, and the whole system that keeps all 8 billion of us alive and fed disintegrates leaving famine, desperation and war in its wake",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CountryMad97",
                                                            "body": "You mean the same agricultural system that's already slowly Killing us anyway? Might actually force people to wake up and start growing food in non destructive ways again",
                                                            "score": 0
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "arent_you_hungry",
                                                            "body": "I for one look forward to fires and blackouts when it eats the insulation off the powerlines and wires inside our walls.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "BeetHater69",
                                                            "body": "Yes, we'll all starve because theres no more microplastics giving us cancer. /s",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Accurate_Summer_1761",
                                                    "body": "Probably would also eat rubber and oil....Basically modern society would collapse roughly 2 mins after the porn sites went down",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "soulsteela",
                                            "body": "Wasn’t this an episode of Sliders? Remember guy taking wallet out and watching credit cards disappear .",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Their point was to come back in 10 years to find out how it all unfolded and then you'll find out what the side effects were.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "HazyAmnesiac",
                                    "body": "That statement to come back in 10 years was said in sarcasm to emphasize that no one knows how this technology will impact our environment and the only way to find out is to wait 10 years to find out.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "catscanmeow",
                                            "body": "it wasnt said in sarcasm, it was said seriously, you cant really know all the side effects until an ample amount of time has passed to assess things.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "gibblewabble",
                                    "body": "Watch it be able to evaporate and then come down in the rain and our civilization dissolves.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Away_Swimming_5757",
                                    "body": "Realistically whatever the plastic is composed will be broken down and when the bacteria cells die, they will organically decompose. The only side effect I could see is it the bacteria becomes home invasive/ product destroying which would have big social impacts (think of how mold can grow on damp surfaces, but if you keep things clean the mold can’t grow… probably need to treat homes for the bacteria or do some type of routine upkeep of plastic products to prevent the bacteria from getting their munchies on).",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ptypitti",
                                            "body": "Tnx",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "LangTheBoss",
                                    "body": "r/whoosh",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "ChrisusaurusRex",
                                    "body": "It’s a joke",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "goodboysparkle",
                                    "body": "r/whoosh",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "zoechi",
                            "body": "then we know we didn't destroy the planet (yet)",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "ethanholmes2001",
                            "body": "RemindMe! 10 years",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "CMDR_TREMAN",
                            "body": "RemindMe! 10 years",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GoArray",
                    "body": "There are a *lot* of useful plastics \"in the water\".  \n\nDamns, ships, docks, subs, swimsuits.. well, you get the idea. Surely we wouldn't dump a bucket of this down a storm drain though.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Alice_D_Wonderland",
                            "body": "And what happens when they get into the air by the vapor? Not a scientist, but a quick google search showed me it’s possible…",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jimmiethefish",
                    "body": " Side effects may be those bacteria turning into Godzillas",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ptypitti",
                            "body": "Wow. A science community that doesn’t question anything? I had the wrong idea of this sub.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "random-user-02",
                                    "body": "My idea of this sub: \n\nPeople scroll here when they take a huge shit, to read interesting things. Then they flush and exit this sub",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ptypitti",
                            "body": "Not disagreeing, i just wanted to learn how this works and what are the side effects. “Matter cannot be created or destroyed; it can only be transformed”. Like you eat, you poop, so the plastic gets transformed into something…maybe i should read the article again",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Tactical_Spaghetti",
                                    "body": "Plastics are almost entirely made out of carbon, oxygen and hydrogen. If broken down efficiently in a way that would likely benefit the bacteria the most , the products would be carbon dioxide and water.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "automatvapen",
                            "body": "Bacteria: destroys plastics\nBacteria runs out of plastics: completely destroys the ecosystem.\n\nWell it's better than the alternative I guess...",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Enfiznar",
                    "body": "Other bacteria feeds on this, creates an overpopulation of this bacteria which makes other species go extinct and in 10 years there is no more plankton in the world. The end.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "PeteyMax",
                    "body": "All your plastic items start to rot after a few years of use.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Awkward-Joke-5276",
                    "body": "Why we can’t have a nice things 😭",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SpectralSolid",
            "body": "this wont backfire.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "Swoshu",
                    "body": "can we develop it so it can't self replicate or something?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nocturnusiv",
                            "body": "That’s life",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "Life finds a way.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "UBNC",
                    "body": "Like in red dwarf when lister and smeg head use nano bots to peal potato skins but it ended up also skinning clothes and hair lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "\n [New engineered bacteria could destroy plastics in seawater](https://www.anthropocenemagazine.org/2023/09/in-a-first-researchers-have-engineered-marine-bacteria-to-destroy-plastics-in-seawater/)",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "SirLordTheThird",
                    "body": "[It would only work in seawater, right?](https://i.imgur.com/mKJcSyg.jpg)",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "sunofnothing_",
            "body": "when its done with the plastic,  it will still be hungry",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "bliip368",
                    "body": "I was going to post this but you beat me to it. Nature has a way of surviving by adapting.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "turriferous",
                            "body": "You might say. It finds a way.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mentive",
            "body": "What could possibly go wrong?",
            "score": 4
        },
        {
            "depth": 0,
            "author": "DeepspaceDigital",
            "body": "What else would it destroy?",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "_dodged",
                    "body": "us",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "CrispyMeltedCheese",
                    "body": "The Kardashians",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "quadsimodo",
                            "body": "They eat plastic. They’re gone.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Possible_Ad_9670",
            "body": "Wait\n\nI've seen this one before\n\nit creates technology dead zones once it become land based\n\nNot a bad deal",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "No more single use commodities and going back to things made of glass wood and metal, lesssgooooooo",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AvgGuy100",
                            "body": "Except medicine understandably requires a lot of single use",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Very understandable. Plastic is obviously very important in every aspect of society, my comment was mildly satirical but also, I like stuff made of wood and metal",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CrispyMeltedCheese",
                                            "body": "They’re too heavy!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "KptKreampie",
            "body": "How would this bacteria react to the micro plastics in our own bodies?",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Oldamog",
                    "body": "I feed mine candy wrappers",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "LazerShark1313",
            "body": "I'm sure this will go perfectly well",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Noooofun",
            "body": "Don’t release it. \nWe have micro plastics within us. Why would anyone engineer this?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "East1st",
            "body": "They'll be working overtime to kill this bacteria 20 years from now",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Tvmouth",
            "body": "One step closer to a new gut biome that lets us eat plastic. Nothing is destroyed, energy goes somewhere, may as well be food for us.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Dang the Amish are gonna win by dumb luck",
            "score": 3
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Im sure stuff like this cant backfire in any way.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "LawAbidingDenizen",
            "body": "Seems like the plot buildup to something from 'The day the Earth stood still (2008)'",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Alice_D_Wonderland",
            "body": "Please don’t… 😔",
            "score": 2
        },
        {
            "depth": 0,
            "author": "KoalaDeluxe",
            "body": "You know it's time to start worrying whenever you read the words \"engineered bacteria\" (or viruses)....",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Millzee69",
            "body": "I am Legend vibes 😭😭😂😂",
            "score": 2
        },
        {
            "depth": 0,
            "author": "motherseffinjones",
            "body": "Every time humans have tried to intervene with nature things have gone well. What could go wrong? Lol",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see: [Scientists identify 16,000 plastic chemicals used in products like water bottles, teething toys and blood bags- and at least 4,200 deemed 'highly hazardous' to human health](https://www.dailymail.co.uk/sciencetech/article-13201735/plastic-chemicals-hazard-water-bottles-teething-blood-bags.html)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see: [Mutated Strains of Unknown Drug-Resistant Bacteria Found Lurking on ISS (gizmodo.com)](https://gizmodo.com/mutated-strains-drug-resistant-bacteria-iss-1851416863)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BohemianGamer",
            "body": "Engineering bacteria to essentially eat the micro plastics is probably the only way to deal with the problem, unless we go down the nanotechnology path and build nanoscale drones to do it, both have potential for problems and unpredictable consequences.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Ye and I could get a date with a super model. Keep me posted on the bacteria.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HeavyDropFTW",
            "body": "We just came out of a pandemic that starred an engineered virus.  Yeah, lets engineer a bacteria and release it in to the ocean.  What's the worst that could happen?\n\n^((all life destroyed in 5 years?))",
            "score": 0
        },
        {
            "depth": 0,
            "author": "PeteyMax",
            "body": "And you've just destroyed the whole point of plastics in the first place: that they don't rot or corrode with time. Now everybody will have to keep their plastic items safe from heat and moisture lest they rot like old fruit.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Greedy-Specific7723",
            "body": "First there was flys ,pesky pesky flys so we brought in some frogs to eat the flys then we brought in some snake to eat the frogs that ate the flys …so we",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Chris714n_8",
            "body": "How many expensive things made of plastics, out there, may get affected by such a bacteria?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "5hred",
            "body": "Imagine , plastic is no longer viable. Sorry this sounds really stupid.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "minion71",
            "body": "I am wondering how much co2 will be release by these bacteria eating plastics.....!!!!!",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Jake0024",
            "body": "It's sad when this sub occasionally gets an actual science themed post, and the replies are all just paranoid conspiracists making up doomsday scenarios...",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Disastrous-Form4671",
            "body": "and what people did not realise is that most people have plastic in thir system, uncontrolled cases of cancer in young, including babies, billions of people who don't understand that the more wealth the rich hoard the more such issues will persist even if we fix few parts of it, and that climate change is real and that's why there is so much flooding, fire, heat, storms, and more. But hey, apparently every one needs to chill, to stay on subject and ignore other matters, because we showed you this, now pay attention to that and don't get distracted with stuff that affect every last being on earth and gets worse",
            "score": -2
        },
        {
            "depth": 0,
            "author": "GodBlessYouNow",
            "body": "The first time i heard about this was in 2016",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Enfiznar",
                    "body": "I think that one was naturally occurring. It's amazing that it evolved naturally to eat PET, as it has only existed for like 80 years.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Individual-Parking-5",
            "body": "We have heard the same story every year once or twice a year like clockwork for the past 13 years.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Either-Wallaby-3755",
                    "body": "Yea starting to think it’s a psyc op by big plastic to keep printing money and polluting.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TurokHunterOfDinos",
            "body": "Cool.  What else do they eat?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PassportNerd",
            "body": "They can’t they build big facilities to do this to new plastic and try to get rid of the old",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PaperbackBuddha",
            "body": "Not to worry! If the bacteria grows out of control and starts destroying all plastic everywhere, we’ll do like Australia did and unleash some other agent that attacks the bacteria, like a slug or something that eats it. And if that gets out of control and starts killing off all other life, we’ll unleash another agent that kills off the slug. It’s foolproof. Humanity is so wise and infallible.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Chrisp825",
            "body": "And when they plastic in the water is all gone,  and this bacteria has become rampant,  what would be next?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Genzeka007",
            "body": "What could possibly go wrong…",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SolarZephyr87",
            "body": "I mean we can’t just dump it into the ocean. But hauling it to a deep artificial basin and then breaking it all down? We could probably make that work.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pipinstallwin",
            "body": "AND... all the microplastics enlodged in your blood, brain, and other organs. Should be fun!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jay-zd",
            "body": "Could it also destroy internet cables?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Absolutely. A lot of short to medium length runs are POF (Plastic Optical Fiber).",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Balbuto",
            "body": "Can it destroy the micro plastic in our bodies?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Will0fDeeznuts",
            "body": "Or we can boycott sugar water corporations until they go back to reusable glass bottles that they clean and redistribute.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PaunchieGenie",
            "body": "Will this be it? Will this be our season finale?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RenaissanceGraffiti",
            "body": "Sounds like the premise to a zombie movie: we build a bacteria to eat plastic but instead it eats brains",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Eloy71",
            "body": "All these inventions to. clean up the planet, it's saved!\n\n\"could\" clean up the water, but never will. We all know it. And we don't know about side effects.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DrWynnewin",
            "body": "SINGLE USE PLASTICS SHOULD BE MADE FROM BIODEGRADABLE HEMP!!!!!     \n\n\n....  That is all.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "readingyourpost",
            "body": "i see and can it eventually  attack the plastics in the animals as they ingest it? what is the recourse entering all those little ecosystems inside all the animals?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Either-Wallaby-3755",
                    "body": "Probably not as bad as eating plastic",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cideart",
            "body": "Told you this was coming ;-)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Considering the shaft and thrust bearings in nearly all ships are polyethylene (for durability and seawater lubrication without danger of corrosion), this is a bad idea.  https://thordonbearings.com/",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "How about in the drinking water supply. Science shows micro plastics are linked homosexuality.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ronpaulbacon",
            "body": "Mmm Bible talks about the sea turning to blood 🩸 in the end times I always thought red tide or something but genetically engineered plastic eating bacteria are now a close second in my mind",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Peterthinking",
            "body": "Reminds me of a story I read. Scientists made this lubricant that spread out very thin and seeped into cracks. Only problem was it spread out so thin it covered the planet. And you couldn't get any mechanical connection to stick. Nuts and bolts all over the planet undid themselves. Cars fell apart into piles of parts.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jorlev",
            "body": "What else could they destroy in our oceans? Unintended consequences?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "What could go wrong",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Beneficial-Test-4962",
            "body": "and then have a glitch and destroy all of mankind too\n\nbut progress!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bignuka",
            "body": "Couldn't water evaporation cause it to get into the clouds and then rain onto civilization fucking us over insanely quickly? Best way to avoid this would be to drag all the plastic somewhere specific on land and let it dry out then afterwards feed it to the bacteria.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Confusedandreticent",
            "body": "Next, make a bacteria that eats concrete, probably the next most abundant thing in society. /s",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HeftyLeftyPig",
            "body": "The word *could* is doing a lot of work in OPs title.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kmaloetas",
            "body": "Yeah that's not the plot for an '80's disaster/horror film.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "YOKi_Tran",
            "body": "the water then becomes red… and we are then visited by alien gods\n\nevangelion is realized",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Rooster1979",
            "body": "What could go wrong?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Own_Cream_551",
            "body": "So this is how we destroy the world’s oceans!? So bacteria that starts with plastics then jumps to biological life forms….",
            "score": 1
        },
        {
            "depth": 0,
            "author": "vinceglartho",
            "body": "Completely unnecessary.  There are already natural bacteria that already do this. Waste of money.  \n\nhttps://news.northwestern.edu/stories/2023/02/new-external-story/#:~:text=A%20common%20environmental%20bacterium%2C%20Comamonas,waste%20from%20plants%20and%20plastics.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "And obviously plastic boats, pipes, canoes, eyeglasses, clothing once it gets loose. These jokers JUST DONT THINK",
            "score": 1
        },
        {
            "depth": 0,
            "author": "UATinPROD",
            "body": "Can we just not engineer bacteria",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DayFeeling",
            "body": "What could go wrong",
            "score": 1
        },
        {
            "depth": 0,
            "author": "trafozsatsfm",
            "body": "As if there is a chemical that eats plastic and doesn't fuck with the eco system in any way.\n\nThe only way to deal with the plastic problem is to deal with it manually.\n\nFuck putting chemicals in the worlds oceans and hoping for the best.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Just in case you didn’t get it yet.  King Crab fisheries crashed.   They are blaming it on climate change, but real reason?  Baby crabs are part of plankton that float everywhere looking for a nursery to grow up in.  Seashores are out because of climate change.  Those micro plastics are providing that nursery.  When they cleaned up the plastics in the ocean, they didn’t tell the downside:  destruction of all microorganisms growing in the flotsam!  They killed the bottom of the food chain.  Voila!  Crash in fisheries, seals and sea lions starving, growing number of shark and other organism attacks!  I kid you not!\n\nJellyfish, sharks, seals all becoming hostile!!!\n\nhttps://www.science.org/content/article/cleaning-ocean-garbage-patches-could-destroy-delicate-ecosystems\n\nhttps://www.wired.com/story/ocean-cleanup-habitat-destruction/\n\nIt is because of humans and sharks interacting!  Hahahaha!\n\nhttps://time.com/6292696/shark-attack-data-2023/\n\nhttps://www.seattletimes.com/seattle-news/environment/why-are-birds-and-seals-starving-in-a-bering-sea-full-of-fish/\n\nhttps://mg.co.za/environment/2021-11-01-thousands-of-thin-cape-fur-seals-die-on-west-coast-beaches/\n\nhttps://apnews.com/article/alaska-bering-sea-fishing-crabs-climate-warming-ocean-5569f639ae3c01f38162f4e4e7023341#:~:text=Then%20in%202021%2C%20disaster%3A%20an,for%20the%20first%20time%20ever.\n\nhttps://www.fisheries.noaa.gov/news/snow-crab-and-red-king-crab-declines-2022",
            "score": 1
        }
    ]
}