{
    "title": "The ozone hole above Antarctica has grown to three times the size of Brazil",
    "comments": [
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[The ozone hole above Antarctica has grown to three times the size of Brazil](https://www.space.com/ozone-hole-antarctica-three-times-size-of-brazil)\n\n*One possible reason for the higher-than-normal growth is the Hunga Tonga volcanic eruption in January 2022, which introduced massive quantities of water vapor into the air. The water vapor could have led to the heightened formation of polar stratospheric clouds, where chlorofluorocarbons (CFCs) can react and accelerate ozone depletion.*\n\n\nversus\n\n[Antarctica’s Temperatures Rose 70°F Above Normal Last Year](https://www.reddit.com/r/ScienceUncensored/comments/16snkoq/antarcticas_temperatures_rose_70f_above_normal/)\n\nIt's evident that similarly to carbon dioxide levels ozone hole is driven by climatic trends [rather than human activity](https://www.unep.org/news-and-stories/story/rebuilding-ozone-layer-how-world-came-together-ultimate-repair-job). People - scientists in particular - like to pretend, they've everything under their control (because only after then it has meaning to spend money for them). See also:\n\n* [This chart depicts the average extent](https://i.imgur.com/TopgOi8.png) of the Antarctic ozone hole during peak ozone depletion season from 1979 to present.  It reflects  global warming hiatus around 2002 year in similar way like [methane levels](https://www.noaa.gov/news-release/increase-in-atmospheric-methane-set-another-record-during-2021).\n* [Climate Impacts and Potential Drivers of the Unprecedented Antarctic Ozone Holes of 2020 and 2021](https://agupubs.onlinelibrary.wiley.com/doi/full/10.1029/2022GL098064) Ozone hole started to grow BEFOR Tonga explosion in  December 2021.\n* [Huge unexpected ozone hole discovered over tropics](https://www.reddit.com/r/ScienceUncensored/comments/vs3byw/huge_unexpected_ozone_hole_discovered_over_tropics/) *The tropical ozone hole appears in all seasons since the 1980s, and its area is roughly seven times greater.*\n* [Ozone hole grows this year, but is still shrinking in general?](https://www.reddit.com/r/ScienceUncensored/comments/y44z8y/ozone_hole_grows_this_year_but_is_still_shrinking/)\n* [Mesospheric ozone destruction by high‐energy electron precipitation associated with pulsating aurora](https://www.reddit.com/r/ScienceUncensored/comments/lxjw13/mesospheric_ozone_destruction_by_highenergy/)\n* [Record‐Breaking Increases in Arctic Solar Ultraviolet Radiation Caused by Exceptionally Large Ozone Depletion in 2020](https://www.reddit.com/r/ScienceUncensored/comments/k38e0x/recordbreaking_increases_in_arctic_solar/)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Magic-Kushroom",
                    "body": "It's getting smaller. Fuck this post.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zero-evil",
                            "body": "Yeah, and covid is over and politicians are trustworthy.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pendayne",
                    "body": "\"scientists like to pretend they've got everything under control\".\n\nIs that why they're out there asking the public and governments to change their energy sources because it's getting out of control?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Zephir_AR",
                            "body": "This is nonsensical question. If we would have fossil energy sources out of control, it would give no meaning to call for their regulation. Try the twisting of posts meaning  somewhere else, please..",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "zero-evil",
                                    "body": "How in the hell would you twist a post's meaning somewhere other than the post?\n\nI don't even know what the meaning of this post is supposed to be. Massive ozone layer holes are.. ok?  Fuckin senseless.",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Zephir_AR",
                    "body": "[When the reality is entirely different from what both conservatives both progressives believe](https://i.imgur.com/ekChZf9.jpg)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "WhoNeedsUI",
            "body": "….i thought this was the one thing we succeeded fixing ?",
            "score": 96,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ssscrudddy",
                    "body": "Me too, now I'm confused",
                    "score": 40,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "foundafreeusername",
                            "body": "In case you haven't gotten the correction yet. The ozone hole is growing and shrinking with the seasons and weather. It is getting smaller overall and expected to be back to normal in 20 years or so. A few days or weeks of a larger than normal ozone hole don't matter at all. \n\nIt is very similar to what we have with climate change. Just because the local weather in one spot is unusual doesn't really mean anything for the climate overall.",
                            "score": 14,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "zero-evil",
                                    "body": "Expected to be normal in 20 years?  Because we reduced per capita emissions by a small percentage while skyrocketing the population?  Do they not teach math anymore?\n\n  So people don't deny environmental issues anymore, they just find different stupid ways to dismiss it?  Why fix anything when you can just pretend there's no problem.  That's a great plan.  We need a registry of every spineless idiot who fights against positive change, that way when things are really bad and there isn't enough for everyone, we can say \" no, you said everything was totally fine, this is your fault, so move the fuck on and go be totally fine on your own somewhere else\"",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sim0nsaysshh",
                                            "body": "The ozone hole was caused by chemicals in aerosols not carbon, all countries banned them at the same time, but China has been using them again according to satellite images",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "zero-evil",
                                                    "body": "  Those chemicals were the largest contributor at the time- big difference from \"only\".  The environment is deeply interconnected, humans do not and probably cannot understand a lot of what's going on.  As it is with most things.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rappa-dappa",
                    "body": "“Yet despite experiencing large seasonal growth this year, the ozone hole is still decreasing in size overall.“",
                    "score": 36,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ultramar_Invicta",
                            "body": "Oh, so it's clickbait.",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Receedus",
                    "body": "We did but alot of cfc's accumulated in antartica's ice. It will take a while before that built up reserve of cfcs is truly gone.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "rare_pig",
                    "body": "Volcanos don’t care",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "tempo1139",
                    "body": "I think there is an association with El Nino/La Ninia.    Several years ago during it's peak the ozone hole got much bigger for awhile. We are at that same point in the cycle again. Gonna be a killer year here in Oz... send firefighters.  Already in jsut one state we have floods and evacuations for fires at the same time... and we only just started October",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "silver-saguaro",
                            "body": "The el Nino phenomenon is a weird one to study. They don't really say what causes it besides that warm water accumulated around the equator and it typically happens every 4 to 7 years.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "catalinus",
                    "body": "From the article linked:\n\n> Yet despite experiencing large seasonal growth this year, the ozone hole is still decreasing in size overall. \"Based on the Montreal Protocol and the decrease of anthropogenic ozone-depleting substances, scientists currently predict that the global ozone layer will reach its normal state again by around 2050,\" said Claus Zehner, ESA's mission manager for Copernicus Sentinel-5P.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "username-is-taken-3",
                    "body": "It was getting smaller during Covid which showed it can be fixed, but it was never fixed from my understanding.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "This is just more fake news to ban another product.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Magic-Kushroom",
            "body": "It's getting smaller fuck off with this",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "isaacals",
                    "body": "what she said",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MrSN99",
                            "body": "Girl???",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "westcoastjo",
            "body": "Your mom has grown to three times the size of Brazil.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "NevyTheChemist",
            "body": "It's seasonal variation and it's still decreasing on average. Says in the god damned article.\n\nY'all a bunch of dumbfucks on this sub.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "DeezerDB",
            "body": "I thought we healed this.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "quecosa",
                    "body": "The ozone layer is currently on track to recover to 1980 levels by 2040, and over and Antarctica by 2066. We have successfully cut the manmade emissions that cause this by over 95% over the last 30 years, but as this article and most other point out, there are natural environmental effects that can cause fluctuations in the levels.\n\nhttps://www.theguardian.com/environment/2023/jan/09/ozone-layer-healed-within-decades-un-report",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DeezerDB",
                            "body": "Copy that, thank you.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "quecosa",
                                    "body": "ROGER ROGER",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AthleteIllustrious47",
            "body": "Damn. We must really need to hard push the Climate change agenda if we’re busting out the ozone hole stuff again",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "pendayne",
                    "body": "Two different scientific processes and implications though aren't they?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Meneyn",
            "body": "This sub is becoming (or already was) a nesting ground for conspiracy and misinformation. Jesus Christ with this title!\nIt's decreasing overall, but it has a seasonal pattern.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "zero-evil",
                    "body": "Yeah, widespread forest fire season and severe volcanic eruption season.  Totally normal.  EVERYTHING IS NORMAL.  RETURN TO CONSUMING IMMEDIATELY.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "masonic_lodge-P2",
            "body": "I guess outlawing the refrigerator gasses was useless and a total scam as well.",
            "score": -5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Individual-Parking-5",
                    "body": "You didn't even bother to read the first few paragraphs did you. Typical",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "galacticwonderer",
                    "body": "Bzzzz. Guessed wrong :)",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Zephir_AR",
                    "body": ">*I guess outlawing the refrigerator gasses was useless and a total scam as well*\n\nIf the expensive and toxic freon can be replaced with much cheaper isobutane with the same efficiency as refrigerant, there's no reason why not to use it. Modern refrigerators use only few millilitres of coolant, so that its flammability isn't big concern.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Yokepearl",
            "body": "ChatGPT is our friend: “Hello, this is Bing. I'm here to chat with you and answer your questions. 😊\n\nThe statement you shared is partially true, but also exaggerated. Let me explain.\n\nIt is true that satellite data shows that this year's ozone hole over Antarctica is one of the biggest on record, roughly three times the size of Brazil or twice the size of Antarctica itself¹²³. The ozone hole is a natural phenomenon that occurs every year during the Antarctic winter, when cold air creates polar stratospheric clouds that deplete the ozone layer, which protects us from harmful ultraviolet rays⁴.\n\nHowever, it is not true that the eruption of Tonga's underwater volcano in January 2022 is the main cause of the large ozone hole. Scientists are not sure why this year's ozone hole is so large, but some researchers have speculated that the volcanic eruption could be one of the factors that contributed to it, along with other natural variability and climate change¹²⁵. The eruption injected a record-breaking amount of water into the stratosphere, which could have caused cooling and more formation of polar stratospheric clouds⁵.\n\nThe statement that we can't live above ground if the hole gets bigger is also false and alarmist. The ozone hole does not affect the amount of ozone in other parts of the world, and it usually closes by the end of November when the stratosphere warms up⁴. The international community has banned the use of ozone-depleting substances since 1989, and the ozone layer is expected to recover by the end of this century⁴. However, we still need to be careful about our exposure to UV rays and protect our skin and eyes from sun damage.\n\nI hope this clarifies your question. If you have any other questions or want to chat about something else, feel free to ask me. 😊\n\nSource: Conversation with Bing, 10/7/2023\n(1) Ozone Hole is one of the BIGGEST on record: Gap over Antarctica is now three times the size of Brazil - and it could get even larger. https://www.dailymail.co.uk/sciencetech/article-12596861/Ozone-Hole-one-BIGGEST-record-Gap-Antarctica-three-times-size-Brazil-larger.html.\n(2) Ozone hole over Antarctica is one of the biggest on record. https://www.wionews.com/science/ozone-hole-over-antarctica-is-one-of-the-biggest-on-record-643483.\n(3) Large ozone hole detected over Antarctica. https://www.msn.com/en-in/news/india/large-ozone-hole-detected-over-antarctica/ar-AA1hNt0B.\n(4) 'One of the biggest on record': Ozone hole bigger than North America .... https://www.livescience.com/planet-earth/weather/one-of-the-biggest-on-record-ozone-hole-bigger-than-north-america-opens-above-antarctica.\n(5) Hunga Tonga undersea volcano eruption to make ozone hole larger | Space. https://www.space.com/hunga-tonga-will-make-ozone-hole-larger.\n(6) Huge Tonga volcano may be to blame for ozone hole over Antarctica | Space. https://www.space.com/antarctic-ozone-hole-early-hunga-tonga.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Habalaa",
                    "body": "> **ChatGPT** is our friend\n\n> \"Hello, this is **Bing**\n\nchatgpt became the Google of chat AIs",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hairburt_Derhelle",
            "body": "Looks like hydrogen cars and planes aren’t the best idea concerning this effect. At least electric cars should do the work.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "KptKreampie",
            "body": "As a child of the 80s, who personally wrote letters to Regan and Bush with my school to do something about this. I'm pissed off! It's clear which side after 40 years still won't do a mother fucking thing about it!\n\n It's a funny thing playing make belive all your life, living for heaven and the rapture. You forget about everyone to come after your selfish asses!\n\nIt's clear ONLY the religious NUT JOBS (if the shoe fits😉) don't take this seriously!",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "zero-evil",
                    "body": "Nut jobs come in many flavors, all very unpalatable.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "whisporz",
            "body": "Not even the people that made up the “hole in the ozone” layer believe that anymore. Polls have always had weak  ozone coverage and even children’s saturday morning shows can explain how this works if you are curious.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Eloy71",
            "body": "oh, there's still ozone left? yay!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Harry_the_space_man",
                    "body": "Ozone is not affected by emissions. It was affected by erosoles combining with other elements in the ozone, causing a reaction that flung those elements out of the ozone. \n\nThe ozone has drastically improved over the last few decades as humanity cut back on the use of these chemicals. You seem very misinformed on how this stuff works.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Eloy71",
                            "body": "I wasn't informed at all how this works and it wasn't even necessary. But you provided the only fact I was interest in (the hole shrinking) which I got confirmed on other sources too now. Thanks!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Harry_the_space_man",
                    "body": "You’re an idiot",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DJviolin",
            "body": "Imma' time to drop R22 for the third world.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Waibry",
            "body": "They still blaming this hoax on hairspray??",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Harry_the_space_man",
                    "body": "Yes. And it’s wasn’t a hoax. It has drastically improved because of the banning of those chemicals, as they would interact with the elements in the ozone and fling them out after combining. This article is clickbait",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lost-Watch-6672",
            "body": "For shit sake I thought Gen X sorted this crap out in the 80's.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Southern-Comb-650",
                    "body": "The climate experts assured us if we gave up cfcs and taxed the shit out if people we fixed it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GruzzyFunt",
            "body": "Probably all the direct energy weapon activity melting the ozone",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Harry_the_space_man",
                    "body": "You’re an idiot",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "animal56",
            "body": "Don't worry, guys! I'm paying the carbon tax, so it should be fixed in no time!",
            "score": 1
        }
    ]
}