{
    "title": "Nearly 100 Teens Paralyzed, Left Unable to Walk, by Mystery Illness",
    "comments": [
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[Nearly 100 Teens Paralyzed, Left Unable to Walk, by Mystery Illness](https://www.msn.com/en-us/health/medical/nearly-100-teens-paralyzed-left-unable-to-walk-by-mystery-illness/ar-AA1hNFTs) ([archive](https://archive.ph/z2pc8))\n\n*A mysterious illness has landed more than 90 schoolgirls in the hospital. The children, students of Kenya’s Eregi Girls High School, near the country’s border with Uganda, have reported [pain in their knees, making walking](https://i.imgur.com/y8IQJ1V.mp4) and basic movement difficult. Blood, stool, and urine tests [have been conducted](https://nation.africa/kenya/counties/kakamega/five-tests-but-no-results-in-eregi-girls-mystery-illness-4390252), and preliminary tests have found [evidence](https://nation.africa/kenya/counties/kakamega/mayhem-in-eregi-as-schoolgirls-fall-victim-to-mysterious-disease-4388996) of [elevated electrolytes](https://my.clevelandclinic.org/health/symptoms/24019-electrolyte-imbalance), or an imbalance of important minerals in the body. Officials have not found any pathogen that could be causing these symptoms.*\n\nSt. Theresa Eregi Girls were [vaccinated against COVID-19 on 20 Jul 2022](https://i.imgur.com/L8Yt9ra.jpg). [Could this be](https://twitter.com/mainandegwa232/status/1709879763462938746) the reason why? [Research suggests Pfizer-BioNTech COVID-19 vaccine reprograms innate immune responses](https://www.news-medical.net/news/20210510/Research-suggests-Pfizer-BioNTech-COVID-19-vaccine-reprograms-innate-immune-responses.aspx) mRNA stimulate the innate immune system through activation of Toll-like receptors (TLRs), so that Pfizer/Moderna vaccines [deactivated them](https://www.reddit.com/r/ScienceUncensored/comments/ua3coa/innate_immune_suppression_by_sarscov2_mrna/). Unfortunately it also opened the way for proliferation of mutagenic cells and dormant viruses. See also:\n\n* [Parents point fingers at evil spirits at Eregi Girls](https://www.pd.co.ke/news/parents-point-fingers-at-evil-spirits-at-eregi-girls-as-tests-fail-to-reveal-illness-204934/) (no philanthropist names were called though)\n* [Mystery Illness Paralyzing Young Girls Sparks COVID Vaccine Theory](https://www.newsweek.com/mystery-illness-paralyzes-dozens-school-aged-girls-1832396)\n* [Five tests but no results in Eregi Girls mystery illness](https://nation.africa/kenya/counties/kakamega/five-tests-but-no-results-in-eregi-girls-mystery-illness-4390252)\n* [Vietnam province suspends Pfizer vaccine batch after 120 children get hospitalized](https://www.reddit.com/r/ScienceUncensored/comments/r9hebg/vietnam_province_suspends_pfizer_vaccine_batch/)\n* [Ramsay Hunt syndrome following mRNA SARS-COV-2 vaccine](https://www.reddit.com/r/ScienceUncensored/comments/v9xurx/ramsay_hunt_syndrome_following_mrna_sarscov2/)\n* [Nobel Winner Warned of VAIDS Risks from mRNA Shots](https://www.reddit.com/r/ScienceUncensored/comments/1702q2j/nobel_winner_warned_of_vaids_risks_from_mrna_shots/)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Username912773",
                    "body": "Considering the fact billions of people around the globe have been vaccinated, and 90 school girls in a very specific part of Kenya have been paralyzed it’s probably not the covid vaccine and is instead something much more local.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "kateinoly",
            "body": "It's probably a virus. \n\nhttps://www.bu.edu/articles/2018/acute-flaccid-myelitis-outbreak/",
            "score": 26
        },
        {
            "depth": 0,
            "author": "Just-Ad1274",
            "body": "All I thought about after reading this was the Tuskegee Experiment and I pray we would have learned from that mistake",
            "score": 21
        },
        {
            "depth": 0,
            "author": "NoMadness777",
            "body": "Excellent and unbiased reporting as always from Microsoft Network.",
            "score": 41
        },
        {
            "depth": 0,
            "author": "Jenkem-Boofer",
            "body": "Los Polio hermanos",
            "score": 22
        },
        {
            "depth": 0,
            "author": "CabbageaceMcgee",
            "body": "Methinks they're being poisoned.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "heavy metals maybe, drinking water?",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CabbageaceMcgee",
                            "body": "Lead or arsenic, probably.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ExPFC_Wintergreen2",
            "body": "Mass Hysteria",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "wtwildthingsare",
                    "body": "Bingo 👌🏻",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "emmybby",
            "body": "They're all students of the same school? And the vaccine was administered specifically for the school students (over a year ago and they're just having symptoms all at once now)? If the school is administering a vaccine like that, are there other things they're administering too? Other kinds of vaccines or immunizations? Medicine? Meals? Water? Menstrual products? There's so many different possibilities and points of contamination that could cause something like this. The reports of parents thinking it's \"evil spirits\" also suggests... a whole other layer of potential causes lol. \n\nWhatever it is I hope they can find out and help these girls. I wish we could talk about this without the elephant in the room, I'm actually very interested in what could cause this.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "Crownlol",
                    "body": "Not a fucking vaccination, that's for sure. You absolute clod. You antivaxtards are genuinely exhausting and insufferable. Read a book.\n\n\nAnyway, to the point, there's a good link in another one of the comments. Symptoms point to some form of meningitis, which this probably is, which spreads *super fast* in close quarters situations, which is why every school and camp requires testing and vaccination for it.",
                    "score": -18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "emmybby",
                            "body": "Reread my comment, you read something in my words that isn't there and assumed a lot about what I believe. I'm interested in this story and wanted to hear people's ideas about theoretical and practical causes. I never claimed to know the answer and never asserted it was the vaccines.\n\nI hope you can feel peace in your heart and not treat the next person like this, and I hope that others don't treat you like this in turn.",
                            "score": 16
                        },
                        {
                            "depth": 2,
                            "author": "ThatPanFlute",
                            "body": "What are you going on about?",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "Odd_Perception_283",
                            "body": "How come you are completely unwilling to even question the vaccine? It’s amazing to me. They’ve made a bunch of you religious around a vaccine. So bizarre.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "Ionsus",
                            "body": "Hey man do you realize how stupid you look not at least considering a vaccine as the cause. Like it's hyper processed chemicals you're shooting directly into your bloodstream. And you're laughing to consider it the problem. You have been fully brainwashed lol",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Crownlol",
                                    "body": "\"Hyper processed chemicals\" was elementary math really hard for you?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ionsus",
                                            "body": "I was just using something so generic it has to be true. And I actually got perfect scores on the math college entrance exams and work as an engineer now. It's super telling that you can't think logically. You're saying it's ridiculous to assume the vaccine has any negative impact. That is so stupid. Honestly you're ignoring variables and shitting on the scientific method.",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MathematicianWeak157",
                    "body": "https://open.substack.com/pub/anamihalceamdphd/p/measles-mumps-rubella-and-varicella?utm_source=share&utm_medium=android&r=1lj35m",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Scalymeateater",
            "body": "polio paralysis caused by polio vaccine?  or poisoned wanter or ddt?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Sir_John_Barleycorn",
            "body": "Mass conversion syndrome",
            "score": 4
        },
        {
            "depth": 0,
            "author": "NeuroLancer81",
            "body": "This sub thinks everything is caused by the Covid vaccine. The border area between Uganda and Kenya is a very poor with poor hygiene, lots of pollution from many road tankers which move oil between the countries and lots of other toxins. So yes, it is the vaccine they were given and it the myriad of Pollutants they are exposed to on a daily basis. The next thing we know the hurricanes will be the fault of the Covid vaccine",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "smegmasyr",
                    "body": "Silly rabbit, everyone knows that the covid shot was caused by global warming.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Crownlol",
            "body": "\"Super credible news source throws covid vaccination 'theory' into 'news' article, wonders why it's ridiculed.\"",
            "score": 2
        },
        {
            "depth": 0,
            "author": "The_WolfieOne",
            "body": "More likely poison of some sort",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Material-Ad7911",
            "body": "Vaccine derived Polio. Boom, solved it! \n\nhttps://www.nature.com/articles/d41586-023-01953-7",
            "score": -5,
            "replies": [
                {
                    "depth": 1,
                    "author": "iCameToLearnSomeCode",
                    "body": "No way it effected that many people. \n\nPolio is asymptomatic in the vast majority of people. \n\nIt's only like 1% of kids that become paralyzed and the vaccine doesn't cause polio that often. \n\nThis school would have to have vaccinated hundreds of thousands of girls to get this result.\n\nThat article even says that only 635 cases have been recorded in a year across 23 countries. \n\nHaving 100 cases show up in one building makes no sense.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "bluePizelStudio",
                    "body": "I can’t tell if this is a joke or not, but I guess that’s the whole experience here on r/scienceuncensored, aka r/sciencebutwithoutanypeskypeerreviewing",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "EnterTheYauta",
            "body": "I wonder if Bill gates is involved",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Critical_Hearing_799",
            "body": "Someone or someTHING is using this school and those girls as a \"test bed\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Just stop being so stupid.",
            "score": -3
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "this happens from time to time, usually with teenage girls.",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "apoletta",
                    "body": "No.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "username36610",
                    "body": "It’s interesting how this is downvoted. This is the same demographic that cuts themselves and throws up food. There’s been a long history of psychological contagion among teen girls. But for some reason ppl think that’s considered misogynistic.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ThatPanFlute",
                            "body": "It’s getting downvoted because social contagion is a irresponsibly poor estimate of what’s causing the events.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "autostart17",
            "body": "Any supposed relation with CoVid?\n\nEdit: truly surprised by the downvotes. Wish someone would explicate",
            "score": -8,
            "replies": [
                {
                    "depth": 1,
                    "author": "These-Employer341",
                    "body": "Maybe like in the US 2015 \nExcept this was across the US not in an isolated area. \n\nMore than 100 kids suffered an unexplained, polio-like paralysis that struck quickly but even now continues to stump researchers and upend the lives of the families across the country.\n\nDoctors believe the condition, known as \"acute flaccid myelitis,\" is linked to last year's nationwide outbreak of enterovirus D68, or EV-D68 — part of a family of viruses that appears in summer and fall — but they haven't proved a connection. \n\nhttps://www.washingtonpost.com/national/health-science/mystery-paralysis-in-children-is-perplexing-parents--and-researchers/2015/03/02/20e1113a-b69d-11e4-aa05-1ce812b3fdd2_story.html",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "These-Employer341",
                            "body": "Update \n\nhttps://www.healthychildren.org/English/health-issues/conditions/head-neck-nervous-system/Pages/AFM.aspx#:~:text=What%20causes%20AFM%3F,%2C%20including%20asthma%2Dlike%20illnesses.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Okay_there_bud",
                    "body": "Maybe it's the thing we're not allowed to question that's been causing injuries, maybe? They thing these girls got that was \"safe and effective,\" maybe?",
                    "score": -12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CrimsonBolt33",
                            "body": "The problem is, when you make claims like this, you need some sort of proof...You have none though...",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "These-Employer341",
                                    "body": "I certainly hoped you pushed back against the idea it could be mRNA vaccines. Because that’s even more far fetched.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Prior_Woodpecker635",
                                    "body": "If we are basing the knowledge of side effects on anyone it should be judged against the record of those who make the claim. No one is above reproach. \n\n On scale, if this is this an issue we should trust in the same folks that were just as pronounced as the ABSOLUTE disaster the efficacy was. \n\nThat’s why England advises 65+ now and were 6 months... those people...",
                                    "score": 0
                                },
                                {
                                    "depth": 3,
                                    "author": "Okay_there_bud",
                                    "body": "Let's just say it doesn't take a rocket scientist to connect a few very obvious dots.",
                                    "score": -9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "JackRusselTerrorist",
                                            "body": "So why only this small group of Ugandans with these symptoms?",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Okay_there_bud",
                                                    "body": "They're probably test subjects.",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "choochoopants",
                                                            "body": "OR… they’re really aliens in human skin suits that ripped during a particularly intense game of musical chairs (these aliens are big chair game-stans) which exposed them to earth’s atmosphere for the first time and then they immediately contracted the super poliorona virus that Bill Gates was developing there.\n\nSee, we can both make claims without evidence. The best part is that both of our claims could be true at the same time!",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Okay_there_bud",
                                                                    "body": "Dude, I never considered that scenario. You might be onto something.   \n    \nOr...    \n    \nYou, unknowingly, have just unleashed a conspiracy so beastly this world, divided as it may, will be divided even FURTHUR over who unleashed the new superpornio virus!    \n    \nI take no responsibility in this line of thought.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "CrimsonBolt33",
                                            "body": "no, it takes evidence.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Okay_there_bud",
                                                    "body": "They don't tell us the evidence. At the very least, we have to use our eyes and ears. Some might say intuition.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CrimsonBolt33",
                                                            "body": "That's not how science, or the world works. You are literally just filling in blanks to make sense in your head...even if not true.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Okay_there_bud",
                                                                    "body": "I don't need a data sheet to tell me that my vaxd friends are the first to become sick and stay sick the longest (not that it would). Also, why did my friend get shingles shortly after taking the vax? What about my other friend who has trouble walking after getting his vax?    \n    \nI'll tell it how I see it. You haven't heard of anyone just dropping dead out of the blue, have you? Perfectly healthy people just dropping dead? How about professional athletes at the top of their game?    \n    \nIf my eyes and ears can't tell me there's something wrong, then I'll leave it to the \"professionals.\" They know what they're doing...",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ok-Cryptographer7424",
                                                                            "body": "srsly?! personal anecdotes lmao",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Okay_there_bud",
                                                                                    "body": "I mean, yes, of course they are. That's what I'm trying to say here. Use your eyes and ears. Something doesn't seem right, and you can't trust the media to tell you what's actually going on.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Ok-Cryptographer7424",
                                                                                            "body": "You’re a conspiracy theorist that cannot backup any of your statements with actual data. More than 5.5 BILLION people have been vaccinated worldwide, over 72% of the world’s population, with over 13.5 BILLION doses given so far. \nThe number of people experiencing severe side effects is soooooooo minuscule compared to the risks of the virus itself. Plenty of data from safety monitoring in at least 190 countries.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "CrimsonBolt33",
                                                                            "body": "[Athletes dropping dead is much more common than you realise](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7237076/), usually due to previously unkown heart conditions that become agitated by extreme exercise. Note the date on that article...\n\n&#x200B;\n\nI don't know anything about your friends so I can't tell you anything about their health, but I can assure you the vaccine didn't give them shingles. Do you know all of their medical history and details? How do you know they get sick more and for longer than others? Do you have any idea how many factors go into that?\n\n&#x200B;\n\nYou are basing things on anecdotal evidence and once again filling in blanks on your own...its pure nonsense.\n\n&#x200B;\n\nAs \"proof from my eyes and ears\" almost everyone I know got the covid vaccine plus multiple boosters and I do not know a single on with adverse effects from it. Care to explain how that works?",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Okay_there_bud",
                                                                                    "body": "I guess we'll see. I would hate for everyone to have long-term side effects, but we have no idea what those will look like (for obvious reasons).    \n    \nI know a lot of upset people would tell you to just \"take another booster\" and laugh. But I don't want you or anyone else to get hurt. Trust what you see and hear in real life, not from the TV or your phone or the newspaper. The media is compromised, and they're not on your side. We need to stick together.    \n    \nAll the best.",
                                                                                    "score": 2
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Youremakingmefart",
                                                                            "body": "Of course you don’t need data when you’re just looking to self-confirm something you already decided was true. You download every instance that validates your narrative and just block out any instance that doesn’t.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Okay_there_bud",
                                                                                    "body": "The thing is, I have looked at the data. And I've seen all I need to see. Not to mention, we've been blasted in the face with their information for 3 years now.    \n    \nIf you don't understand the point I'm trying to make, then consider, why was it mandatory?      \n    \nAnd are you willing to read about the less-than-ideal situations the injured have, and are, enduring?    \n    \nIt's no use throwing up links. \"My information is the right information!\"    \n\"No MY information is the right information!\"    \nNobody's reading shit because we've already made up our minds, right?    \n    \nHave you made up your mind?",
                                                                                    "score": 2
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "LumpyGravy21",
                                                                                    "body": "2003 Athlete Cardiac Arrests or Serious Issues, 1400 of Them Dead, Since COVID Injection https://goodsciencing.com/covid/athletes-suffer-cardiac-arrest-die-after-covid-shot/",
                                                                                    "score": -2
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "choochoopants",
                                                            "body": "Username check out lol",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Okay_there_bud",
                                                                    "body": "Oh no you didnt",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "malshnut",
                            "body": "Ok there bud.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Okay_there_bud",
                                    "body": "Easy there, pal.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MalcolmSolo",
                            "body": "Like 4 billion people did that thing you’re referring to. So why is this only happening at 1 small school in Kenya?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Okay_there_bud",
                                    "body": "I dunno. I could only speculate.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "These-Employer341",
                    "body": "I’ll check. re Covid. \nAbsolutely not vaccines they don’t work like that. \nGood info regarding how vaccines work 3 guest speakers explain.\n\nhttps://youtu.be/OUiM3sQuswE?si=aREwo4drKr2_zh36",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "MalevolentIsopod23",
            "body": "I saw the title, was going to make a joke “could be the vax?” comment, and…",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Regular-Option6067",
            "body": "Any updates on this ?",
            "score": 1
        }
    ]
}