{
    "title": "50-year-old Cambodian man dies from bird flu",
    "comments": [
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[50-year-old Cambodian man dies from bird flu](https://www.newagebd.net/article/214425/50-year-old-cambodian-man-dies-from-bird-flu)\n\n*A 50-year-old man has died from H5N1 bird flu in Cambodia, the health ministry said, & investigating the source. Around 50 poultry, owned by him & his neighbors, died recently. ‘The dead chickens were shared among villagers to eat,’ says ministry.*",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "mx_kush",
                    "body": "We have a bird flu out break in South Africa, we can't really buy eggs because the prices are high as elon musks space balls",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Smithmonster",
            "body": "Well if they ate diseased birds, they should of seen that coming.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see: [Deja flu? Alert over spread of mystery pneumonia 'that has sickened dozens of healthy people in Argentina' | Daily Mail Online](https://www.dailymail.co.uk/health/article-13322629/Deja-flu-Alert-spread-mystery-pneumonia-sickened-dozens-healthy-people-Argentina.html)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see: [I've studied bird flu for 20 years and here's why I stopped drinking milk..as FDA begin testing dairy cows for deadly virus | Daily Mail Online](https://www.dailymail.co.uk/health/article-13350921/bird-flu-stopped-buying-dairy-milk-fda.html)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "brokenbatblues",
            "body": "Without knowing any facts, is it time to freak out?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Zephir_AR",
                    "body": ">*Without knowing any facts, is it time to freak out?*\n\nNeither freak out, neither ignore it.  Killing a host is merely \"*oops, sorry - I'm very new here*\" event in life of virus. Viruses gradually mutate into a less aggressive form, so that there is a good chance that zoonotic H5N1 will become benign again before it will spread into a Western world.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "brokenbatblues",
                            "body": "Thank you bot. I feel reassured now. That was a close one",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kerry-4013-Porter",
            "body": "It has been common for people who cared for livestock with bird flu to be infected with it for some time. \n\nHowever, no family members or people around the infected patient have been infected by the air.\n\nThis stage still remains, but it will collapse at any moment, and there is a fear that it will become a pandemic at that moment.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Scalymeateater",
            "body": "fearmongering or has there been a proper virus isolation?  they should say that pcr tests indicate that there could be a presence of particular virus particles in this dead person and since no one else or no other animals are affected, virus is not transmissive.  most likely birds ate some toxic stuff and died.  then this guy ate some toxic dead birds and he poisoned himself.",
            "score": 1
        }
    ]
}