{
    "title": "\"Anthropology Conference Drops a Panel Defending Sex as Binary\"",
    "comments": [
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[Anthropology Conference Drops a Panel Defending Sex as Binary](https://www.nytimes.com/2023/09/30/us/anthropology-panel-sex-binary-gender-kathleen-lowery.html)\n\n\nIronically just the archaeologic and forensic anthropology gives a sh*t about genders - its results are strictly and unequivocally bound to biological definition of binary sex from apparent reason: there are no LGBT or transgender teeth or skeletons - only men / women ones, as no one can ask them how sexually confused they can feel.. See also:\n\n[No Place For Transphobia in Anthropology: Session pulled from Annual Meeting program](https://www.reddit.com/r/ScienceUncensored/comments/16xij4b/no_place_for_transphobia_in_anthropology_session/)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BDashh",
                    "body": "To say that there are no lgbt skeletons is disingenuous; even if we can’t tell which ones were heterosexual or homosexual, there have been lgbt people throughout human history. Also, it would be best to drop the phraseology “sexually confused” from your vernacular.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "RingAny1978",
            "body": "Actual title of the panel:  “Let’s Talk About Sex Baby: Why Biological Sex Remains a Necessary Analytic Category in Anthropology.”\n\nThis is political correctness run amok.",
            "score": 133,
            "replies": [
                {
                    "depth": 1,
                    "author": "skookumchucknuck",
                    "body": "its actually postmodernism run amok\n\nin the 70's when a mummy was found to have died from tuberculosis they very earnestly argued that that was impossible because TB is a 'modern western medical construct'\n\nyou can't make this up, postmodernism has no reference to reality, they really believe that literally everything is a social construct, even matter\n\nthis is what happens when art critics think they are scientists and philosophers\n\nwhat is astounding is how many young liberals believe the nonsense that these old white and very very creepy men were spouting",
                    "score": 72,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IFightPolarBears",
                            "body": ">tuberculosis they very earnestly argued that that was impossible because TB is a 'modern western medical construct'\n\nWhere'd you see this?",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AntiquatedSolutions",
                                    "body": "Peter Bogosian has mentioned it on the Sitch and Adam Show.\n\nAlso check out Fashionable Nonsense: Postmodern Intellectuals' Abuse of Science by Alan Sokal and Jean Bricmont.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "IFightPolarBears",
                                            "body": ">Peter Bogosian has mentioned it on the Sitch and Adam Show.\n\nSo a guy with a history of stretching the truth said so on a internet show. \n\nCoolio.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "drunk_with_internet",
                                                    "body": "Don’t know why you’re being downvoted when all you’ve asked for is evidence in a science sub and all you got was hearsay.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "IFightPolarBears",
                                                            "body": "We both know why. \n\nThis sub isn't based on evidence, just another sub that started small and smart; with a purpose. Then got infiltrated by partisans.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Heavy-Dealer-8307",
                                                                    "body": "This sub was never smart, it was always a tool to spread misinformation and distrust in science and academia. That's why multiple mods of this sub have been banned sitewide for spreading misinformation and hate.\n\nBanned for this statement of fact, so \"uncensored\"",
                                                                    "score": 3
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "drunk_with_internet",
                                                                    "body": "I suppose I was being cute and totally agree.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "IFightPolarBears",
                                                                            "body": "I totally agree too. \n\nYou were being cute.",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "80sCrackBaby",
                                                            "body": "this is not a science sub lol",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "AntiquatedSolutions",
                                                    "body": "Aw come now, don't blue ball me. Give me an example of Bogosian \"stretching the truth\".\n\nWhat's the point of this reply? Someone asked a question and I answered.\n\n>on a internet show. \n\nOh I totally forgot only telegrams are trustworthy. As if this is some sort of criticism...\n\nA+ contribution all around.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "skookumchucknuck",
                                    "body": "It was Latour \n\nI think I saw it referenced by Chomsky in one of his tirades against postmodernism, but it could have been Hicks, or Dawkins, or Paglia, or Peterson, Finkleman or Hitchens, or Maher.\n\nImagine something so shite that it brings that gang together.\n\nIt is also referenced here, in an article that everyone concerned with this subject should read. Its an old link but it checks out...\n\n[https://physics.nyu.edu/sokal/nagel.html](https://physics.nyu.edu/sokal/nagel.html)\n\nNote that this was from the 90's, and also note how mocking the tone is because no one EVER thought that they would gain traction ever again after they declared *consent* to be a repressive social construct and started appearing in court to defend paedophiles.\n\n[https://en.wikipedia.org/wiki/French\\_petitions\\_against\\_age\\_of\\_consent\\_laws](https://en.wikipedia.org/wiki/French_petitions_against_age_of_consent_laws)\n\nAgain, very, very creepy men... \n\nI will leave it at that, I think these people speak for themselves.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "IFightPolarBears",
                                            "body": "I'll have to read through this. I appreciate the indepth answer. \n\nI do think it's strange/a bit funny that the 3 people that gave answers, all gave different ones. 0 overlap.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Halvdjaevel",
                                    "body": "I don't have a link right now, only to a bunch of tertiary articles about it, but the guy who claimed it couldn't have been TB was Bruno Latour",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "tgosubucks",
                            "body": "Nailed it. Social sciences love crying foul when the natural sciences apply the same objective lens from our work to theirs. When they do it, we get this.",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ecronwald",
                    "body": "I don't really see the controversy. \n\nBiological sex is binary, gender is a social construct.\n\nWomen have two x chromosomes, men have one x, and one Y.\n\nBeing upset about this statement, is like being upset the moon is not made of cheese.\n\nNothing about this is threatening trans people. If anything, anthropologists would be their ally, in researching alternative gender roles.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "randomlycandy",
                            "body": "Sex and gender used to be the same thing until recent times. There are no masculine women or feminine men anymore. They must have their own special label.",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "an_irishviking",
                            "body": "Biological sex isn't binary. Inter-sex people exist. People can have three Xs, XXY, XXYY, and many others. \n\nI'm not saying sex and sexual dimorphism isn't important to anthropology, but there is more complexity that should be taken into account.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "“No scientific merit”\n\nXX = female \nXY = male \n\nAnything else (genetic disorders like XXY, YYX etc) represent less than 1% of 1% of the general public. \n\nThere are only two human genders, & people with mental disabilities",
            "score": 133,
            "replies": [
                {
                    "depth": 1,
                    "author": "rupertyendozer",
                    "body": "I agree with you but  don't use chromosomes, because some activist is gonna point to exceptions.\n\nThat's why I use \"active SRY\"\n\nActive SRY gene = male\n\nNo active SRY gene = female",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "Don’t stoop to their level. There is no room for opinions in science, only facts",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "Secret_g_nome",
                            "body": "Chimeras, intersex and single chomosome people?",
                            "score": -10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "matthew0001",
                                    "body": "So the thing with intersex  is that a lot of people with the condition still predominantly lean one way or another. It's normally a male with a small penis, or a female with an abnormally large clitoris, and other fairly minute differences from the normal anatomy. Very rarely does it ever manifest the way people think intersex manifests.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "rupertyendozer",
                                            "body": "Yep, more than half of intersex people are still categorized as male or female.\n\nThe second thing is that while intersex exists, hermaphroditism does not.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Secret_g_nome",
                                            "body": "https://thefocusfoundation.org/x-y-chromosomal-variations/\r  \n\r  \nhttps://www.britannica.com/science/chimera-genetics\r  \n\r  \n[https://www.britannica.com/science/intersex](https://www.britannica.com/science/intersex)  \n\n\nAgain, doesn't mean they are not real and undeserving of a name.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "AbortionSurvivor777",
                                    "body": "Rare outliers dont make sex functionally non-binary. We know how sex is determined and that is a binary (yes or no) signal of a particular gene. \n\nIn biology we tend to describe things as part of the norm. Humans have one head, two arms, two legs and are either male or female. Just because it's possible to be born with more or less arms than two, we dont describe humans as having anywhere from 0 to 4 arms.\n\nWhen sex falls outside that binary it's because some normal part of development did not function as it should have.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Secret_g_nome",
                                                    "body": "[https://thefocusfoundation.org/x-y-chromosomal-variations/](https://thefocusfoundation.org/x-y-chromosomal-variations/)  \n\n\n[https://www.britannica.com/science/chimera-genetics](https://www.britannica.com/science/chimera-genetics)  \n\n\nhttps://www.britannica.com/science/intersex",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Secret_g_nome",
                                            "body": "\"as it should\" sounds very subjective imo.  \n\n\nhttps://thefocusfoundation.org/x-y-chromosomal-variations/\r  \n\r  \nhttps://www.britannica.com/science/chimera-genetics\r  \n\r  \n[https://www.britannica.com/science/intersex](https://www.britannica.com/science/intersex)  \n\n\nYeah and its less than 0.01% of people. We need words to describe them. Why people are so offended by natural variance and use of language is stunning to me. Should we just not use words to describe variance and play pretend? Or can we give them a name and let them be that? Or better yet, let them name themselves.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AbortionSurvivor777",
                                                    "body": "As it should isn't subjective, it's based on whether or not parts development happened in accordance with their proper function. I'm sure even you can admit that when someone is born with one arm, something went wrong.\n\nWe already have words to describe them, intersex is about as accurate as it gets. The issue isn't with these people existing or us acknowledging the existence of their conditions. It's the attempt to use these very rare outliers to push a weird agenda of labeling something like sex as being non-binary. I'm concerned with people warping reality to suit their political agendas and how the scientific community is allowing it.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Secret_g_nome",
                                                            "body": "So you are pro laws that prevent people with one arm from participating in sports or defining where they go to the bathroom? Should we not teach about one armed people in schools? Should we ban books and television shows with disabled characters? There is a historical precedence for that and it frightens people...\n\nIts not a weird agenda at all my dude. Its the APA that changed it from a disorder to not a disorder in 2019 and our society is trying to adapt and normalize. Much like when they removed homosexual as a disorder in 1969 and folks made the same kinds of arguments against their integration too.\n\nIf it doesn't impact how you describe yourself or feel about yourself then it doesn't matter.",
                                                            "score": -7,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AbortionSurvivor777",
                                                                    "body": "Where did I say I supported any of those things? The ONLY thing I'm concerned with is twisting science to fit a political agenda. The APA and the DSM-V is an entirely separate discussion, but notably relevant to the politicization of science.",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Christoph_88",
                                                                            "body": "certain people also like to point to homosexuality being taken off of the DSM as a sign of the politicization of science, because their politics demand that gay people be recognized as disordered.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AbortionSurvivor777",
                                                                                    "body": "The most widely accepted definition of mental illness/disorder is any persistent or recurring mental state that causes distress to the individual or urges to harm oneself or others. By this definition, unless you have a warped view of homosexuality being somehow harmful to others, it makes sense for it not to be included among disorders or illnesses.\n\nHowever if you take something like gender dysphoria which causes ample distress to the sufferer, then it's clear that it should be included, but isn't. This is an example of politicization, trying to escape the label of mental illness. At the end of the day, psychology is very far from a unified and empirically sound field of study so not everyone even agrees on that basic definition. The sad part is we should be trying to eliminate that stigma rather than escape the label.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Christoph_88",
                                                                                            "body": "If you do an honest evaluation of someone suffering from gender dysphoria, and the processs of transition alleviates that dysphoria, how can you say that the trans individual is mentally disordered if the cause of their disorder is alleviated?  Gender dysphoria has criterion to follow in the DSM-V, being trans does not.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "AbortionSurvivor777",
                                                                                                    "body": "Well transitioning is the therapy, so let me answer that with a question. \n\nIf someone with depression is treated with antidepressants and they aren't depressed while on them, are they still mentally ill? It kinda depends on how you define the pathology. If we stopped treatment in either one of those cases would that person revert back to suffering? Probably. Or is a diabetic still diabetic if its controlled with insulin? I would say yes.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Christoph_88",
                                                                                                            "body": "A therapy can result in a disorder being cured, or it can result in treating symptoms but not cure the underlying cause.  Anti-depressants treat the symptoms and cannot cure the underlying cause, whether that cause be a genetically based neuroendocrine imbalance or a more life situational basis where introduction of other treatment modalities like CBT can produce longer term results.  Transition ostensibly looks to be the former, where by itself alleviation of dysphoria is achieved.  Is a cancer patient given a therapy that clears the tumor still a cancer patient after treatment?  By your logic, yes, even though its patently absurd given the tumor burden is gone.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "AbortionSurvivor777",
                                                                                                                    "body": "Cancer is a different case, dont you think? Yes, if you can cut out the source of an ailment, then of course you would be cured. But that isn't what happens in the treatment of gender dysphoria. \n\nTransitioning doesn't cure the cause, it just temporarily alleviates symptoms of dysphoria. If a person stops transitioning, they will continue to experience gender dysphoria, I'm sure you would agree. Transitioning as a treatment for gender dysphoria is more akin to taking antidepressants for depression than it is cutting out a tumor. Much like how the treatment for bipolar disorder that didnt respond well to medication is to just try and live a healthy lifestyle. That doesn't cure their condition, but can help alleviate the extremes of manic and depressive states.",
                                                                                                                    "score": 2
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "bigmonkey125",
                                                                                            "body": "Dysphoria was removed? Strange, I still learned about it in psychology class.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Secret_g_nome",
                                                                            "body": "That's what the discussion is my dude. Its being politicized and weaponized to ban and inhumane people. In some US states they passed laws allowing gym teachers and sports coaches to check out girls coochies to make sure they are \"actually girls\"\n\nWe have to fight back. Our rights are being eroded for hate. Its already politicized, what can we do? The science says the best thing to do is accept people and leave them be, Which is my political philosophy. Sadly the party supposed to represent that is creating a cultural war as they swing towards extremism.\n\nThe last time a western nation passed similar laws was 1938 Germany... Now several US states. Banning and burning books, limiting educational content, controlling who does what where and genital inspections. Its fucking disgusting and I'm sure you agree. What choice do we have but to politicize it right back? For evil to win all we have to do is sit back and say nothing.\n\nAll over a simple change to the literature. I'm sure politicizing gay rights in 69 and civil rights in 76 made a lot of people uncomfortable too. What choice do we have in the face of segregation and religious rule?\n\nSo every time someone says \"they aren't real\" or \"don't deserve equal treatment\" we get riled up! The discussion is more than the one liners and buzz words and marketing. There is a claim right now that Ukranian's are not real and therefore deserve their freedoms and political decisions taken from them. Same shit, different place.  \n\n\nI don't know much about social studies or gender studies but I know more than enough biology to account for a small number of people bein several deviations from the norm. Its a statistical reality smaller than a rounding error. As populations grow into the billions there are enough to form communities.  \n\n\nMost rural towns and schools have none in their regions or cities. Huckabee Sanders, a loud proponent has exactly 0 openly tans people in the school district in her state. 1 had graduated in the last 10 years... Its such a nothing burger issue.",
                                                                            "score": -2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AbortionSurvivor777",
                                                                                    "body": "This is the wrong hill to die on in the name of Liberty.  In fact there is a case to be made that the rise in Conservative authoritarian policies are in part in retaliation to progressives twisting reality to fit their own goals.  Neither side is right, but this is what happens when people throw out the truth and vilify anyone who denies them.",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Secret_g_nome",
                                                                                            "body": "Villify anyone who denies them is the MO of the right... They use that projection technique a lot. They deny literally everything they don't like and then accuse the opposition of what they do.\n\nTaking away our children's rights, privacy, bodily autonomy and free speech isn't the hill to die on? Should we not have the right to read and study what we like? Why do religious folks get a free pass to dictate their nonsense on others? \n\nWhere is the line then? Destroying rights and free speech is kind of not negotiable to me. Sounds like doublethink and doublespeak to me.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "AbortionSurvivor777",
                                                                                                    "body": ">Villify anyone who denies them is the MO of the right... They use that projection technique a lot. They deny literally everything they don't like and then accuse the opposition of what they do. \n\nAbsolutely wrong. This is the primary tactic used by BOTH SIDES in the modern political climate.\n\nI meant the designation of sex as binary or non-binary is not the hill to die on. Book bans and abortion rights are and if it was happening in my country I'd be raising the pitchforks. But this is how the conservatives get empowered to enact authoritarian policies, by misrepresenting the facts to further your agenda you're giving them the ammunition they need to discredit you.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Secret_g_nome",
                                                                                                            "body": "I'm not misinterpreting facts. This is a regular occurrence in the news.\n\n[https://kansasreflector.com/2023/04/09/kansas-anti-trans-sports-law-opens-door-for-genital-inspections-of-kids-thats-the-simple-truth/](https://kansasreflector.com/2023/04/09/kansas-anti-trans-sports-law-opens-door-for-genital-inspections-of-kids-thats-the-simple-truth/)\n\n[https://ohiocapitaljournal.com/2022/06/17/after-backlash-gop-leader-says-genital-inspections-wont-be-part-of-anti-trans-athlete-bill/](https://ohiocapitaljournal.com/2022/06/17/after-backlash-gop-leader-says-genital-inspections-wont-be-part-of-anti-trans-athlete-bill/)\n\n[https://www.nbcnews.com/nbc-out/out-news/florida-school-districts-removed-roughly-300-books-last-school-year-rcna104367](https://www.nbcnews.com/nbc-out/out-news/florida-school-districts-removed-roughly-300-books-last-school-year-rcna104367)\n\n[https://bookshop.org/lists/books-banned-in-florida-and-texas-in-2022](https://bookshop.org/lists/books-banned-in-florida-and-texas-in-2022)\n\n&#x200B;\n\n[https://www.nytimes.com/2023/04/22/books/book-ban-florida.html](https://www.nytimes.com/2023/04/22/books/book-ban-florida.html)\n\nRemember when they shot unionists in the 30's and burned down black financial cities in the 50's then rioted against gays in the 60's and lynched Civil Rights activists in the 70's then protested gay marriage in the 90's and now trans people today? Banning abortion, banning sex ed, banning  gender studies, banns on teaching about slavery and on and on and on...Almost like canceling people and denying them rights is their political platform.  \n\n\n[https://www.lgbtmap.org/equality-maps/youth/sports\\_participation\\_bans](https://www.lgbtmap.org/equality-maps/youth/sports_participation_bans)\n\n[https://www.pbs.org/newshour/politics/here-are-the-restrictions-on-transgender-people-that-are-moving-through-u-s-statehouses](https://www.pbs.org/newshour/politics/here-are-the-restrictions-on-transgender-people-that-are-moving-through-u-s-statehouses)\n\n[https://www.npr.org/2022/02/03/1077878538/legislation-restricts-what-teachers-can-discuss](https://www.npr.org/2022/02/03/1077878538/legislation-restricts-what-teachers-can-discuss)\n\nMy country even has travel warnings to several of these states...",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "AbortionSurvivor777",
                                                                                                                    "body": "I'm not sure what I'm meant to engage with here. Those things you mention from the early 1900s are recognized today as abhorrent. Modern day anti-abortion/book bans are a retaliatory response to the progressive agenda in the last decade. \n\nIt's like a pendulum that swings back and forth. The harder it swings in one direction the harder it will swing back the other direction. I think the progressives took it too far with their methods in the last decade and now the Conservatives are taking it too far by hitting abortion rights and banning books. If more of us were moderates, the extremists wouldn't be running the headlines.",
                                                                                                                    "score": 5,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Secret_g_nome",
                                                                                                                            "body": "The 1990's wasn't some past that is gone. Have you seen the age of the average senator and congress person? Its mostly the same people sitting in the same chairs.\n\nFrom the episode \"White Power\" from Sam Harris speaking to an ex skin head Neo Nazi (poorly paraphrased) 'We traded in our tattoos and leather for briefcases and suits, we changed from using words like Jews to Globalists and the goal was to make our talking points mainstream' -10 years later id say they succeeded.\n\nDo tell of this pendulum? Is it only in the US? Seems to me that lots of Authoritarian and theocratic nations could see it swing the other way any day now. Democracy is under attack from the extremes, not just 'right wing values' but actually controlling speech and thought and attempting to enforce it with violence or shut down the nation. \"right wingers\" don't attempt to take the capitol and vow to hang their opponents. Most are civil and want a democracy or republic of some kind.\n\nI know right wingers in my life who are appalled by what they see. They may not like the progressive left but they like Authoritarians of any side a lot less. A small minority of republican senators and congress people are trying to hold the whole nation hostage. Its not a really a typical democratic swing nor is it a both sides thing.",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "bigmonkey125",
                                    "body": "Still describable as male or female. Just studied this in university. There's nothing that can be called \"in between\".",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Secret_g_nome",
                                            "body": "XYX with an inactive Y? What about X people?   \n\n\n[https://genetic.org/variations/](https://genetic.org/variations/)  \n\n\nSeems like there are over 12 viable variations...  \nrefusing to name them doesn't make them less real.  \n\n\nCalling people who have these variations mental disabilities is cruel.  \n\n\nIf its a semantic argument to discredit or dehumanize people that's even worse.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "bigmonkey125",
                                                    "body": "I didn't call them mental disabilities. And i am aware of the multitude of variations, thank you. Did you not read what I said? It's not that we can't name them. We name all kinds of things. Just that they can be described under the umbrella terms of \"male\" or \"female\". Who said we couldn't have specific names for things under another name? I'm not dehumanizing anyone.",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "nathsnowy",
                                    "body": "yea but nah sorry xx and xy, less then 1% has those included and they already have a name",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Secret_g_nome",
                                            "body": "They are less than 1%... trans folks are only about 0.01% of the population. It just so happens in cities of millions of people there are enough to form community. If you have spent time with them they are different and so it makes sense they would need a different name.\n\n“What's in a name? That which we call a rose, by any other word would smell as sweet. It is neither the hand nor foot nor any other part of a man.\"\n\nWords are really not that hard. You probably have a vocabulary of over 2000. adding 1 or 2 won't harm you in the least. Being stubborn about nothing is pointless.  \n\n\nWait till you discover the nomenclature in Herps. Sometimes a stripe or colour difference classified different salamanders as entirely different species even if they are genetically extremely similar and interchangeable.   \n\n\nIf we find a physical difference then we can apply a name to it. If there is a potential these people are in reality, and biologically that can be so, then there is no argument to be had. I don't know much about social studies but form follows function in biology. A rare variance in nature that seems to match a rare variance in people.... that's proof enough for me",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Mysterious_Produce96",
                            "body": "How do you know which pronouns to use for people before you can test which SRY their genes carry? Do you use neutral pronouns as a placeholder until your tests come in?",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rupertyendozer",
                                    "body": "I assume based on the visual image of the average phenotype. We assume, but there's often exceptions.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "4th_times_a_charm_",
                            "body": "Is that like gametes?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "80S_Ribosome",
                    "body": "Female = big gamete\n\nMale = small gamete\n\nThis is the better definition and is pretty much the only universal dimorphism across the animal kingdom.\n\nEdit: gender is clusterfuck that I don't comment or touch as a natural scientists. I'll leave it to the social scientists and conservatives to rip each other up. Meanwhile I'll live however the fuck I want too whether I wanna a skirt or a suit, no one should be allowed to tell me how to live my degenerate lifestyle",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DrZetein",
                            "body": "That would mean people who don't produce gametes are neither male nor female",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "80S_Ribosome",
                                    "body": "The piping is still in place for making gametes; so you can still classify them as male or female.\n\nEdit: Klinefelter remains male because they have testicles even though they may not produce viable gametes.",
                                    "score": 9
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "sex not gender\n\nYou forgot chimeras, intersex people and people with phenome-genome expression differences...\n\nHasn't been classified as a mental disorder in years.  \n\n\nI don't get why these folks want to force others to act a certain way. Just live and let live.",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bigmonkey125",
                            "body": "Who's forcing who to live any way? Also, as I pointed out before, intersex individuals can still be called male or female depending on the specific variant.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "Did you miss the book and education and sports bans and the banning of specific language in some states? Its super disturbing.  I wouldn't care so much if people's rights were not being stripped in law.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bigmonkey125",
                                            "body": "I have heard of such things. It's not good. But both sides of the conflict are being very annoying about the affair and I'm sadly not an important person who can make up laws to try and make people happy.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Secret_g_nome",
                                                    "body": "Its more the legislation that gets to me. I think people should live and let live but here we are.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bigmonkey125",
                                                            "body": "It's \"live and let live\" until some fool does something that no one likes. Society isn't that simple.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Secret_g_nome",
                                                                    "body": "you mean they use their free speech to disagree and disprove?... That's kind of the main point of free speech, free press and free expression...",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "euph-_-oric",
                                                    "body": "1 side is legislating people out of existence , creating laws to inspect your children's genitalia, labeling an entire group as groomers vs the side the sometimes says ridiculous things online...",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bigmonkey125",
                                                            "body": "It goes one way after a while. I didn't say I agree with the one side, but I'm not exactly in any rush to find out what the other side might do either. I'll have to ask around more to figure out what both sides have done. I know for a fact I won't like either.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jice",
                    "body": "Hating people because they're different (whatever difference, sex orientation, race, religion, fucking neighborhood) is the real mental disability",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "Keep your thoughts and opinions out of science.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jice",
                                    "body": "Oh, so \"being different is a mental disabilities\" is science now?\n\n\\[edit\\] forget it. I've looked at your post history, it's pointless",
                                    "score": -3
                                },
                                {
                                    "depth": 3,
                                    "author": "NovelNeighborhood6",
                                    "body": "Trans people have existed and always will exist. It’s not an opinion, it’s a fact.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "*mental illness",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Andrelse",
                                    "body": "Meanwhile you claimed there were only 2 human genders despite scientific consensus saying otherwise. Please keep your opinions in check.",
                                    "score": -3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Serai",
                    "body": "1% of 1% is still more than 0. How is that so hard to grasp, especially in a science subreddit? If there are more than two, there are more than two. Might be rare, but they still exist. Good enough for science.\n\nPerhaps not good enough for you. But thats soft science. And thats fair. 3+ = 2 wont get you far in maths at least.",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "flipaflip",
                            "body": "Uhhh…. Have you heard of scientifically significant and significant figures? It kind of really matters in the science world.\n\nI’m not saying they don’t exist, I’m saying in the general population, scientifically proven by numbers, those who fall outside of that tend to be scientifically insignificant compared to the rest of the population.\n\nBut then again I guess I could be a complete bigot and I hate all intersex people? 🤷🏻‍♂️",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "McMyn",
                                    "body": "There’s also no human prodigies. No musical or scientific or artist geniuses at all. Because if there are, they are so few. ‚Scientifically insignificant‘ I think is the term. Mozart? Einstein? Should ignore them, barely real people. I’m not saying they don’t exist, but definitely don’t give these statistical outliers *any* attention.\n\n/s, obviously",
                                    "score": -1
                                },
                                {
                                    "depth": 3,
                                    "author": "Serai",
                                    "body": "A thing with three or more values can, by its own definition, not be binary. Keep your sigfnicant Numbers to yourself, they are only relevant to what is common. Not to what exists.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bigmonkey125",
                                            "body": "Well, even intersex individuals can be described as male or female. So it's still 2 general. We just have some people who are considerably interesting males or females.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Serai",
                                                    "body": "If thats your definition then thats fine. Just dont equate your general definition with actual science.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bigmonkey125",
                                                            "body": "No, as in they do fit the definition. They still do or do not have a functional SRY gene. That is the genetic definition of sex. I based my own definition on the genetic definition. Because, y'know, science is about defining things. What bothers me is when people try to force other so use their definition for no purpose than to satisfy whatever political vendetta they're trying to drive.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Serai",
                                                                    "body": "So are they there but not significant numbers or are they outside of the definition? You have to pick one.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "bigmonkey125",
                                                                            "body": "Third option: they fit within the initial definition. I don't get why you didn't make that an option for me. They are within the definition regardless of the statistics. A very interesting male or female is still a male or female. No reason to arbitrarily ostracize them just because they're a little different.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Serai",
                                                                                    "body": "«Very interresting» isnt a scientific term. Why are all the «its binary!!»-people so terrible at science?\n\nIf they are fundamentally different, as different combinations of x and y are, the grouping them together because you want to win an argument is a bad way to do science.\n\nBiology does not care about what is interresting to you. It cares about variation. Regardless of rarity.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "bigmonkey125",
                                                                                            "body": "You're getting very upset because of what is only colloquialism. They are fundamentally different from a typical male or female but they can be classified as such without issue as they are simply deviations from a standard male or female. I just prefer to say \"interesting\" as people like you would likely get more angry if I said \"anomalous\".  I'm generally scientific, but I'm also not linguistically oblivious. Seriously, don't get so hung up over my word choice. Diction does not make one less scientific. A scientific mind would understand that. And also, I'm not acting against variation. I'm trying to be inclusive by pointing out that these people are still men and women.",
                                                                                            "score": 2
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Lol 😂 go away silly brain https://i.imgur.com/d49ghrk.jpg",
                                    "score": -1
                                },
                                {
                                    "depth": 3,
                                    "author": "DrZetein",
                                    "body": "It definitely is scientifically significant to recognize that no sex definition applies to 100% of the population. Even if a single person in the world was born outside of a definition, it would be enough to prove that the rule is not enough to define everyone. At the end of the day, sex is still another socially constructed concept, with multiple definitions that are meant to describe what is true in the majority of cases, but will never be enough to describe all of them. Some of these definitions are based on characteristics that can be changed through medical interventions, such as morphologic aspects (sex organ and secondary sexual characteristics) and dominant sex hormones, and as medicine evolves more of these characteristics will be able to be changed, that is effectively the same as changing sex, which proves that sex is not immutable.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bigmonkey125",
                                            "body": "Well, as far as I've seen, intersex is still male or female. Just a very interesting male or female.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "redditblows69420",
                    "body": "Gender and biological sex are two different things. Gender evolves with culture, some cultures have two genders some have more. Gender and gender roles are a social constructs that can be changed by society. So you either don't know what the fuck you're talking about or are being disingenuous",
                    "score": -11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "No, no they are not! There is absolutely no scientific basis for your thoughts",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Christoph_88",
                                    "body": "There is a substantial scientific basis for this.  Point to me the genes responsible for women wearing dresses and men wearing pants, or pink being a girls' color and blue being a boys' color.  Once you to start to dissect social expectations of gender, you realize there is no biological basis for almost any of our beliefs of gender.  Gender essentialists want to argue that these are all biologically based, and thats why this being pushed against in anthroology, because cultural evaluation shows there are completely polar opposite applications of gender beliefs.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Catsandjigsaws",
                            "body": ">Gender and gender roles are a social constructs that can be changed by society.\n\nSo then society could decide that gender requires a biological basis (i.e. to be a woman you need to be female) correct?\n\nI don't understand how you could say gender is a social construct and then demand society perceive you in a certain way.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Zess-57",
                    "body": "The universe is 91% hydrogen, 9% helium and only 0.1% everything else, yet without that 0.1% we wouldn't exist",
                    "score": -39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "icookseagulls",
                            "body": "Are you arguing that without transgender people none of us would exist? lol.",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Zess-57",
                                    "body": "No but things shouldn't be simplified to a binary, and complex organisms are the least likely to strictly follow a binary, there's always deviance",
                                    "score": -35,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "Your arguement doesnt make sense outside your head.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Secret_g_nome",
                                                    "body": "Actually in Biology it makes good sense, everything is graded on a curve. Some things are 2 or more standard deviations out but that doesn't make them less real.  \n\n\nWould you deny chimeras are real even if they are less than 1/10000?",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "You are saying that there's people with different cromossomes than whats known and some third type of genitals out there?\n\nYeah, no.\n\nHe is arguing that beyond a simple threshold added complexity makes things unclear, maybe for retarded people.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Secret_g_nome",
                                                                    "body": "well in science and math that added complexity is how we make sense of the world and how we develop new materials.  \n\n\nAccepting nuance and facts is maturity and higher education. Only siths deal in absolutes ;)",
                                                                    "score": 0
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "icookseagulls",
                                                            "body": "“Transgender” people exist, but a transgender woman who’s biologically male isn’t actually a woman.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Secret_g_nome",
                                                                    "body": "Sounds like a The ship of Theseus issue. Imma leave that to the individual and their healthcare professionals.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "icookseagulls",
                                                                            "body": "And that’s fine. A transgender woman can believe whatever they want to. \n\nBut should biological males be allowed in women’s sports? In women’s bathrooms? In women’s prisons?",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Zess-57",
                                                                                    "body": "Would something bad happen if they were in a women's prison? why do even need gendered prisons in the first place?",
                                                                                    "score": 0
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Secret_g_nome",
                                                                                    "body": "its a bathroom my dude. We had an intersex bathroom in my house growing up.\n\nIf they arn't raping people I don't see why anyone would care. We already have laws for that so....\n\nAlso if they look like a man due to surgery and hormones they will scare the crap out of women going into a woman's room. Many cannot be distinguished while clothed.\n\nAlso led to one nasty incident Where a Sporting team parent ranted and screamed at a masculine looking girl born girl for being trans and cheating. Seems like people were always a mix in appearance anyways.  \n\n\nSounds like excuses to be angry for no reason to me.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GreenLurka",
                    "body": "You literally contradicted yourself with a pause in between. Also, intersex disorders make up about 1.7% of the population. Which is much more then less than 1% of 1%. Your math is way off there.",
                    "score": -33,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "shitholejedi",
                            "body": "They do not reach that number in the population. This number (Fausto Sterling)has been disproven multiple times since it was conjured up in the 2000s. It is created by lumping anyone with a developmental hormone disorder as intersex which it isnt.\n\nThe author of that book has admitted so that the true population is a percentage of 1%.",
                            "score": 24,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GreenLurka",
                                    "body": "Interesting. It was my understanding that those hormone disorders counted as they resulted in individuals with intersex traits that otherwise wouldn't be distinguishable.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "GreenLurka",
                                    "body": "So I went and did the reading, and the counter reading. And even if we don't lump things like Klinefelters in as intersex, Klinefelters don't fit into the binary sex definitions anyway. There's talk of new terminology, it seems that's all still up in the air.  \n\n\nEither way,  Giettus is wrong. Genetic disorders like XXY, YYX, and intersex disorders represent, when grouped together, 1.7% of the population. 1.7% of the population does not fit binary gender.",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Traditional_Peach_29",
                                            "body": "Intersex people are still female or male. True hermaphroditism is a condition not compatible with life in humans. Sex is very much binary, biologists don’t just define it by chromosomes.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "GreenLurka",
                                                    "body": "Without getting into the mess of definitions and contrary definitions where different disciplines of Science can't seem to agree with each other or the people with these conditions themselves. There are males, females, and others. Others make up about 1.7% of the population.",
                                                    "score": -3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Traditional_Peach_29",
                            "body": "Intersex people are still female or male.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "yellowbrickstairs",
                                    "body": "Do you mean in terms of chromosomes? Cause they can have the chromosomes of 1 sex and then present as another in physical form. I guess it's then up to subjective opinion on what they are, their physical body or their chromosomes",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Traditional_Peach_29",
                                            "body": "Chromosomes aren’t everything, it really is complicated. You can have XY chromosomes with no SRY. The physical body and the organization of the reproductive system is more important",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Zess-57",
                                    "body": "How? They're intersex, because they both have male and female biological features at birth",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Traditional_Peach_29",
                                            "body": "Intersex people do have atypical sex characteristics, but they will still produce only one of the gametes or have a reproductive system organized around the production of one gamete.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Zess-57",
                                                    "body": "So are infertile women no longer women because their reproductive system is disabled?",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Traditional_Peach_29",
                                                            "body": "Wow you for sure have no reading comprehension",
                                                            "score": 14
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "HesNot_TheMessiah",
                                                            "body": "Nah.\n\nXX.\n\nQuite simple really.",
                                                            "score": 8
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "GreenLurka",
                                                    "body": "I don't usually go with feelings on cases like this, sticking with the hard science is the best go to. Having said that, I'll violate my own rules and say this feels very much like the argument of a group of people who wanted to jam everyone into a binary definition.  \n\n\nIt doesn't look like it stems from understanding the conditions themselves, and coming at them from the perspective of 'this must be male or female' looks very much like an argument set in feelings and keeping the status quo rather than an objective look at facts.  \n\n\nWe can obviously point to cases where individuals won't produce gametes at all, where they will outwardly present as male but have ovaries and vice versa. You want us to then argue that the bearded person with a penis, who insists they are a man, is in fact a woman because they possess eggs? Eggs that are functionally useless to them without direct medical intervention?  \n\n\nA binary definition demands one or the other. A spectral definition says a person can be somewhere along that line. Even if you want to define sex what gametes are produced, you come across cases where no gametes are produced, or true hermaphrodites. Or even animals where the entire sexual reproductive organs will metamorphize and they will go from produce one gamete set to another.  \n\n\nThe fixation on a gender binary seems useless and futile in the face of nature.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Traditional_Peach_29",
                                                            "body": "No one is arguing that sex characteristics are binary because it’s obvious they aren’t. \n\nWhy are you completely ignoring my second part of the answer? Many people don’t produce gametes, yet they’ll still have a reproductive system centered around one of them. If a person has a penis AND ovaries, they will still have a reproductive system centered around sperm production. You’re arguing against an argument you’ve misunderstood.\n\nTrue hermaphroditism, as it’s encountered in other animals, doesn’t exist in humans. There have been no human individual to self fertilize with their own gametes. It’s a disorder that is very rarely observed and understudied, most often a result of chimerism, and (especially considering the last point) shouldn’t be used as proof that humans can be neither or both male and female. And it’s ridiculous to somehow bring animals into a discussion about human genetic variety.",
                                                            "score": 7
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mastermide77",
                    "body": "Sex and gender are two different things. Also many different cultures around the world have had more then 2 genders",
                    "score": -71,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "wsorrian",
                            "body": "They are in fact, not two different things. This wordsmithing nonsense needs to stop. Claiming otherwise is like claiming there is a difference between color and hue. And just because you can point to someone in history believing the same lie you believe today doesn't make that lie true.",
                            "score": 52,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ChiefRom",
                                    "body": "Bam! Very well said!",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "yellowbrickstairs",
                                    "body": "Colour is a catch all term and there are many aspects to colour, hue refers to pure chroma",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "wsorrian",
                                            "body": "hue \\[(h)yo͞o\\] NOUN: a color or shade.  \n\n\nAll you did was make the exact same logical fallacy I was talking about all over again.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "yellowbrickstairs",
                                                    "body": "Shade is hue + black, colour theory teaches us about a spectrum of pale to dark colour, pale being hue + tint and shade being hue + black\n\n\nhttps://en.m.wikipedia.org/wiki/Tint,_shade_and_tone",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Lyrael9",
                                    "body": "The fact that gender and sex are different things is exactly the reason why the dropping of this panel is so ridiculous.  Anthropologists *know* sex and gender are not the same thing.  They know sex is binary, which is completely separate from whether or not gender is binary.  Anthropologists know the difference and shouldn't have any issue talking about the binary state of sex.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "wsorrian",
                                            "body": "Gender is a term bastardized by a criminal psychopath, \"Doctor\" John Money, to justify his weird sexual experiments.\n\nThe term is an English word originating somewhere around the 15 century and meant male or female. In the late 19th century that was changed to breed, kind, or sex, still referring to the biological reality.\n\nLater, John Money refashioned the term by linking it with identity. That meant making a false distinction between biology and self perception. Since some men and women had slightly varying degrees of masculine and feminine behavior, some even sharing across these lines, political and social groups with converging interests saw an opportunity create social chaos upsetting what they viewed as the oppressive patriarchal dominant class. So behavior became conflated with identity and societal roles were attacked.\n\nThe problem with the logic in this is behavior is largely genetic. It's not immutable, but forcing artificial changes in someones behavior leads to disastrous outcomes, as we plainly saw with 2 of Money's victims. Maternal and paternal behaviors are instincts. They are genetic. Therefore the roles they play stem from their genetics. So even if we accept the distinction between gendered behavior and biological sex, it still leads to a binary outcome. Male and female.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Lyrael9",
                                                    "body": "How the terms sex and gender are used (and have been used) generally changes (etc), but in Anthropology gender and sex are two very distinct (but related) terms.  And it's very important that they're different.  For Anthropology.  When people use these terms interchangeably in everyday life, it creates some confusion but in Anthropology they have separate meanings and these Anthropologists know this. And the idea that Anthropological and Archaeological organisations are letting politics interfere with their profession is so disappointing.  What's next?  Biologists?  \n\nEstimating the biological sex of a skeleton is not *transphobic.*  The gender identity of that individual, on the other hand, can't really be identified from the skeleton.",
                                                    "score": 0
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Andrelse",
                                                    "body": "1. Meanings of words change all the time. Ultimately the point of a word is to be useful. Redefining gender as a term distinct from sex to denote biological vs societal makes sense.\n2. If you are against forcing artificial changes in someone's behavior, wouldn't you then support people expressing themselves in whatever gender they choose, and not forcing a set of expressions upon them?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "The roles we play are constructs tho... They are acts we teach our children. Nothing more.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "wsorrian",
                                            "body": "The roles we play stem from behaviors which are heavily influenced by genetics. They are assigned by that which we are best suited. The concept of a man providing for a family with his job may be a learned concept (it's not, but you can argue that), but the desire of a man to have and provide for that family is genetic. The same applies to a woman. The concept of a homemaker might be a social construct (it's not, but you can argue that), but her desire to keep a safe environment in which to nurture children is instinctual - it is genetic.  \n\n\nEverything is a construct. That's a meaningless term. It's a buzzword. There are social constructs, physical constructs, biological constructs, psychological constructs, etc. Sometimes these constructs are subsets of other constructs, and sometimes they're not. Some social constructs stem directly from biological constructs, as do some psychological constructs. As such they are vital for mental, physical, and societal health.   \n\n\nI want to be clear. I am not blaming you or trying to disparage you. But your comment is the end result of logical fallacies, goal post shifting, hair splitting, and rhetorical pilpul that has all but destroyed academia. Your perception of these constructs is colored by less-than-honorable people who died long before you were born, but left behind their books and teachings, full of nonsense, but still taught as if they have academic value. They do not. They are subversive propaganda masquerading as philosophy or thoughtful critique. In short, the modern perception of these constructs comes from these people who had a vested interest in destroying the nuclear family that they viewed as an obstacle to be overcome, and not as the natural result of a healthy people and a healthy society.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Andrelse",
                                                    "body": "The nuclear family is a fairly new social construct. For you to claim it's the natural result of a \"healthy people and a healthy society \" kinda invalidates your whole point.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Secret_g_nome",
                                                    "body": "I know straight and cis men and women who don't fall into your \"biological norms\"I know women who hate their kids and regret their decision to settle and I know dudes who give zero shits about providing for their families. Conveniently disregarding things you don't like to look at does not make them less real.\n\nIn Biology there are two main hormones that determine behavior in a typical man. Men with more Oxytocin tend to be providers, loyal partners and dedicated parents, men with more testosterone tend to take on multiple partners, give no fucks for offspring. Its visible from groundhogs on up.\n\nYour \"genetic\" claims are not based on anything. I studied biology. Behavior is a result of Hormones, brain wiring and cultural rewards/stimulus.\n\nI know a family with many kids. Some of the boys ended up with their mother's body type and others with their father's. Some ended up with their mother's personality type and others with their fathers. Using this simple example we can see how genetics get mixed and recombined in near random ways. They had at least one miscarriage and so recombination can lead to non viable combinations as well. These are as far as I know all cis people.\n\nFor most people societal constructs do match biological ones. We all know people whop are great fits to stereotypes and norms and they have zero social/cultural struggles in society. However Genetics is near random there is no mechanism in the body or in the genome to pair this with that, chains from both parents get taken and filled into a chromosome that is not even necessarily viable as an organism.\n\nYour assumption (aside from your conspiratorial nonsense that has nothing to do with the current discussion) is that EVERYONE must fit because you fit. Biology doesn't work that way, otherwise evolution could not be possible. Mutation and recombination are the mechanism of evolution and genetics. Change and variance are necessary for natural selection to even work...\n\nIts why boys raised by hunters are much more likely to be hunters than boys raised by programmers. Same was true in ancient societies when many sons of lords got into accounting or science or theocracy, not all boys are warriors. Its often cultural, not genetic. My father is a soft and empathetic man, My mother is a hard ass get shit done kind of person. My grandfather was an engineer and in no way a violent hunting hardass of a man that was the norm of his time, his wife went back to work after having kids and was shunned by many. They fail to match the stereotypes and norms in your assumptions but are only within 1 SD of the norm, they were always mocked and ridiculed by the normies despite being very similar. People who differ 2SD and 3SD from the norm (so that's the 10% and less than 1% on the ends of a bell curve) won't. Greeks were known to be tough guy oiled up by little boys gay guys and were shocked when Persian warriors approached wearing eye liner. Koreans have a period of their history they mock in film of how soft and silky and pretend wail-y the ineffective leaders of the Josen period are sometimes depicted to be. I had a flamboyantly gay Korean (from like a mile away) manager who's cousin, an adult man with a family and career, had no idea and said \"some people in my culture are just like that\". If your claim is true when do many men and women chose to become monks or nuns? are they \"not real?\" Why do other cultures not see what you claim as strictly as your universality makes it sound?\n\nNow we understand society is constructed for the \"Norm\" that's obvious and to be expected. The problem is that those who differ should not be stoned to death or jailed (as they are in most countries) nor should their exitance be illegal or invalidated. We should not be banning books that talk about them nor limiting studies (modern studies in the free world) into how other sub sets of culture live. They should be allowed to live and let live.\n\nI'm not shifting goal posts or hair splitting. I've met all these kinds of the people in these communities. They are different and I fail to see the problem. Appeal to nature is also a logical fallacy I will remind you since you seem to think you are immune to fallacy.\n\nThe whole \"Its communism\" you allude to is nonsense. Just because the Soviets allowed women to work in most jobs first doesn't invalidate their contributions to businesses does it? Just because the Soviets gave equal rights to Blacks and minorities before the US did (at least on paper) doesn't mean segregation is a \"natural and genetic norm\". Even if that's what some geriatric senators seem to think, because in their era those were not the norm... Also founding fathers in the US wore wigs, makeup and robes... Kinda makes you wonder how norms shift and change over time...\n\nAlso your claim to the nuclear family is hilarious. Its only been around for 2 generations in very wealthy western nations. The norm elsewhere is everyone living in the same room for all the living generations.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "mastermide77",
                                    "body": "\"I will ignore thousands of years of social and biological science and study because of I don't like the outcomes,\" worrian.",
                                    "score": -29,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Electronic-Race-2099",
                                            "body": "\"I will ignore the obvious reality in front of me and parrot political bullshit instead.\"\n\n\\-mastermide77",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mastermide77",
                                                    "body": "If you mean backed up science, then yes. Yall are the ones who made it political",
                                                    "score": -1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Rukasu7",
                                                    "body": "such deep and sophisticated argument, truely amazing sir, how you dazzle me with your eloquence in articulating yourself and your believes.",
                                                    "score": -8
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "new-religion-",
                            "body": "lip subsequent cautious ossified telephone placid agonizing cough consist concerned ` this message was mass deleted/edited with redact.dev `",
                            "score": 41,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mastermide77",
                                    "body": "It's sex and gender. Both are considered science, lol. Many trans people do have surgeries that do change their sex organs. Most people use the terms interchangeably, even trans people",
                                    "score": -38,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tbald4",
                                            "body": "> Most people use the terms interchangeably\n\nGee I wonder why that might be?",
                                            "score": 25,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mastermide77",
                                                    "body": "Because most of the time your sex and gender match. That doesn't mean the words are the same. We have two words for a reason lol",
                                                    "score": -1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Rustymetal14",
                                            "body": "They don't change their sex organs, they mutilate them. MtF don't gain a vagina, they gain an open wound.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "yellowbrickstairs",
                                                    "body": "Woah. Haha can you imagine that surgery, wake up the patient and be like yep we took your dick and gave you a random hole in your crotch flesh? Literally the whole surgical department would get fired, that's some 1800s horror novel shit",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Rickor86",
                                                            "body": "It gets worse. I've heard and read stories of people who did the surgery and they experience nothing but pain on a constant basis.  In the example of M2F bottom surgery:  Every man knows you grow hair on the shaft of your penis.  Well, penile hair removal isn't a part of the surgery and they're given a tunnel that grows hair on the inside.  Simple tasks like urinating are extremely messy and time consuming.  If they don't dialate their \"Vagina's\" on a regular basis, it'll heal up leaving countless hair follicles growing deep under scar tissue causing infection.  This is just an example of some of the uphill battles these poor people need to constantly go through in order to \"feel happy\" in their true form.  I for one can't wait for the influx of lawsuits comming in the next 10-15 years.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Betelgeuse3fold",
                                                                    "body": "I was mortified to learn the uglier details of transition maintenence. Truly horrifying, is the stories from people who say they *weren't* informed about these things before hand. R Detrans is a harrowing sub",
                                                                    "score": 6
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ChiefRom",
                                                                    "body": "What will anger people is if, in the future, enough people that went the transition surgery sue, the government may grant disability status to these people then we as tax payers will be paying for their mistake.",
                                                                    "score": 2
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ChiefRom",
                                                                    "body": "They shouldn’t be allowed to sue. They did it to themselves, willingly. They don’t want to be responsible for the consequences in the future so they will sue.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Rickor86",
                                                                            "body": "De-transitioners who were under 18 when they transitioned are totally within their rights to sue.  And they will.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ChiefRom",
                                                                                    "body": "That is a reasonable exemption.",
                                                                                    "score": 0
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "ChiefRom",
                                                    "body": "Yup and they should not be allowed to sue in the future if they change their minds about it.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Rustymetal14",
                                                            "body": "They should be, because any sane doctor should be telling them not to do it. We don't see doctors cutting the limbs off of healthy patients who believe they are amputees, if they did the doctor would be sued for not recommending a psychiatrist instead.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ChiefRom",
                                                                    "body": "Right but we aren’t doing anything about it right now, when half of the population is telling the other half that it isn’t a good idea. So when the bad idea goes catastrophically wrong then they will want to be compensated for their own mistake.\nRight now we are dealing with people wanting to transition, which hey it’s your right and freedom to do so but when it goes wrong don’t expect sympathy from the rest of us.",
                                                                    "score": 3
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "mastermide77",
                                                    "body": "That would apply to literally every cosmetic surgery lol",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mastermide77",
                                                    "body": "Your dick is a sex organ lol. Are you a child? Do you not know what that is? Drop the boys and flip the boat. Bam you now have a pussy",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[deleted]",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "mastermide77",
                                                                    "body": "Don't think I want?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "bliip368",
                                                                            "body": "I don't think you'll understand with the above explanation you gave.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "mastermide77",
                                                                                    "body": "Being vague and esoteric doesn't make you cool lol. Say what's on your mind. We're all friends here",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "bliip368",
                                                                                            "body": "What makes someone cool?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "mastermide77",
                                                                                                    "body": "Not being vague or esoteric helps.",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Electronic_Rub9385",
                            "body": "Lots of cultures have fantastical rituals and magical thing.",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "new-religion-",
                                    "body": "label bedroom capable apparatus prick public alive library bear aloof ` this message was mass deleted/edited with redact.dev `",
                                    "score": 19
                                },
                                {
                                    "depth": 3,
                                    "author": "mastermide77",
                                    "body": "And we are no different, lol. Men and women change roles all the time. Don't like it? Get rid of gender",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Electronic_Rub9385",
                                            "body": "I’m not concerned. This too will pass.  The marketplace of ideas will purge this in good time.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mastermide77",
                                                    "body": "Considering how well the Republicans did in 2022 when all they did was campaign against trans people. No, I don't think you're winning this one, my man.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "morallyagnostic",
                                                            "body": "Maybe not a full win, but I can see a day where sex segregated spaces are once again segregated by sex not gender.  Also, many European countries have reversed course on Affirmative Care as the only treatment as the outcomes with puberty blockers, hormones and surgery's are not showing statistically significant improvement.",
                                                            "score": 14,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "mastermide77",
                                                                    "body": "The studies showing the good gender affirming care does are many and well backed. Politicians will find one study that says otherwise and make laws off that. The same studies who only polled the parents of trans kids and called a boy liking the clour pink gender dysphoria.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "morallyagnostic",
                                                                            "body": "Nope - they don't exist.  There are activist surveys with statistically insignificant results and massive drop out rates that the TRAs love to cite.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "mastermide77",
                                                                                    "body": "They do exist and all your bitching and crying only proves it",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "morallyagnostic",
                                                                                            "body": "Why is it that the group who feels morally superior always resorts to personal attacks?  Perhaps because their value are an inch deep.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "mastermide77",
                                                                                                    "body": "Why is it that the group who complains the most about personal attacks are the most morally reprehensible?",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Andrelse",
                                                                    "body": "Source on Affirmative Care not showing statistically significat improvement? As it kinda clashes with studies that do show improvements",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "morallyagnostic",
                                                                            "body": "Recent systematic reviews conducted independently by England, Sweden, Norway, and Denmark - some of the countries that led the way in GD care.  \n\n\nThe American Pediatric Association is undertaking their own review, we will see what conclusions they come to.  \n\n\nStudies that do show improvements - where?  It's all experimenting on children at this point.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Dizzy-Kiwi6825",
                            "body": "Yeah but most often the third one was just sissies",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mastermide77",
                                    "body": "And still more than 2 genders. Eunuchs were considered a different gender in some places, too. Women who were too old or too young were considered different genders.",
                                    "score": -1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "What defines a woman? A toddler should be a ble to answer this.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Zephir_AR",
                                    "body": ">*What defines a woman? A toddler should be a ble to answer this.*\n\n[Not sure](https://www.youtube.com/watch?v=s6ueIasxZKE) about it, [r/KidsAreFuckingStupid](https://i.imgur.com/xbq5CbA.jpg)",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "vikumwijekoon97",
                            "body": "Sexually repressed republicans are in full swing against your comment. For those dumbasses, actually do a bit of research on scientific studies around genders. You’ll realize that it stems not from chromosomes but from brain chemistry.",
                            "score": -23,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "diagonalizacion",
                                    "body": "And you think brain chemistry hasn't anything to do with chromosomes? Chromosomes are our genetic material. They are literally what determines how our body works.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "vikumwijekoon97",
                                            "body": "Your chromosomes doesn’t define your life experiences and brain chemistry. They help your body function. Gender dysphoria is a well defined condition with thousands of cases and how brain chemistry works on individuals with gender dysphoria. How do you dumbasses dispute proven medical science because you don’t feel like it!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "diagonalizacion",
                                                    "body": "I am not talking about gender dysphoria.\n\nGenetics regulate the production, breakdown, and functioning of neurotransmitters, receptors, enzymes, and hormones in the brain. Yes, enviromental and social factors are important, but genetics plays major role in both the structural and functional characteristics of the brain, as it happens with the rest of the body.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DrZetein",
                    "body": "Actually, there are XX males and XY females. For this reason scientists have come up with multiple other definitions for sex other than this one. Examples of other sex determiners are morphology (the sex organ, which is the first thing observed at birth to determine the sex of a newborn, and secondary sex characteristics), dominant sex hormones, reproductive system, and literally none of these can be applied to the entirety of the population. Some of these characteristics can be changed, which is effectively the same as changing the sex of a person, and as medicine evolves, more of these characteristics are inevitably going to be able to be changed as well if so desired. So not only is sex not binary, but bimodal, it is also a concept that was constructed by humans to try to describe what is true to the majority of the population but not the entirety of it, and it is not immutable and can be changed.",
                    "score": -2
                },
                {
                    "depth": 1,
                    "author": "euph-_-oric",
                    "body": "You are talking about sex and now about gender.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "mirh",
                    "body": "I'm sure anthropologist give any fuck about biology /s\n\nhttps://en.wikipedia.org/wiki/Third_gender#History\n\nhttps://en.wikipedia.org/wiki/Kathoey",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Schtoops1",
                    "body": "I'm confused... You seem like someone who is really intent on using specific language, which I assume is why you listed the sex chromosome pairings for male and female individuals. And yes, male and female are the correct biological sex terms for those chromosomal pairings. But then you go into talking about gender as though your previous statement on biological sex necessarily confirms your conclusion about their being two genders. \n\nYou do realize that biological sex and gender are two entirely different things, correct? Just asking, because it seems like understanding this is important to you, but it feels like you might mistakenly be thinking that two very different things are the same...",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DanDubbya",
            "body": "An inconvenient truth 2.0 \n\nBiology.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "JJJSchmidt_etAl",
            "body": "The crazy thing is that they explicitly belabor the point that they accept that gender could also be important but is different than biological sex. Like, will nothing please them until there is ONLY the idea of gender and biological sex is completely censored?\n\nI really want to find a reason to say that anthropologists act scientifically but they keep making it so difficult.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "XavierRex83",
                    "body": "People denying biological sex is really weird.  Like their are clear differences and males and females have unique needs from a medical standpoint.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mirh",
                            "body": "And this is happening where?",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JJJSchmidt_etAl",
                                    "body": "Anthropology conferences, women's sports, women's bathrooms, elementary schools",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mirh",
                                            "body": "Care to show any example? Because OP definitively isn't one, if you don't just hear one side of the bell.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "JJJSchmidt_etAl",
                                                    "body": "So is it really the case that you haven't looked into recent developments of biological males playing in women's sports, at least the collegiate level?\n\nI'm interested in discussing but I would want it to be an honest discussion; apologies if it really is, it can be hard to impossible to tell on the internet.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mirh",
                                                            "body": "I get what you are saying, but I would like to highlight that \"biological males playing in women's sports\" is really **not** the standard of \"denying biological sex\".\n\nYou also listed other things (from this conference, to whatever the hell \"elementary school\" is even supposed to mean) that also have nothing to do with anything. While \"women's bathrooms\" sounds a lot like you missed what and why gendered restorooms even existed to begin with.\n\nEDIT: u/JJJSchmidt_etAl blocked me",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "JJJSchmidt_etAl",
                                                                    "body": "Ah so you just are a troll. That's really too bad.\n\nNo matter what you're going to try to spin everything as \"well ACHTUALLY.\" That's why I asked if you're interested in an honest conversation, but when biological sex is ignored, you just say \"NUH UHHH.\"\n\nI hope you find a better way to spend your time, and I'm sorry you're so angry about basic biology, and from the looks of your post history, other basic kinds of science as well. Take care of yourself.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "starwalkerz",
            "body": "We must be mushroom with hundreds of sexes.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "sex is not gender. Thanks for pointing to the fact that many species on earth are some combination of both.",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "starwalkerz",
                            "body": "Gender is upper class Americana ideology therefore not real.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "They even worshiped a frog god in ancient Egypt for that purpose. Its been in western history for at least 4k years... How are so many poor and homeless and living in trailers as a stereotype?",
                                    "score": -1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mastermide77",
            "body": "Bimodal sex has been a common idea for years now",
            "score": 7
        },
        {
            "depth": 0,
            "author": "SnooTomatoes3423",
            "body": "Fucking cowards.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PizzaLikerFan",
            "body": "Sex is a binary, instead of 0's and 1's we have x's and y's, most people are 2-bit. With the second bit (bits you read from right to left, right? Always being X. However there is a small minority of people who are 3-bit",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "bigmonkey125",
                    "body": "Those people still function as if they were 2 bit though.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PizzaLikerFan",
                            "body": "I thought people with an extra X/Y couldn't reproduce?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bigmonkey125",
                                    "body": "Correct. Sometimes. Many of them cannot reproduce. It depends on what genes did what. Same as a person who loses their balls. I mean \"function\" in the sense that the gene expression does result in a tangible trait.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PizzaLikerFan",
                                            "body": "Thx for the extra information, I appreciate it pal",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "bigmonkey125",
                                                    "body": "You're welcome. Thank YOU for being civil in your question and response. The subject of nonstandard sex is quite interesting, actually. As long as it's not weaponized for peoples' political shenanigans, of course.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Isn’t this subreddit supposed to be scientific? Why are all the comments politically charged messages about how gender and sex are equivalent?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ConsistentBroccoli97",
            "body": "Science loses again. \n\nWhen did the right become the party of science?\n\n🤦‍♂️",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "so here is a wild theory that came up in the babbling of drunken seniors, which when i gave deep thought, practically the logic behind it seemed flawless.\n\nthe increased number of people who consider themselves \"non binary \" or homosexual is a bio-evolutionary response to how humans have mismanaged its environment.\n\nwhy you ask? if you check statistics and with logic alone what is the percentage of a homosexual couple having biological children? without extreme scientific intervention, almost none.\n\nso this helps thin the crowd without any violent reactions and naturally. \n\nin other species, and i think is applicable too almost all species of animal, when the population reaches a point of imbalance, a violent reaction usually occurs, and in some propagated specie it is called a culture crash. \n\ni think as a specie that has cognitive ability it has manifested subconsciously and pushed this occurrence to deal with humanities problems in a somewhat harmonious transition rather than a culture crash.\n\ni am in no way saying that homosexuality is an anomaly, what I'm trying to say it is an evolutionary trait to maintain balance in the human populace.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Unable_Wrongdoer2250",
                    "body": "You should read up about mouse overpopulation studies and the \"bright ones\" they discovered.  A certain part of the population refrained from the typical excessive agression exibited by other males and had zero sex drive but they all took great care of their coats thus the name.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AbortionSurvivor777",
                            "body": "Rare outliers dont make sex functionally non-binary. We know how sex is determined and that is a binary (yes or no) signal of a particular gene. \n\nIn biology we tend to describe things as part of the norm. Humans have one head, two arms, two legs and are either male or female. Just because it's possible to be born with more or less arms than two, we dont describe humans as having anywhere from 0 to 4 arms.\n\nWhen sex falls outside that binary it's because some normal part of development did not function as it should have.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bigmonkey125",
                                    "body": "But even the exceptions function roughly as a male or female.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Starscr3am01",
            "body": "Transgenderism is yet another offspring of occultist insanity written by Helena Blavatsky and alike who were the foundation for works of Marx and Hitler. There is nothing left so say about it.",
            "score": -8,
            "replies": [
                {
                    "depth": 1,
                    "author": "pseudophilll",
                    "body": "Bro.. check yourself 😂😂",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "I suppose next your going to tell me chimeras are not real because they are rare?",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "LuisLmao",
            "body": "What about people who are born intersex with both genitalia? How should they identify?",
            "score": -10,
            "replies": [
                {
                    "depth": 1,
                    "author": "powerfunk",
                    "body": "Nobody has fully functional parts of both sexes. If you have XY chromosomes and a dick, you're male. Even if you had some underformed vagina parts at birth. No human being can reproduce with both sexes.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LuisLmao",
                            "body": "And if this hypothetical person has a functional penis with breasts how should they identify? What about the inverse with functional vagina and no breasts ?",
                            "score": -7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "powerfunk",
                                    "body": "There's a uterus phenotype and a testes phenotype. How people identify is none of my concern.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LuisLmao",
                                            "body": "Exactly if how people identify is none of your concern then why throw a fit over it? If it's as simple as having a uterus phenotype and a testes phenotype then it should be impossible to be born XXY and yet it still happens? Even if it's rare that it happens doesn't the fact that it does necessitate a world view that accommodates reality?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "powerfunk",
                                                    "body": "XXY people are still either a uterus phenotype or testes phenotype. It really is that simple.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tzaeru",
            "body": "Well, yeah, people constantly use phony science to justify their transphobia, so makes sense these people don't want to be a platform for that.\n\nWhy binary sex isn't necessarily a good classification in anthropology is discussed e.g. here: https://www.sapiens.org/biology/biological-science-rejects-the-sex-binary-and-thats-good-for-humanity/\n\nOverall I'd like to hear why exactly people want to stick to the binary in e.g. anthropology. What's the benefit? How does your ability to explain or theorize improve upon adopting a binary paradigm?",
            "score": -6
        },
        {
            "depth": 0,
            "author": "SaintMurray",
            "body": "My God, why do I keep seeing this live if need everywhere in reddit.\n\nNo one cares, and if you do get a life immediately.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Secret_g_nome",
            "body": "Why can people not accept that in biology nothing is black and white. Its all on a curve. Some organisms fall outside the 2nd or 3rd SD for their species... that doesn't make them less real. It just makes them vanishingly rare. Like Chimeran birds or lobsters, by the above definition they could not be real because they are not the norm for their species. However we do occasionally find them and they are very real. In large populous cities of millions of people there will always be some outside the norm and enough to form community.  \n\n\nWhy anyone makes a big deal of it is beyond me.",
            "score": -7
        }
    ]
}