{
    "title": "The bizarre study that was used to \"practically\" ban fluvoxamine for covid",
    "comments": [
        {
            "depth": 0,
            "author": "proverbialbunny",
            "body": "It wasn't just fluvoxamine.  Anything that was pushed as a self cure for covid was temporarily banned in the US.  I have a rare chronic liver condition that I take a multivitamin for specializing in helping it.  One of the vitamins (or supplements, I forget how it's classified) in the pill was hard to get due to COVID conspiracy theories saying it helped with COVID, so for a while there I couldn't get what I needed and had to turn to a prescription to get a mega dose of it.  So yeah, I got to see this first hand.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "Hatrct",
            "body": "I show here the bizarre contradiction of basic statistics and common sense that was used:\n\n[https://www.reddit.com/r/DebateVaccines/comments/15tq0vd/the\\_bizarre\\_study\\_that\\_was\\_used\\_to\\_practically/](https://www.reddit.com/r/DebateVaccines/comments/15tq0vd/the_bizarre_study_that_was_used_to_practically/)\n\nThe tl;dr is: they downplayed a study with sufficient sample size due to arbitrary/subjective reasons (that the \"endpoint\" was not \"good enough\" even though according to common sense it was clinically meaningful)... and yet they based their decision on another study that had an insufficient sample size: this study only had about 250 people in the fluvoxamine group and around the same number of people in the placebo group. For a disease that causes less than 5% severe illness in people without any immunity, to begin with, that means roughly only 10 people out of 250 would be expected to get severe illness even without any sort of intervention or vaccine. So when you only have around 250 in each group, and around 15 might get severely ill... fluvoxamine would be expected to lower that number of 15 but not by 100%.. so perhaps it might lower it to something like 7 or 8.. and in the placebo group because there is no intervention we would expect around 15.. but in this study they found only 15 in placebo group vs 13 in fluvoxamine group.. well.. when your sample size is so small.. those numbers are way too small to draw any conclusions from..\n\nThe other study (that they dismissed due to their subjective/arbitrary decision that the \"endpoint\" was not \"good enough\").. had a much higher sample size.. around 750 in each group.. and they found 119 in the placebo group clinically deteriorated vs 79 in the placebo group... \\[119 vs 79\\] vs \\[15 vs 13\\].. 15 vs 13? Are you kidding me? That is way too small for both groups to draw any meaningful conclusions from. Yet they chose to base their decision on that study, and strangely downplayed the study that showed 119 vs 79. It is quite literally bizarre that they can get away with something like that. It is basic math, logic, and common sense, but again, very few people care about these things, and only around 2% of people can understand these basic statistical concepts, this is how they get away with their bizarre decisions.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "proverbialbunny",
                    "body": "The entirety of food and nutritional science is like this.  E.g. the food pyramid has no solid scientific backing behind it.  The US gov pushes out food guidelines based on lobbying, not based on hard science.\n\nIf interested in the topic [this](https://youtu.be/7Lww5WH7INI?si=nFIODaF8CADrYJqM) is a pretty good video that exposes only a fraction of the corruption.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "enkiloki",
                    "body": "They also lied about vitamin d using the rda amount of 400 mg per day in the study rather than a higher beneficial amount of 5000 mg per day.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "enkiloki",
            "body": "The whole COVID reaction by the government has shown me that our government is as corrupt as any third world shit hole only with the thin veneer of propaganda to sell it better.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "whisporz",
            "body": "The point of covid, lobbyists paying politicians, and the hostials being subsidized for ventilators was that only the vaccine could be used. \n\nThere were several cures with no side effects or dangers but they were cheap.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "allenout",
                    "body": "Like cow pee.",
                    "score": -4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see:  [Willow Bark Extract: A Revolutionary Antiviral From Nature](https://scitechdaily.com/willow-bark-extract-a-revolutionary-antiviral-from-nature/)",
            "score": 1
        }
    ]
}