{
    "title": "Trends and projections of obesity among Canadians",
    "comments": [
        {
            "depth": 0,
            "author": "Hatrct",
            "body": "I find it bizarre that not a single person has compared the pandemic responses of countries like USA and Canada to their obesity response (or lack thereof).\n\nThey treated the pandemic like a war, necessitating lockdowns, suspension of medical informed consent and forcing people to get medical interventions against their will, etc...\n\nYet they have largely ignored obesity, and continue to do so. What is interesting is that during the first covid wave in the USA, even the CDC admitted that 4/5 in ICU were obese. But of course, instead of tackling obesity, they instead told obese children to get the vaccine while going to and from McDonalds, and were incentivizing people with free unhealthy food to get the vaccine:\n\n[https://www.cnn.com/2021/04/24/business/vaccine-freebies/index.html](https://www.cnn.com/2021/04/24/business/vaccine-freebies/index.html)\n\nLet's return to the article in the OP I posted:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4910458/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4910458/)\n\nLook at Figure 1:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4910458/figure/f01/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4910458/figure/f01/)\n\nIt is similar in the USA:\n\n[https://en.wikipedia.org/wiki/Obesity\\_in\\_the\\_United\\_States#/media/File:Obesity\\_in\\_the\\_United\\_States.svg](https://en.wikipedia.org/wiki/Obesity_in_the_United_States#/media/File:Obesity_in_the_United_States.svg)\n\nThe rise of obesity occurred in lockstep with the rise of neoliberalism.\n\nIn practice: neoliberalism is a political/economy ideology that was initiated in the late 70s/early 80s by Western countries such as USA/UK/Canada, etc... it means these countries were run by an oligarchy that comprised of politicians and corporations who had so much influence that in practice they ran the countries. One of the implications of this was the fast food/junk food industry through their mammoth amounts of money and advertisements \"normalizing\" junk/fast food. As a result, obesity were from virtually not being a thing, to something like around 1 in 5 people being obese in Western countries.\n\nLet's look at the top 10 causes of death in countries like USA/Canada, notice how most of them are either caused by or exacerbated by obesity (including covid):\n\n[https://www.healthline.com/health/leading-causes-of-death](https://www.healthline.com/health/leading-causes-of-death)\n\n[https://www.finder.com/ca/what-are-the-top-10-causes-of-death-in-canada](https://www.finder.com/ca/what-are-the-top-10-causes-of-death-in-canada)\n\nObesity kills far more people than 9/11 did (this resulted in 2 wars and 1+ million people dying), than the pandemic did, than most other things. Yet there is barely any movement in terms of trying to stop it.\n\nYet what are these governments doing to tackle obesity? Pretty much nothing. Now contrast it to their war time effort for the pandemic. It really helps recognize their priorities. Is it public health? Or the profit of the corporations who fund their election campaigns and other influences they have on them? Covid was bad for profit (lockdowns hurt profit) and also politically bad (hospital system collapsing would be political suicide for any politician in power) and also covid vaccines made a lot of people rich with board members of people in CDC/FDA hopping to and from board of corporations like pfizer, but obesity is good for profit (it makes the fast/junk food industry rich/it increases GDP due to weight loss products and increased hospitalizations and need for medical services, supplements, gyms, etc..).",
            "score": 5
        },
        {
            "depth": 0,
            "author": "cody0071",
            "body": "This study is from 2015, there has to be something more updated? 8 years is a long time for a population factor to stay the same…",
            "score": 1
        }
    ]
}