{
    "title": "Pfizer’s Clinical Trial ‘Process 2’ COVID Vaccine Recipients Suffered 2.4X the Adverse Events of Placebo Recipients; ‘Process 2’ Vials Were Contaminated with DNA Plasmids.",
    "comments": [
        {
            "depth": 0,
            "author": "Hatrct",
            "body": "I have heard about this DNA plasmid hypothesis, I can't rule it out, and in light of the fact that common sense studies needed to confirm this hypothesis are bizarrely deliberately not being done by orgnaziations such as FDA/CDC, whose very job is to perform these basic safety studies (but instead they are too busy manipulating science and basic statistics to prevent early treatment/prevent any treatment that can possibly compete with the vaccines:\n\n[https://www.reddit.com/r/ScienceUncensored/comments/172d94c/the\\_bizarre\\_study\\_that\\_was\\_used\\_to\\_practically/](https://www.reddit.com/r/ScienceUncensored/comments/172d94c/the_bizarre_study_that_was_used_to_practically/)\n\nThis PhD expert says he can do the study in 3 hours, but FDA/CDC ignored him:\n\n[https://www.youtube.com/watch?v=IEWHhrHiiTY](https://www.youtube.com/watch?v=IEWHhrHiiTY)\n\nwe just have to guess on whether it is true or not.\n\nPersonally I am not too convinced, because this is Pfizer yet Moderna had identical side effects, does this mean the exact same production problem happened with Moderna? And not just Pfizer and Moderna, but virtually all spike protein based vaccines, regardless of whether they are mRNA or not, cause abnormally/astronomically higher rate of adverse effects compared to non covid vaccines. Also, Moderna has a higher rate of adverse effects, and we know it has 3x as much mRNA so 3x as much spike protein. And there are studies showing the spike protein independently appears to be causing heart issues. So my own hypothesis is that these vaccine adverse effects are due to the unnatural toxic spike protein of this accidentally lab leaked artificial virus, and the more spike protein you get the higher chances of symptoms. That would explain why the virus, and all spike protein based vaccines, are all causing the same sorts of symptoms. It would also explain why milder covid results in relatively less long covid symptoms but can still cause long covid symptoms: less spike protein proliferates in the body but there is spike protein in the body nevertheless.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "The X files did an episode in 2017 about the population being vaccinated with a vaccine containing foreign DNA, that shouldn't be there in the shots. Here is a video clip:\n\nhttps://twitter.com/MAVERIC68078049/status/1705631832996499735",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CallMeFartFlower",
                    "body": "https://news.yahoo.com/false-claims-recirculate-harmful-dna-184043727.html?",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "gingobalboa",
                    "body": "Moderna has slightly less levels of DNA plasmids, but much more of LNPs.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Got_Perma_Banned",
            "body": "Here comes the libs defending big pharma for some reason.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "jazzmagg",
            "body": "Thank fuck I didn't get vaxxed. Those poor bastards.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "iDontLikeChimneys",
                    "body": "Thankful I got the “1 and done” and not the mRNA versions. \n\nI have had covid probably 5 times and the most sick I ever got was after that shot. \n\nWe really pushed the envelope on how complacent the world population is. \n\nI am so sad we did this. We kind of cut our nose off to spite our face",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see Mery Nass condemn a WHO proposal: [Dr. Meryl Nass explains how the WHO's proposed pandemic treaty](https://www.youtube.com/watch?v=boiWU6TPviU)\n\nNote: The video makes it look like she is speaking on behalf of the WHO, when she is speaking as opposition.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "She is doing amazing work.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see Dr John Cambell 1:14 hour video interview of Angus Dalgleish: [The Death of Science](https://www.youtube.com/watch?v=us4N4KL7VkI)",
            "score": 3
        },
        {
            "depth": 0,
            "author": "101m4n",
            "body": "\"DNA plasmids\"\n\nAs opposed to what? Lego plasmids?",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Big sciencey-sounding words scary. I do my own research. /s",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "dailyclout.io \n\nSeems reliable /s.",
            "score": 34,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "Pfizer reliable /s.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "Fair point, Pfizer is big pharma. but surely you can use a more reliable source to support your claim",
                            "score": 22
                        },
                        {
                            "depth": 2,
                            "author": "MrMxylptlyk",
                            "body": "Wow, good comeback, you showed them",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Financial-Adagio-183",
                                    "body": "Actually - have you checked out Pfizer’s rap sheet? Or lobbying history? \n\nUsed to be they had republicans in their back pocket - now they mostly donate to the democrats. \n\nAlso, they are lobbying to weaken protections for whistle blowers. \n\nAlso, they were the company that insisted they would only manufacture vaccines if liability was removed for them - they started that. \n\nBrilliant move…100 billion in two years without any liability. Absolutely brilliant.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Adifferentdose",
                                            "body": "100 billion in 2 years the most profitable experiment ever ran. I bet they still can’t believe they’re getting away with it. \n\n#guillotinebigpharma",
                                            "score": 4
                                        },
                                        {
                                            "depth": 4,
                                            "author": "MrMxylptlyk",
                                            "body": "Yes, corporations are evil. Vaccines should only be produced by governments. Their greed undermines public trust in public 'goods' such as vaccines. It's a mess.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SivalV",
                                                    "body": "The current situation stopped being a trust issue when politicians started lying about the efficacy and the expected results, and started forcing it on people who were statistically better off without it... repeatedly!",
                                                    "score": 3
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Financial-Adagio-183",
                                                    "body": "Um - what public trust?",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "That would be cool if we didn’t just see politicians lie about the effectiveness of the last covid vaccine",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MrMxylptlyk",
                                                            "body": "Why did they lie?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "I don’t have the reason they lied, but they lied",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Financial-Adagio-183",
                                                                            "body": "Because their re-election campaigns depends on pharmaceutical lobbying money!",
                                                                            "score": 3
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Lol. An adverse event according to this article is something like swelling at an injection site or headache. I'd sure hope the placebo causes less of these. Considering the idea is to trigger an immune response which often comes with headaches or soreness. This does not mean it's a bad or dangerous thing.\n\n\nThe science community would not call these adverse events. These are side effects.\n\nMore misinformation in science uncensored. Who would have thought?",
            "score": 51,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mymoggievan",
                    "body": "Not saying this article means anything...but just as an FYI: the 'science' (clinical science) does indeed consider these things adverse events. They likely were never classified as 'serious adverse events' though. (SAEs are events that cause hospitalization, potentially life threatening, etc).  Source: Am a clinical scientist and spent half my career reviewing adverse events.",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zero-evil",
                            "body": "Were you reading through Mass Gen's FLARE in the early days?  Thoughts on how that went?",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "xeio87",
                    "body": "Yeah, only 2.4x a placebo seems really good given we know there are common mild side effects of any vaccine. Had soreness in my arm myself.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "rudster",
                    "body": "I & millions of others got an injection after being told it was well tested on a shortened schedule. As it turns out the testing was of a different product than I received, and the one I received had zero testing.\n\nHow is that not a jail-them-for-life offense, regardless of whether there were side effects or not?",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "mwallace0569",
                    "body": "this article is one of the reason why people think vaccines having side effects is dangerous or unsafe, god forbid a vaccine gave someone soreness, headache, a fever for 24-48 hours",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Hatrct",
                    "body": "A few million non covid vaccines administered during the same time as a few million covid vaccines.\n\nnon covid vaccines adverse effects: 1 report of chest pain out of around 2 million of doses.\n\ncovid vaccines adverse effects: 1404 reports of chest pain out of around 6 million doses.\n\nfor myocarditis: 1 vs 98, respectively.\n\nSee page 2, and page 33 for the breakdown:\n\n[https://www.health.wa.gov.au/\\~/media/Corp/Documents/Health-for/Immunisation/Western-Australia-Vaccine-Safety-Surveillance-Annual-Report-2021.pdf](https://www.health.wa.gov.au/~/media/Corp/Documents/Health-for/Immunisation/Western-Australia-Vaccine-Safety-Surveillance-Annual-Report-2021.pdf)\n\n&#x200B;\n\nSo yea.. this is all by coincidence.. and Western Australia government is obviously spreading \"scientific misinformation\" according to you/the corporate North American mainstream.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gtalnz",
                            "body": "Do you think it's something about the mRNA vaccine process that is responsible for this?",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "The_Noble_Lie",
                    "body": "Those are, in fact, adverse events.  You are thinking serious / severe adverse events. \n\nAn adverse event is primarily about whether one's daily life is affected (ex: a fever that necessitates bed rest, or missing even a single day of work)",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "rare_pig",
                    "body": "Did you read the article? \n\n“Although the adverse events were minor, there is such a big difference between the placebo and treatment arms, 65 versus 155 or 2.4 times more, that further scrutiny would be expected to determine the cause, since the NEW PROCESS was about to be used for the worldwide roll-out.”",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "ConsiderationNew6295",
                    "body": "That’s a fallacy-riddled description of the situation. The fact is there have been serious adverse events with the mRNA shots and we did not give informed consent for this plasmid garbage. You need to either emotionally prepare yourself for what’s coming out as a result of the judicial rulings and FOIA requests or get a new job because shilling is ugly.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "YoyoMiazaki",
                            "body": "I know right. It amazes me after all the medical journals who have done elaborate studies about the adverse effects of the mRNA vaccines, there are still people on here defending them like it’s 2020 and anyone who speaks against vaccines will be banned and shamed publicly. \n\nSometimes I am shocked who these people are who are still waving their vaccine flags and defending them. Even people I know who were publicly defending them during the first Covid vaccines have seriously backed off and had a change of heart.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ConsiderationNew6295",
                                    "body": "It’s astonishing. I’m guessing it’s because of the public health messaging, the social pressures that developed (rather cruelly, I might add), but also that to admit we were wrong at this point carries such a huge emotional impact. Heavy implications. We’re having to acknowledge that the people and institutions we trusted were not trustworthy - and we are still forced to trust these people for so many things. It’s better for some to stay in cognitive dissonance or denial. Some are plain shills. \n\nI have three people in my inner circle, including my wife, who had serious adverse effects after getting the vaccine. That’s a lot of people, my inner circle is not very big. After a while, you just can’t pretend anymore.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Jealous-Elephant",
                            "body": "Bro can I borrow some tin foil? I’m not sure I have enough",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fufu3232",
                                    "body": "When the medical community, literally the people who make these, out right admits something but you’re so far left pilled that you deny it lol",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Tropical_Yetii",
                                    "body": "Just wait untll they activate the 5 G man\n\nIts all gonna come out just wait",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "RedSquareIsGreen",
                                            "body": "You guys said the same thing about 2K, 2012, the ending of the Mayan Calendar, and now 5g. I wonder what's the next?",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mwallace0569",
                                                    "body": "6G, i promise man, covid 2028\n\nwho downvoted my joke?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "RedSquareIsGreen",
                                                            "body": "Lol",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Unnombrepls",
                    "body": "Usually, an increase of mild side effects could mean that severe side effects are also increased. Let's say that in 1 of 1000 cases of headache, it develops to a more severe form due to the person's immunity, genetics, etc. I have got lots of vaccines and meds in my life; but covid vaccine was the first one that left me pretty bad for a week and with weird side effects for half a year. Many people that I know and in my family experienced different side effects; but many were long-term.\n\nAll this from a product that was advertised as equally safe as vaccines that have been tested and improved for decades.\n\nNow we learn they might have even been cutting corners and people like you jump to defend them. No, just because of the urgency of the situation does not justify lying to most of the population and managing a vaccine that millions of people got as if it were for animals.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Minimum-Avocado-9624",
                            "body": "That’s is not at all what an increase of mild effects means.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Unnombrepls",
                                    "body": "It isnt what it means; but it can totally mean that. It is causing adverse effects more than other vaccines, I would be very very surprised if only the weakest side effects are increased.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Minimum-Avocado-9624",
                                            "body": "Side effects are not a magic category the reaches a threshold and boom you get sick or die. They can be mutually exclusive to other side effects that may co occur (effects not intended as the primary effect).   Individuals can have different degrees of severity to different effects.   The term weakest and strongest are irrelevant in clinical terms.   A greater % beyond 2% may have similar side effects those may occur in similar degrees of intensity but they do not always change based on dose.  Sometimes efficacy of the therapeutic window and occur at too low a dose and too high a dose.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "littleday",
                    "body": "Yeh I mean you should have that conversation with my bosses dead sister…",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Camel_Natural",
                            "body": "Or my friends dead brother who refused to get vaccinated, leaving behind his wife and 2 young children.",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleday",
                                    "body": "At least he had a choice and he made it. My bosses sister was told to take it or loose everything. She lost everything anyway.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Minimum-Avocado-9624",
                                            "body": "What Did your bosses sister die of?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Electronic-Race-2099",
                                                    "body": "\"Trust me bro\"",
                                                    "score": 6
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "mwallace0569",
                                                    "body": "a car accident(probably)",
                                                    "score": 5
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "littleday",
                                                    "body": "Google AstraZeneca Death Australia. You’ll be able to find her article, was all over the news.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Minimum-Avocado-9624",
                                                            "body": "I found this that points out that AstraZeneca death due to rare side effect is 1 and a million.\n\n\n> What is TTS?\n\n>Thrombosis with thrombocytopenia syndrome (TTS) is a rare condition reported in some people who have received adenoviral vector COVID-19 vaccines [such as the AstraZeneca COVID-19 vaccine]. The syndrome is characterised by blood clot formation (thrombosis) combined with low platelet levels (thrombocytopenia).\n> TTS is different to other more commonly diagnosed blood clotting conditions as it is triggered by an immune response that causes the combination of both clots and low platelets.\n>Having a history of blood clots, like deep vein thrombosis (DVT), does not increase your risk of TTS due to the AstraZeneca vaccine.\n\n\n\n> Risk of death due to TTS from receiving the AstraZeneca COVID-19 vaccine is 1 in a million\n\n> Risk of TTS from receiving the AstraZenecaCOVID-19 vaccine is less than 30 in a million\n\n>  Risk of death due to rock climbing is 3 in a million\n\n> Risk of death from a general anaesthetic is 18 in a million\n\n> Risk of death from giving birth is 67 in a million\n\n> Risk of being struck by lightning is 2 in a million\n\n\nhttps://www.science.org.au/curious/people-medicine/astrazeneca-vaccine-risk-death-1-million-what-does-mean\n\nSo getting TTS is 1 in 30million and then from there dying from TTS is 1 In a million of those who get TTS.  You are more likely to die from lightning.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "littleday",
                                                                    "body": "For sure everything has risks. They don’t force people to rock climb to be able to be allowed to leave your home. You don’t need to give birth to keep your job. They don’t force you to stand in a field during a lightning storm to be allowed into the shops to buy food. \n\nShe didn’t want to get it, government forced her, and she died. If it was optional, sure, let everyone choose. But it wasn’t a choice. And this is my problem. They should not be forcing a vaccine on people who will most likely have been fine from Covid.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Minimum-Avocado-9624",
                                                                            "body": "> For sure everything has risks. They don’t force people to rock climb to be able to be allowed to leave your home. You don’t need to give birth to keep your job. They don’t force you to stand in a field during a lightning storm to be allowed into the shops to buy food.\n\nSure but if they did force you to do these things then you would be safer taking a vaccine then doing these activity’s.   Furthermore in many places people are forced to give birth.\n\nYour whole argument is this idea that you were forced to to take a vaccine and yet we are forced to do many things or suffer repercussions.  Wear seat belts when driving for example.  Regardless though your argument hinges on the safety of the vaccine and The data points out that that safety is far less a concern than those things mentioned above.   Shifting to the government forcing someone is also not entirely accurate.  Most governments made a vaccine optional but the companies made it mandatory which is their right as you then become a risk to the safety of the other employees as well as yourself which makes unvaccinated a legal liability.   Sure you don’t have to get a vaccine but you do have to accept the social repercussions of that choice.",
                                                                            "score": 2
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "trippedbackwards",
                                                                            "body": "Technically she was not forced to take it.  Nobody was forced.  Some employers and some government employees were required to take it to keep their jobs but that's not \"losing everything\".  In no uncertain terms, it sucks and I can see it being judged unfair but the everyone had to make tough choices-individuals, company owners and the government-but this was unprecedented in human history to have a virus canvass the world so quickly (yes there have been pandemics but not when there's so much international travel and international interconnection as there was in 2019).  Lots of people chose to not take the vaccine and suffered those consequences.  Some chose to take it and suffered those consequences.  She chose to take it.  She wasn't held down.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "peacenity",
                                                                                    "body": "This is medical coercion. There's a difference between signing up for a job and agreeing to a new novel treatment and being alrdy in a job and threatening your livelihood if you don't take this novel treatment w very little testing. I took the vaccine and still deal w long term issues after 2 yrs.\n\nThere are entire subs and Facebook groups for vaccine injured people.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "trippedbackwards",
                                                                                            "body": "You call it what you want.  If you feel that strongly about not taking vaccine, don't. I understand it's not fair. But the businesses had choices to make too.  You and other entities will not always agree so you agree to separate. That's life.  Lots of people chose to quit their jobs. That's not \"losing it all\".  That's a major inconvenience.",
                                                                                            "score": 0
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Nani_The_Fock",
                                                                                    "body": "> Technically she was not forced to take it  \n\nGod I hate this fucking strawman. It was the vaccine or her job, her means of earning a living. Yes she was absolutely forced.\n\n> Technically  \n\n\nNo no, stfu about technicalities please.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "trippedbackwards",
                                                                                            "body": "Um no.  I won't.  My opinion counts one vote just like yours.  I said, \"yes it sucks\".  People all over the world were faced with terrible choices.  Guess what?  Nobody liked all the choices that were made for us.  But bottom line is, nobody was forced.  There's not just 1 job for every person.  If it means THAT much to you not to take it, you should have accepted the consequences and got a different job.  Choices.  It's not that hard to comprehend!  We were al faced with choices.   Everyone, government included, did what they thought was best. So did you.  But you weren't a victim anymore than anyone else was.  We were all impacted.  We all made shitty choices (neither option was appeaing).  That's what happens in a f'n pandemic.  So again, KMA.  I won't shut up.  Again, deal with it snowflake.  This world doesn't revolve around you.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Nani_The_Fock",
                                                                                                    "body": "\n> But bottom line is, nobody was forced.  \n\nLick those fucking boots I guess. At least your name makes sense.\n\n> My opinion counts one vote just like yours.  \n\nYour opinion is dogshit.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "trippedbackwards",
                                                                                                            "body": "Cry me a river.  You guys are always the victim.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Nani_The_Fock",
                                                                                                                    "body": "Ok guy.",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "The_Noble_Lie",
                    "body": "Now, my opinion on this is, there should always be three windows into the data, All AE, SAE and Only \"Minor\".  Obfuscating one or another is an issue.  Sometimes it's useful to see trends in all reactions.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Yeah this is misinformation and should be filed under troglodytes uncensored.",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "JSB_322",
                    "body": "Interesting take.  How can you be sure?",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Backwardspellcaster",
                            "body": "[Need anything else?](https://mediabiasfactcheck.com/dailyclout-bias/)\n\nDetailed Report  \nBias Rating: RIGHT CONSPIRACY-PSEUDOSCIENCE  \nFactual Reporting: VERY LOW  \nCountry: USA  \nPress Freedom Rank: MOSTLY FREE  \nMedia Type: Website  \nTraffic/Popularity: Minimal Traffic  \nMBFC Credibility Rating: LOW CREDIBILITY",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheTopNacho",
                                    "body": "Don't be too quick to discount this as a possible thing. When isolating RNA, DNA contamination could very realistically happen. Even when using otherwise clean methods.\n\nThe grander question is will DNA transfection by liposomes cause problems. If the RNA is being produced under a bacterial promoter, it probably wouldn't produce mRNA in mammalian cells. Albeit, who knows, maybe there is minimal promoter activity. \n\nPoint being, I'm not for spreading conspiracies or over interpretation of results. But this one has a plausible reality to it.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "OderusOrungus",
                                    "body": "Freedom rank... back to terror level updates. Its like childrens shows for adults",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "iiioiia",
                                    "body": "That in no way demonstrates it is necessarily incorrect.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Stargatemaster",
                            "body": "Because it's from a right wing propaganda website.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Significant-Fruit494",
                                    "body": "As opposed to the corporate establishment media (i.e neoliberal propaganda sites) who will lie to you til this day and tell you that the pfizer jab is an FDA approved vaccine called comirnaty.\n\nIt's not. You cannot get an FDA approved covid vaccine in the US. Call pfizer and they'll tell you that it's the same ingredients and formulation as comirnaty. That's a weird response to what should be a simple yes or no question...\n\nAnd the reason is because they used a different manufacturing process for publicly available vaccines (process 2). If you read the fda approval for comirnaty, it's very clearly based on a singular and established manufacturing process (process 1) \n\n>An October 2020 amendment to the protocol of the pivotal Pfizer/BioNTech BNT162b2 (Comirnaty) clinical trial (C4591001) indicates that nearly all vaccine doses used in the trial came from ‘clinical batches’ manufactured using what is referred to as ‘Process 1’.[3] However, in order to upscale production for large-scale distribution of ‘emergency supply’ after authorization, a new method was developed, ‘Process 2’. The differences include changes to the DNA template used to transcribe the RNA and the purification phase, as well as the manufacturing process of the lipid nanoparticles. Notably, ‘Process 2’ batches were shown to have substantially lower mRNA integrity.[4,5] \n\nhttps://www.bmj.com/content/378/bmj.o1731/rr-2",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Stargatemaster",
                                            "body": "You guys have been crying wolf for the better part of 4 years now. It's time to give it a rest. \n\nIf you want me to take you seriously, then get a peer reviewed research paper that agrees with this, not some random comment from 2 random users.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "gingobalboa",
                                                    "body": "The bmj is a leading medical research journal, read some lol.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Stargatemaster",
                                                            "body": "I already know that. What's your point?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "gingobalboa",
                                                                    "body": "You stated: “If you want me to take you seriously, then get a peer reviewed research paper that agrees with this“ , when you responded to a comment linking this study from one of the most prestigious medical journals in the world. \n\nit doesn’t get more cognitively dissonant than that! So I’ll share it again. Hopefully you can read\n\n[https://www.bmj.com/content/378/bmj.o1731/rr-2](https://www.bmj.com/content/378/bmj.o1731/rr-2)",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Stargatemaster",
                                                                            "body": "\"Active in these communities:\n\nr/RFKjrforpresident\n\nr/astrology\"\n\nI've seen all that I need to see here.",
                                                                            "score": 2
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Stargatemaster",
                                                                            "body": "Ironic... You do realize that you're reading a user's comment, and not published research, right?\n\nYikes bud. You need to learn how to do your own research instead of regurgitating whatever you see online.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "iiioiia",
                                                    "body": ">You guys have been crying wolf for the better part of 4 years now. It's time to give it a rest. \n\nlol, weak.\n\n>If you want me to take you seriously, then get a peer reviewed research paper that agrees with this, not some random comment from 2 random users.\n\nSays the guy who just finished saying \"Because it's from a right wing propaganda website.\".",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Stargatemaster",
                                                            "body": "It's not weak, it's true. \n\nAnd what I said is not hypocritical in the least.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "iiioiia",
                                                                    "body": ">And what I said is not hypocritical in the least.\n\nYes it is.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Stargatemaster",
                                                                            "body": "No it's not. There's nothing hypocritical about assuming that an article coming from a site that consistently posting misinformation is also going to be misinformation, and then asking someone for evidence that supports their position.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "iiioiia",
                                                                                    "body": "There is if you present your assumption as a fact, as you did above.\n\nWhy can't you people just admit you're speculating? Do you *realize* you are?",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Stargatemaster",
                                                                                            "body": "Of course I realize that me simply dismissing the article does not mean it's not true. \n\nI don't have to read the article to understand that DailyClout is not a reputable website, which is why I asked for an actual study. \n\nI never presented it as fact, I used the term \"know\" in it's colloquial sense: to believe something with a degree of certainty. \n\nYou're the only one freaking out about the words I'm using when we all know what I meant.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "iiioiia",
                                                                                                    "body": "Oh how I love Reddit.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Stargatemaster",
                                                                                                            "body": "You're a goofy person. Not worth my time.",
                                                                                                            "score": 2
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "iiioiia",
                                    "body": "That is plenty for heuristic beliefs, but it is useless *or worse* when it comes to the discovery of objective truth.\n\nThe way \"scientific thinkers\" think is mind boggling.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Stargatemaster",
                                            "body": "Well that's just silly to say. Occam's razor is very useful for *discovering* objective truth. \n\nUsing it as confirmation or claiming that it is objective truth would be improper, but that's not what is happening here.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "iiioiia",
                                                    "body": ">Using it as confirmation or claiming that it is objective truth would be improper, but that's not what is happening here.\n\n**\"Because it's from a right wing propaganda website.\"**\n\nThat you people are sincere is surreal.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Stargatemaster",
                                                            "body": "So whenever you see something from CNN you assume that it's correct until you prove it wrong, right?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "iiioiia",
                                                                    "body": "No, but that is very close to your thinking style interestingly.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Stargatemaster",
                                                                            "body": "So you give every single CNN article the benefit of the doubt until proven wrong, correct?",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "iiioiia",
                                                                                    "body": "No, but that is very close to your thinking style interestingly.\n\nTry some more guesses, maybe you'll get lucky.",
                                                                                    "score": 3
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Honest_Vitamin",
            "body": "wow!   thanks for sharing that.   Who would have thought Pfizer would use E-coli bacteria to make an mRNA drug.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "CallMeFartFlower",
                    "body": "I honestly can't tell what's sarcasm and what isn't anymore.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "Who would of thought of having plasmids and lipopolysaccharide in a vaccination, along with modified mRNA and toxic nano lipids in a vaccine?",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "severityonline",
            "body": "“Hehe, oopsie daisy!” *-Pfizer*",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Raggedyman70",
            "body": "Clearly, this was a pharmaceutical shit show run by businessmen whose only real concern was maximising profit. Don't even think they world argue the point. They will just point to the \"can't blame us\" document signed by idiot western governments. Also, their bid to have these documents released in 75years, does not mean they wanted to hide anything.\nNow they are pushing to take over the world, pandemic treaty anyone?\nCertainly, there's nothing to see here.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see: [Quantitative evaluation of whether the Nobel-Prize-winning COVID-19 vaccine actually saved millions of lives](https://correlation-canada.org/nobel-vaccine-and-all-cause-mortality/)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Stephen_P_Smith",
            "body": "Also see Camus' comment on X: [ Dr. Sabine Hazan said that the COVID-19 vaccine may cause immunosuppression](https://twitter.com/newstart_2024/status/1762888869169496402)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Heightpocket",
            "body": "Why are people still taking vaccines for something they most likely already have had, and are naturally immune?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "thetjmorton",
                    "body": "Viruses mutate. The immunity you acquire against one strain does not confer or guarantee a sufficient or adequate response against another variant. Therefore, a new vaccine is necessary. \n\nThink Cinderella. Feet come in different shapes and sizes, not all feet will fit the glass slipper.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mwallace0569",
                            "body": "But I had covid, so that would make me immune to any covid variants for life /s",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "gingobalboa",
                            "body": "With that logic humans wouldn’t have survived the evolution of the last 2,000 years. Viruses grow weaker as they mutate in the wild. I don’t think you know anything about how immune systems work because the body can absolutely recognize strain differentials, maybe not always- but it happens plenty. Natural immunity will always reign supreme. Antibody dependent enhancement is also a huge risk of coronavirus vaccines, being very well studied in the past; some people end up becoming more susceptible to infections as vaccine efficacy wanes. You can’t outsmart nature! There is no one size fits all.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "thetjmorton",
                                    "body": "To whom are you responding?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "gingobalboa",
                                            "body": "You, Saying a vaccine is “necessary” every time a virus mutates. Nature handles that well on its own without us meddling in the process, hence why we are here.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "gingobalboa",
                                            "body": "You, Saying a vaccine is “necessary” every time a virus mutates. Nature handles that well on its own without us meddling in the process, hence why we are here.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "thetjmorton",
                                                    "body": "I don’t disagree with you. Nature can handle viruses without a vaccine. Vaccines can help in the process, or they can also introduce other complications. They’re not fool-proof. But they can be very effective.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "EmbraceHegemony",
                    "body": "Why have people gotten a flu shot every year for the past 20+ years?",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "0rd0abCha0",
                            "body": "Marketing. The efficacy of the flu vaccine is pathetic. And many get sick for a day or two from the flu vaccine.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mwallace0569",
                                    "body": "OH NO, A headace, and maybe a fever for a day or two from a vaccine, what the world come to /s\n\nif you can't handle a little headache, fever, and other normal side effects for 24-48 hours, then i'm sorry to say this, but you're a wimp",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sixfour304",
                                            "body": "Clearly not enough boot straps in their life.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "0rd0abCha0",
                                            "body": "I wouldn't take medicine that makes me sick. I take care of my health so I don't need to put anything in my body that causes a negative reaction, just to maybe prevent a natural negative reaction. \n\nI can handle the flu, I'm not a little whiner who wants others to mask, and demands children sacrifice years of their childhood, because I'm scared of the air.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "xeio87",
                                                    "body": ">I wouldn't take medicine that makes me sick.\n\nI'm not sure there's even a single medication on earth without side effects. Even placebo can have them.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "AnimationOverlord",
                                                            "body": "The reason the comment you responded to is ironic is because the very mechanism of action is to illicit an immune response which in turn makes you feel sick. But you’re not actually sick, since reactogenicity is a thing. All we’ve done is make vaccines illicit a response so the immune system remembers what it fought off. It’s more complex than saying it gives a mini-dosage of the virus. I’m not necessarily surprised the mentioned person can’t see the trade off between being sick “naturally” and being “sick” from a vaccine. If you’re sick naturally the things entering you body actually want to fucking kill you. Vaccines, not so much.",
                                                            "score": 3
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "mwallace0569",
                                                            "body": "like i keep saying, people like above, expects meds, vaccines to be 500% effective, they want them to be perfect without a single side effect, no matter how minor that one side effect is\n\nalso the person above is a antivaxxer, so not surpising",
                                                            "score": 4
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "0rd0abCha0",
                                                            "body": "How bad do you feel after you take an Advil? Come on use your brain for once",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "xeio87",
                                                                    "body": "I don't feel bad after I get a vaccine either, at worst I get mild soreness in my arm at the injection site.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "0rd0abCha0",
                                                                            "body": "Perhaps you are like the tinman in a Wizard of Oz. Pick a side\n\n'I'm not sure there's even a single medication on earth without side effects. Even placebo can have them.'",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "gingobalboa",
                                                                    "body": "You can’t compare a vaccine to advil. With vaccines, there is no other pharmaceutical on the market which integrates with the immune system as intrinsically as vaccines. \n\nThere is no other pharmaceutical company which has total legal immunity in the case of serious adverse health effects/death.\n\nif you took advil and it killed you, you could sue advil and win.\n\nIf you take a vaccine and die the next day, you’ll get nothing but a bunch of people telling you you’re crazy and that vaccines are SaFe and efFeCtIvE (trademark). They have total legal indemnity, and that is ethically/morally wrong.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "\"I won't take medicine that makes me sick for a day or two. I prefer to get sick for several weeks minimum, possibly months.\"\n\nYou know that germs are things you put into your body that cause a negative reaction, right?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "0rd0abCha0",
                                                            "body": "Are you referring to germs as medicine?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "Well, fecal transplants are. Which would do no good, since you're already full of it.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "0rd0abCha0",
                                                                            "body": "You're the one taking in other peoples shit. You shouldn't swallow so much bull considering how much you take up your rear end",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "mwallace0569",
                                                    "body": "k, don't come to me if you ever have cancer, and you need chemo, because that shit will make you sick, but guess what? after you finished the course, you will be thanking your doctors.\n\nbut yet again, you won't do something that would make you sick, unless its getting infected with a virus. because as i said before, people like you act like \"viruses gives you super powers\", while \"vaccines, meds, or treatments will kill you\"",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "Sadly many do believe chemo is worse than cancer. That's how Steve Jobs died: he did his own research...\n\nHe did change his mind, but by then it was too late.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "mwallace0569",
                                                                    "body": "we all love to think we can do our own research, but the truth is, that many of us have no clue how to research, how to read the scientific studies. it also doesn't help when news media misrepresent a study, \"scientists found the cure of cancer\" and then you find out, from a scientists/experts that not what the study said at all, and that more research needs to be done.  \n\n\nmost of us laypersons are not trained to be able to read, and understand scientifc research. but that doesn't stop people acting like they know how to, and then scamming the vulnerable such as cancer patients into going against doctor recommendions, and just eat a orange, take some ginger, and bath in the sun for 10 hours a day, and don't forget to buy 50 supplements off my store that will def cure your cancer, while destroying your liver",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "gingobalboa",
                                                                            "body": "Um. People can read dude lol. maybe you just think this lowly of yourself, but people are smart. Telling people they can’t read like a 14th century clergyman is dumb lol",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "mwallace0569",
                                                                                    "body": "true people can read lmao, but can they actually understand what they're reading is a whole different issue. i bet that most of us laypersons have no idea how to undersand scientific research, which is why for most of us, we should rely on those went actually know their shit because they studied, and their whole career is said subject.\n\nbut we have so many people acting like they know more than someone who went to school for 10+ years learning about the said subject, who also go back to school every once awhile to update what they know.\n\ni can look at scientific research on biology  but if i don't know what i am reading, but think i do know what i am reading, then it would be a problem, especially if i go on tiktok saying BS because i think i do understand the research, but in reality, i don't know shit. (people actually do this)",
                                                                                    "score": 1
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "mwallace0569",
                                                                                    "body": "also have you seen the test scores of students in the US, like if that's not evidence that people in the US are getting dumber, which have been happening for years now, then i don't know what is",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "0rd0abCha0",
                                                            "body": "What's the survival rate for chemotherapy? Versus no therapy, how many additional months on average do people survive, albeit with a greatly reduced quality of life. It's not that many, obviously depending on the severity of the cancer, but you drastically reduce the quality of those last months with chemo.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Kailaylia",
                                                                    "body": ">What's the survival rate for chemotherapy?\n\nThis varies with a person's age, health, type of cancer, and progression of that cancer. \n\nFor the HER+ breast cancer I had 3 years ago, the average 5 year survival rate for a patient who has appropriate chemo, medication plus surgery is 95%. The patients who do survive are usually as healthy after that time as they were before getting cancer. Without treatment this cancer is generally fatal in months. \n\nDespite being an oldie and of course aging in the intervening years, I'm healthier and happier now than I was before getting cancer.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Minimum-Avocado-9624",
                                    "body": "Oh wow, you have framed an argument which no foundation.    You make claims of efficacy with no proof and you create a motivation for why we continue this prevention without evidence.    Now go grab you 3 studies and cherry pick data to prove your point",
                                    "score": -1
                                },
                                {
                                    "depth": 3,
                                    "author": "Tasty_Drawing128",
                                    "body": "\\^This",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Odd_Log3163",
                                            "body": "No",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Tasty_Drawing128",
                                                    "body": "yes...",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Odd_Log3163",
                                    "body": "If you get out of your echo chamber you'll realize you have no idea what you're talking about",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Tasty_Drawing128",
                            "body": "because corporations need money too!",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Electronic-Race-2099",
                                    "body": "You think corps are getting rich off the flu vaccine? lol\n\nDude they literally have to beg people to take it.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Why is everyone driving in the wrong lane?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "rossarian",
                    "body": "You smart. Everyone else is dumb",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tasty_Drawing128",
                            "body": "been telling myself that for a while now.",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mwallace0569",
                                    "body": "yeah many people that against the vaccines loves to believe they're smarter",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Tasty_Drawing128",
                                            "body": "so do people without common sense. Not completely against it. Just the group think mentality of it. inject plamid DNA all day. thats on you.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mwallace0569",
                                                    "body": "Yeah I can't wait to die from the 100 mRNA dose, or maybe I will die from the 101 dose, I mean it bound to happen at some point, right?",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "rossarian",
                                    "body": "No doubt.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "R4B_Moo",
                    "body": "Because immunity wanes over time",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Epyx911",
                            "body": "And viruses mutate, creating new strains.",
                            "score": 14,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Tasty_Drawing128",
                                    "body": "should we get new vaccines every 6 months for sars and ebola as well?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mwallace0569",
                                            "body": "sars 1 doesn't even exists anymore, and does ebola mutate at such a high rate? you're giving bad examples, try again",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Tasty_Drawing128",
                                                    "body": "how bout the millions of other viruses out there? why the worship of the Covid vaccine? why is natural immunology just out the door now?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mwallace0569",
                                                            "body": "It's not, it just that covid, for the foreseeable future is and will be causing deaths higher than the flu, until we have better vaccines, or some miracle happen that it disappears or becomes a non issue. We don't freak out about other viruses, because most of them are not as contagious \n\nWe are years away from better vaccines, even if it's possible",
                                                            "score": 5
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Epyx911",
                                            "body": "First of all, YOU don't have to do anything. Me, I care about the elderly in my family and immuno compromised people I work with. I also care about hospital staff and do my bit to reduce admissions. So me, I will treat it like the flu and get immunized annually to protect those I love and myself as I'm 50+ now.  I also know strains mutate, and that immunity wanes over time. YOU can do you.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Tasty_Drawing128",
                                                    "body": "I will. What happens when one of those people I also care about has an adverse reaction to a vaccine because of terrible manufacturing practices that left plasmid DNA behind? See original post",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Epyx911",
                                                            "body": "That is far, far less likely than them dying from being hit by the virus. This is a science sub...did you actually look at peer reviewed studies before you typed that? This will assist you:\n\nhttps://www.mayoclinichealthsystem.org/hometown-health/featured-topic/covid-19-vaccine-myths-debunked",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Zee-Que",
                            "body": "If it \"wanes\" it's not really \"immunity\".",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OkNotice8600",
                    "body": "“Vaccine” lol.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "karlnite",
                    "body": "Immune compromised and the elderly are the ones still getting it, and at the advice of their doctors, who studied and practice medicine.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tasty_Drawing128",
                            "body": "doctors or corporations?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "MaxSeeker95",
                            "body": "“Practice” medicine",
                            "score": -4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Seditional",
                    "body": "Not all people have immune systems working at 100%. Cancer victims and older people for example can suffer from poor immune systems. Even the smallest illnesses can take them down.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ricobe",
                    "body": "Well if you want a serious answer:\n\nOne of the reasons is that different viruses operate in different ways. Some have a short infection period and mutate often and for others it's pretty much the opposite. That means with some you could have very strong lifelong immunity from a vaccine, but with others you can only get a strong immunity for a shorter period.\n\nVirus like COVID and the flu that spreads through the air, and infects our breathing system, tend to have a faster rate of mutation. If you get the disease and develop natural immunity from fighting it off, you can still contract it months later, because it's mutated and your body isn't fully prepared for how it's changed.\n\nThis is also why there's a lot of talk about updating the vaccines. The vaccines that were rolled out were designed on the original variant. Since then it has mutated a lot and the more it mutated, the less effective the vaccines became. They still had some effects and that's why some received a third shot, while research went into updating the vaccines.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Heightpocket",
                            "body": "I think its interesting that the virus became less lethal as it mutated. Like it wants to survive by not killing its host. \n\nIt is a little crazy to think that by the time we make and roll out a vaccine its already ineffective because the virus is mutated.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ok_Fox_1770",
            "body": "Just tryin to free up some hard drive space on earth… gotta break a few million eggs is all.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerry-4013-Porter",
            "body": "Truth will eventually prevail over lies. \n\n\"MABUS\" and \"FIRE\" cannot ,will not beat the truth.",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Decent_Leadership_62",
                    "body": "I wouldn't get my hopes up bro, the moon landing hoax is still going strong after 54 years....",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tomasisko",
                            "body": "if it was faked then why the soviets didnt say anything?",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Decent_Leadership_62",
                                    "body": "They can't even show the footage on TV anymore because younger people just burst out laughing - they're a bit less gullible than the boomers were\n\nApollo 17 Liftoff from Moon - December 14, 1972[https://www.youtube.com/watch?v=9HQfauGJaTs&ab\\_channel=SmithsonianNationalAirandSpaceMuseum](https://www.youtube.com/watch?v=9HQfauGJaTs&ab_channel=SmithsonianNationalAirandSpaceMuseum)",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LumpyGravy21",
                                            "body": "So they left the cameraman on the moon?",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "No-Needleworker-1388",
            "body": "Who would take this vaccine for the sniffles? Is this a joke? Pfizer loves taking money for a little cold and the sheep line up.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Odd_Log3163",
                    "body": "Tell that to all the people who have died horrible painful deaths or are disabled for life",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "No-Needleworker-1388",
                            "body": "From the vaccine? My uncle died from a Covid vaccine adverse event.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jordansky",
            "body": "2 x 0 is 0",
            "score": 0
        },
        {
            "depth": 0,
            "author": "rare_pig",
            "body": "We do have to be careful when reading statements such as “2 times the adverse effects”. In this case it’s double the patients in the study, but it can often be misleading.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SANcapITY",
                    "body": "Percentage increase without also giving you absolute numbers is a great way to manipulate people. All sides tend to give you just a % and it’s awful.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rare_pig",
                            "body": "I see it all the time. Lipitor, a cholesterol drug by Pfizer go figure, lied to everyone. \n\nIn the ASCOT-LLA study, which was terminated early because it was considered to have such outstanding results, there were heart attacks and deaths in 3% of the placebo (no treatment) group as compared to 1.9% in the Lipitor group. The improvement in outcome with Lipitor treatment was only 1.1 percentage point, but when this study was presented to the public, the advertisements used the inflated (relative risk) statistic, which transformed the 1.1% effect into a 36% reduction in heart attack risk",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SANcapITY",
                                    "body": "Oh yeah this is a fantastic example, and one I was familiar with. So many doctors don’t even know this stuff it’s absurd.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "YoyoMiazaki",
            "body": "This post is just to make you all think about a touchy subject. \n\nAll Covid vaccines are safe and effective for humans and any adverse effects are very very very rare. \n\nThere are no medical journal that have written about Covid vaccines having adverse effects. \n\nThe only sites you will find that speak about Covid vaccines having negative effects are misinformation. \n\nI believe you can still get banned from many subreddit for speaking anything negative Covid vaccines. So be careful before you speak your mind on the subject. It seems harsh but it would be very dangerous to the world if people had access to information that said that the Covid vaccine is anything but safe and effective. \n\nWe need to control the information the masses have access to for safety. Some people have thoughts that might make people have thoughts that are not in support of vaccines. If there words get out into the public and some people don’t get vaccinated, then can you imagine how scary of a world we would live in?\n\nEven though there is free speech, it is important to monitor speech on social media and ban accounts that speak information that has been deemed dangerous. \n\nInformation such as a person saying they had complications after getting a vaccine and that others should be careful. Unless they are a doctor and they have absolute proof that their illness had anything to do with the vaccine they should not be allowed to speak. They are just reacting to their sickness most of the time and trying to find something to blame. Vaccines are an easy target. \n\nVaccines are safe and effective. Any side effects are extremely rare.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "gingobalboa",
                    "body": " This sounds like it was spat out by ChatGPT",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Stargatemaster",
                            "body": "And what if it was? Just because an AI collects information and presents it to you does not mean the information is wrong. You have to independently verify it.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "gingobalboa",
                                    "body": "“Don’t believe everything you read on the internet” but believe if if its AI ok lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Stargatemaster",
                                            "body": "You really do have a reading comprehension problem, don't you?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "gingobalboa",
                                                    "body": "i can smell manufactured information when it’s presented to. Selective reporting is everywhere, AI only enhances that. The statement retorted by this bot that “all covid vaccines are safe and effective” -is dead wrong right then and there. 3 years in and we have 46,000 deaths reported to the CDC and 2.5 million adverse events reported. Moderna’s stock has dropped 70% this year and pfizers have dropped over 20% because no one wants to take these death shots anymore. \n\n&#x200B;\n\nThere is no one size fits all approach to health. \n\nEven the greatest medical interventions in history should never be forced onto people. Especially for a product with complete immunity from legal retribution. If you were to die just seconds after taking a covid shot, your family would still not be able to sue Pfizer. Way to stand behind your product right?  sketchy.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Stargatemaster",
                                                            "body": "You can smell manufactured information but somehow you think that a user comment on a medical journal is \"peer reviewed research\". \n\nYea, ok bud. You're completely delusional. \n\nYou know what has killed literally millions of people? Covid.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}