{
    "title": "What's behind the spike in deaths among younger, working people?",
    "comments": [
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[What's behind the spike in deaths among younger, working people?](https://www.msn.com/en-us/money/personalfinance/what-s-behind-the-spike-in-deaths-among-younger-working-people/ar-AA1hNERb) ([archive](https://archive.ph/Qj1at)) \n\n\n*A report by the nonprofit Society of Actuaries found that [34% more 35- to 44-year-olds died than expected](https://www.soa.org/49b504/globalassets/assets/files/resources/experience-studies/2022/group-life-covid-19-mortality-12-2022.pdf) in the last three months of 2022. More deaths occurred among white-collar vs. blue-collar workers. The organization also reported [a sudden jump in employee deaths](https://www.soa.org/49b504/globalassets/assets/files/resources/experience-studies/2022/group-life-covid-19-mortality-12-2022.pdf) in the fall of 2021. Independent sites aggregating Centers for Disease Control and Prevention data confirm these trends. According to [U.S. Mortality](https://www.usmortality.com/), excess deaths in September 2021 among 25- to 44-year-olds were [70% above normal](https://www.usmortality.com/excess-mortality/percentage/united-states/25-44)*\n \n*That number has thankfully dropped, but as of May 2023, the most recent month for which data are available, deaths in this age group remained 10% above expected. Among people under 25, it was [16% above normal](https://www.usmortality.com/excess-mortality/percentage/united-states/0-24). Experts have posited all sorts of theories, from [rising obesity rates](https://fortune.com/well/2023/06/17/america-covid-excess-deaths-worse-other-rich-countries-85-percent/) to [extreme heat](https://www.usatoday.com/story/opinion/2023/07/21/heat-deaths-increase-climate-change-effects-worse/70436488007/) to lagging effects from [lockdowns](https://journals.sagepub.com/doi/10.1177/00469580221139016) to wider [alcohol abuse](https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2791852). These possible contributors deserve careful consideration. Given the [sheer number](https://openvaers.com/covid-data) of COVID-19 vaccine deaths reported to the Vaccine Adverse Event Reporting System, more than 36,000 to date, the possible role of vaccines should be examined, too*.\n\nThese questions are getting increasingly rhetoric, given the fact how excess of deaths correlates with vaccination status levels [1](https://www.reddit.com/r/ScienceUncensored/comments/15tp0ah/australian_scientists_find_disturbing_patterns/), [2](https://www.reddit.com/r/ScienceUncensored/comments/16woqzd/covid_vaccines_causally_linked_to_increased/) both in time, both in space. See also:\n\n* [Covid NOT Responsible for 'Explosion' in Heart Deaths, Major Study Shows](https://www.reddit.com/r/ScienceUncensored/comments/12h6789/covid_not_responsible_for_explosion_in_heart/) [another studies](https://www.reddit.com/r/ScienceUncensored/comments/16z5pk8/compendium_of_links_for_anyone_still_clinging_to/)\n* [Civilian labour force with a disability](https://i.imgur.com/3CmKKbl.gif) - from 2021 i.e. year of vaccines roll-out?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "pokemonareugly",
                    "body": "Does it correlate? From the article in the original post:\n\n“Comparing state-level excess mortality percentage estimates to estimated COVID-19 vaccinated percentages shows a moderate negative correlation for both the U.S. population and the Group Life data for the third quarter of 2021.\nFor subsequent periods, although some negative correlation was still seen in most periods, it was less pronounced than the third quarter of 2021. Note that Figure 9.21, which looks at the correlation based on the percent of the population with a completed primary vaccine series and an additional dose (booster) as of December 31, 2021 shows a small positive correlation for the Group Life data for the 2022 period. but with a very low R^2 statistic. which\nindicates that vaccination rate does not explain much of the variation in excess mortality.”\n\nFurthermore, when you look at the county level, vaccination status is both more strongly associated  with lower mortality (being negatively associated at all time points) and shows a higher R^2:\n\n“Similar to the state-level analysis for the U.S. population, the county-level analysis shows negative correlation between the excess mortality percentage estimates and the percentages of the population that are fully vaccinated As was the case with the state-level analysis, the third quarter of 2021 shows a steeper slope than the subsequent periods. In comparing the county-level and state-level graphs, the R? statistics suggest a stronger fit at the county level relative to the state level. However, the steeper slopes on the state-level graphs relative to the county-level graphs suggest a larger change in excess mortality per percentage change in vaccination rate at the state level.”\n\nIt seems that mortality is not correlated spatially to vaccination status? In fact it’s the opposite",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AnAttemptReason",
                            "body": "Yea, the excess mortality at the end of 2021 coincided exactly with the delta and omicron waves. \n\nCome on guys.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "LumpyGravy21",
                                    "body": "If the vaccine was supposed to help against covid why does excess mortality keep increasing. If this trend line is extrapolated out, say by two or three years, the US is in big trouble, why is there no concern from the health agencies about excess mortality?\n\nThese charts shows the weekly cumulative excess mortality from all-causes for the United States and its states over time https://www.usmortality.com/excess-mortality/cumulative",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thisgrantstomb",
                                            "body": "Why does the cumulative excess mortality rate still climb?  Because that's all a cumulative rate can do.\n\nNotice how on the 2022 overall excess death rate climbs at a  slower rate as the year goes on, cumulative measurement cannot turn negative.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LumpyGravy21",
                                                    "body": "So why does it still climb after the vaccine roll out, shouldn't it have gone down?",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "thisgrantstomb",
                                                            "body": "Cumulative numbers? No. Cumulative numbers cannot go down.\n\nTo explain, I will give you a set of declining numbers as they go. Let's say January there was 30 deaths so the cumulative deaths in that time period are 30. In February there is 20 deaths so the cumulative deaths in that time period are 50.  In March there are 10 deaths, so the cumulative deaths over that time are 60.\n\nSo which month had worse numbers? Because the cumulative measure was lowest in January and highest in March.  But measuring how fast the cumulative number increases says a different story.\n\nThe rate of change is more important for what you're looking at.\n\nand in the chart you posted as vaccines rolled out more the cumulative numbers increased at a slower rate.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "LumpyGravy21",
                                                                    "body": "if excess deaths returned to baseline rates, it would go down.",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "thisgrantstomb",
                                                                            "body": "No it wouldn't because the graph is tracking a running total,  cumulative total, and not just the number from month to month like you appear to think it does.\n\nThe actual excess deaths week to week run in conjunction with Covid 19 surges and not vaccine rollout.\nThe third and fourth graphs in this article show excess deaths per week and month respectfully, very clearly there are ebbs and flows.\nhttps://healthfeedback.org/what-can-explain-the-excess-mortality-in-the-u-s-and-europe-in-2022/",
                                                                            "score": 7
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Zephir_AR",
                            "body": ">*when you look at the county level, vaccination status is both more strongly associated with lower mortality*\n\nIt depends when you look at mortality. Counties of low vaccination status have older population more impacted with Covid wave. And negative mortality persists years after vaccination so it occasionally prevails.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pokemonareugly",
                                    "body": "This association also shows at the state level, not only the country level. Also this doesn’t explain the fact that the R^2 is fairly high, showing that vaccination status as an independent variable explains a good proportion of variance in death.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Zephir_AR",
                    "body": "[Civilian labour force with a disability](https://i.imgur.com/3CmKKbl.gif) - from 2021 i.e. year of vaccines roll-out?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GWPulham23",
            "body": "The increasing total shitness of everything?",
            "score": 94,
            "replies": [
                {
                    "depth": 1,
                    "author": "Iwantmy3rdpartyapp",
                    "body": "[You don't get it?](https://youtu.be/Sh7QWBb2U2A?si=6y5rCee63H7cMSds)",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "DrKnowledgeCollege",
            "body": "It’s the thing that no one can talk about.",
            "score": 219,
            "replies": [
                {
                    "depth": 1,
                    "author": "ObligationParty2717",
                    "body": "That’s because Dead Men Tell no Tales",
                    "score": 42
                },
                {
                    "depth": 1,
                    "author": "TypicalAnnual2918",
                    "body": "I never thought we’d live in a world where people can be so easily programmed.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ancient_Oxygen",
                            "body": "People believe that they live in a free society where you cannot say \"Divoc\".",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Soigieoto",
                                    "body": "But you just did",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ancient_Oxygen",
                                            "body": "I didn’t.",
                                            "score": 4
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Quentin__Tarantulino",
                                    "body": "Wtf is divoc?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ancient_Oxygen",
                                            "body": "An anagram for a virus that appeared in recent years.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Quentin__Tarantulino",
                                                    "body": "Oh, haha. So are we not allowed to say Covid then?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ancient_Oxygen",
                                                            "body": "No... I can say Covid of course. You have to read my comment on the context of the subject of this thread.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bigcaulkcharisma",
                    "body": "It’s actually just deaths of despair from drug use. All the young people I know irl who have died has been ODs and suicides. To the man.",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rootbeerdelicious",
                            "body": "I've lost way too many friends to fent, and its almost never clear whether its intentional or not.",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Endthepain42023",
                                    "body": "In my experience, suicide is often both intentional and not for the person involved. \n\nIt is never black and white.",
                                    "score": 7
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DrKnowledgeCollege",
                            "body": "🤦‍♂️",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lucidum",
                    "body": "Fight Club?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Iwantmy3rdpartyapp",
                            "body": "His name is Robert Paulson",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Magic-Kushroom",
                    "body": "DIVOC?!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "DsntMttrHadSex",
                    "body": "That states with a lower vaccination rate have a higher excess mortality?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "rugosefishman",
                    "body": "The jabbbbbbbbbb.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rnobgyn",
                            "body": "Probably economy at the end of it - it’s becoming harder and harder to live so people can’t pay their bills, some turn to opiates (fentanyl) and OD, others commit suicide due to the pressure and subsequent mental health problems. If the vaccine were killing people in droves the normies would notice lol",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "throwaway48706",
                    "body": "Capitalism?",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rnobgyn",
                            "body": "Probably yes - increasing economic pressure (gouged costs, no help from anybody) is making people turn to drugs to escape the stress or go into a mental health spiral. These deaths are probably OD’s and suicides most likely stemming from the inability for some people to afford basic things",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "throwaway48706",
                                    "body": "It’s just ironic that the comment that named all of the symptoms of capitalism got tons of upvotes and then when I named it I got downvoted into oblivion.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "rnobgyn",
                                            "body": "That’s propaganda for you. “Capitalism” is the savior - all the symptoms tho, those are real issues that we need to use capitalism to fix. You have to word your comments carefully when talking to reactionary conspiracy types",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "allenout",
                    "body": "Death rate has gone down towards more normal level as of September 2023, so has the number of vaccinated people gone down?",
                    "score": -23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Unlimitles",
                            "body": "Find the stats and document them yourself, because the gov won’t.\n\nThat’s exactly why the stat of “recovered” was taken off the news when it was being reported and only ran the infected and dead stats.",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "LumpyGravy21",
                            "body": "These charts shows the weekly cumulative excess mortality from all-causes for the United States and its states over time. https://www.usmortality.com/excess-mortality/cumulative",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "allenout",
                                    "body": "\"Cumulative\"\n\nIf you could read.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ok-Ability5733",
                                            "body": "Or owned a dictionary.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ill-Ad9065",
                            "body": "The number of people getting boosters sure has.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "TheRealAuthorSarge",
                            "body": "Or they're dying off with no first time vaccinations to take their place.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -17
                },
                {
                    "depth": 1,
                    "author": "real_bk3k",
                    "body": "As I thought... >!Greta Thunberg!< killed those people!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Rogozinasplodin",
                    "body": "Guns, drugs, and obesity?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Overall-Importance54",
                    "body": "Someone has to say it: It's the transkids mind virus and other strains of toxic though that fucks up their path. And lack of healthy positive perspectives from that same well contributes.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "dogrescuersometimes",
            "body": " * climate change\n\n * not enough bugs in the diet\n\n * home ownership",
            "score": 145,
            "replies": [
                {
                    "depth": 1,
                    "author": "penguinsrcoolaf",
                    "body": "• making your bed\n• gardening\n• cost of living \n• skipping breakfast\nThese have been \"real\" articles about the rise in heart attacks in young people. If it really was all because of covid they would be screaming it from the roof tops. The fact they're blaming all these insane things makes it obvious they're hiding something.",
                    "score": 69,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Okay_there_bud",
                            "body": "Don't forget cold showers - Instant heart attack.",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "calendulahoney",
                                    "body": "Wait really",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Okay_there_bud",
                                            "body": "No hot showers either. But only for you.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "IWantAStorm",
                            "body": "Keep up your place! Never eat! Work a full-time job! That allows you three days off but you need a doctors note! Get a side gig! Student loans need to be paid off after all! Eat cheap processed food. Sleep for 5 hours and repeat. \n\nNo shit we're all going to die early. Nevermind microplasrics, endless pollution, etc.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "bannished69",
                            "body": "You forgot “winter vagina”.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Public-Tree-7919",
                            "body": "It's pollution. These big chem, oil, and auto manufacturing industries put a lot of toxic stuff into our air and water ways and it sticks around. It accumulates in our bodies and on our property. We all have to keep moving to stay afloat so people aren't getting rest and time away to basically detox.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "VelkaFrey",
                    "body": "This guy mediaz.",
                    "score": 21
                },
                {
                    "depth": 1,
                    "author": "wakanda_banana",
                    "body": "Also trees (they’re killing the planet according to Bill Gates)\n\nAre you all catching on yet? Wake tf up people",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "always_and_for_never",
            "body": "Depression, Despair and Hopelessness.",
            "score": 43,
            "replies": [
                {
                    "depth": 1,
                    "author": "FearfulInoculum",
                    "body": "and Fentanyl.",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "rnobgyn",
                    "body": "Bingo - the conspiracy nuts on this sub point to the vaccine but it’s realistically suicides and OD’s because people can’t afford basic life.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Darkhorseman81",
            "body": "The ultimate outcome of trickle-down economics and massive tax cuts for the rich while demanding more and more exploitation and productivity gains for less and less pay.\n\nAKA cost of living and standard of living driving poor physical and mental health outcomes.\n\nWe already have enough studies showing what this system we are living under is doing to us.\n\nCovid, Ukraine, and the 60% deliberate price gouging is just accelerated it.",
            "score": 64,
            "replies": [
                {
                    "depth": 1,
                    "author": "Saviourmacine",
                    "body": "Yes, they know it.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "gatorsgat21",
                    "body": "This is the real answer. Overworked, overstressed, can’t afford to have the American dream, etc… it is taking a physical and mental health toll on us.",
                    "score": 22
                },
                {
                    "depth": 1,
                    "author": "Slapshot382",
                    "body": "💯",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "digital_darkness",
                    "body": "Do you have data saying these excess deaths are due to mental health?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "doomedeskimo",
                            "body": "Just look around.  Shits depressing",
                            "score": 12
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "throwaway48706",
                    "body": "I can’t believe I found the real answer here amongst the anti vax nonsense. \n\nIt’s things getting way shittier under capitalism.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "alexb3678",
                    "body": "Can you point me to a tax cut “for the rich” that wasn’t just a tax cut across the board? I feel like it’s disingenuous to call a tax cut for everyone a tax cut for the rich. Also, even if this was true, why would a tax cut for the rich effect the mortality rates of the average middle class person?",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "fabmeyer",
                    "body": "Yeah you're right. Have a look at r/insomnia to see where that leads to.",
                    "score": -1
                },
                {
                    "depth": 1,
                    "author": "Roselace",
                    "body": "Thomas Sowell economist says there is no such theory as trickle down economics. Nor in practice does it exist. You tube has good videos of his commentary. Although the rest of your comments maybe true. Those circumstances do not exits due to ‘trickle down economics.’",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "80sCrackBaby",
            "body": "I didn't realize this was a anti science sub",
            "score": 3
        },
        {
            "depth": 0,
            "author": "GodBlessYouNow",
            "body": "Spike,  pun intended.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "Kerry-4013-Porter",
            "body": "The 10% increase in deaths, not 1% to 2% excess deaths, cannot be explained for any reason other than the following two reasons. As I've said many times, either Long Covid or vaccine side effects, or both.",
            "score": 64,
            "replies": [
                {
                    "depth": 1,
                    "author": "beehummble",
                    "body": "The study linked in the article says that those who didn’t receive the vaccine had a higher death rate (pg49-53): https://www.soa.org/49b504/globalassets/assets/files/resources/experience-studies/2022/group-life-covid-19-mortality-12-2022.pdf",
                    "score": 54,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BOW57",
                            "body": "Sssh don't read the actual study and throw those facts around. You'll upset the anti-vaccine wackos",
                            "score": 32,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SeriousAboutShwarma",
                                    "body": "I love how its more likely to the person that covid conspiracy stuff caused it and not outright people being reasonably depressed, hopeless, etc over the state of cost of living, oligarchies running the west, a hopeless wealth gap that has been enabled by how older generations have voted for the last 70 yrs, none of us will own homes, our own pensions will be worthless, and we will work til we die for fucking scraps because employers pay dick all - but oh it's def the covid vaccine that caused it, lol",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WhyMyButtTickles",
                                            "body": "I don’t see why it has to be one or the other…. those are all true facts u just cited. But I would only add to that, that corporate greed isn’t limited to just a few industries… Pfizer and Moderna rushed the vaccines to market, made a killing (in the stock market), and it’s not unreasonable in the face of every thing else you just said to predict that any lawsuits/fallout stemming from court cases finding big pharmacy guiltyor liable of pushing un safe products that caused more harm than good would only result in the inevitable fines and slaps on the wrists.  It would be a slight fee for the cost of doing business to them. this whole thing with pharmaceutical companies profiting off of a healthcare crisis and botching the vaccines really reminds me of the big banks gambling with derivatives crashing the economy, and then being bailed out by the taxpayers in the end. It reminds me of tobacco, knowing that cigarettes cause cancer and hiding it for years, and never having to really pay a price for that. It also reminds me of oil companies re-branding themselves as energy companies because they knew about climate change and hid it from the public without ever having to pay a price for that. I see this whole thing as an us versus them, and not really a left versus right thing. I lost faith in the media after 911 and the Iraq war. Now I don’t trust my insurance company or my doctors either. I don’t understand how anybody can trust either party now a days without amnesia. It’s funny to see partisan people yell past each other when it sounds like they mostly should agree… that’s the real bummer.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "euph-_-oric",
                                    "body": "If they could read they would be very upset",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Kerry-4013-Porter",
                            "body": "In Korea, there is a national health insurance system, there is no drug problem such as fentanyl, and there is no problem waiting in the hospital. It does not fall under any of the causes of excess mortality suggested by a pharmaceutical public relations staff that there is no vaccine problem at all.Nevertheless, the excess mortality rate from 2021 onwards is 10% (up to 19%). Again, nothing but Covid or vaccine side effects is a reason.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "Ok. So the facts are that those who got the vaccine are dying at a higher rate and those who didn’t are dying at an even higher rate than that. Correct? I mean that’s what the study in OPs post is saying.\n\n> nothing but Covid or vaccine side effects is a reason\n\nI don’t understand this sentence. Are you saying that there is no possible reason other than Covid or vaccine side effects? If so, I’ll need a source for that.\n\nOr are you saying that the people dying have nothing but Covid or vaccine side effects? If so, I’ll need a source for that.",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "Multipass-1506inf",
                                    "body": "It’s catching Covid that does it. Not the stick.",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Iwantmy3rdpartyapp",
                            "body": "I'm sorry, sir, you must be lost. We don't read the articles here on reddit, we just comment on the headlines. Move along, please.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": ">The study linked in the article says that those who didn’t receive the vaccine had a higher death rate\n\nDoes it? The first and second graphs show that, but then the treadlines become more or less horizontal with very low R^2 values, and the final graph shows a *positive* treadline, meaning that states with higher primary and booster vaccination rates are more likely to have excess deaths.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "Yeah. On page 53:\n\n> Comparing state-level excess mortality percentage estimates to estimated COVID-19 vaccinated percentages shows a **moderate negative correlation** for both the U.S. population and the Group Life data for the third quarter of 2021. For subsequent periods, although some negative correlation was still seen in most periods, it was less pronounced than the third quarter of 2021. Note that Figure 9.21, which looks at the correlation based on the percent of the population with a completed primary vaccine series and an additional dose (booster) as of December 31, 2021, *shows a small positive correlation for the Group Life data for the 2022 period, but with a very low R2 statistic, **which indicates that vaccination rate does not explain much of the variation in excess mortality.***\n\nIn other words: The difference is clearly observable and substantial at the beginning in areas where there were more holdouts against getting the vaccine early on (you don’t even need to plot a line to see it). Then, the difference shrinks as more people get the vaccine. Then it goes up at such a small rate that it can’t even be seen in a graph without plotting a line and even then the line increases at such a small rate that it is not even clear that it is actually increasing due to factors being graphed. \n\nI don’t know how much you remember from science classes but if you need to plot a line and there is not a significant change then that isn’t evidence for anything.\n\nEdit: I just realized your comment makes it sound like the last graph wasn’t the one they were talking about when they said it had a very small R^2. You should reread that section",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ecronwald",
                    "body": "What about different countries? Does this happen in Scandinavia? Does it happen in Germany?\n\nIf it happens in the US, but not other countries with the same genetic makeup, but different politics, it is because of the politics.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "I_love_milksteaks",
                            "body": "I live in Norway and general death and serious hospitalization has been more or less steady since early 2021, and we are at 98% vaccinated, so can't we once and for all rule that one out. Shall we?",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mr_ludd",
                                    "body": "Looks pretty high there too according to this:\n\nhttps://ourworldindata.org/grapher/excess-mortality-p-scores-average-baseline?country=\\~NOR",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Goofy_Goobers_",
                                    "body": "What companies were creating the shots in Norway? I know that AstraZeneca was pulled because of rare blood clot issues. I believe the difference between there and here is people are generally healthier in Norway. The food isn’t as fake, the obesity rates are low, and many don’t have the comorbidities we do. I also know that Moderna was also pulled and now only pfizer is being used. So good luck with that because pfizer is the dumpster fire that was causing a lot of these issues. I wouldn’t recommend taking any boosters from them.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BlindBard16isabitch",
                    "body": "Orrr microplastics. Orrr increased stress because the economy is fucked. Could be a number of things we don't know. All I'm seeing is speculation.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rnobgyn",
                            "body": "No bro - it’s totally the vaccine killing people! Totally not our state of discourse compounded by the impossibility of the economy, can’t afford basic things, skip meals, don’t take time for yourself just work, start a side hustle and keep working, can’t go to the doctor or therapist it’s too expensive. Nope none of those - totally not our opioid crisis and totally not suicides from the insanity of our post pandemic world",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "warablo",
                    "body": "It could also be the terrible food industry and healthcare system",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rare_pig",
                            "body": "That hasn’t changed in decades",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "destroyer1134",
                                    "body": "I disagree the amount of processed food has increased mainly due to consolidation of food companies. They keep making aquisitions changing the product to be more shelf stable and cheaper to produce.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "freeslurpee",
                                            "body": "Totally agree",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Weary_Yard_4587",
                            "body": "¿Por que no los dos?",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Mediocre-Sink-7451",
                    "body": "Vaccine side effects?... Most of the entire population of Earth gets vaccinated for diseases. If it were vaccines then why wouldn't the percentage be much higher?\n\nAlso, we now have protection through vaccination for diseases that literally wiped out entire populations. Smallpox, Polio, Hepatitis, Rabies, Influenza, Measles, Rubella, Diphtheria, Poliomyelitis etc.. Are you saying that vaccines for those diseases outweigh the tens of millions they kill?\n\nIf I may ask, could you link me some credible scientific sources that prove/show rates of vaccine side effects kill/harm/maim? I would be interested to read into it.\n\nAnd please I must reiterate, credible sources please. Don't link me a Facebook group or some pop up go daddy website from a self profound doctor with testimony or literature stating from them \"as evidence\".",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Goofy_Goobers_",
                            "body": "Those vaccines were not made like this one. And it has been discovered that lots of batches had contaminated DNA in it. The higher the percentage of foreign DNA the higher the chance that you will have injuries or even fatalities because it can be shuttled into the nucleus of the cell since they used a plasmid and mRNA template. This isn’t a vaccine, it’s gene therapy. It has the potential to become a permanent fixture in your genetic makeup causing autoimmune issues that can potentially attack your organs and cause death. In the animal trials in a lot of labs who have worked with this type of technology they have died after being inoculated. Why this was the chosen method to use is beyond me. It’s literally a poorly tested experiment from a corrupt and shoddy company that they pushed on the entire fucking world. The countries that did not allow Pfizer or Moderna to be part of the choices people could get probably faired better. I chose to be part of the control group because I knew what this was from the beginning after reading about it.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fickle_Patient2224",
                                    "body": "Sources for the dna contaminations and animal trials claims?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Goofy_Goobers_",
                                            "body": "https://osf.io/b9t7m/\nDescribes the double stranded dna contamination \n\nhttps://journals.plos.org/plospathogens/article?id=10.1371/journal.ppat.1010830\nDescribes how it can weaken immune response long term and can be acquired in a heritable fashion in mice trials (meaning this can become a permanent fixture of your DNA and in the mice trials these immune weaknesses were inherited by the offspring who eventually passed away) \n\nhttps://www.mdpi.com/1467-3045/44/3/73\nDescribes the ability of the mRNA to enter the nucleus of the cell and become part of the DNA via reverse transcription because it has been shuttled in by a plasmid. \n\nhttps://www.biorxiv.org/content/10.1101/2022.09.27.509633v1.full\nSource that shows that it does indeed have the ability to enter the nucleus of the cell\n\nDo you need more? At the very least these results should be alarming but I’m sure these people working with this and who have published these findings under peer review are lying right? It’s frustrating that people doing real science to help us figure this out are being censored at every turn. The scientist who brought these things to light for a legal case involving the contamination was met with crickets as a response.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "It's stands to reason that it's covid. \n\nThe vaccine is inconsequential when compared to the actual disease. \n\nWe knew the effects of viral infections before covid even happened. Everyone who got covid is going to die younger than they would have otherwise. \n\nEvery time you get covid, it adds viral load and reduces life expectancy.",
                    "score": -18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pewpsupe",
                            "body": "Do you all your info from Pfizer marketing materials? Lmao your conclusions are laughable.",
                            "score": 26,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "The study shared in the article of ops post literally shows that those who didn’t get vaccines had a higher death rate. Page 49-53, https://www.soa.org/49b504/globalassets/assets/files/resources/experience-studies/2022/group-life-covid-19-mortality-12-2022.pdf",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Hmmmmmm let’s see could it be the virus or the thing that helps stop the virus. Really jogs the noggin. God you anti vax people are morons.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "No my information comes from MS research and the correlation with HPV. \n\nA whole section of modern diseases are the result of viral infections. \n\nGo-ahead man, blame the vaccine. It's actually just regular old covid.",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "shikodo",
                                            "body": "If they could pin the deaths on covid, trust me...they would.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "Viral load causes a whole host of other diseases. It will never show up as covid just an assortment of other diseases and reduced life expectancy. It's all further down the road.\n\nSimilar to HPV.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "shikodo",
                                                            "body": "Considering this injection CAN actually kill a person, what makes you so sure it can't cause other issues?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "Maybe it is causing other issues. \n\nMy point is more that covid is causing issues right now, and it will cause issues for everyone who's had it down the line. Just like all the other viruses. The more you catch it, the more likely you have issues. It's a pretty simple concept.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "randomlycandy",
                                                                            "body": "You don't understand how our immune system works, do you? And how previous vaccines that were either a dead virus or a weakened virus worked as well? Our immune systems learn and strength against viruses through contact with said virus.",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "To be fair – nobody commenting in this sub knows how the immune system works. Or vaccines.",
                                                                                    "score": 2
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "AntiquatedSolutions",
                                                            "body": "Can you source some studies that show this specifically for COVID-19?\n\nPreliminary searches, albeit short, really only say viral loads are used as a proxy to characterize infectious viral spread.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Slim_ish",
                                                            "body": "Viral Load- dibs on that band name.",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "apoca-ears",
                                                    "body": "TrUsT mEEE",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "shikodo",
                                                            "body": "When you see the \"[conditions contributing to death involving covid-19](https://www.cdc.gov/nchs/data/health_policy/covid19-comorbidity-expanded-12092020-508.pdf)\" numbers include items like gunshot wounds and lightning strikes yet the deaths were still included in the covid death count.  Yes, trust me.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "apoca-ears",
                                                                    "body": "Have you stopped to think that maybe a gunshot wound or lightning strike left the person’s body in a weakened state that made them more easily succumb to covid?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "shikodo",
                                                                            "body": "Absolutely not.  It's well known, if you pay attention that is, that [death counts](https://x.com/TOPublicHealth/status/1275888390060285967?s=20) were [inflated](https://twitter.com/NuclearHerbs/status/1480774887002107904?s=20).",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "apoca-ears",
                                                                                    "body": "Do you have any evidence that the statistics are bad on the whole or nah",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "shikodo",
                                                                                            "body": "The evidence is in what they're telling us.  They're literally saying they inflated the numbers.  Some people simply choose to not listen to what is being said.\n\nLies, damned lies, and statistics.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "pewpsupe",
                                            "body": "I guess all the non labrats are immune to both causes then. \n\n\nOnly the shot takers are having these issues and you blame it on covid. The control group you choose to ignore proves your premise false at every turn.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "I don't care about the vaccine man .  \n\nI'm telling you that covid acts the exact same way as all the other viruses. They cause severe disease down the line because they never fully leave the body. \n\nI don't care if you vaccinate or not, I'm just stating how viruses work. HPV, HIV etc...",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "pewpsupe",
                                                            "body": "There are no unvaccinated people with \"long covid\" because \"long covid\" isn't real. Those are pharmaceutical side effects and if they weren't, they would also be present in the unvaccinated.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "spookytransexughost",
                                                                    "body": "Uhh people got long Covid before the vaccine",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "pewpsupe",
                                                                            "body": "False. There is no data that supports this.",
                                                                            "score": -4
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "🤣😂😂🤣😂\n\nOk dude.. it's OK",
                                                                    "score": 6
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[deleted]",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "pewpsupe",
                                                                            "body": "False.",
                                                                            "score": -3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "thep1x",
                                                                                    "body": "um my brother is one of those people, he also still can’t taste anything, 3 years later",
                                                                                    "score": 6,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "pewpsupe",
                                                                                            "body": "And that brother was Albert Einstein 😳",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "thep1x",
                                                                                                    "body": "are you on glue or something?",
                                                                                                    "score": 5,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Sempereternity",
                                                                                                            "body": "He literally can't provide any sort of evidence or else he wouldn't be here blubbering \"FALSE\" over and over again. I can post \"false\" under anything I want and that makes it true, right guys?!",
                                                                                                            "score": 3
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Mediocre-Sink-7451",
                                                                                    "body": "Can you please give sources for this conclusion?",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Postheroic",
                                                                    "body": "My guy… \n\nMy aunt cannot receive the vaccine, and never did. She caught covid in summer of 2020. She still isn’t fully recovered. \n\nYou 🤡",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "christiancocaine",
                                                                    "body": "My aunt has long Covid and she’s never been vaccinated.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheRealAuthorSarge",
                            "body": ">inconsequential when compared to the disease\n\nHow many people do you feel entitled to force to take something they don't want even if it kills them? Lies and mandates are never inconsequential.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mediocre-Sink-7451",
                                    "body": ".... Literally no one forced anyone to take the vaccine.. It was completely optional for everyone.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cyborg_elephant",
                                            "body": "Except the many people who couldn't keep their jobs without vaccination or be at the hospital while their wives give birth or visit their loved ones who are terminal.  The ones who were blacklisted from society and not allowed to do almost anything.  With the news telling them that they're essentially akin to murderers and where hospitals were giving preferential treatment to vaccinated patients.\n\n\nWhen you say 'Nobody got forced into getting vaccinated' thats a pretty misleading statement. Sure nobody was forced at gunpoint but it sure was a lot of coordinated pressure.",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Nobody has died from the vaccine, you vapid moron.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheRealAuthorSarge",
                                            "body": "They died from myocarditis caused by the vaccine.\n\nNo doubt you like to call people \"moron\" even when you can't hide behind the internet.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "It’s caused by the virus you fucking dingbat",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TheRealAuthorSarge",
                                                            "body": "The vaccine doesn't protect against the worst of the disease? 🤔",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "You are mind blowingly stupid",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TheRealAuthorSarge",
                                                                            "body": "I'm relying on the data. The excess deaths are among the vaccinated. You insisted it was from the disease itself. That means the vaccine doesn't protect from the disease.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "There is no data that suggests excess deaths are from the vaccinated. You are either lying or looking at bullshit data. Also, being vaccinated does not mean 100% immunity. It’s not a difficult concept to wrap your mind around.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "TheRealAuthorSarge",
                                                                                            "body": ">There is no data that suggests... \n\nhttps://www.washingtonexaminer.com/opinion/op-eds/whats-behind-spike-deaths-younger-working-people\n\nNo doubt you will squeal about the source, but the source links to an independent study.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "[deleted]",
                                                                                                    "body": "Lmao, so it’s bullshit data you’re referencing. At least try to have a credible source. \n\nIt is far safer to get covid while vaccinated than not. Full stop. We are still in a pandemic and vaccination does not mean 100% immunity. Correlation does not mean causation. Digest these concepts. Do better. The vaccine is not killing people. You know what is? The fucking virus.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "TheRealAuthorSarge",
                                                                                                            "body": "A professional insurance actuarial is far more credible than you.\n\nPeople under 50 with no co-morbidities are the safest. Stop being a bootlicker crybully because you don't give shit #1 about the people you are pushing the vaccine on.\n\n\"You stupid moron. Do better idiot. Blah blah blah. I just love you and want you to be safe because I'm just a warm, caring, caring and compassionate person.\"",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "[deleted]",
                                                                                                                    "body": "People like you are barriers to progress. Moron",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "TheRealAuthorSarge",
                                                                                                                            "body": "It's weird how your bootlicker's progress is so fragile it demands my compliance. Take your shots, wear your mask and go on about your business like the obedient little government cultist that you are. You don't need me.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "[deleted]",
                                                                                                                                    "body": "I’m a communist brother and you are for sure a right winger. Don’t talk to me about bootlicking. I simply understand that we live in a society. Lol peace",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "TheRealAuthorSarge",
                                                                                                                                            "body": "I can no more live in peace with a communist than I can live in peace with a fascist. You are both 2 sides to the same authoritarian coin.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "[deleted]",
                                                                                                                                                    "body": ">when you don’t know what communism is",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "TheRealAuthorSarge",
                                                                                                                                                            "body": "Yeah. Weird how you people can spend decades bleating about what communism is only to have to run around bleating about how everyone else doesn't know what communism.\n\nStop stacking human skulls and pay off your student loans, human waste.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "[deleted]",
                                                                                                                                                                    "body": "Mad?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "TheRealAuthorSarge",
                                                                                                                                                                            "body": "At a bunch of wasteoids whose only claim to fame is mass murder, starvation, and tender feels?\n\nNo.\n\nI enjoy watching free people poke you in your eye.",
                                                                                                                                                                            "score": 1
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "powerfunk",
                            "body": ">The vaccine is inconsequential when compared to the actual disease.\n\nImagine still thinking covid is real lol",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mediocre-Sink-7451",
                                    "body": "I got it and so did some of my family members one of which who died.\n\nYou saying something as stupid as that is as moronic as me saying something like. \"Imagine still thinking AIDS is real lol\" or \"Imagine thinking cancer is actually a thing\".\n\nThe epideamy of your stupidity actually had a physical side effect on me. I detached my retina rolling my eyes in gobsmack there are actually people in life so disconnected with reality.\n\nI can't imagine what it must be like to live such a docile and secluded life where you just literally never go outside and sit on the Internet all day.\n\nSeriously dude, go outside for a walk. Try interacting with people in real life. It's a huge step but it's one people like you need.\n\nTake a break from the Internet.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MrMxylptlyk",
                            "body": "Lmao. All the moron on the genius high iq sub hanging up to down vote you.",
                            "score": -1
                        },
                        {
                            "depth": 2,
                            "author": "SkylineFever34",
                            "body": "If it was that good, the Vax would easily sell itself to the masses.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AlfaLaw",
                    "body": "Here’s some actual data that might help you get started: https://reddit.com/r/dataisbeautiful/s/ztVd6ndBmI",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "rnobgyn",
                    "body": "Orrrr suicides and OD’s. Have you noticed the extreme rise of costs in the last two years? People can’t afford anything bro, young people especially. People either turn to drugs and potentially OD or they go down a mental health spiral and end their own lives. It’s totally foolish to say there’s no other possible reason than the vaccine lmao - come up for air my guy",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "pharmamess",
                    "body": "Keep preaching bro.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "crafty_alias",
                    "body": "Overdose and suicide.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Vaccine side effects LOL",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ricobe",
                    "body": "Then what you've said many times is likely very false assumptions. There are multiple reasons for excess deaths and vaccine side effects have been studied a lot and actually show the opposite. So you're trying to link things that don't match",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "I assume that this is yet more white-washing to obscure the fact that men do all the dangerous jobs and that they had to continue to do them even while you huddled in your homes?\n\nNotice how they use the word \"people\" throughout this report? \"People\" is the word that they use when men are dying, because when men die it is not as important. If it were women they would have explicitly said \"women\" and made a new ribbon that we had to put on the backs of our cars during a 3 week washington post media blitz.\n\nI guess this report is confusing if you continue to deny the basic gynocentrism.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Secret_g_nome",
            "body": "If you look at the dates of the beginning of these excess deaths they begin during Covid but before the vaccines... There is no spike after vaccination began. Its long covid that damaged our insides and caused scarification of tissues in our organs making us more vulnerable to everything else.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "-paperbrain-",
                    "body": "People misunderstand covid as a respiratory disease. It's a vascular disease that happens to present with respiratory symptoms. Vascular damage is going to increase a range of health risks long term.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Let’s not look at the elephant in the room guys. Let’s pretend the elephant is safe and effective, well studied, and is looking out for our well being.",
            "score": 78,
            "replies": [
                {
                    "depth": 1,
                    "author": "beehummble",
                    "body": "The study linked in the article in OPs post that no one here is reading says that those who didn’t receive the vaccine had a higher death rate. https://www.soa.org/49b504/globalassets/assets/files/resources/experience-studies/2022/group-life-covid-19-mortality-12-2022.pdf",
                    "score": 30,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LumpyGravy21",
                            "body": "What page?",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "Page 53. I address someone else’s analysis of that page in this comment: https://reddit.com/r/ScienceUncensored/s/mfQspVwbC0\n\nThe graphs start on page 49.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LumpyGravy21",
                                            "body": "Thanks, looks like pretty old data.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "beehummble",
                                                    "body": "No problem. I’m here to discuss the facts so there’s no reason to avoid sharing them.\n\nYou think a study released *this year* talking about something from *two years ago* is “pretty old”? That’s interesting.\n\nDoes the fact that it’s been two years make the conclusions different? Those who didn’t get the vaccine were dying at a higher rate until infection rates fell. Is that not true anymore because it’s been 2 years?\n\nAlso, did you not fact check your own information before sharing it? Or did you see the dates the first time but only decide that it was “pretty old” when you realized it didn’t support what you said anymore?",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LumpyGravy21",
                                                            "body": "A lot of data can happen in two years.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "beehummble",
                                                                    "body": "Generally, sure. But, again, how does that factor in to what we’re talking about right now?\n\nYou completely ignored the very next sentence.\n\nDoes the fact that it’s been two years change the fact that people who didn’t get the vaccine were dying at a higher rate? *Are you saying that we might have new data that says that the people who didn’t take the vaccine and then died **didn’t actually die?***\n\nI mean, please help me understand how data being *two years old* is a problem when it’s drawing conclusions *about what happened two years ago*. If you truly believe you’re right, don’t you want others to understand?",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Pleasant-Border-1416",
                            "body": "You’re spamming this but you obviously didn’t read it. Page 9 tells us the moderate negative correlation dissipated after a short period in 2021. Go suck fauci’s cock. You disgust me.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "That \"moderate negative correlation\" was people *dying*. They didn't get better after a short period lmao. \n\nYou know what happened after a short period in 2021, everyone started getting vaccinated. That just proves my point.\n\nYou think it's saying that people who weren't vaccinated who were getting sick were just more powerful in 2021. That's stupid.\n\nWhy are y'all obsessed with Fauci? I've honeslty listened to Fauci speak on TV for maybe 20 seconds. Yet conservatives can't shut up about him. You think Fauci is the reason that the whole world realized vaccines were important? Including countries that don't speak english? You're a sheep who has been led to believe that Fauci is the problem. When in reality, critical thinking is your worst enemy. You can’t even look at a simple study and piece basic things together.\n\nIt's crazy how y'all actually need other people to do your thinking for you. Pick up a book. Try doing a puzzle. Exercise your brain a little.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Jumpy_Climate",
                            "body": "The problem with just quoting the data and pretending it's meaningful is that it has been compiled by known criminals (the government).\n\nThey have counted everyone as \"unvaccinated\" for 2 jabs plus 14 days.\n\nSomeone could get 2 doses, drop dead in an hour and they are counted as \"unvaccinated\".\n\nThat's fraud.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "You think it’s better to count people as being vaccinated before the vaccine takes effect?\n\nCounting deaths before the vaccine takes effect would completely ruin the test results because it would make it seem like the vaccine is less effective than it actually is. What you’re suggesting is junk science.\n\n> if someone drops dead within 2 hours of getting the vaccine\n\nThis is effectively unheard of. It’s less than 10 per million - which is what you’d expect to see happen after giving a candy bar to a million people because people are dying all the time. Less than 10 per million is not statistically significant. It’s 0.00001%",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Jumpy_Climate",
                                            "body": "[https://www.youtube.com/watch?v=5hfYJsQAhl0](https://www.youtube.com/watch?v=5hfYJsQAhl0)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "beehummble",
                                                    "body": "Ahh the classic anti-vaxxer hit and run\n\nAnti-vaxxer: “this is bullshit because abc”\n\nPeople with critical thinking skills: “actually that doesn’t make sense because xyz”\n\nAnti vaxxer: “you’re a dumb!” *runs away*",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Jumpy_Climate",
                                                            "body": "You genuinely believe takes *2 shots and 14 days* to experience a side effect? Two whole fucking shots and 2 whole fucking weeks? \n\nI refuse to believe anyone is that stupid.\n\nThat's lying with statistics. Not science.\n\nEven if the drivel you typed were true, in a sample size that large, the same number of random deaths would be found in both populations.\n\nYou're just not smart enough to realize the obvious. You were lied to.\n\nWhich, by the way, Pfizer has a long documented history of doing.\n\n[https://violationtracker.goodjobsfirst.org/parent/pfizer](https://violationtracker.goodjobsfirst.org/parent/pfizer) \n\nNow you're in the most obvious and most predictable of all human responses.\n\nDenial.\n\nPS \n\nOnly idiots say \"anti-vaxxer\". \n\nI don't smoke. Nobody ever called me an anti-smoker.  \nI prefer not to eat processed foods. Nobody ever called me an anti-processed-fooder.  \nI believe people should have access to clean water. Nobody ever called me anti-water.  \nEven that label of how you view \"your opposition\" was force-fed to you by your TV propaganda machine.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "beehummble",
                                                                    "body": "> you genuinely believe it takes two shots and 14 days to experience a side effect\n\nNope. Never even came close to suggesting that. Maybe learn to read before you work on disproving something that 96% of doctors agree on?\n\nNot going to read the rest of your comment if you start off like that.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "Well they began before vaccines were available and did not spike after vaccination... seems obvious to me...",
                    "score": 31
                },
                {
                    "depth": 1,
                    "author": "muricanmania",
                    "body": "I think it's overwhelmingly more likely that the adverse effects of getting covid are hurting people than it is that the vaccine is killing people in some vague manner.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "inthefirsthour",
                            "body": "A vague manner such as\" Sudden Adult Death\" or...  myocarditis???",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "muricanmania",
                                    "body": "I don't think you can get more vague than sudden adult death, tbh. And we know that myocarditis had been linked to covid, as well as the vaccines. Everything available to us makes clear that having the vaccine is safer long term than not having the vaccine, on average.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "inthefirsthour",
                                            "body": "Lol... there is nothing to indicate the vaccine is either safe or effective. \nNight night internet stranger. Good luck out there.",
                                            "score": -5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "I_love_milksteaks",
                                    "body": "Did you know, that there's a 0,002% chance of getting myocarditis from the vaccine and 4% from getting it if you have COVID? Did you know that myocarditis is in itself not a life-threatening illness, but could be a sign of something serious, like heart failure? Myocarditis is not exclusive to the COVID virus, but can be a symptom from many types of viruses, like the flu virus for example. Most of the time it is treated with reset for a few days.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ProbablyOnLSD69",
                                            "body": "What do you mean by “reset for a few days”?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "I_love_milksteaks",
                                                    "body": "I mean that is generally what the doctor prescribes if you have myocarditis and there’s no serious underlying reason for it, like heart failure.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ProbablyOnLSD69",
                                                            "body": "So just rest? I just wasn’t sure what you meant by reset.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "I_love_milksteaks",
                                                                    "body": "Ah I meant to say rest, my bad.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ProbablyOnLSD69",
                                                                            "body": "Ahh word that’s what I thought, just wanted to clarify",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pokemonareugly",
                    "body": "I mean the link does show counties with higher vaccine uptake had lower excess mortality?",
                    "score": 51,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kicksavebeauty",
                            "body": "STRESS KILLS",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AlfaLaw",
                    "body": "It’s suicide and OD. And it only got worse. https://reddit.com/r/dataisbeautiful/s/ztVd6ndBmI",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ObligationParty2717",
                    "body": "It’s the Friendly Elephant!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "UngruntledAussie",
                    "body": "No one made a butt tonne of cash from these elephants either.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "skriver23",
            "body": "*\"spike\"*\n\nI see what they did there, lol",
            "score": 3
        },
        {
            "depth": 0,
            "author": "demitasse22",
            "body": "I’m not sure, but this headline is referring to data from the last three months, collected by a nonprofit life insurance actuary think tank, that is legally not representative of any actuary research, per the disclaimer, so…idk! But probably the COVID vaccine right?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "MysticFox96",
            "body": "As a young person I am going to say the main cause is crippling stress - especially if you are a young American parent.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Gold-Buy-2669",
            "body": "Fentanyl",
            "score": 3
        },
        {
            "depth": 0,
            "author": "seniorscrolls",
            "body": "6 day work weeks, 12 hours a day. No social life, no prospect of future equals death by many means.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "victorvaldes123",
            "body": "‪Professor Angus Dalgleish is an oncologist who has noticed troubling patterns in his melanoma patients recently. He believes repeated boosters are perturbing the immune system and allowing cancer to break through immune surveillance.‬\n\n‪https://youtu.be/PnJ5T1Enwq4?si=rwQT6Z6U6U34zJiM‬",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bucksandreds",
                    "body": "Definitely not the fact that covid is known to cause systemic inflammation which can harm the bodies ability to fight off cancer cells before they take over? Definitely some vague unknown effect of vaccines, huh?",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Hatrct",
                    "body": "Silence, Biden, MD, PhD, looked into the camera and said all healthy 6 months old and above need to get perpetual boosters for life, and the CDC/FDA, and other political organizations masquerading as public health have followed suit from those who hire and pay them. Conflict of interest is not a thing. Corporate influence is not a thing. Obviously you need to trust organizations whose board members hop between national health organizations and private private seeking corporations like pfizer. If you claim otherwise, you are clearly spreading scientific misinformation. At one point bloodletting was standard medical practice, and speaking against it was deemed \"spreading scientific misinformation\". Not too long ago, telling doctors to wash their hands was deemed \"spreading scientific misinformation\". The earth USED to be flat then magically stopped being flat, that is why back then SCIENCE=earth flat and anybody who said earth was round was spreading scientific misinformation. You need to trust \"THE\" science: what politicians and the health officials they directly appoint and pay tell you. Science does NOT change. Updated studies are NOT needed. Calling for more studies= spreading scientific misinformation. Observing patterns then saying what is going on people are dying what is causing this how do we stop dying= spreading scientific misinformation. You are either WITH \"Science\" or AGAINST us you trump loving conspiracy theorist! Censor on you! Btw we believe in freedom of speech!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "HeyHihoho",
            "body": "Maybe that's it. Many spikes falling on them.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "dresden_k",
            "body": "We dunno! Scientists are baffled! Myocarditis is normal!",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "Why would anyone be baffled? They began a year before vaccination and did not spike after vaccination. Applying the data over a timeline reveals its not vaccination.",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "I_love_milksteaks",
                    "body": ">there's a 0,002% chance of getting myocarditis from the vaccine and 4% from getting it if you have COVID? Did you know that myocarditis is in itself not a life-threatening illness, but could be a sign of something serious, like heart failure? Myocarditis is not exclusive to the COVID virus, but can be a symptom from many types of viruses, like the flu virus for example. Most of the time Myocarditis is treated with reset for a few days.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dresden_k",
                            "body": "Bad bot",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pokemonareugly",
                    "body": "The report shows higher vaccination is associated with less deaths not more…\n\nEdit: it appears OP has blocked me (for some reason I can’t respond to their comment asking for pages, so I’m assuming I’m blocked). It’s in pages 53 (state level) and 56 (county level).",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "People are still struggling with the concepts even after HPV, AIDS and HIV. \n\nOnce you get covid, it's forever. The virus remains in the body forever. \n\nIt's easy to blame the vaccine because it not as scary.",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MongooseLeader",
                                    "body": "Yeah, the vaccine hasn’t caused a massive uptick in neurological issues including anxiety, early onset dementia, severe depression, early onset Alzheimer’s, and then all the physical complications that no one can figure out. Things like persistent shortness of breath, POTS, long term joint/muscle inflammation, the list just goes on.\n\nCovid is the who’s who of long term side effects that will just ruin your life. I’m willing to bet in 10-20 years we will start seeing the real fallout from people who have had multiple bouts with covid, and not long after those who had one infection. And eventually, we may or may not see issues from those who had relatively minor infections.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Hatrct",
                                            "body": "It's likely the spike protein, which is in vaccine and virus. That is why vaccine injured and long covid have same symptoms. Remember this is a an accidentally lab leaked virus, that is why its spike protein is independently causing damage. They did not even consider this when basing the vaccines off of it, because in the past we dealt with natural viruses, and their spike proteins did not independently cause damage.\n\n&#x200B;\n\n>I’m willing to bet in 10-20 years we will start seeing the real fallout\n\nWho cares? Let's just wait and see. Why do studies now to prevent this? Let's just see what happens. If people die, people die. Why prevent it? In fact let's give all healthy 6 month olds and up perpetual boosters for life and keep injecting more and more novel spike protein, and just wait to see what happens in some years. They have less than 0.1% chance of developing severe covid, but why not reduce that a little bit more, at the exchange of potential death and all hosts of worse complications years down the line? I mean obviously 1+1=3, so the risk-benefit analysis is worth it.\n\nHey look a study from Harvard, who cares, Harvard was created in 1636 after a group of conspiracy theorists predicted a pandemic in 2020 and then created this insitution so they can publish anti-vaccine and anti-scientific studies like this one:\n\n>Conclusions:  \nImmunoprofiling of vaccinated adolescents and young adults revealed that the mRNA vaccine–induced immune responses did not differ between individuals who developed myocarditis and individuals who did not. However, free spike antigen was detected in the blood of adolescents and young adults who developed post-mRNA vaccine myocarditis, advancing insight into its potential underlying cause.\n\n[https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.122.061025](https://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.122.061025)\n\nThe obvious implication of this study: ignore it completely, and listen to Biden, MD, PhD, and his political institutions CDC/FDA whose board members hop between these organizations and pfizer, when they say this study is a conspiracy theory, that no more studies like this need to be done, and that all 6 month olds and up regardless of health status or previous level of immunity need to keep getting more boosters.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "rtrbitch",
                                                    "body": "There's zero evidence that this is a \"lab leak virus.\"  It was always a matter of time before a SARS-type virus turned into a horrible pandemic.  You're acting like a bunch of antivax propaganda is a given when it's actually horseshit.",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LumpyGravy21",
                            "body": "What page does it say that?",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hatrct",
            "body": "Mainstream Health Officials: by censoring this and saying \"no it is 100% not the vaccine you cannot even ask this question you are a 5g Russian Putin control zombie bot Bill Gate conspiracy theorist Trump lover if you ask this and are going to get censored for spreading scientific misinformation\" to anybody and everybody who brings up legitimate or rational questions aimed at stopping deaths, we will lower vaccine hesitancy!\n\nThis is what happens when incompetent and/or immoral people are in charge. You would think common sense, such as that gleaned from reading books such as \"The Boy Who Cried Wolf\" would be a job requirement for high ranking positions, but it clearly isn't.\n\nNot only have these illogicos lowered vaccine uptake among those who actually need covid vaccines (e.g. elderly, immunocompromised), but they have increased vaccine hesitancy overall and caused people and children to die or get seriously ill by not taking necessary vaccines for serious pathogens that cause serious damage to most people.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "It began a year before vaccination but nice try",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "Excess deaths begin the April before the first vaccines were released in December...",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Secret_g_nome",
                                                    "body": "I have literally provided  the data that proves otherwise. Youtube is not a valid source. \"somebody said it\" is not data.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Bucksandreds",
                                    "body": "Ridiculously bad, untrue take. The vaccine isn’t 100% safe but it is exponentially safer than getting covid",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "beehummble",
                    "body": "The study linked in OPs post that none of y’all are reading says that those who received the vaccine had lower death rates than those who did not receive it: https://www.soa.org/49b504/globalassets/assets/files/resources/experience-studies/2022/group-life-covid-19-mortality-12-2022.pdf",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rtrbitch",
                                    "body": "Or you're so invested in this conspiracy theory that your emotional needs require that you believe this horseshit.",
                                    "score": 6
                                },
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "My point is that the study in the article that is linked says the opposite of what the guy I was responding to was saying.\n\nIf you want to pick your own study, go for it. I’m happy to talk about it.\n\nLet’s take a look at your video:\n\n“Still having 8% excess deaths is high because you would expect that all vulnerable people would have died already” - well that’s fucking stupid. This assumes that everyone has already had Covid - which just isn’t true.\n\nIt’s an 18 minute video, I’m not going break down everything he says. Which of his points do you want me to address and what are the timestamps?\n\nBtw, I strongly discourage watching YouTube videos for scientific information because you’re letting other people do your thinking for you and they rarely link their sources. Anytime I see someone link a YouTube video of someone just talking into a camera as their source I immediately assume they can’t think critically.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "beehummble",
                                                    "body": "Tons of data points and you can’t share one?\n\nAll you did was link a video (a video is not a “data point” btw) where, in the first minute or so, some old guy said something stupid that you’d catch with the smallest amount of critical thinking. So I decided to stop watching because it was 18 minutes long.\n\nThen you ran away crying when I asked you what you wanted to share about that video?\n\nWhat kind of person goes around spamming videos that they refuse to defend?\n\nAlso, it’s embarrassing if you believe AI (me allegedly) or an uneducated child can understand your sources better than you can.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kailaylia",
                    "body": "Such as the after effects of Covid?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "asuuhdude",
                            "body": "Covid? The thing with 99.98 % of survival rate?",
                            "score": -8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "We had 4% mortality rate in Canada for Covid, Dropped to 1% post vaccination.  \n\n\nExcess deaths began a year before vaccination...  \n\n\nI can tell someone doesn't read data",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "lionsrawrr",
                                    "body": "I've had covid twice. Yeah I survived, but am a shadow of my former self. But I'm alive right? And that's all that matters.",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "asuuhdude",
                                            "body": "Did you get the vax? I have had covid more than once and it came and went, not vacinated",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lionsrawrr",
                                                    "body": "🤣🤣 Hilarious that that's your only talking point, but ok I'll bite. Yeah I got two shots of Moderna the first one a little over a year after the after being sick the first time. I  had long covid symptoms off and on that whole time. Had heard that others in the same boat had gotten relief after being vaxxed. Caught it a second time about 7-8 months later. That time it was easier but did have new symptoms show up . Was vaxxed a second time about half a year later.  [this](https://www.reddit.com/user/lionsrawrr/comments/171zpwy/three/?utm_source=share&utm_medium=web2x&context=3) is the bpm data from my fitness monitor from today. Zero physical activity. Just ran some errands around town. But yeah sure it has 99% survivability",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "asuuhdude",
                                                            "body": "What do you mean my only talking point? Thats what we where talking about?  So let me get this straight you got covid, and then after that you got the shot? The shot to prevent covid? Wich you already had developed the imunity for?",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "lionsrawrr",
                                                                    "body": "I got the shot in the hopes of it lessening  my long covid symptoms",
                                                                    "score": 9,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "asuuhdude",
                                                                            "body": "How did that work out for you?",
                                                                            "score": 17,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "lionsrawrr",
                                                                                    "body": "The symptoms were already slowly mellowing out. I didn't notice any adverse effects after the shot. Both times after actually having covid I had symptoms popping off. Your blame on the vaccine is disingenuous.  You're completely ignoring the real damage that covid itself does to people in favor a a talking point. 99% survivability never mind the millions of people that have dealt with and/or are currently dealing with long covid",
                                                                                    "score": 13,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "asuuhdude",
                                                                                            "body": "They are dealing with long covid because the vaccines compromises your imune system, my vaccinated family members have had nothing but problems since they got the vaccine, blod clot leading to surgery, vaginal bleeding and problems that never hapened before getting the shot, and my father has ben constantly sick for the past two years, ear infections, bone problems, he was all for the shots, but now he thinks it was te vaccines that realky fucked him up, because all the problems started after the second shot, the first one let him in  bed for two days,",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "lionsrawrr",
                                                                                                    "body": "Eh my experience says otherwise",
                                                                                                    "score": 7,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "asuuhdude",
                                                                                                            "body": "Sounds reasonable to me, good luck",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "lionsrawrr",
                                                                                                                    "body": "Annoying right. How easily you were brushed off. And I even provided data to back up my claims. We may never actually know how much physical damage  was caused and the source where it came from, Vax and/or covid. There is no true control group. Be unbiased is all. Life isn't black and white",
                                                                                                                    "score": 5,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "asuuhdude",
                                                                                                                            "body": "i dont really care to be honest, i just like voicing my opinion, we will know, just give it time, there is a reason the contracts the EU and pfizer made are heavilly redacted, there is things they dont want us to know, but they will eventually come out, at least i hope they do",
                                                                                                                            "score": 5,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Was_It_The_Dave",
                                                                                                                                    "body": "Is being a degenerate online helping society?",
                                                                                                                                    "score": 3
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ThiccMangoMon",
                                                                    "body": "I actually had covid like 3 times before I got vaxxed, and I had a really tough time.. even struggled to breathe sometimes, and it lasted for about a week.  After I got the shot and got covid, it was basically just a slight cough.\n\nAlso, the shot doesn't prevent you from getting covid like any other vaccine shot it teaches your body how to fight off more effectively and  quickly",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "asuuhdude",
                                                                            "body": "My counter argument to that is that by the time you got covid after the shot, it was already a less dangerous variant, like they say the virus mutates to be less devastating and more transmitable, and by the fact that you already had it before a couple of times, our bodies start developing the imunity, my first time geting covid got me in bed for a day, the other times it was just like a normal flu, i only knew i had covid because i had to test for work... but this i my bias speaking so yeah xD",
                                                                            "score": 6,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Was_It_The_Dave",
                                                                                    "body": "Thanks doctor nobody.",
                                                                                    "score": 4
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Sempereternity",
                                                                                    "body": "This guy's really out here deciding anonymous internet users covid strains from years ago, just to bend a narrative to PrOvE his argument lmao.",
                                                                                    "score": 2
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "CountryMad97",
                                                                                    "body": "Except some of the variants that mutated were actually more deadly... it's literally just genetic lottery",
                                                                                    "score": 1
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ThiccMangoMon",
                                                                                    "body": "When I got it the 3 times, they were all bad, and I didn't only get covid once after i got the vax, but probably around 6-7 times, and each time after, it was like nothing.. I mean, it's hard to explain while typing, but it was 100% a difference and not just my immune system or a different varriant because at the time, there were only 2 variants.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "icookseagulls",
                                                                            "body": "Those with naturally strong immune systems didn’t really need the COVID vaccine.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "Naw, man, doesn't work like that. \n\nWait another decade, and it will make more sense.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "pewpsupe",
                                                            "body": "Those are pharmaceutical side effects. No shotless people have your issues.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "lionsrawrr",
                                                                    "body": "Sure sure, except I had all those symptoms for a year before I ever got the vaccine. But yeah you probably know better",
                                                                    "score": 4
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Decent_Leadership_62",
                                            "body": "and how many 'boosters' have you had",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "drdenjef",
                                    "body": "To use your own arguments against yourself: getting a vaccine also has a ridiculously high survival rate. Therefore, according to your own reasoning, this spike in deaths can not come from the vaccines.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "asuuhdude",
                                            "body": "By that argument the spike in deaths cant come from anything then",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "drdenjef",
                                                    "body": "Exactly, so now you see the flaw in the reasoning.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "asuuhdude",
                                                            "body": "I dont, i still think it was the vaccines, since it was the first time vaccines like these have ben given to the public, the mrna kind, so that could be corelated, since we havent had any mrna shots in a wide scale before, and now we do…",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "pokemonareugly",
                                                                    "body": "I mean if you read the original article posted, it has a few graphs showing that both at the county and state level, vaccination status is negatively correlated with deaths (higher vaccine uptake = less excess mortality)",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "asuuhdude",
                                                                            "body": "the death rate is 70% above normal, they say its probably obesity and extreme heat and im the crazy one for thinking its the new vaccines that havent ben tested xD",
                                                                            "score": 8
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Sumstranger",
                                                                            "body": "Don't bother these people BELIEVE  what they say so it makes it \"their truth\". I shit you not this was presented to me as a valid argument the other day",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "asuuhdude",
                                                                                    "body": "It is a valid argument, just because there is an article doesnt make it bullet proof, what is your argument for the EU and Pfizer contracts being heavilly censored and redacted? If the vaccine are all that life saving like you both claim them to be, why censor and redact?",
                                                                                    "score": 11,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Sumstranger",
                                                                                            "body": "See what I mean...",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "asuuhdude",
                                                                                                    "body": "as always no counter argument, classic xD dont forget to get your boosters!",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Sumstranger",
                                                                                                            "body": "I don't mud wrestle pigs",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "asuuhdude",
                                                                                                                    "body": "You should, its pretty fun",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Sumstranger",
                                                                                                                            "body": "My point exactly.  ✌️",
                                                                                                                            "score": 3,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "asuuhdude",
                                                                                                                                    "body": "What point? as soon as you are presented with a valid argument, you flee and start name calling with a sense of superiority, that says all we need to know about you",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Was_It_The_Dave",
                                                                                                                                            "body": "Nothing valid from you.",
                                                                                                                                            "score": 2
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "LikeThePenis",
                                                                                    "body": "These people read the headline and believe it because it fits their existing beliefs and then when something in the article contradicts their beliefs, they reject that one part as a lie or fabrication while still believing the headline.",
                                                                                    "score": 2
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "benswami",
                                                                    "body": "But correlation doesn’t equal causation.",
                                                                    "score": 0
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ProbablyOnLSD69",
                                                                    "body": "I mean it’s also the first time we’ve had this particular kind of worldwide pandemic too.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Survival rate over what time period? A month? A year? five years?\n\nI mean the survival rate for those who either had covid, or the vaccine, over a long period of time. I'm not talking about the gross excess death rate.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "asuuhdude",
                                            "body": "I dont know, i just know its true  \n\n\nhttps://www.medrxiv.org/content/10.1101/2022.10.11.22280963v1",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "Then, if the consequences of the disease and/or the vaccine do not appear until many years afterwards, then we don't really know what is causing these problems of excess deaths. It could be covid or the vaccine, or it could be something else.\n\nThe study you cited does not follow people for many years. It's not relevant.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "asuuhdude",
                                                            "body": "But we do know that the vaccines are being resposnible for heart problems, the evidence has ben here for a while but people dont accept it and just dismiss it as a consipracy theory",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "Like I said, they have not followed individuals for many years to see if they develop problems later.",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AscendedFalls",
                                                                    "body": "So why not both? Covid and the covid vax? They are both the same spike protein. I had covid in March 2020 before the tests and the vax. It was brutal. No previous health issues and then suddenly… Heart stopping. Palpitations. Couldnt breathe. Chest pain. Made my peace with life cause I was sure I was going to die. I am young and in my twenties. Apple watch showed heart rate of 200+ bpm from walking up stairs. After I got the vaccine I caught covid again and it was really mild, like I had a slight cough and some tiredness.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "pewpsupe",
                                                            "body": "Pretty easy if you have a control group to check on. Weird how they tried so hard to make sure there would be no control group if you ask me.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "As I said, they have not followed people for many years after either having covid or getting the vaccine.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "beehummble",
                                                    "body": "I looked at your link. It was the survival rate for months 0-26. We’re in month 46. Do you see the problem here?",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "LumpyGravy21",
                                            "body": "These charts shows the weekly cumulative excess mortality from all-causes for the United States and its states over time. [https://www.usmortality.com/excess-mortality/cumulative](https://www.usmortality.com/excess-mortality/cumulative)",
                                            "score": -1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "throwaway48706",
                    "body": "Trying reading",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SouthernFilth",
            "body": "Does it rhyme with Maxine?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PeacefulGopher",
            "body": "Get another vaccine and find out….",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Basshead42o",
            "body": "Vaccines lol",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TensorFl0w",
            "body": "Gene Therapy",
            "score": 2
        },
        {
            "depth": 0,
            "author": "7ve5ajz",
            "body": "The world is all used up and there’s no homes, jobs, clean air, clean water, guarantee of democracy, livable environment, affordable healthcare, affordable education, or hopeful future.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Aberfalman",
            "body": "It's best left unsolved.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Iwishthiswasnttrue2",
            "body": "Some people that were already on psychosocial medication and took the emergency Covid vaccine ended up with brain damage. This is a result based on the information provided. IMO",
            "score": 2
        },
        {
            "depth": 0,
            "author": "delfin_1980",
            "body": "Ozempic /s",
            "score": 2
        },
        {
            "depth": 0,
            "author": "That-Cow-4553",
            "body": "A fauchi?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "Faucism",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Goofy_Goobers_",
            "body": "I think it’s interesting they pointed out there were more deaths among white collar vs. blue collar workers. I feel like blue collar workers are probably more on the conservative side and therefore a bunch less of them got the vaxx because either their jobs didn’t push it or they were strongly against it and working in trades they could pretty much work for whatever company that didnt. All of the corporations and bigger companies largely mandated it, explains the increased deaths.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Dark_Seraphim_",
            "body": "We're all killing ourselves.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Ohbuck1965",
            "body": "You can't mix divoc shots, fent and alcohol.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "If it was Mrna vaccine. Why heart attack is increasing in country which used Astrazeneca vaccine",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Falconstarr07",
                    "body": "Boosters were Pfizer",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "indigenous Pfizer was banned in India. all boosters were Oxford(80 percent). Other vaccine was an indigenous vaccine(20 percent of total vaccine).",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Falconstarr07",
                                    "body": "And AZ was banned in some countries in Europe due to stroke and heart attack risks, especially in young males",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dicka24",
            "body": "Clot shot",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "BIN,GO",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mag2041",
            "body": "The realization of, they didn’t have a future to look forward to. That the system is built for the 1% and they are trapped.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Disastrous-Form4671",
            "body": "after slavery was banned, comanies worked together with CORRUPTED goverment and CORRUPTED lawyers to add as many laws as possible that imitates the slavery system\n\n&#x200B;\n\nAs such, you sign a contract as a worker that you get paid flat rate while the ~~slave master~~ Shareholder get % profit. And the best part, big comanies pay most of thir expenses to other comanies for materials and such. But they pay so much exactly because Shaholders, get thir profit from those comanies as well! like a pyramide scam\n\n&#x200B;\n\nOver the decates, this was better and better shaped until comanies can make bilions in profit, food, energy, medicine, and more, exactly because everyone is dying and suffering due to pandemic, war and such.\n\n&#x200B;\n\nAnd of course, guards were replaced by managers, HR and police (like not paying debt), and torture and losing famaly was replaces that you need to work or otherwise you family and yourself will suffer and live in misery as everything is to expensive, and of course it's ilegal to live in a car, tent or similar as that would prevent form creating situations where you need to borrow money from banks that enable more profit for sharheolders.\n\n&#x200B;\n\nwe can't afford anything just like slave, unless we sign contract that enslaves us or we go in prison, so of course we will work. And even if we have rights,like a animals, we don't have the privilege to get them, like how animals are pets, livestock or even if they don't want to become another animals food, they have no chose as no one will save them\n\n&#x200B;\n\nWe are one step away from slavery. And the effects are the same effect you see in slavery. I mean, did you not realise? no one, absolutly no one, called out and penelised the corrupted that made bilions in profit, exactly because they increased the prices (they are LEGALLY ALLOWED <- why?????) insted of reducing it to 0% profit exactly because of world crisis and people dying and suffering.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Covid not responsible for deaths.  Myocardia is.  As well as the slew of chronic problems AGGRAVATED by Covid.  How did we get Covid?  The vaccine.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Dangeruss82",
            "body": "The covid vaccine.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "speedracer2222",
            "body": "The jab, possibly in combination with EMF",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ProbablyOnLSD69",
            "body": "Gee idk, fucking everything??",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DontJabMe42069",
            "body": "winter vagina strikes again",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Scalymeateater",
            "body": "its the covid vaxx.  duh...",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Pipes4u",
            "body": "I hope they weren't fooled into taking any new experimental vax.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Far from experimental, they just gave the lady who was working on them for the last 30 years the noble prize. \n\nYou will take a MRNA vaccine in your life time, it's one of the greatest medical breakthroughs of our time. \n\nIf you're getting covid and thinking the vaccine is the issue, think again. It's viral load from covid remaining in the body and funking everyone up.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Pipes4u",
                            "body": "Why did we have to wait for tests and trials to be completed then if the vaccine for covid has been around for 30 years.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "She was working on MRNA research without support for 30 years because she knew the science would be useful. \n\nThat's why she is being hailed a hero and recieved the noble prize. Its one of the greatest medical advancements of a generation.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DarkCeldori",
                                            "body": "The fact spike appears in blood 180 days after vaccination, suggests continued production, which in turn suggests the rna has been transcribed into dna and integrated in the cell.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "I don't care about the covid vaccine specifically. \n\nI'm saying covid is a long-term issue if we use all other viruses as references. They stick around, so we can assume that covid sticks around. \n\nAlso, MRNA vaccines are an amazing medical advancement. \n\nMy points do not need to intersect with the covid vaccine. Even if it was poison, my points on viral infections and MRNA technology still stand.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Historical-Tip-8233",
                                                            "body": "mRNA as a tech is far too infant to adopt on a massive scale. Anybody who acts like the tech is just a new form of vaccination is lying. Before covid the only people who were given it were dying from MS and other terminal illness because we had not done any real mass-testing on the tech until it was released.",
                                                            "score": 4
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Pipes4u",
                                            "body": "But your point telling me its far from experimental. I'm just looking for clarity on why it needed some much testing and trials before it could be given to the public if it's around for 30 years. And you would imagine if it's been in use for that long it would have been affective. It doesn't strike me as a medical achievement of a generation. Covid is still around????",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "I can't help you understand. We all have limitations, maybe this subject is not your forte.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Pipes4u",
                                                            "body": "Its OK once your wan got that prize the rest is irrelevant... delighted for her.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "She deserved it, just a regular ol research scientist doing her thing for years. It became relevant overnight. \n\nBeing able to treat using MRNA now means that loads of untreatable diseases are now curable. \n\nWe are making huge advancements in genetics, and you guys are rattling about vaccines. \n\nThe right-wing disinformation train loves you guys, I'm not sure why you don't just move to China since you keep repeating their rethoric. \n\nYou do realise that it's been proven that most of the anti vaccine information is coming out of Chineese and Russian troll farms.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Historical-Tip-8233",
                                                                            "body": "*citations needed desperately*",
                                                                            "score": 4
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Pipes4u",
                                                                            "body": "Read this even the paper said it was experimental.  . Any input welcome...\n\nhttps://www.bbc.com/news/health-66983060",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "Dude, this is not even about the vaccine. I'm willing to completely accept it could have issues.\n\nWhat I'm trying to say is, regardless, covid is causing diseases and health issues across the population. \n\nJust like people who have HPV the issues will show up later in life as diseases like MS and MND.",
                                                                                    "score": 4
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "AntiquatedSolutions",
                                                                            "body": ">You do realise that it's been proven that most of the anti vaccine information is coming out of Chinese and Russian troll farms.\n\nThis is just straight up nonsense. The Russians and Chinese have both developed their own vaccine. Why would the Russian and Chinese state push for something that actively hurts their own interests?The irony of this is you're falling for corporate propaganda, and you're almost proud of it.\n\n>The right-wing disinformation train loves you guys, I'm not sure why you don't just move to China since you keep repeating their rethoric. \n\nWhat specifically makes it a *right-wing* disinformation campaign? How is questioning the safety and efficacy of a new technology at all political?\n\nAnd what exactly is the rhetoric the Chinese government is pushing? \n\n\n>Being able to treat using MRNA now means that loads of untreatable diseases are now curable. \n\nAgain just straight up fucking nonsense, it's like you're making it up as you go...",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Zee-Que",
                            "body": "They gave Obama the Nobel Peace prize, so not really that convincing.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "spookytransexughost",
                    "body": "Haha it wasn’t an experiment",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Pipes4u",
                            "body": "Your a clown... Read the paper today... \n\nhttps://www.bbc.com/news/health-66983060",
                            "score": -3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "beehummble",
                    "body": "The study linked in the article that none of y’all are reading says that those who didn’t receive the vaccine had a higher rate of death than those who did receive it: https://www.soa.org/49b504/globalassets/assets/files/resources/experience-studies/2022/group-life-covid-19-mortality-12-2022.pdf",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Pipes4u",
                            "body": "Well I'm not dead yet.. And neither is any of our family..",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beehummble",
                                    "body": "What point do you think you’re making? Do you not know what “rate” means?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Pipes4u",
                                            "body": "Do I necessarily have to be making one or is that 1 of the many reddit rules thy must obey",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "beehummble",
                                                    "body": "No. It’s not a Reddit thing. It’s a normal-human thing. If you show up to be part of a conversation, typically, when you speak up about that topic, you will have some point that you are making or supporting.\n\nIf you just wanted to share that your family isn’t dead - great. Same here. Same for a lot of people in this thread. And a lot of people who you might see walking outside. Thanks for your contribution.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "babamum",
            "body": "Ummm...could it be the pandemic we're currently still experiencing? \n\nYou know, the one that multiple studies show increases the risk of death, especially  from heart attack or stroke?\n\nOf course not.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "salad_gnome_333",
                    "body": "I know right… isn’t it obvious? Oh right, we’re pretending it’s a cold now.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "babamum",
                            "body": "Ha ha! It's nothing, mate! Not dangerous at all.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "icookseagulls",
            "body": "*”We don’t know, but we are absolutely confident it’s not that one thing some people think it is.”*",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "well if it began a year before it was available and did not spike after introduction...",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LumpyGravy21",
                            "body": "The vaccine was suppose to decrease deaths, not increase deaths:\n\nThese charts shows the weekly cumulative excess mortality from all-causes for the United States and its states over time\n\nhttps://www.usmortality.com/excess-mortality/cumulative",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "Mortality dropped from 4% to 1% in Canada... (using the same method for stats as was used at the time, I know different calculations exist now but the ratio of mortalities did drop the same ratio %)\n\nExcess deaths Begin in April and the vaccines become available in a very restricted way the following December.\n\nEffect cannot predate cause...",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LuluGarou11",
            "body": "No healthcare access\n\nToxic environment\n\nBeing Worked to Death\n\nThe Economy",
            "score": 9
        },
        {
            "depth": 0,
            "author": "supaloopar",
            "body": "Spending too much money on avocadoes /s\n\nPS: I meant this as sarcasm",
            "score": 3
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Lmao y’all need to stop. \n\nThe year will be 2074 and y’all will still be talking about, or alluding to, the COVID vaccine. Can y’all just go back to your usual conspiracy theory playbook and talk about Jews or something?",
            "score": 4
        },
        {
            "depth": 0,
            "author": "G_raas",
            "body": "I find it curious that we have so few recommendations from health authorities to Vitamins and supplements to maintain health; 5 IU VitD, VitC, Zinc, Quercertin, NAC, Green Tea extract, regularly performing Nasal Sprays/washes w/Xylitol, CPC mouthwash, Omega3s, eat a fruit smoothly daily, IR light dosing… just to name a few. We don’t need to suggest that this ‘fights’ COVID, but there is no doubt these boost the immune system and have beneficial effects on the heart and lungs. \nI could just be really lucky, but neither I nor my wife have yet been noticeably sick since this whole thing with COVID started.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "DyrusforPresident",
                    "body": "You have few recommendations for these because you get all these from a healthy and balanced diet. Taking excess vitamins and minerals does nothing for the body",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BOW57",
                            "body": "That comment actually made me laugh. Drink a fruit smoothy daily. That's exactly part of a balanced diet which is recommended by every health authority",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Fickle_Patient2224",
                            "body": "Yeah I'm sure you're getting 5k of vit d, quercetin and nac from your diet bud. Taking excess zinc does massively help for your immune system.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DyrusforPresident",
                                    "body": "You think your body can absorb all that? Excess zinc does fuck all to your immune system, that's why it's called excess",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Fickle_Patient2224",
                                            "body": "Define excess.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DyrusforPresident",
                                                    "body": "More than your body can absorb. Your turn",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Fickle_Patient2224",
                                                            "body": "Which is for reference...",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "DyrusforPresident",
                                                                    "body": "it varies based on the mineral or vitamin and the individual. People tend to go with the daily recommended amont by their healthcare officials. Zinc is recommended 12mg for healthy adult men",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrsMoonpoon",
            "body": "https://www.sciencenews.org/article/fentanyl-deaths-children-teens-opioid",
            "score": 2
        },
        {
            "depth": 0,
            "author": "QuantumAffected99",
            "body": "It's DNA plasma contamination as suggested by multiple doctors. It was poor safety practices pressured by our overlords in mass production.  You should be ok as long as you haven't received more than 2 doses.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Alohoe",
            "body": "It's definitely climate change and absolutely not the rushed barely tested so amazing you need 10 of them vaccine.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "JackDeRipper494",
            "body": "The rise starts exactly when vaccines were massively distributed (in summer/fall 2021 in Canada).  \nSo... it's climate change.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "MazlowFear",
            "body": "More people died from opioids during the pandemic than COVID. We know who was behind it. We have their address. Rather than prosecuting, Everyone with power in the government at that time, let them get a sweet heart deal to protect them from law suits. I would suggest that they are probably helping to underwrite vax & COVID fears and manipulation. As is being demonstrated by Trump, we don’t treat wealthy criminals like everyone else, not only do we make it easier for them to get off, we allow them to manipulate the public, but look up the [Saklers](https://www.newyorker.com/magazine/2017/10/30/the-family-that-built-an-empire-of-pain) and you tell me why are fighting over murky conspiracies when we know the people who delt the drugs that killed more people than COVID AND VAX combined. This is not in dispute yet we do nothing and name call each others over vapor.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "DayFeeling",
            "body": "Vaccine obviously",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "I_love_milksteaks",
                    "body": "Except the article shows that the mortality rate was higher with people who were not vaccinated. sooo.. how do you explain that?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ZolaThaGod",
                            "body": "They won’t explain it, because it’s much easier to type “v-a-c-c-i-n-e” and think you’re smarter than everyone else, than it is to actually read through articles/studies/etc. and develop a true understanding of things like this.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "themistergraves",
            "body": ">\"Given the sheer number of COVID-19 vaccine deaths reported to the Vaccine Adverse Event Reporting System\"\n\nStopped reading right there.\n\n**Anyone** can report to the VAERS. Conservative talkshows TOLD their listeners to go to that site and report that people had died from taking the vaccine.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "yahoo_determines",
                    "body": "VAERS is a great way to identify anomalies and begin looking for real problems.   BEGIN looking.  \n\n VAERS is definitely not a \"study\" to begin drawing conclusions from.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MalevolentIsopod23",
            "body": "It’s VAERS.  It’s not data about adverse effects.  Having an sciency sounding acronym doesn’t make it data.  It only makes it sound like data to people who don’t know what data is.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "smithalorian",
            "body": "Late stage capitalism. Also this happened during the industrial push at the beginning of the century. There is nothing new under the sun. Read some papers from the 20’s to the 50’s and it’s all the same.  “Younger people refuse to work and only want to listen to jazz” \n\nCompanies are allowed too any breaks on how they must behave and they start doing what they need to make money no matter who is in the way. Everyone is replaceable. \nThis recent push (last 40 years) is what’s killing people. \n\nExperience- I work in a management at a Fortune 500 company that is near the top of the list and has a major hand in GDP. \n\nConclusion- This push is not new. It is the same as in the early 1900’s.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "well if it began a year before it was available and did not spike after introduction... then we can safely rule that conspiracy out",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Greyhuk",
            "body": "What If there was this ...we'll call it ...perhaps a medical treatment....maybe something  untried ...experimental...\nThat all of them were mandated to take",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "well if it began a year before it was available and did not spike after introduction...",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Greyhuk",
                            "body": ">well if it began a year before it was available and did not spike after introduction...\n\nSo you didn't  read the autopsy?\n\nhttps://link.springer.com/article/10.1007/s00392-022-02129-5\n\nThe histological and immunohistochemical characterization revealed that the inflammatory infiltrate was predominantly composed of lymphocytes. The number of CD3-positive T-cells by far outnumbered the few CD20-positive B-cells detected. In addition, most T-cells belonged to the CD4-positive subset, while only scattered CD8-positive T-cells were seen (Fig. 1, 2, Supplementary Fig. 1/2). The T cells were negative for Tbet as a marker for Th1 cells, GATA3 as a marker for Th2 cells, D2-40, as a marker for Th17 cells (Supplementary Fig. 2). In addition, FOXP3 positive regulatory T cells and CD21 positive follicular dendritic cells were not detected within the cardiac infiltrates, while control cases, including cases of sarcoidosis were positive",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "I have.\n\nAll medications have side effects.\n\nPointing to \"it has side effects\" doesn't mean anything.\n\nI worked on some of the the vaccine studies on animals. We gave rats and dogs many times the dosage and daily and had zero mortality on hundreds of test subjects. That's thousands of times the human dosage over the trial period just so we are clear.\n\nNo offense but 1/5 mortality from this claim should have killed someone I know or worked with since the medical lab I worked at had a voluntary 99% vaccination rate. I know hundreds of vaccinated people and none have had any issues.  \n\n\nAgain excess mortality began before vaccination and there was no major spike upon vaccination. Ergo its not that.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Greyhuk",
                                            "body": ">I have.\n\n>All medications have side effects.\n\n\nPermanent heart damage was not one listed, and gaslighting  wins you no pointts\n\nNothing  else you said was worthy  of  or eraned a response",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Secret_g_nome",
                                                    "body": "lol \"I ignore things that I don't like\" niiiice. I see how you got here.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Greyhuk",
                                                            "body": ">lol \"I ignore things that I don't like\" niiiice. I see how you got here.\n\nJust your bullshit and gaslighting \n\nIt's not worth  my data",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Secret_g_nome",
                                                                    "body": "lol \"data\"",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Greyhuk",
                                                                            "body": ">lol \"data\"\n\nYes as in my internet  data: you know megabytes..or in your case kilobytes \n\nBeing moronic isn't  helping  your case you know.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Secret_g_nome",
                                                                                    "body": "okay, then explain this to me then.\n\nIf excess mortality rose in April in the US but the vaccines only became available in December of the same year (and were not widely distributed for months) and there is no significant spike in December how can you relate the two? Why do low compliance and high compliance states show very similar data? Surely by your hypothesis states like NY should have much higher Mortality than Texas, whereas the data shows them to be almost identical.\n\nIn Canada Excess Mortality rose in April 2020 but the vaccine did not become available until spring 2021 as the government insisted on having the studies redone in Canada?\n\nCause cannot predate effect.\n\nDo you think the virus that caused internal organs to rupture/leak and form scar tissue might have adverse impacts in some individuals? Its not conclusive but damn is it highly suggestive. Certainly fits the timeline better too.\n\nI remember when the outbreak hit France and young people began dying of heart failure.\n\nThe conspiracy in the US prior to vaccination was that doctors signed heart attack and lung failure deaths as COVID mortalities. They then switched to blaming vaccines a year later and I still think it would be funny if it wasn't so sad. If logic and science don't work what do we have left but mockery?\n\nIt seems to have begun in April 2020 in Canada[https://www150.statcan.gc.ca/n1/pub/71-607-x/71-607-x2021028-eng.html](https://www150.statcan.gc.ca/n1/pub/71-607-x/71-607-x2021028-eng.html)\n\nLooking at more detailed US trend Lines[https://www.usmortality.com/excess-mortality/cumulative](https://www.usmortality.com/excess-mortality/cumulative)\n\nAnd globally week by week[https://stats.oecd.org/index.aspx?queryid=104676](https://stats.oecd.org/index.aspx?queryid=104676)  \n\n\nIts clear that vaccines had little to no impact on excess mortality.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Greyhuk",
                                                                                            "body": ">If excess mortality rose in April in the US but the vaccines only became available in December of the same year (and were not widely distributed for months) and there is no significant spike in December how can you relate the two? Why do low compliance and high compliance states show very similar data? Surely by your hypothesis states like NY should have much higher Mortality than Texas, whereas the data shows them to be almost identical.\n\nBoth covid vaccine and the covid  itself cause myocarditis \n\nPer the autopsy \n\n>In Canada Excess Mortality rose in April 2020 but the vaccine did not become available until spring 2021 as the government insisted on having the studies redone in Canada?\n\n>Cause cannot predate effect.\n\nNot factoring that Canada  had longer lockdowns concentrated covid, creating  artificial  pockets  of more virulent virus\n\nRemer them locking up priests? \n\nOh and mandatory masks\n\n>remember when the outbreak hit France and young people began dying of heart failure.\n\n>The conspiracy in the US prior to vaccination was that doctors signed heart attack and lung failure deaths as COVID mortalities. They then switched to blaming vaccines a year later and I still think it would be funny if it wasn't so sad. If logic and science don't work what do we have left but mockery?\n\n>It seems to have begun in April 2020 in Canadahttps://www150.statcan.gc.ca/n1/pub/71-607-x/71-607-x2021028-eng.html\n\nExcept the Chinese festival that Trudeau  lauded...prior  to April.\n\n>And globally week by weekhttps://stats.oecd.org/index.aspx?queryid=104676 \n\n>Its clear that vaccines had little to no impact on excess mortality.\n\n🤣😂🤣😂🤣\n\nUhuh. Which included  deahs with covid, as deaths from.\n\nNice try on the spin and gaslighting.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Secret_g_nome",
                                                                                                    "body": "you literally changed your stance and threw out several red herrings there...\n\nSo you freely admit its likely the virus and predates the vaccine? Thanks.\n\nCause cannot predate effect. Unless they are time traveling Aliens XD which are totally real Right?!?!?! XD\n\nOne was tested in a controlled setting and caused zero issues in studies. The other was tested in the wild and had different results. There is a reason we do lab studies.\n\nApril was also pre lockdowns, also same time period in the US has the same data without lockdowns. Nice try lol. The Data I shred disproves whatever point you think you were making... unless that was another attempt to change the topic.\n\nAgain you simply don't read the data and look like a fool. Its why nobody takes you or your stance seriously. Red Herrings, Logical fallacies, Hyperbole.... I can tell one of us studied science and worked in research XD\n\nWhat does Trudeau have to do with private corporate research? XD Who was talking about that? XD That's like admitting your a conspiracy nut with no evidence or point LMAO. He didn't do the studies nor did I listen to anything he or his government had to say. I went and read the studies and data and made the decision for myself... Not wild conspiracies and opinions of the uneducated and uninformed XD  \n\n\nIn fact I was left a legal cripple after COVID and still waited for 2bn doses of the vaccine(s) to be administered so I had a huge amount of data to compare real world impacts and safety. Sophistry and whataboutisms don't work on me...",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Greyhuk",
                                                                                                            "body": ">you literally changed your stance and threw out several red herrings there... \n\nNo I haven't.  I've always  said  both cause it.\n\n>lol, what a flake\n\nYou mean you? \n\n>Insults me and calls me names\n\nThen stop with the disingenuous bad fail attempts \n\n> then lies when proven wrong.\n\n😂😂🤣😂🤣😂🤣 more bad faith.\n\nI've posted plenty  of papers citeding that covid causes myocarditis\n\n>classy , dude, classy\n\nSays the one who blocked me? How classy  is it? I see now why fragility  is such a bitter insult to people  like  you\n\nYou're  nothing  more than a pathetic trope",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Secret_g_nome",
                                                                                                                    "body": "lol, what a flake. Insults me and calls me names then lies when proven wrong. Classy dude, classy...",
                                                                                                                    "score": 2
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CreamMyPooper",
            "body": "if it does turn out to be true that its the vaccine behind the deaths, will we go back to calling it “Trump’s vaccine” to make the pill easier to swallow",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "true, but he didn't mandate it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "perspectivecheck2022",
            "body": "How do you cull the lower I.Q. from the population?\n\nHint; you don't poison those who choose to think for themselves.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerry-4013-Porter",
            "body": "FYI, the reason I think the situation is quite dangerous right now is also because of Nostradamus' prophecy. \n\nAlong with \"MABUS,\" the word \"FIRE\" is prophesied to be something that brings disaster to the world. \n\nBy the way,  \nI found those two words in the present's situation. \n\nI think the problem of side effects of vaccines is just the beginning.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "FlatHighKnees",
            "body": "Umm... The vaccines",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MrMxylptlyk",
            "body": "Covid causing heart complications.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Yikert13",
            "body": "Cocaine use and energy drinks. Puts a lot of stress on the heart.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "inthefirsthour",
            "body": "Probably climate change.  If we send more money to Ukraine it should fix everything... but only if we completely ignore covid vaccines as a potential cause. 😉",
            "score": 1
        },
        {
            "depth": 0,
            "author": "freddysdeadohno",
            "body": "Vax injured",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ElbisCochuelo1",
            "body": "A. Obesity is up like 10% in the past ten years.\n\nB. Our healthcare system is fucked post covid, it is difficult getting timely care especially in rural areas.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Increasing cannabis use causing heart attacks and stroked",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MuddyWheelsBand",
            "body": "In most other reddit circles, the mention of covid vaccines being a possibility would get you a load of downvotes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tzaeru",
            "body": "Ah yeah, as discussed by doctor who suggested people try a horse antiparasitic for COVID-19 with no scientific evidence that it would work for COVID-19, and a conspiratory-minded journalist who thinks mental illnesses are a hoax.\n\nI suggest actually checking those sources and references. e.g. \"According to U.S. Mortality\" sounds like it was some very official source - it isn't, it's a website kept by anonymous people, in no way affiliated with the US government.\n\nWithout proper statistical analysis and proper sources for the data, this article has no scientific worth. It's just an opinion piece.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tealwaterinside91",
            "body": "COVID??",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ok_Ticket_889",
            "body": "Probably the covid vaccine. If it's happening across the board, then it's enviormental. What was put into our environment across the board? Maybe GMO, maybe fertilizer.... but i don't think that. I think the vaccine was either irresponsible, nefarious, or both. People were herded because of fear. And acted terribly against those that didn't want to get the vaccine.  Are they even checking whether these early deaths are of people who got the vaccine? Also, I can't imagine being a parent and not trusting the vaccine. Dealing with the social pressure and stigma of your peers simply because a lack of evidence from some new tech, RNA vac, was pretty embarrassing to witness. Alot of so called \"free thinkers\" turned on their peers very quickly beholding to not a lot of will tlor compassion on seeing the other side of the coin. Fuck civic duty if the risk is literally a chance of altering my genetics, my progeny. The future scares me as does this mob.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "enkiloki",
            "body": "It is certainly not the vaccine.  Move along nothing to see here.   I'm pushing 70, my wife had a stroke, her cousin had a stroke on the same day, the hospital had so many patients that day my wife never got to the brain trauma ward that had 16 beds, my daughter in law 36 has turbo cancer, my grand child age 1 has a rare metabolic disease (his mom was vaxed 3 times). , neighbors daughter has a kid 2 years old with brain cancer, another kid down the street age 2 also has a metabolic disease, my own daughter age 30 has the early stages of autoimmune disease. Before the vax ( I had three my wife and daughter had 4) my neighborhood just had old people dying from cancer and heart attacks.  Now we're dropping like flies in a frost. But not the vax definitely not the vax.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "Thats fucking horrible.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Magari22",
            "body": "It's definitely not that thing",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Diemetic",
            "body": "It’s the pointy needle we all had to take",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SlappingDaBass13",
            "body": "Not allowed to talk about it sorry",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "well if it began a year before it was available and did not spike after introduction... then we can rule it out",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LumpyGravy21",
                            "body": "These charts shows the weekly cumulative excess mortality from all-causes for the United States and its states over time. https://www.usmortality.com/excess-mortality/cumulative",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Secret_g_nome",
                                    "body": "It seems to have begun in April 2020 in Canada[https://www150.statcan.gc.ca/n1/pub/71-607-x/71-607-x2021028-eng.html](https://www150.statcan.gc.ca/n1/pub/71-607-x/71-607-x2021028-eng.html)\n\nLooking at more detailed US trend Lines[https://www.usmortality.com/excess-mortality/cumulative](https://www.usmortality.com/excess-mortality/cumulative)\n\nAnd globally week by week[https://stats.oecd.org/index.aspx?queryid=104676](https://stats.oecd.org/index.aspx?queryid=104676)\n\nTrends begin before US vaccination dates and before even more widespread use globally. The dates don't line up with vaccination so we can rule that out. Vaccines were not available in Canada for the general public before spring 2021... That's one year after the major spike in excess deaths in the US. Look at Connecticut and its Pronounced!",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "blackjohn420777",
            "body": "Oh we're pretending not to know? Let me help you, IT'S THE JAB!!!!!!!",
            "score": -1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "💉💉💉💉💉💉",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Secret_g_nome",
                    "body": "well if it began a year before it was available and did not spike after introduction...\n\ndo y'all just not look up data when folks make claims\n\nEdit: Sorry. First vaccine in the US was end of December 2020, First availability in Canada was in April 2021, Excess mortality began April 2020 and did not see a significant spike post vaccination. Low compliance and high compliance states and provinces show the same rise in Excess mortality. One would think the data would change dramatically for later or non vaccinating regions or countries if the vaccines were the primary or a major contributor to. They seem very similar.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "No-Mechanic6069",
            "body": "VARS is now bollocks for vaccine reporting. It has been bombed by cultists for the last two years.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "yahoo_determines",
                    "body": "Big true.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Best_Caterpillar_673",
            "body": "Gas stoves, exercise, stevia, and video games. Definitely  not the Covid-19 vaccines they rushed through production and forced us all to get.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "zero-evil",
            "body": "Jesus, when it's considered like that, one cannot discount the possibility that it was intentional.  How do we check what type of personalities those increased numbers had?  If it was largely non-conformists..",
            "score": 0
        },
        {
            "depth": 0,
            "author": "autostart17",
            "body": "What’s the primary source on this? Whose life insurance data? Which companies?",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "themistergraves",
                    "body": "The primary source appears to be VAERS, an entirely **self-reported** site about adverse effects that conservative talkshows told their listeners to go to inflate the numbers of reported vaccine-related deaths.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LumpyGravy21",
                            "body": "Vaccine was supposed to decrease death.\n\nThese charts shows the weekly cumulative excess mortality from all-causes for the United States and its states over time https://www.usmortality.com/excess-mortality/cumulative",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "zero-evil",
            "body": "Jesus, when it's considered like that, one cannot discount the possibility that it was intentional.  How do we check what type of personalities those increased numbers had?  If it was largely non-conformists..",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Ass-Dick-pussy-8423",
            "body": "ask yourself what had a huge social media blackout, on ANYONE talking about it. less testing than it should and only got released under eau\n\nSchrodinger's cat. Both dead and alive until we actually test it. WITH real science and not capitalistic buzz words.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Cradleofwealth",
            "body": "Cutbacks on safety regulations!... It'll get worse now that child labor is becoming normal!",
            "score": -1
        },
        {
            "depth": 0,
            "author": "gotkube",
            "body": "Couldn’t *possibly* be feeling trapped in a life of being a corporate slave in a cold society of unending pressure",
            "score": -1
        },
        {
            "depth": 0,
            "author": "masonic_lodge-P2",
            "body": "[Its a mystery](https://youtu.be/OLvL3ecB82E?t=19)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Saviourmacine",
            "body": "The Tories & and their policies play a big part. I reckon",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Old-Individual1732",
            "body": "Same  old  tired answers,  I read it right  here,  scientific  paper on reddit,  Mitochondria in the  heart  being  affected by covid.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dystopian_Future_",
            "body": "Work",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hopeful_Solution5107",
            "body": "\"this upward trend is the result of four causes, suicides, homicides, drug overdoses and car accidents, mainly in young people 10 to 19 years old.\"\n\n\"...adults 25 to 64. And most of those relate to the problems of drug overdoses, suicides, alcohol related causes.\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SkylineFever34",
            "body": "People realize the American dream of climbing the ladder by honest hard work is gone. Your hustle and grind are no insurance policy.\n\nIf you aren't one of the well connected to the c suite, and have loads of narcissm and sociopathy, you won't get far up the ladder.\n\nMasses are discovering that if you do the equivalent of searching for the pot of gold at the end of the rainbow, you will discover someone else got it. Also, some corporate assholes profiteered off the chase.\n\nWhenever I read a rant about objectification, I say the the most guilty are the executives that see everyone as a pixel on an Excel spreadsheet.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Odd_Relation2247",
            "body": "Limited  resources and opportunities, lack of drive and ambition ,and clarity , anomie generated by an ever changing, and demanding society, the man enforced  view of the present  political  correct view of human sexuality ,and identity, and last but not the least ,the exclusion  of the wisdom  of our elderly, and the fixed norms and values that served us good ,all these things destroys the future of young  people.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jazzmagg",
            "body": "*cough*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Only_Cardiologist_80",
            "body": "Moderna and Pfizer are behind it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Neco-Arc-Brunestud",
            "body": "Because they can’t afford healthcare amidst rising inflation?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TryptaMagiciaN",
            "body": "Suicide and suicide by drug overdose.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Predatory employers and stress.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Xerio_the_Herio",
            "body": "We living paycheck to paycheck... yea and because of needles",
            "score": 1
        },
        {
            "depth": 0,
            "author": "laps1809",
            "body": "Overwork, low salary and no future.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BitchyWitchy68",
            "body": "Two words..  Predatory Capitalism.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AmbitiousNoodle",
            "body": "The typical - climate change, capitalism, exploitation",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Jabby jab, stabby stab required now ☠☠☠",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Environmental_Gap920",
            "body": "What are you trying to imply haha, this prank should have an end.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Hmmmmm.......what could it be??",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BobTrac84",
            "body": "What has changed over the past 3 yrs?what has huge a percentage of the population put into their body that they never have before? there was no long term studieon this thing…there’s your answer…",
            "score": 1
        },
        {
            "depth": 0,
            "author": "salad_gnome_333",
            "body": "Covid is a vascular disease and yes it’s causing new heart issues in previously healthy people",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LumpyGravy21",
                    "body": "Caused by the covid spike protein.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Adderall",
            "score": 1
        },
        {
            "depth": 0,
            "author": "t4ct1c4l_j0k3r",
            "body": "Stress more than likely.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BiPolarBaer7",
            "body": "Cause they put the work deaths in 2021 as deaths from the thing we can't say and it's either going back to normal now OR the thing we cannot talk about is killing the old fat white collar people with crappy heart muscles that crumble because of the thing we cannot talk about.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "niftyifty",
            "body": "That last link is a rough read. Covid has very clear heat implications and the US military ran tests showing that Covid induced myocarditis is worse than vaccine induced, but that yes vaccine induced also exists.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "new-religion-",
            "body": "absurd library drab terrific enjoy steep seemly march squalid safe ` this message was mass deleted/edited with redact.dev `",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ro2778",
            "body": "I can already tell from the source that the answer is not going to be vaccines :D let me see if I'm right...\n\nedit: surprised, it was leading heavily towards vaccine harm that could be prevented, maybe it's too big to ignore now by the mainstream. I suppose you can't ignore a collapse in vaccine uptake.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Zahn1138",
            "body": "Drug overdose, suicide, homicide, and vehicular deaths are all up in the last decade. These disproportionately affect young people.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jaymzmykaul",
            "body": "Stress, bad food options, lack of exercise, and greed.",
            "score": 1
        }
    ]
}