{
    "title": "Women are less likely to receive bystander CPR than men due to fears of 'inappropriate touching'",
    "comments": [
        {
            "depth": 0,
            "author": "TheRealAuthorSarge",
            "body": "We did it, Patrick! We defeated the patriarchy!",
            "score": 249,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "The stethoscope only exists because the inventor thought it was inappropriate to touch a woman’s chest to feel her heartbeat.",
                    "score": 54,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mythical_Atlacatl",
                            "body": "And every other doctor hated him for that",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ghostdeinithegreat",
                                    "body": "9 out of 10 doctors hated him for it.",
                                    "score": 14
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "lateformyfuneral",
                            "body": "Seems like a good invention then. You can’t diagnose as much from just putting your hand against a chest.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "derrick81787",
                                    "body": "I've always heard that same story, except it wasn't putting his hand on her chest. It was putting his ear against her chest. To me, that makes more sense because they are still listening for the heartbeat.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "zed-darius",
                                            "body": "😂",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "meangingersnap",
                                    "body": "Do you think big tiddies makes the heartbeat sound more faint? (Sorry ik this is like the stupidest question ever)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LothlorianLeafies",
                                            "body": "I think it would make the most sense to adjust them in order to snuggle in there. Not weird in the time of medicine women, but weird and uncomfortable when women were kept out of medicine.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "BIG_MUFF_",
                                            "body": "all For the sake of knowing",
                                            "score": 0
                                        },
                                        {
                                            "depth": 4,
                                            "author": "tonkadtx",
                                            "body": "They do even with a stethoscope.  Makes it tougher to find the PMI (Point of Maximal Impulse) and do EKGs, too.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "FBM_ent",
                                            "body": "I for one, appreciate your candor.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "KawazuOYasarugi",
                                    "body": "Nah, it wasn't the hand, it was their ear. They would put their ear to the sternum and listen then count. It was apparently the cause of many a salacious rumor and accusation. I'm quite sure several people died on duels and assassinations because of said allegations, so a worthwhile investment to be sure. Lots of women were embarrassed, flustered, or even horny over it, and male doctors stuffing their face in boobs probably had a same effect on them.\n\nEdit, a similar tool is a speculum, used by gynecologists to get a better view: previous to that it was all fingers, sometimes an assistant, sometimes the doctor. The speculum cleared up a similar problem. Of course there were people that wouldn't allow one to be used because apparently its enough to \"ruin virginity\" so there was that argument for a while.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Prometheus55555",
                    "body": "Tits to die for.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Justdowhatever94",
                    "body": "You can't discriminate against women if they're are none left.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[Women are less likely to receive bystander CPR than men due to fears of 'inappropriate touching'](https://www.abc.net.au/news/health/2023-10-06/women-less-likely-to-receive-bystander-cpr-than-men/102937012)\n\n*The researchers then focused on the roughly 9,000 people from the total group who went into cardiac arrest in a public place (as opposed to a private residence) and found bystanders gave CPR to more men (68 per cent) than women (61 per cent). They found only 54 per cent were given CPR by a bystander. When the researchers looked at cardiac arrests in private settings, older women were more likely to receive CPR than older men.*\n\n*Research shows some people fear they will be accused of sexual harassment if they give a woman CPR\nYet all Australian states and territories have Good Samaritan laws which protect bystanders acting in good faith\nSome CPR trainers are tackling this issue by using female-presenting mannequins in classes.*  \n\nTIL If you see someone in troubles make sure he isn't a women first for not being called a creep later. See also:\n\n\n* [Women Less Likely To Be Given CPR Than Men In Public Places But In Private Spaces Older People Less Likely To Be Given CPR](https://eusem.org/news/908-press-release-women-less-likely-to-be-given-cpr-than-men-in-public-places-but-in-private-spaces-older-people-less-likely-to-be-given-cpr)\n* [For many, a 'natural death' may be preferable to enduring CPR](https://www.npr.org/sections/health-shots/2023/05/29/1177914622/a-natural-death-may-be-preferable-for-many-than-enduring-cpr)\n* [Lady Sues Man Who Performed Mouth-to-mouth CPR And Rescued Her From Drowning](https://thewitnessjournal.com/lady-sues-man-who-performed-mouth-to-mouth-cpr-and-rescued-her-from-drowning/)\n* [Man revives woman with AED, but branded 'pervert' for removing her clothes to apply electrode pads](https://japantoday.com/category/national/man-revives-woman-with-aed-but-branded-pervert-for-removing-her-clothes-to-apply-electrode-pads)\n* [Chinese chemist who broke woman’s ribs during CPR cleared of liability](https://www.scmp.com/news/china/society/article/3044505/chinese-chemist-who-broke-womans-ribs-during-cpr-cleared)\n* [A woman named Cassidy Boon is suing the man who saved her from drowning, claiming that he raped her.](https://www.youtube.com/watch?v=RkBj58VJfHI)\n* [He Saved Her Life…Then She Sued Him.](https://www.urbo.com/content/he-saved-her-life-then-she-sued-him/)\n* [The world’s first true female car crash dummy is here — and it’s a big deal](https://www.zmescience.com/science/news-science/the-worlds-first-true-female-car-crash-dummy-is-here-and-its-a-big-deal/)",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "Zephir_AR",
                    "body": "[Failure to provide assistance](https://g1.globo.com/rj/rio-de-janeiro/noticia/2023/09/06/omissao-de-socorro-entenda-o-crime-pelo-qual-foi-autuado-porteiro-que-viu-agressoes-ao-ator-victor-meyniel.ghtml) criminal offence:\n\n*If you don't touch the person and just call an ambulance, you can't be charged. Or if you run to find someone that know better is also a valid response. But if you ignore, you're charged.*",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Strange_Hedgehog_7",
                            "body": "I think that's only if you have a duty of care like you're in a position to provide aid like a Paramedic, Police, Firefighter. You really don't need to involve yourself please just go on with your day, this is what response would ask you to do anyway",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "zolikk",
                                            "body": "Sounds like a great way to dissuade people from taking an accredited CPR instruction or class.",
                                            "score": 18
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Chubbywater0022",
                                            "body": "You got a link to that. I think that’s a very interesting law. I’m cpr certified but that was well over 7 years ago and I got a memory of a goldfish.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Strange_Hedgehog_7",
                                            "body": "Remind me to avoid seattle. What a horrid sounding place",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Extra-Cheesecake-345",
                                    "body": "It depends on the location greatly. Generally speaking though you won't be charged as a random person unless there is some compelling reason to do so. For example, if you are wearing a confederate flag shirt and yell out \"I aint doing shit for a \\_\\_\\_\\_\\_\\_\\_\\_ he can die\" you will then be charged (and probably get the felony hate crime enhancement). That said they generally don't charge people who panic, or do other stuff unless there is a very compelling reason to do so.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "asm120",
                            "body": "The whole acting in good faith thing may protect you from legal consequences, but all it takes is a well edited video by someone with an agenda posted on twitter and the mob comes out and ruins your life and everyone defending the person gets silenced on twitter/reddit.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Whane17",
                    "body": "Canada has the same laws. I was still verbally reprimanded by my supervisors boss (who is female) for performing CPR on a woman while I had a new guard (who was also female) standing there doing nothing. Like it should matter who is providing the life saving somehow...",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Zephir_AR",
                    "body": "[Women abusing accusation of personal attacks](https://www.youtube.com/shorts/roEeZMcwXkQ?feature=share) No wonder persons with such a mentality put men into a legal risk even after medical intervention.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ArguteTrickster",
                    "body": "Did you read the article, and how this includes paramedics? It's mostly due to a lack of understanding women are having heart attacks, not fear of inappropriate touching.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LothlorianLeafies",
                            "body": "I've read the article, and your assertion is incorrect.\n\nAfter this quoted section, they carry on to speak about CPR training and mannequin breasts, and finish with best practices for bra removal during codes (underwire/defibrillator).\n\n\"Clinical and interventional cardiologist Fiona Foo said this gender disparity in CPR rates was one of several reasons why women with heart disease have poorer outcomes compared to men.\n\nShe said it was noteworthy that even paramedics were more likely to give CPR to a man than a woman (40 per cent versus 36 per cent), according to 2019 data from NSW.\n\n\"The public and doctors still don't feel that women have heart disease or are going to have a cardiac arrest,\" she said.\n\n\"There's still this thought that women don't die of heart disease when it is actually the second-leading cause of death in women in Australia after dementia.\"\n\nWhy aren't women given CPR?\n\nResearch suggests there's three main reasons behind this reluctance:\n\nfear of inappropriate touching\n\nfear of causing injury because women are \"physically weak or fragile\"\n\npoor awareness of a woman being in cardiac arrest.\"",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ArguteTrickster",
                                    "body": "Nothing you just quoted says I'm incorrect.",
                                    "score": -1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "West_Big_6219",
            "body": "No matter what u do as a man, a woman will accuse u of something",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Men are always suspect apparently. It still bothers me that I can’t walk home on a sidewalk in the evening without women crossing to the other side pretty much every night. I’m just walking home from work and have the repulsive nature of being a tall man, feels bad every time you notice the look up and cross over motion",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "HereAgainHi",
            "body": "What?  I would dive right in.  idgaf.\n\nedit: I'd probably administer cpr too.",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "fufu3232",
                    "body": "You’re going to get yourself in legal trouble. You need to realize what the western world views men as from birth; a threat. You are a threat whether you like it or not.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GnotrexZzama",
                            "body": "Yeah maybe we should stop thinking that then. “Western world” my ass I don’t know anyone in real life who actually has a life that believes or says these things. Maybe that would change if I decided to study the liberal arts",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "LeChief",
                    "body": "💀",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "desubot1",
                            "body": "\"what the hell is cpr\"- quagmire",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HulkSmashHulkRegret",
            "body": "The law of unintended consequences! \n\nIt’s like putting a “no solicitors” sign by the front door, it’ll scare off the considerate sales people, so the only ones who still ring the door bell are those who are too oblivious to read the sign or who really don’t care, either way a lower quality person. \n\nSame goes for the the decades of  messaging about treating women respectfully and trashing men who don’t, and the whole problem of false accusations and the need to protect ourselves from that; those who care, *and those who fear the accusation*  stay away except for very limited times when enthusiastic consent is there… but this is also the same population who care to do CPR! \n\nNo idea how to fix this, but we’ll all be dead soon regardless",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Lol, you nailed it. Teach men not to rape seems like a good idea until you realize most men know not to rape and rapist don’t care.",
                    "score": 25,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Eyes-9",
                            "body": "exactly, lmao.\n\n\"Don't rape!\"\n\n\"what's rape, mommy?\"",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "radioOCTAVE",
                    "body": "Good morning to you too, sunshine!",
                    "score": -2
                },
                {
                    "depth": 1,
                    "author": "Luxating-Patella",
                    "body": "How is getting fewer door to door salesman an unintended consequence of a \"no solicitors\" sign?\n\nAs long as the time I spend dealing with them goes down, I don't care if the average quality of spammer goes down. \n\nIs the idea that if there's a line of \"considerate salespeople\" (lol) down the garden path, the \"bad salespeople\" can't get through?",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "1bir",
            "body": "They know where #MeToo's heart is...",
            "score": 36
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Try and help someone, get slapped with a sexual assault charge. Pass\n\nUsing an AED is even worse. You have to remove their bra. Hard pass",
            "score": 16
        },
        {
            "depth": 0,
            "author": "Flashy_Attitude_1703",
            "body": "Fun thought on CPR. I took a first aid course from an EMT who was teaching CPR and some people said they would be afraid to hurt someone giving CPR and he pointed out if someone needs CPR they’re already dead so you might as well try.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Phototoxin",
                            "body": "But it can keep people stable until an ambulance arrives",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "RobotToaster44",
                            "body": "2 > 0",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Unable_Orchid2172",
                                            "body": "There's no way you can \"do more harm than good\" on someone with CPR. If you're giving CPR to someone they're literally already dead.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "How do you know? People panic, skip steps, forget to check for a pulse, or don't know what a weak one feels like, etc...",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Fresh-Temporary666",
                                            "body": "Yes but you only do CPR when the person's heart is no longer beating. \"Doing more good than harm\" has a low bar to clear when doing nothing leads to them dying. When the alternative is death 2% odds are well worth the risk of a few broken ribs.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Extra-Cheesecake-345",
                    "body": "Yup, they are dead, if all you do is chest compressions you aren't gonna make things worse. Also, CPR is known to break bones particularly in older people, if you break a rib that might actually mean you are doing it right and applying enough force.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "JakeWasAlreadyTaken",
                    "body": "When I got CPR certified, they taught me that you’re pretty much breaking their sternum every time. It sucks that the US allows them to sue for saving a life. The only time I could see a lawsuit being fair is if the person improperly administered it or wasn’t certified to administer it and improperly administered it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Whane17",
            "body": "Am a security guard. Had to perform CPR on a woman. My female coworker on the scene stood back and did nothing during the event but watch me. Had a second of \"What do I do\" before training kicked in. Got reprimanded after the event by my supervisors supervisor because I'm a male who performed CPR on a female while a female guard was present...  \n\n\nSo yeah, screwed if you do, screwed if you don't. Guess next time some woman's going to die because I can't afford to lose my job.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "tzwep",
            "body": "I mean.. even in that photo the middle and ring finger are very close to the nipple. \n\nIs it worth the potential lifelong headache of being accused?",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "ProEugenics",
                    "body": "Bleeding hearts will say it is worth the headache, but those same people are awfully silent whenever people are being accused of heinous shit, and being tried in the court of public opinion.\n\nNah, fuck all that, don't help them. Women insist they can survive without the help of a man just fine, so let them. For the woman that have a problem with that logic, start holding your friends accountable for their stupid ideas, they're never going to listen to a dude stating logic when they already hate everything that they think men stand for.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "detXJ",
                    "body": "Based off the photo, I think that the guy may actually have been scared of groping her. Palm should be medial, so you should absolutely be grabbing a handful.\n\nYou should also cut off all their clothes in order to apply aed pads.... can definitely see how some may be scared of a lawsuit",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ProEugenics",
                            "body": "It's 2023, they can do anything a man can do, right? Let 'em handle their own problems, I agree.",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Yes because the alternative is someone dying, with much greater probability. And if you do get accused in that situation people will probably side with you given that you literally saved their life",
                    "score": -10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "There was a biking guy in the forest who was asked for help from a lost 5 yr old girl. He went away and she was found dead later. He said he did not help her because he did not want to be accused of weird stuff (having kidnapped or sexually abused her). As a father of a girl I cannot imagine the pain. Yet as a man I do feel that guy as well.",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "S0urH4ze",
                                    "body": "I appreciate you sharing that with everybody.\n\n\nI hope you and your family live a peaceful life and never have to experience anything like that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "Same to you!!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "M_LeGendre",
                            "body": "\"Much greater probability\" is a stretch, CPR administered outside a hospital, by someone who is not a professional, has a very low impact on the odds of survival",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Yeah but you’d have to be completely psychotic to accuse someone who just saved your life of sexual assault",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "M_LeGendre",
                                            "body": "Have you met people? There are plenty of idiots out there.\n\nAlso, pretty common to sue the person that just saved your live for bruises caused during CPR",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "Lots of idiots, not as many insane people. At least not that insane.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "S0urH4ze",
                                                            "body": "High risk high reward.\n\n\nNot worth the chance.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BoomerHunt-Wassell",
                                    "body": "CPR in a hospital by all the professionals is almost completely worthless as well.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "M_LeGendre",
                                            "body": "The numbers I have are 20% success rate in hospitals, vs. 7% outside hospitals (or 1 in 5 vs. 1 in 14). Pretty big difference",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BoomerHunt-Wassell",
                                                    "body": "My source is I asked my mother who’s been an ER nurse practitioner for 32 years how good cPR is.  \n\n“We’ve brought 1 person back.  They died 2 days later”",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "M_LeGendre",
                                                            "body": "That's awfully low. I have a lot of physician friends/family, and they do CPR often, most say it's 20-40% success rate. One of them did it successfully today",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "BoomerHunt-Wassell",
                                                                    "body": "A defib or crash cart sure, 40% seems reasonable.  Compressions and breaths, good luck.  Especially good luck if you aren’t in a hospital.  I mean cmon, CPR is so bad they change the info constantly just to keep it relevant.  I’m convinced it only exists to make people feel like they are “doing something” and that person is going to live or die independent of those actions.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ProEugenics",
                            "body": "One person dying out of nearly 8 billion on the planet is absolutely not a huge loss, in any way. Especially not compared with the rest of my own life. They already made whatever poor decisions put them on the ground, I'm still walking and trying to live, so if helping them would potentially hurt me, I'll pass.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Actually a sociopathic thing to say",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Clancy1312",
                                            "body": "You believe the exact same thing, you're not throwing your life away for a stranger. The bystander effect is real and you're not somehow above it. However you're also constantly on a moral high horse so you'll never admit this.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "If someone is actually dying in front of me that isn’t even something I’m gonna think about. I’m going to be operating on instinct at that point. In the incredibly slim chance that they decide to *accuse me of sexual assault* I’ll cross that bridge when I get to it. \n\nIt’s not until I witnessed someone hurting someone else that the bystander effect would come in. I wouldn’t know why they were doing what they were doing so I wouldn’t know how to respond and if no one else is responding either I would probably just keep doing whatever everyone else was doing.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TrueMrSkeltal",
                                                            "body": "You wouldn’t do anything. You know this deep down and are pretending you have some sort of superior ethics to everyone else here. No one is fooled by it.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "I think you’re projecting",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TrueMrSkeltal",
                                                                            "body": "Nah",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Clancy1312",
                                                            "body": "Yes everyone believes they’d be the one to jump in and save the day",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "Do you think we, as a species, just leave each other to die because of the bystander effect? No, that is not what happens.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "S0urH4ze",
                                                                            "body": "No I'm going to depend on you to take all the risk and accept all the reward if everything turns out. Clearly from your comments my intervention isn't necessary.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ProEugenics",
                                            "body": "I'm sorry that discussion actually has to include logic, at some point. If all you want is to engage on a battlefield of emotions, I don't have time for you. Our species is supposed to be sapient, not driven by emotions and instinct.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "‘It doesn’t matter if a person dies because there are 8 billion other people’ is not logic. It is not logical to not care about the preservation of the lives of other members of your species, we evolved to do that for a good reason.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ProEugenics",
                                                            "body": "Yes, and that good reason was because our species, especially while still evolving, faced many, many threats. We were even fairly close to extinction at one point, if you actually know the history of the human species.\n\nWe are not at that point anymore, and to refuse to evolve further would be some seriously subsentient behavior.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "It’s not just not dying. It’s caring about other people in general. Humans are social creatures and our ability to communicate and operate as a collective force is what got us this far. If we become cold sociopaths that entire dynamic breaks down",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ProEugenics",
                                                                            "body": "Humanity has always skated by on the idea of the 99.9% that is common and stupid utilizing the successes of the 0.1%. To refer to that as cooperation is a gross misrepresentation of history. Tribalism is not some beautiful, socialist, communal living situation, it's a bunch of people who didn't know what to do in a situation following the one person that did, and not much has changed in that regard. Vicariousness is a poison, stop sipping it.\n\nSociopaths are also consistently the ones in leadership positions, if you refer to the research...seems to imply that the emotional crap doesn't really do well when in charge.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "The world is not a meritocracy. Sociopaths are in leadership positions because they are willing to do things to get there that other people aren’t.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "ProEugenics",
                                                                                            "body": "Yeah, sounds exactly like a meritocracy, they are willing to do what others aren't, so they get rewarded. Good job.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "[deleted]",
                                                                                                    "body": "Willing to do what others aren’t when it comes to morality, not leadership. \n\nCancer cells are better at reproducing and as a result take over the entire body. Would you consider that a meritocracy at the cellular level?",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "ProEugenics",
                                                                                                            "body": "\"when it comes to morality, not leadership\" those two things often go hand in hand, and that's why the tough decisions can't be made by bleeding heart emotional jackasses. You need calculated decisions at that level.\n\nAnd not exactly, but in a rough manner, I guess you could call evolution a meritocracy, although nature is a horribly inefficient CEO.",
                                                                                                            "score": 2
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "SageAMunster",
                                                            "body": "\"It is not logical to not care about the preservation of the lives of other members of your species.\"\n\nIf you care about the preservation of your species, then you should welcome natural selection to keep your species strong. Your worrying about an individual which, in the big picture, is expendable. We evolved this way for a good reason.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "Natural selection made us care about each other. Having people to help you makes your death far less likely.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ratttertintattertins",
                                    "body": "You’re claiming to be “unemotional” and yet your argument is based on a completely hyperbolic fear of getting falsely accused of something while trying to help someone.  Not something that actually happens in any kind of statistically significant way.\n\nYour response couldn’t be more emotional.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ProEugenics",
                                            "body": "My argument is entirely logical, you're simply trying to project your emotions.\n\nMe, and the victim of whatever circumstance occurred, are both human beings with a base value of 0. We have both lived lives that, more than likely, have added value to ourselves to some degree. The only real difference between us, at this stage, is that I'm still ambulatory, and they need assistance.\n\nThe issue arises in that, if I help, I risk my value, in the eyes of society, going down drastically. And that's the minimum punishment, assuming I don't actually get fined or jailed because someone believed some bimbo's accusations, which inarguably DOES occur in our world. If I don't help, the worst thing that happens is that people think I'm kind of a dick, assuming anyone knows that I noticed and didn't help at all. I don't lose access to my livelihood, I don't lose nearly as much reputation, comparatively, I don't really lose anything at all.\n\nSo, why bother? A basic cost-benefit analysis says that it isn't worthwhile, not because of anything that I may or may not gain, but because of what I may or may not lose. And I am not willing to, nor is it acceptable to demand that I, risk any part of a life that I am quite enjoying on a complete dice roll of an action.\n\nAs for statistical insignificances, the ridiculously vast majority of men do not rape, have never thought of raping, and will never rape. Yet, such accusations are things that we must worry about in the modern day, because the modern legal system has proven that it is lucrative for women to accuse someone, because they will be publicly showered with affection and support before any proof is ever offered and gone over by actual professionals in an actual court of law. People like you are just mad that it's your turn to be worried about a statistical insignificance, perhaps you shouldn't have set such a precedent.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "You’re just too afraid to discern what women are feeling so you put a blanket illogical argument over everything/ strawman everything so that you don’t have to be bothered with other people’s experiences",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ProEugenics",
                                                            "body": "Afraid to discern? More like not going to bother discerning. I've weighed my life against theirs, and mine is more important to me, deal with it. There's nothing straw man about an argument that we have literal statistics for, you are trying to argue about a straw man existing in a post about literal research done on this topic.\n\nActually learn to read, my guy, lol.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "……. You’re an idiot 🫣",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ProEugenics",
                                                                            "body": "This is the guy trying to bring up straw man's on a topic about research into said topic. Keep up next time.",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "ratttertintattertins",
                                                    "body": "Yeh, you’re not only emotional but you’re highly delusional and your turning to misogynistic language (Bimbo) as if the distressed person must obviously be one only highlights your emotional state further.\n\nIn your mind, a woman on the ground is somehow a threat to you and your sense of being threatened is way over the top.  You’ve got a classic victimhood mentality going on and it’s a mile wide.\n\nAs I said, your point of view is about as emotional as they come.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ProEugenics",
                                                            "body": "Oh yes, misogynistic language, as if people who falsely accuse others of heinous crimes don't deserve to be ridiculed and disrespected. Again, you are responding emotionally without thinking of who you are defending.\n\nNot reading further into your comment, you're proving my point tenfold.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ratttertintattertins",
                                                                    "body": " As far as I can tell, the situation you're describing of a person accusing someone doing first aid of sexually assaulting them has happened once...\n\nDo you really thing this bizzare position of yours has any basis whatsoever in sane reality?",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ProEugenics",
                                                                            "body": "Ah, so you have first-hand knowledge of every CPR instance in recent history, like an AI or something? I mean, your responses would indicate you're pretty much a bot, logically speaking, but I didn't think it was a literal condition in your case.\n\nAnd we are literally talking about women's propensity to lie about this topic, which is not up for debate, the stories have become more and more prominent in recent years. You don't get to make reality based arguments when defending such behavior, nor when attacking the valid reactions to such behavior.\n\nIf a woman crossing the road to avoid walking directly past a man is a valid response based on the statistical improbability that he might rape her, then a man walking past a woman who needs CPR based on the statistical improbability that she might lie about him is equally valid.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ratttertintattertins",
                                                                                    "body": "I don't need to have been present at them all.  If another incident had occurred, morons like you would be pumping out the rage propaganda to such an extent that it'd be readily findable.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "ProEugenics",
                                                                                            "body": "Propaganda? This study is the first I've heard of this topic, but then again, unlike what I have to assume is your type of people, I don't go out every day looking for things to be offended by.\n\nAlso, men's issues being often suppressed in public forums is literally one of the men's issues that people consistently try to discuss...except that it gets often suppressed. Imagine creating an echo chamber, then acting like not hearing things outside that echo chamber is somehow evidence for whether or not something occurs.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "ratttertintattertins",
                                                                                                    "body": "> I don't go out every day looking for things to be offended by.\n\nI mean...  you seem to be so paranoid about women that you'd literally let a woman die because of some theoretical risk that largely exists in your own mind.  You're living in a highly distorted reality.  This comment couldn't be more ironic.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "wosayit",
                                                                                                            "body": "It’s not a theoretical risk, someone actually did get sued after rescuing a woman.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "ratttertintattertins",
                                                                                                                    "body": "That’s true, there’s a genuine one in a million chance of it occurring.",
                                                                                                                    "score": 0
                                                                                                                }
                                                                                                            ]
                                                                                                        },
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "ProEugenics",
                                                                                                            "body": "We are literally on a post about this topic, if you can't comprehend talking about a topic that literally pops into your feed, without including emotion in the mix, then I can't help you.\n\nLmao, projection is your drug of choice, isn't it?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "ratttertintattertins",
                                                                                                                    "body": "I am going to stop discussing with you now.  We’ve reached the futile circular stage of the conversation.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "ProEugenics",
                                                                                                                            "body": "Attaboy.",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "Um except in one of those situations there’s a person collapsed on the ground possibly dying. The vast majority of women who would normally avoid the “man” would probably turn around and help out if they started dying…",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "ProEugenics",
                                                                                            "body": "Considering all the research done on the bystander effect, I don't think you're correct.",
                                                                                            "score": 2
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "OilBoardingMasochist",
                                    "body": "Based",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ChiefRom",
                            "body": "Not worth it sorry",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "momentimori",
                            "body": "Try and help someone, who is more likely to die, and get your life ruined by allegations of sexual assault or don't take the risk.\n\nMost people don't care that much about random strangers to take that chance.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Fickle_Goose_4451",
                            "body": "Having seen how it plays out in real life, the dude coping the feel on the dying/unconscious lady doesn't stick around to actually render aid.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Extra-Cheesecake-345",
                    "body": "Here is my tip, if you ever think you might be charged with something, you have the right to remain silent, use it. By the time she complains or makes the accusation she will be at the hospital, police are probably not gonna ask you questions about who you are, and EMT's don't have the authority to detain you. Leave, say nothing to no one about who you are, and just wait to see how things play out.\n\nWould it be saving someones life or self defense, use every right you have as it all falls on the government to prove everything. Combine that with they can't use you using your rights as proof of guilt, this means its a impossible to prove case.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Matty2things",
            "body": "White women less likely to be saved due to fear of helping a Karen.",
            "score": 23
        },
        {
            "depth": 0,
            "author": "Multipass-1506inf",
            "body": "Nobody really does though. I’m old, and I’ve seen three people have heart attacks in public though my life. In all three cases, people stood around waiting on 911, not sure if they would do anything or not. The one case where someone jumped into action the victim ended up a vegetable. The latest time I’ve seen someone have a medical episode in public, far to many people took out their phones.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Heavy-Copy-2290",
            "body": "We'll in my CPR class, the lady talked about getting sued by some father because she exposed her chest. Shit does happen unfortunately...",
            "score": 3
        },
        {
            "depth": 0,
            "author": "daemon_fork",
            "body": "Well what else did people expect? Why would man wish to save a stranger only to be faced with a SA lawsuit later on?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "SageAMunster",
            "body": "First Aid course taught me... Don't make others problems, my problems.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "player85",
            "body": "I never thought about this, but it's right I wouldn't try any first aid on a female I didn't know!",
            "score": 4
        },
        {
            "depth": 0,
            "author": "ProEugenics",
            "body": "I thought they were strong, independent, and didn't need a man's help...\n\nI can just keep walking by, they've got this, right? I wouldn't want to offend a woman by implying that they couldn't take care of themselves.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Such a straw man argument",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ProEugenics",
                            "body": "Nothing strawman about it when it's the literal narrative these days.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Early-Rough8384",
                                    "body": "The literal narrative is that women would rather die than have man perform CPR on them?\n\nThat's literally the narrative is it?\n\nLike literally?",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ProEugenics",
                                            "body": "No, the literal narrative is that they're strong, independent, and don't need men's help.\n\nI can understand why, for the purpose of your argument, you would want to ignore that obvious connection that I was making in favor of your straw man.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "seniorscrolls",
                                                    "body": "Honestly that sounds like they don't want CPR from a man though so where are all the CPR certified women in public and why aren't they helping?",
                                                    "score": 6
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Early-Rough8384",
                                                    "body": "Ok glad you admitted that your comment was a straw man argument\n\nNext time try and argue with facts and logic rather than your feelings",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ProEugenics",
                                                            "body": "My word, but you seem to have some trouble reading. The words used were \"your straw man\".\n\nI'd say nice try, but it wasn't even a good one.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Early-Rough8384",
                                                                    "body": "Yes we're talking about your strawman \n\nYou admitted you were wrong, it's fine just don't do it again",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ProEugenics",
                                                                            "body": "Well, the votes seem to indicate that people think you can't read, just like I said. Keep trying, little buddy.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Early-Rough8384",
                                                                                    "body": "The votes are saying your argument was a straw man...",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "ProEugenics",
                                                                                            "body": "Me: +4 +6 +7 +3 +2\n\nOther side: -5 -2 -6 0 0\n\nI know logic isn't your strong suit, obviously, but you can't even do basic addition?",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Early-Rough8384",
                                                                                                    "body": "Yes, but you clearly can't",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "ProEugenics",
                                                                                                            "body": "Keep on trying, lol. You are outclassed logically, so you tried numbers, but you are outclassed there, too.\n\nSee if you can come up with something smarter than \"no u\", this time.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Early-Rough8384",
                                                                                                                    "body": "Ok you're clearly not debating on good faith",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "How in gods name do you not get the contexts in which women say they don’t want or need help? It’s soo obvious. You’re just being dense.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ProEugenics",
                                            "body": "I'm pretty sure someone laying on the ground bleeding out and needing CPR is probably not actually asking for anything. Do try to stay within the confines of the actual topic of the post.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "Did you actually think that arguing semantically that a person on the ground dying isn’t technically asking for help is a good argument? 😂😂😂😂😂😂😂😂😂😂😂😂😂🤣🤣🤣🤣🤣🤣🤣🤣😂🤣🤣🤣😂😂😂😂",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ProEugenics",
                                                            "body": "Yeah, consent is huge. Don't you remember all the signs that used to be around, no means no, I'm drunk means no, silence means no?\n\nAnd people who are going to lie about you, will usually do something to entrap you into that lie, so asking for help is not inherently proof that you're safe. Nice try.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "I feel like I’m having a deja vu, but how do you not get the specific contexts that the “no means no” movement is referring to? It’s soo obvious.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ProEugenics",
                                                                            "body": "How do you not understand the idea that if the logic works there, the logic works elsewhere? Your inability to extrapolate is quite a crippling mental hang up, ain't it?",
                                                                            "score": 3
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Yeah, unless she's family or a close friend. I'm not giving CPR to any woman.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "This is sad, but I 100% understand as a female. These days females demonize men over the smallest things. They go to gyms with string up their behinds and get offended when a man gives them the SLIGHTEST look.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Lol",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Mythical_Atlacatl",
            "body": "Is this like false rape allegations?\n\nSomething that is rare but has a large impact on innocent people?\n\nLike we have women suing and calling people perverts because they were saved via CPR\n\nA rare event, but has now led to women more likely to die because people are fearful to administer CPR?\n\nDo people need to come down hard of people suing after CPR? For frivolous cases, stupid cases, people out to make a buck?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Zeal514",
                    "body": "Yea.  But the consequences of it are nearly unbeatable, and all it takes is a claim to completely ruin someones life.  Its not so much about the frequency of women falsely claiming their CPR savior raped them, but the frequency of women who make false claims in general, and the severity of those consequences.  It makes people anxious.  Anxiety is a thing.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Traditional_Peach_29",
                            "body": "What are you talking about? Do you know how few rapists get actually persecuted?",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Stranger rape has a very high conviction rate.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Traditional_Peach_29",
                                            "body": "Do you have a source that validates this claim as a general trend?",
                                            "score": -3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Zeal514",
                                    "body": "Even if not convicted, the social consequences are often extreme.  For instance MattressGirls victim commit suicide.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Traditional_Peach_29",
                                            "body": "A hard fact is that false accusations are much much rarer than actual rapes. Of which around 50% often go unreported. \n\nYou are statistically more likely to be raped as a man than to be falsely accused. \n\nAnd “social consequences”? Do you also care this much about men protecting their rapist friends, which happens often?",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "S0urH4ze",
                                                    "body": "What you're failing to realize it's high risk high reward.\n\n\nSure you could save somebody. It could also completely ruin your life and destroy your family.\n\n\nIf it's between my family and letting a stranger die. Sorry\n\n\nEven if it's a .0000001% chance, is it worth the rest of your life?",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Zeal514",
                                                            "body": "This is exactly the thought process.\n\nI always found it funny how politically correct people seem to forget that people are human beings.  When I was a kid, it was the conservatives, but nowadays it seems to be the left...  Its really very simple, human beings are human, they feel emotions, they observe potential risks, they feel anxiety, depression, happiness, sadness, etc.  Seeing someone dieing pulls on the emotions and makes the average person want to help.  But the potential risk that might go along with helping also plays a factor, which increases anxiety and so on.  In fact, most people won't jump in to do CPR out of anxiety for what ever reason they have, outside of male to female CPR.  Thats just a fact, when tragedy strikes, most people are not the sort of person you want to lean on for it.  Adding in a potential sexual assault allegation, well that just creates a perfect excuse for someone to say \"welp, fuck that I am not doing that.\"  Its a very human response.  People not understanding this just seem like robots to me.",
                                                            "score": 2
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Traditional_Peach_29",
                                                            "body": "God in what countries do y’all live where giving a stranger CPR can actually ruin your life",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "S0urH4ze",
                                                                    "body": "I mean any country where somebody can get on the internet and accuse you of something.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Traditional_Peach_29",
                                                                            "body": "That seems like a baseless fear, I have never seen nor heard of someone doing that, and I’m a med student",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "S0urH4ze",
                                                                                    "body": "Sweet. In that case I'll stand back and let you do the CPR.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Traditional_Peach_29",
                                                                                            "body": "Childish",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "S0urH4ze",
                                                                                                    "body": "I know why would you ever want me to perform CPR on somebody",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ProEugenics",
                    "body": "There have been calls for fair punishment in those cases for a while now, as far as I know.\n\nIn my own personal opinion, I think whenever you falsely accuse someone, and you get found out, your sentence should be whatever their max sentence could have been, plus 10 years.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Disastrous-Form4671",
            "body": "what? I did a few CPR training, so anyone who did real life correctly: you press on the chest to pump the heart to pump the blood flow, no on the breast to pump the lungs. Aka it's in between and all you need to do is twist the hold of your arms to avoid what is shown in that picture.\n\n&#x200B;\n\nAlso, it dosen't matter, many people sued people doing CPR exactly because they did mouth to mouth. At least the judges had the brain to throw such cases out exactly because the one making the claim is alive because of the CPR.\n\n&#x200B;\n\nAlso, anyone wanting to do CPR to help others (like care homes and such), ensure you always have a bag (specially made for CPR), because they will vomit up whatever is in their stomach and it will be nasty beyond imagination",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "9th-man",
                    "body": "You forgot about having to break a couple of ribs to get the heart pumping.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Stupid question: who pays for the lawyer of the accused person? who pays for the time and stress wasted to prepare your defense and attend the trial?  Because even if the judge decide nothing wrong happened, you still get a bill there, or am I missing something?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SuspiciousGrievances",
            "body": "Sorry she had boobs. There was nothing we could do.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Slongo702",
            "body": "Yeah unless they were a close friend or family I wouldn't touch em.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "InSight89",
            "body": "I can totally understand the reason behind this. When men are constantly labelled as perverts, sexual deviants, paedophiles, and whatever other negative label then how else do you expect those men to react when faced in a situation where such labels can be slapped on them?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "CherryBomb214",
            "body": "Dear fellas...please CPR me if I need it. Honestly I don't even care if you're a perv and grope me in the process.  Just like...don't let me die.  Thanks in advance.  I promise to not MeToo you.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SquirtinMemeMouthPlz",
                    "body": "I got you. You can even sue me later. I'll win.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AdLive9906",
                            "body": "you got downvoted for wanting to do CPR on a woman. Shame on you!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "red_olympus_mons",
            "body": "Probably balanced out by people who like 'inappropriate touching'",
            "score": 1
        },
        {
            "depth": 0,
            "author": "muchnamemanywow",
            "body": "There have been cases of women sued men who performed CPR or exposed their skin in order to use an AED, so it's sadly a valid concern\n\nIf it's a stranger, you never know what kind of psycho you're dealing with, nor if you have the law on your side",
            "score": 1
        },
        {
            "depth": 0,
            "author": "No-Needleworker-1388",
            "body": "Another brilliant example of liberalism ideology eating its own head.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "HarbingerDe",
                    "body": "Lol you think this is a problem of liberalism?\n\nMike Pence, king of the Christian conservatives, won't even stand in the same room as a woman if they're alone.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lesdeth",
            "body": "I am sorry, but I would not assist a woman in these situations either. I do not want to go to prison for helping.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "sunofnothing_",
            "body": "if the first thing you think of is how it might be inappropriate, I think you may be the problem.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "seniorscrolls",
                    "body": "No the problem is years of school telling boys they are monsters and will harm women, now men are afraid to interact with women. At least, the good men are. Which is why I see so many stories about shitty men flirting with women and women acting like that's the norm. That's the norm set by women who went way too far with femsplaining to men that we are abominations that must be controlled because we have no self control.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sunofnothing_",
                            "body": "teaching consent isn't a bad thing,   Jesus Christ, you're mixed up.",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "seniorscrolls",
                                    "body": "Of course but not to the degree it brainwashed a generation into seeing nothing but terror when they see a woman. Made a whole generation of men who are so afraid of women they'd let one die in front of them if it means they don't have their entire life ruined. Hard to say where the line of consent even stands at this point so men don't even bother, the only men still trying to talk to women are the shitty ones who don't care about consequences.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sunofnothing_",
                                            "body": "now you're just making shit up.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "seniorscrolls",
                                                    "body": "Nope that's general consensus 👍 any guy I talk to is afraid of women, luckily we all have girlfriends now so we don't have to worry much anymore about anything. Girlfriend thinks it's wrong I wouldn't assist a dying woman in public, but completely understands considering the atmosphere of hate directed towards men today that actually puts us in legal jeopardy for ever doing the right thing regardless of what it is.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "sunofnothing_",
                                                            "body": "it doesn't put you in legal jeopardy, and perpetuating this idea that you should be afraid of women is the problem.   coward.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "seniorscrolls",
                                                                    "body": "I mean it's pretty good advice to tell men to stay away from women until the laws are reasonable, I'm sure a lot of women see how unfair the laws really are. Call me a coward if you want, still doesn't change ether fact that as time goes on men are moving further away from women because they are afraid to get in trouble just for looking the wrong way. We are the victims now of oppression this is what oppression looks like, fear and cowardice.",
                                                                    "score": 3
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "sex4xmr",
                                    "body": "A person who need CPR cant give consent so yeah. Im not helping bc again: testching consent, which is a good thing, showed me that i need it to touch someone's body. So no CPR for u.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "sex4xmr",
                                    "body": "A person who need CPR cant give consent so yeah. Im not helping bc again: testching consent, which is a good thing, showed me that i need it to touch someone's body. So no CPR for u.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Oldamog",
            "body": "I'll let a mother fucker die before getting sued for trying to help /s",
            "score": 0
        },
        {
            "depth": 0,
            "author": "deadlysunshade",
            "body": "Damn, people really HATE women.",
            "score": -12,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "deadlysunshade",
                            "body": "Nah, this is literally a gender bias against women that could get them killed.",
                            "score": -15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lizard-_-Queen",
                                            "body": "Just admit that you hate women dude.",
                                            "score": 0
                                        },
                                        {
                                            "depth": 4,
                                            "author": "deadlysunshade",
                                            "body": "That’s what happens when men decide to socially punish women out of paranoia.",
                                            "score": -16,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ProEugenics",
                                                    "body": "Sounds like exactly what women have been doing to all men because of very, very tiny minority of men rape.\n\nSo turnabout isn't fair play, anymore? I thought equality was the name of the game, but it seems like you just want the best of both worlds, to have your cake and eat it too.\n\nEDIT in response to traditional peach, because they're one of those types that likes to say something stupid and then press block so that they don't have to see an answer:\n\nIt's almost like we're talking about the propensity of people to lie about such stories, and why men are refusing more and more to interact with women more than is absolutely necessary as a result. Weird.\n\nEDIT 2: they say they didn't block me, yet I can't respond directly, so they're either lying, or Reddit is just being trash. Either way, they're still wrong, lol.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Traditional_Peach_29",
                                                            "body": "Yeah, of course women are just going to lie to each other about being assaulted. What’s up with you lol",
                                                            "score": 2
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Traditional_Peach_29",
                                                            "body": "“Very, very tiny minority of men rape” yet nearly all women have a story of being raped or sexually assaulted. Weird",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Feed_Bunnies",
                                                                    "body": "That's the biggest load of shit.",
                                                                    "score": 6
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Traditional_Peach_29",
                                                            "body": "Didn’t block you though?",
                                                            "score": -1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bluebabyblankie",
                                                            "body": "misandry isn't real",
                                                            "score": -8,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "You sound like a right-winged moron that claims racism isn't real.",
                                                                    "score": 2
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "It is, you just proved it.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Traditional_Peach_29",
                                                                            "body": "Saying that misandry is real because a woman was mean to you under a post saying that women are less likely to receive CPR is wild",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "I didn’t say it was real because someone was mean to me, I said that claiming it doesn’t exist is misandry because you are dismissing problems that men face as non-existent, therefore you are being misandrist. I would be interested to know what your reasoning is about why misandry doesn’t exist, because there are many things that happen every day, such as the dismissal of men’s issues due to their perceived privilege like you just did, which are the textbook definition of misandry. Also, what makes you say the person I responded to is a woman?",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "bluebabyblankie",
                                                                            "body": "seethe",
                                                                            "score": -3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "Thanks for proving my point yet again.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Traditional_Peach_29",
                    "body": "I’m actually so disturbed reading these comments",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "ConsiderationNew6295",
            "body": "Sounds like bs, everyone is taught Good Samaritan rule in cpr class. Women just don’t matter as much in people’s unconscious minds.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "S0urH4ze",
                    "body": "People aren't really concerned about that though. It's the social implications, once you're accused of being a rapist or a pervert or whatever it's almost impossible to come back from that and it ruins people's lives.\n\n\nIt requires no jury conviction no lawyers and no judge.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "themangastand",
            "body": "Ummm do people really give a shit about this in a life and death situation lol. Oh she's dying. But I might cop a feel so I guess I'll just let her die",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "ProEugenics",
                    "body": "You say \"life and death situation\" like that matters in the exact same manner, to everyone, across the board.\n\nIt isn't a life and death situation to me, it is to the person on the ground. In a world full of accusations, and the court of public opinion being more powerful than ever, at that point I have everything to lose, and pretty much nothing to gain, especially because I don't really care about the whole \"5 minutes of fame on the local news\" thing.\n\nAdd in some basic utilitarian views, and one person dying out of a billion on the planet is absolutely not a loss. There is no logical reason for me to throw my entire reputation and life, potentially, out the window to save one person that doesn't make a difference in the grand scheme of things.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "themangastand",
                            "body": "I think your just a dick",
                            "score": -5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ProEugenics",
                                    "body": "I think that's not an argument.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "themangastand",
                                            "body": "No it's not. It's a fact.\n\nThough maybe not a dick. To paralyzed by imaginary ideas and fear that you can't act. \n\nI recommend going to the gym for that. Really will clear your head and decrease your anxiety levels.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ProEugenics",
                                                    "body": "I go to the gym all the time, that's why I can take care of myself, maybe that person on the ground should try that.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "themangastand",
                                                            "body": "Okay then why are you scared of being prosecuted from helping someone? You must be self aware enough to be aware that is illogical. Where does the anxiety come from?",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ProEugenics",
                                                                    "body": "If it can happen, it can happen to you. And it CAN happen, again, the reality of women who lie when accusing men is well past proven. Plenty of court cases that are easily looked up.\n\nToo many people work too hard to risk everything they've earned on one individual. It may be ruthless calculus, but one person potentially dying on a planet of 8 billion is not much of a loss, and it's a potentiality that I'm willing to risk in place of risking my own personal successes. Working years to build my own desires, and all of that can be torn away in a short amount of time by a liar.\n\nEven when false accusations are proven wrong, many men never recover, and again, this has been widely discussed already. Once a reputation has been ruined on that level, it is insanely difficult to return, because no one wants to hear your defenses when they already heard the initial accusation. How much worse would it be if the accusation was, not only that you sexually assaulted somebody, but you took the opportunity of them being medically disabled at the time to do so? That is fucking heinous, and someone's life would essentially be over already.\n\nIs there a very small chance of this happening? Absolutely. But the consequences are dire enough that it really doesn't really matter.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "themangastand",
                                                                            "body": "But there is a good Samaritan act. No one has ever won a case. It's not only just a small chance. It's never happened. So your worried about something that's never happened\n\nAnd also dude you aren't famous. When you aren't famous you do recover from false acquisitions because literally no one knows you or cares. It's also really uncommon to have a false accusations when your not famous.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ProEugenics",
                                                                                    "body": "You don't need to be famous to be screwed locally, how ignorant do you have to be? You are terminally online, and therefore incapable of thinking of real world consequences, how telling.\n\nCourts change, history does not guarantee the future...better to maintain safe habits from the get-go, then to get into poor habits that can get you in trouble down the line.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "themangastand",
                                                                                            "body": "Can you name me a single case or know a single person that this has happened to?",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "ProEugenics",
                                                                                                    "body": "Literally the first page of google has at least 3 cases, and one mention of being able to be sued because delivering help to a minor requires their parental consent, which is hilarious considering the possibility that the minor may be dying while not around their parents.\n\n\"Sometimes it’s not clear whether the victim is able to give consent—they seem both delusional and lucid at different times. In these circumstances, the rescuer has to make a judgment call. This might leave the open to charges later...\" is a fun bit in the CPR certified blog.\n\nI. Will. Pass.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "themangastand",
                                                                                                            "body": "All I see on Google is how it's completely safe. Can I have a link. Clearly no one's social standings are being hurt if I have I can't find these things.\n\n\nI see a couple about some suicide attempts try to sue. Unsuccessfully.\n\n\nAnother case I'm reading the person tried to sue. But then you get into it and it's because they couldn't afford the medical bills so more an issue with America's health care system. Can't find a single one where anyone's social standing gets harmed or were successful.  Maybe if you provide me with links I'll be able to read the articles.\n\nRemember a lawsuit can be started for any reason. We can be walking down the street and I can sue you for a plethora of reasons. Doesn't mean Ill win. From Google their has never been a successful lawsuit.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Xenatona",
                                    "body": "*You're* \n\nIf you're going to insult someone, at least sound intelligent.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Zeal514",
                    "body": "Yes.  Why risk the potential sexual misconduct charge, when the consequences are dolled out in a guilty upon claim scenario.  People do like to help others, but the need to not have a social death is greater than the need to help others.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "themangastand",
                            "body": "What social life? You think people give a fuck. You think your close friends are going to disown you because you tried to save someone life lol because you touched some booby lol?\n\nGet the fuck off the Internet and go touch grass for a bit. There is no way you have real friends, or your friends are wack.\n\nEven if this was true Who the fuck cares about social death when someones life is at stake.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Zeal514",
                                    "body": ">What social life? You think people give a fuck.\n\nHuman beings are incredibly social animals... \n\n>You think your close friends are going to disown you because you tried to save someone life lol because you touched some booby lol?\n\nMaybe, maybe not.  But the risk is still present.  The difficulty getting a job, the per-requisite of filing where you move, not being within x amount of feet of a school building.  Getting the sex offender stigma attached to you is incredibly damaging for a plethora of reasons.  While it is understandable, its also incredibly horrifying if you are wrongfully accused. \n\n>Even if this was true Who the fuck cares about social death when someones life is at stake\n\nSocial death in humans tends to generate despair, anxiety, depression, etc.  Being a social recluse has a stigma attached to it for a reason, and it is not good.\n\n&#x200B;\n\nYou seem like the naive type, potentially young or at least immature.  Someone who hasn't experienced life, and stands on moral high ground without ever having tested your own moral fortitude.  You can't be considered brave unless you've actually overcome your fears.  Just like you can't be considered moral if you haven't had your morals tested.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "themangastand",
                                            "body": "No I'm old. It has nothing to do with morals. Doing CPR ain't that hard or inconvenient. Totally self centered. I'd do CPR on others because I expect others to do the same if I'm in that situation. \n\nI don't consider that brave or moral. I don't really believe in morals. I just do what I want I want to do. I just can't believe people are so stuck in their imagination that they get paralyzed by it.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Zeal514",
                                                    "body": ">I don't consider that brave or moral. I don't really believe in morals\n\nMorals are simply rules in which you live your life by.  Bravery is simply the ability to overcome ones own fears.  If someone is realizes a risk, and is afraid of taking said risk they have perceived, and then faces it head on and does it anyway, that is brave, whether or not you believe it or not.\n\n>I just do what I want I want to do.\n\nSo that is your moral code.  You essentially don't empathize with others, and you look out for what you want, and not what others want. \n\n>I just can't believe people are so stuck in their imagination that they get paralyzed by it.\n\nWe are all in our imaginations lol.  It is actually impossible to perceive everything, its your brain that is filling in the blanks all of the time.  For instance, did you know your peripheral vision is actually in black and white?  The reason people don't realize this is because our brain straight up fills in the missing information with what ever it imagines, which turns out tends to be pretty accurate.  When ppl take hallucinogens you are actually playing with that aspect of human perception, and forming new neural pathways, which is whyt there is a following for ppl to experiment with them to see things in a different light and even help deal with things like depression and anxiety.   You can actually see a great example of it with brain tricks, optical illusions, etc.  Like [this.](https://www.youtube.com/shorts/cIWyID6osmE)",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "themangastand",
                                                            "body": "Theres difference between being in your imagination and utilizing it to act. And being paralyzed by your imagination \n\nOf course we have an imagination. Idk what you had to say had anything to do with what I said",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Zeal514",
                                                                    "body": ">Theres difference between being in your imagination and utilizing it to act. And being paralyzed by your imagination\n\nWell obviously there is a difference.  We all, whether we want to or not utilize our imaginations to act, it's literally impossible to not, you'd be paralyzed with fear or you'd have to lack the ability to be self aware.  This ability can absolutely paralyze you though and that is different.  But its the same phenomenon that is being utilized in both situations.  We can be wrong about how we percieve the world.  Yes, even you can be wrong.\n\n&#x200B;\n\n>Of course we have an imagination. Idk what you had to say had anything to do with what I said\n\nWhen you enter a grocery store, how do you know everyone wont kill you?  When you drive your car, how do you know all the nuts and bolts are assembled correctly to the right torque?  You don't, you make this assumption, based on your life experiences, you are imagining that it should be safe.  Well, we do the same thing in reverse.  From some's perspective, thats a risk that they arent willing to make.  Who's right?  who's wrong?  well, thats not for me or you to judge.  That'll be evolution, or God's place whatever you believe.",
                                                                    "score": 0
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Extra-Cheesecake-345",
                    "body": "Yes, you would be amazed at some people and their WTF stuff they do with lawsuits. Some people are just looking for money, other attention, and some well their entire personality is being the victim. Of course you also have the sick fucks who would do this to a person \"hey she's dying, this is a chance for me to cop a feel\".",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Thanks for the boy math comments made me laugh.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -19
        },
        {
            "depth": 0,
            "author": "Longjumping_Tale_111",
            "body": "Thankfully CPR is worthless. It increases survival rate by 2% which is basically a statistical anomoly",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Feed_Bunnies",
                    "body": "2% is important when you have kids at home and people depending on you.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Southern-Comb-650",
            "body": "Now THAT is a serious consequence to all the bullshit thats been allowed to percolate. So now you women you'd better hope you are in female company if you need CPR.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "ghostdeinithegreat",
            "body": ">[…]found bystanders gave CPR to more men (68 per cent) than women (61 per cent).\n\nThat’s not that wide of a gap.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Potential-Drama-7455",
            "body": "I actually think it's more to do with the perception of women not having a heart attack than the touching thing. Apart from very religious societies with taboos against such stuff",
            "score": -36,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Women can have heart attacks. You should probably know that.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Berserkerzoro",
                            "body": "Sorry women don't have a heart/s",
                            "score": 9
                        },
                        {
                            "depth": 2,
                            "author": "Quick_Interview_1279",
                            "body": "Yes, he knows that and that's why he used the term \"perception\"",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "Still sounds ignorant.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Quick_Interview_1279",
                                            "body": "That's on you.  \n\nMaybe this can help you understand better why there are problems with the perception of heart attacks in women. \n https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(19)30510-0/fulltext\n\nMaybe after reading it you won't be as ignorant.  The beauty of ignorance is that intelligent people can overcome it by learning.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cyanide-ky",
                    "body": "It doesn’t have to be a heart attack tho could be stroke, diabetic shock or a bunch of other things that caused the cardiac arrest.\n\nThere are few things worse than being accused of sexually assaulting some one your trying to help especially when exposing the chest is a part of first aid especially if your using an IED.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "aminicuspondicus",
            "body": "Well... the cases OP added seems awful but on the other hand: people with no medical training love to interfere with some kinda hero complex. They watch in movies, thinking it is the right way, and they might cause more harm than good. So in a way.... I am fine with this",
            "score": -35,
            "replies": [
                {
                    "depth": 1,
                    "author": "BaronOfTheVoid",
                    "body": "> people with no medical training love to interfere with some kinda hero complex.\n\nNo. Nobody interferes _at all_. Really, 99% of people are _much_ more likely to watch someone die than getting involved with it.\n\nThis has been my experience when someone had an accident or something in public.",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Extra-Cheesecake-345",
                            "body": "Yup, there was actually a famous case where a women was stabbed to death in front of a entire apartment complex worth of people. No one called 911 as she was screaming for help, or went down to help her, cause they all thought someone else was...",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "aminicuspondicus",
                            "body": "My experience was to stop someone from giving compressions to someone who was actively vomiting....",
                            "score": -7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "X02378",
                    "body": "1 in 5 people are CPR certified.  This means that when CPR is needed, most of the time there is someone available nearby that is CPR certified.",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aminicuspondicus",
                            "body": "I only commented towards my own experience. I do not live in that side of the world so that is not true for me",
                            "score": -15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "longarmsweakhands",
                                    "body": "So as a woman your preference is to die from cardiac arrest vs have someone at least try to save your life even if they are just trying their best to administer CPR?\n\nIf my hearts not beating idc if the only person there isn’t cpr certified, my boobs are worthless to me if im dead. Give it a shot.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Extra-Cheesecake-345",
                            "body": "Even then, if no one is CPR certified and need it, they are basically dead you aren't making it worse if you do chest compressions incorrectly. Its the same thing with tourniquets, if there is serious bleeding, put it on them the only wrong way is putting it on their neck (also chances are the medics will see it shortly after you put it on and if they know its not needed they will just remove it themselves).",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "goodboysparkle",
            "body": "They are also less likely to get hired for a job that either sex can do.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Free_Mixture_682",
            "body": "I performed CPR on a man who had collapsed. His teen/young adult son was there also. I did the chest compressions and had him do the breaths.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "For good reason",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Lmao!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SkepticSpartan",
            "body": "i'm sure they would not mind being that they are technically dead.   Then again you do have wackos out there.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tony7914",
            "body": "Understandable, the US is lawsuit happy, so much that many states have had to pass good Samaritan laws to protect people who are just trying to help.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "popularTrash76",
            "body": "Those girl bosses can just revive themselves",
            "score": 1
        },
        {
            "depth": 0,
            "author": "blu3ysdad",
            "body": "Seems the biggest thing is to make sure we have good Samaritan laws and consequences for bad faith lawsuits.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "oO_Pompay_Oo",
            "body": "With the state of how things are in the world, I'm totally cool with being left for dead.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aigars2",
            "body": "There was an actual case a man was sued in 2021 if I remember correctly",
            "score": 1
        },
        {
            "depth": 0,
            "author": "seniorscrolls",
            "body": "Can attest to this as the one man in a room full of men that actually jumped in when a woman passed out in public. The other guys were looking at me like they were afraid for me. The patriarchy really fucked up public relations that's for sure.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "seniorscrolls",
                            "body": "Yeah that's also the legal system, you are right to do nothing because if you do you place yourself in legal jeopardy with charges ranging from sexual assault to battery.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sex4xmr",
                                    "body": "And since its law i cant ignore. So i hope the 911 comes fast so i dont have to stand there too much time",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tuckermfker",
            "body": "I've been CPR certified for over a decade, which means I think 5 separate certification classes taught by 3 different instructors (2 male and 1 female instructor). Every single instructor had stories of local men being sued by women whos life they saved. Is it common, probably not but it does happen. I don't believe any of the women who sued were successful, but it still requires time and money to defend yourself in those cases. It's not going to stop me from trying to help a woman who needs it though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ok_Management_8195",
            "body": "So if women speak out against assault, they risk negligent homicide. Damned if you do, damned if you don't...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "JohnnyGFX",
            "body": "I wouldn’t perform CPR on a woman I don’t know well.  I can’t even take my kids to the park without some woman treating me like I’m a creep, I sure as shit am not risking my freedom by performing CPR on them. I’ll call for help, but that’s it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DontJabMe42069",
            "body": "i dont want to kiss a man so i would have to let them both go...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sandleaz",
            "body": "> Women are less likely to receive bystander CPR than men due to fears of 'inappropriate touching' \n\nThis is too risky in the modern era.",
            "score": 1
        }
    ]
}