{
    "title": "Angus Deaton on inequality: ‘The war on poverty has become a war on the poor’",
    "comments": [
        {
            "depth": 0,
            "author": "bluelifesacrifice",
            "body": "I swear the end goal here seems to be just a few wealthy people owning and governing slave nations.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "Neco-Arc-Brunestud",
                    "body": "That is exactly the end goal.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "proverbialbunny",
                    "body": "The end goal is myopic: My friend bragged about lobbying congress to get a leg up and I love to compete so I'm going to do my own lobbying to see if I can outdo them.\n\nTrump showed this behavior directly, talking regularly about how he'd compete with his friends to have the lowest taxes.\n\nWhen you have more money than you know how to spend, men mostly (sorry guys) tend to default to games.  It's a similar mentality to playing video games, but instead it's these kinds of games: competing for higher numbers, less taxes, more lobbying, anything you can do to show off.\n\nThe problem is it's selfish in that it doesn't think about the negative consequences for those actions.  It doesn't think about the harm on thousands or millions of people all just for bragging rights.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bluelifesacrifice",
                            "body": "This is on point though. Guys have this tendency to focus on winning in some way even if it harms everyone else.\n\nWhen winning becomes the goal, nothing else matters.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "proverbialbunny",
                                    "body": "It's a lack of empathy, and it's something that can be addressed easily if people are raised slightly differently in the US.  Other countries do it and get all of the benefit.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "Reminds me of the scenes of the rich guys with John Cleese betting on ridiculous shit in the movie Rat Race.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "proverbialbunny",
                                    "body": "I haven't seen it.  Is the movie any good?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "It's decent, but throughout the movie a group of rich guys are constantly placing bets on ridiculous things like how much a call girl would charge to shave a man's ass in a jacuzzi filled with pepto bismol while wearing sailor hats. \n\nIt's making fun of bored rich people, plus the movie is called \"rat race\" , so I'm pretty sure it's sort of (low brow) commentary on capitalism; hence the name rat race. It's really just a silly movie from the early 2000s with a bunch of comedic actors.\n\nSeemed somewhat relevant to your excellent analysis.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "proverbialbunny",
                                                    "body": "lol!\n\nI love comedy.  Too bad good comedy is nearly dead in the US (though to be fair even good US comedy rarely is as good as comedy other countries pull off).\n\nI'll have to check it out.  \\^_^",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "Makes me think about Sieben Zwerge, a ridiculous German movie parody about Snow White and the 7 Dwarves. Check it out if that sounds interesting.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "proverbialbunny",
                                                                    "body": "Germany and comedy tends to be very SNL + lewd.  Not my thing.  Though German comedy is close to a lot of American comedy if you like that sort of thing.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "[deleted]",
                                                                            "body": "No doubt, its a movie from 2004 when SNL was less awful, but I get the point.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "_DrDigital_",
                    "body": "I recommend \"the wages of humanity\" by Cixin Liu. https://www.goodreads.com/book/show/17935230-the-wages-of-humanity",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "GullibleAntelope",
                    "body": "Not true.  A large body of poor people is a big hassle.  Look at America's low income  black communities.  They have brought all sorts of negative impacts to non-black people: 1) Crime and violence in black  neighborhoods (*bad*) that spills out into other communities (*more bad*); 2) Continued welfare needed   to offset the worst conditions (= higher taxes on everyone); \n\n3) Costly race riots ([George Floyd Riots Caused Record-Setting $2 Billion in Damage](https://fee.org/articles/george-floyd-riots-caused-record-setting-2-billion-in-damage-new-report-says-here-s-why-the-true-cost-is-even-higher/?__cf_chl_jschl_tk__=75129cb36ecfb8881f8607ce48f729052579d92e-1615124793-0-AS0Njv9F3til13cmOAneftp8IdH7ErincaA5Mz-2sjoBA4kJ6ogs2N14H0re1rlLDkiWUGd6Ar6ttiwJlfA1tuCyJMDKmjQRivfFEzm6RWjyvnvuCelkM4GMTNwQwS7Cmyddx9v_3Oh8_bcuB4dRcU8KMIVB-qIvDD7K9voRFv9rwy-Ai6m227bCFoOtedlYcZkpvE171cpfmxWB17zCzb7dWgbBBFME9VII9iq6H-xPER8_H4amnb9yihLDINo6Kt9cJ4E5BwSMLQJRe-OJZOmGNv2K5zLdwJfWA1wIYg1zIlrgyGsxJYqD61JIQN1wzTlPnX1xW5oAlzlaPXNPkxbNsWjJ2E9XPfjK44Cq5RT1Td6RX0gKZht2gLt3IITD3lriF8g0oGEpRCScX6AfqhzApHjmLayPbelV6SI5PsWFl4jRv7ABuyJ9zy6FS_C8cPOVyNaETMWuriYIk1XsAR3nypqukfDO-6RCR-3c50fz&filter_by=popular7&_page=84&fbclid=IwAR1KNV6Cw51moi0SKpnwhMw1Egz4gh1AzPleqC_3-qhavizBzQcR7pU7jqk&ref=hexometer&utm_campaign=targetingUSA&utm_medium=display&utm_source=facebook)) and other social unrest, and 4) Black children in dysfunctional families/communities developing  poor life habits -- meaning more chance the undesirable conditions in those communities will persist.\n\nLeftists persist in coming up with the faulty analysis that  dire poverty benefits  rich elites.  The benefits of paying workers low wages is more than offset by the above.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zephir_AR",
            "body": "[Angus Deaton, Nobel Memorial Laureate, on the state of economics:](https://www.theguardian.com/inequality/2023/oct/07/angus-deaton-interview-book-economics-in-america)\n\n “*The time has come, Deaton argues, for economists to get back to serving society. ‘The discipline has become unmoored from its proper basis, which is the study of human welfare*’”",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "clover_heron",
                    "body": ". . . from a guy who has been an economist at Princeton since the 1980s.\n\nHe's going to say he's advocating for progressive policies when in fact he is distracting from the progressive agenda. Don't buy the BS, peeps.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "proverbialbunny",
            "body": "I think the title is a bit silly, but it is an interesting article.\n\nOne thing I didn't know is:\n\n>Deaton said rightwing politicians and economists fixed the numbers so they could claim, in the words of Ronald Reagan, that in the war on poverty, poverty won. Official income statistics left out welfare payments so those receiving them often appeared to still be living below the poverty line when, by other measures, government assistance demonstrably helped.\n\nI've always wondered about this.  I prefer creativity and socialization over consumption, which means I spend very little.  So because of that despite having plenty of money, I tend to spend below the poverty line out here in Silicon Valley, which is about 57k.\n\nIf I ate out every day of the year at a decent sit down restaurant I would spend 36k, combined with an above median rent of $2000 a month I'd spend 60k a year, I'd be just over the poverty limit.  This seems insane to me.  I can live comfortably, regularly travel to Europe for vacation, eat out, have a decent reliable car, and still be in poverty?  The numbers always seemed off to me.  Apparently out here all those things are not enough to be considered a liveable wage.\n\nNow to be fair, that would be a bit tough with a kid, but the poverty limit is set based on size of household, so 57k is one person.  It goes up for two people, and a kid is a 3rd person, so it goes up higher to account for that.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "clover_heron",
            "body": "Hey hey guys, a British royal title guy who has been working and teaching at Princeton since the 1980s is now on the side of the poor!! For real guys.\n\nHe's seriously concerned about white people dying, especially via what he and Case call [deaths of despair](https://press.princeton.edu/books/hardcover/9780691190785/deaths-of-despair-and-the-future-of-capitalism), i.e. drug and alcohol deaths and suicides. Of course our polluted water and air and food haven't played a role, duh! Or any of that other stuff. We've been CHOOSING to poison OURSELVES!!\n\nAnd you know what else doesn't play a role, because Case and Deaton didn't even think to mention it in their book? Student debt. BOOM. Economists from Princeton know that crushing debt is sort of like, an insignificant detail. Because of course no one who hasn't graduated has student debt, and in fact, college educated people are currently [flourishing.](https://www.nytimes.com/2023/10/03/opinion/life-expectancy-college-degree.html) (\\*\\* please correct me if I'm wrong. I thought I paid careful attention while listening to their book but could've missed something. \\*\\*)\n\nYou can tell Deaton really cares about the poor because he's promoting progressive policies like [this](https://www.nytimes.com/2023/10/03/opinion/life-expectancy-college-degree.html):\n\n>We are encouraged by the efforts of both public and private employers to remedy this; it is a low-cost policy that could have large benefits. For example, Gov. Josh Shapiro of Pennsylvania signed an executive order removing the B.A. requirement for 92 percent of state jobs; similar policies are in place in Utah, Maryland, Colorado, Georgia, South Carolina, Virginia, New Jersey and Alaska.  \n>  \n>Anything that reduces health care costs would help, as would replacing employer-funded health insurance with vouchers paid for by general taxation. Fighting NIMBYism (residents’ “not in my backyard” opposition to local development) and expanding affordable housing in successful cities would increase mobility. Job creation under the Inflation Reduction Act is a move in the right direction. Working people would do better with stronger unions and fewer hostile measures such as right-to-work laws.\n\nDid he say \"vouchers\"? Oh wait . . . is Sir Dr. Deaton from Princeton possibly trying to distract us from ACTUALLY progressive policies, such as universal health care, free (and public?) post-secondary education, stricter water, air, and land protections, undoing the hoarding of real estate by the wealthy, more rigorous food safety standards, jobs guarantees, student debt relief, support for small farmers and action against conglomerate farms, etc. Though it is cool he is advocating for unions . . . but history shows that union gains can be easily undone as needed. Hmmmmmm.\n\n(And a bit of extra fun, the Princeton economists also say that its our [mental distress](https://qz.com/583595/deaths-of-despair-are-killing-americas-white-working-class) that caused some of us to support Bernie Sanders, rather than any sincere and rational belief in the need for collective action. Quick, someone get us help.)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "kateinoly",
            "body": "Great article.  I've been thinking about this a lot, since so many \"economists\" on Reddit think the whole system is impartial and magical.   My favorite bit:\n\n*A friend of mine, a conservative economist and deeply religious man, is fond of saying that ‘fair’ is a four-letter word that should be expunged from economics*.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "quisp1965",
            "body": "Inequality is heavily determined by differences in innate abilities between people which are taboo to discuss.  I welcome analysis into looking at inequality but our society won't allow it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Scalymeateater",
            "body": "just like every other war, war on poverty created a cottage industry whose only interest is promoting and maintaining the said condition for profit purposes.",
            "score": 1
        }
    ]
}