{
    "title": "WAYWT - May 22, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "RLS1822",
            "body": "I Mc’d a Scholarship Gala which was a White and Gold Kentucky Derby styled  theme.\n\nHat:  not sure Dress Terri Jon Shoes:  Sam Edelman Bag: Christian Dior\n\nhttps://preview.redd.it/ry8jiymog02d1.jpeg?width=3024&format=pjpg&auto=webp&s=b79dc0aed4faeb3c569594edba3910e5ecf383c2",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Literally so perfect for that theme",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RLS1822",
                            "body": "Awww thanks!  It was a fun little affair!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Omg everything about this fit is amazing 🤩",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "oat-beatle",
            "body": "[Album](https://imgur.com/a/gF8j0UX)\n\n29 / Eastern Ontario / work is business casual\n\n1 - dress over pants bc this dress is too short for work but super business coded\n\n2 - ngl full spite on the denim maxi hater comments that are incessant here\n\n3 - casual summer fit since it is now 30 degrees daily\n\n4 - basic work look trying to deal with 30 outside / ac inside as usual this time of year",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "mini-mal-ly",
                    "body": "Loooove your style! I vibe a lot with the colorblocky-ness of your looks and with the silhouettes. 😍\n\n\nDenim maxi looks hella cute. I think dark wash and long slit do a lot to move it away from Christian Girl Summer.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oat-beatle",
                            "body": "Thanks!\n\nI think a lot of Americans do not realize ppl worldwide don't have the same religious connotations as their evangelicals lol",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mini-mal-ly",
                                    "body": "Haha I think the associations are just so deeply ingrained that it becomes largely illogical. Now I'm curious about clothing/style associations ex-USA that we wouldn't have.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "engshowcase",
                    "body": "I love the dress over the pants!  Denim skirt is awesome too.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oat-beatle",
                            "body": "Thanks!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "Always love your fits!\n\nWhere are your silver shoes from? Love them! ",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oat-beatle",
                            "body": "Thanks!\n\nThey are a Dream Pairs Amazon special lol",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DarkEdgeoftheSea",
            "body": "https://imgur.com/a/07tQWRh\n\n\n1. Date Night\n2. Just chillin at home\n3. Brunch with the family\n4. Errands\n\n\nCCW ",
            "score": 12
        },
        {
            "depth": 0,
            "author": "bubblegumdavid",
            "body": "https://preview.redd.it/q1v3waa0702d1.jpeg?width=1971&format=pjpg&auto=webp&s=2bfe3dcb2d2faf6210eabaae5fa15e0bfbf14051\n\nWork for today: 28, Northern NJ, working in fundraising\n\nPlease excuse the computer parts mess behind me. Lee jeans, tagless shell, satin scarf from Nordstrom, Vionic sandals",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "bubblegumdavid",
                    "body": "https://preview.redd.it/y43sd4ue702d1.jpeg?width=1954&format=pjpg&auto=webp&s=e1d32a130271b7c98e22b9653b03f8dffa920669\n\nYesterday: anniversary dinner\n\nOld club Monaco dress, Steve Madden heels, LV Graceful\n\nAgain, please excuse computer parts mess, building a pc was a whole thing",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Haha who cares about the computer stuff, I’m too busy looking at your dog!\n\nYou look great in white, and your outfits have a really effortless/chic vibe! The jeans would look great with a little braided belt in tan to tie it to the scarf/shoes, if you wanted to add something extra.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bubblegumdavid",
                            "body": "Ugh I so agree! But the dog in the picture is the primary suspect in the ongoing case of the missing belts actually right now\n\nI suspect he’s hiding my belt someplace because he wants to play tug of war real bad and he destroyed his rope and we’ve not replaced it yet.\n\nIf you like your clothes and sanity, don’t get smart dogs, they’re petty and my home is a hotbed of psychological warfare. \n\nThank you though!! Spring and summer are kind of becoming my favorite for outfits these days!",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fir6987",
                                    "body": "Haha oh no!! I hope you find your belts soon! \n\nI have a smart dog but fortunately the only damage she’s done to my wardrobe was chewing the hell out of a leather watch band (she’s done plenty of other physical and emotional damage tho). She’s 14 now and sleeps all the time, which has been very nice for my sanity.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bubblegumdavid",
                                            "body": "Ahhh that sounds like peace \n\nYeah one of ours is 10 and she used to be hellish, and then we had a bigger yard and thought “oh why not!”\n\nThis be why not omg",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RLS1822",
                    "body": "Yass!!  I love the creative chic you are bringing.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bubblegumdavid",
                            "body": "Awww thank you!",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RLS1822",
                                    "body": "I know this is giving serious granny vibes.  But I mc’d our annual Scholarship Gala that was a White and Gold Kentucky Derby themed event.\n\nDress: Terri Jon Hat: Not Sure Shoes: Sam Edelman Purse: Dior\n\nhttps://preview.redd.it/mu2rj9hwh12d1.jpeg?width=3024&format=pjpg&auto=webp&s=c9c67a4d8d25baa6801ce01ae8465693783e8b54",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bubblegumdavid",
                                            "body": "I looooove this! That hat is phenomenal!\n\nI just booked my org’s gala mc last week and I hope she comes as on theme as you did for yours omg!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "engshowcase",
            "body": "Work outfit for today.\n\nhttps://preview.redd.it/ezfh0fg4mz1d1.jpeg?width=1198&format=pjpg&auto=webp&s=e120cea9b9eb8ae6dd07a83c799773857351be47\n\nI thrifted this Banana Republic dress this winter and lost some weight so it was too big by this time of year, but I’m so glad I spent the money to get it altered.  I love it so much.",
            "score": 3
        }
    ]
}