{
    "title": "Favorite summer pants? ",
    "comments": [
        {
            "depth": 0,
            "author": "ama_da_sama",
            "body": "I like linen pants, but I don't know how to style them so they don't look like pajama bottoms (lol). Paperbag lycocel pants or structured utility shorts are my go to on truly miserable days.",
            "score": 115,
            "replies": [
                {
                    "depth": 1,
                    "author": "local_fartist",
                    "body": "Linen pants with darts or pleats look a lot more professional than ones with elastic or a drawstring if you’re trying to go less casual.",
                    "score": 39
                },
                {
                    "depth": 1,
                    "author": "ladolceLolita",
                    "body": "I love linen anything and especially pants. However, I've had issues with bagging in the butt toward the end of the day or day 2-3. I do believe lined linen pants don't do this, but I'm having a tough time finding decent ones. Any thoughts on lined vs unlined or suggestions for specific brands?",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "biggerthanasquirrel",
                    "body": "I like wearing linen pants with button ups or obviously nicer blouses/shoes to avoid them looking like pajama bottoms. Or going fully beach-casual with a straw bag and flip flops.",
                    "score": 29
                },
                {
                    "depth": 1,
                    "author": "Minimalgoth",
                    "body": "Linen pants with a boxy linen tank is my summer go-to when it comes to pants wearing. I'm in dresses 98% of the time in the summer.\n\nJust make sure the top hits right at the top of the waistband for a clean line look.",
                    "score": 20
                },
                {
                    "depth": 1,
                    "author": "Sincerely_Me_Xo",
                    "body": "Fitted T-shirt tucked in with sandals is what I do.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "I had the same problem. But looking at these comments it seems I have some good ideas for wearing them in the future",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "blahblooblahblah",
                            "body": "Uniqlo has linen pants this season with a button and fly front! They’re great.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PaulaLoomisArt",
                                    "body": "Do they keep their shape all day?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hikedip",
                    "body": "I've been doing body suits with elastic-waisted linen pants and it's a cute combo. It's not my usual style, but I've gotten lots of compliments",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "bm1992",
            "body": "I love linen pants from old navy! I wear them with a fitted top and wedges to look cute, or with a tank top and sandals to look casual!",
            "score": 41
        },
        {
            "depth": 0,
            "author": "cenimsaj",
            "body": "Curator SF Cadence pants... and I was very sad to see that I can't find them on their website right now. But I think they were one of their most popular styles, and they DO make stuff in small batches that sell out fast, so they may be back. I've just never seen them completely gone in every color and size. Anyway, I'm posting despite that because they truly are awesome, they can be found secondhand, and you can always sign up for emails to get new stock alerts if you really happen to like them. \n\n[Here's a link](https://curatorsf.treet.co/l/6538471c-c90a-466c-8549-19531a6f8d4d) with some original model photos. It's not exactly a unique style, so I'm sure you can also find similar elsewhere. They're super flattering and incredibly comfortable. The fabric on these in particular is breathable, but substantial enough to move nicely and not really wrinkle. I basically lived in the black ones last summer and wore the rust-colored ones around once a week also. The black are also on my go-to packing list for travel, depending on weather.",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "artfartspaulblart",
                    "body": "They're barrel style legs if that helps. Although barrel pants will turn up a lot of variation in width (wide to skinny) and curvature of the barrel leg itself.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "These look great! Very comfy. I’ll check if I can find these elsewhere",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "stellalunawitchbaby",
            "body": "Every year I buy a few of these cotton sets from Z Supply: https://zsupplyclothing.com/products/scout-cotton-jersey-pant-1?variant=42879564218468\n\nThey’re wonderful, breezy, comfortable, and wash well. And while they go well with basic Ts and tanks, I love them with their matching tanks. They’re like my summer uniform.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "notoriousJEN82",
                    "body": "If only they made them in regular length instead of cropped...",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stellalunawitchbaby",
                            "body": "Despite the inseam they’re not all that cropped on me actually (im 5’8”) though I’ll say that for whatever reason the black ones are longer than the white ones. I typically wear them mid rise though so maybe that helps me out!",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "I love the entire outfit that pops up in this link I’ll check out their website. Thanks",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "SpiceGirls4Everr",
                    "body": "these look awesome and like they'd not bag out like linen pants",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "daddy_tywin",
                    "body": "I have these on right now. I love them but the tops run a full size small IME and at 5’3 they are quite cropped for me. Super soft though and wash really well, total weekend uniform with suede birks.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stellalunawitchbaby",
                            "body": "That’s so interesting - When did you get yours? I buy a S in the tops and bottoms for each set and for me they fit fine *but* I have a small chest. I’m wearing the light blue ones (S) right now from last year and they’re full length on me - I do not *ever* wear them above the belly button it looks weird on me, I know that’s how they wear them on the site.\n\n(I’m wondering if they have gotten more cropped bc when I first bought them they weren’t even described as cropped on the site - but my white ones which were my most recently purchased are by far the most cropped)*",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "daddy_tywin",
                                    "body": "I got black last year and the khaki color this year, and yeah I totally feel like this year’s pair is shorter. However, I wear mine high rise like they show online so that’s probably why they feel more cropped to me even though I’m way shorter. \n\nPersonally the S tops pulled for me across the chest (I do have bigger boobs), which is weird because I am a small literally everywhere else I shop, and in my ZSupply Sirena tank top I had to go down to an XS. Their sizing is just a tiny bit weird imo but it’s cute stuff so whatever!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "stellalunawitchbaby",
                                            "body": "For sure, yeah I can see how it would pull with the kind of restrictive neckline! \n\nIf you end up looking for another one, the light blue pants (they call them faux denim but they’re literally thinner than all the other cotton ones lol) run the longest on me *and* their tank is the least restrictive. I usually get mine in person and I kind of wanted the sage green set they have this year but I’m def gonna try it on if they’ve been getting more and more cropped!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ornery-Possession-03",
                    "body": "Do the lighter colors show dimpling/cellulite at all?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stellalunawitchbaby",
                            "body": "Honestly I’m not sure, though I’d guess it just depends how they fit on someone - on me they’re allflowy and loose though, they don’t cling to my legs or butt or anything whatsoever. The lighter colors I have are the cream/off white and the light blue, the cream is pretty thick and the light blue is much thinner. I think if someone was a lot curvier than me they could fit differently, I’d be tighter around the butt for example, but on me they just hang down.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "KarlaIrina",
            "body": "https://preview.redd.it/fayzlbx8mz1d1.jpeg?width=950&format=pjpg&auto=webp&s=fcf4487a3ed2b5f14a2cb7b8ea23783f826c46e4\n\nBesides wearing short trousers made of natural fabrics those are my 4 essential long trousers:\n\n1. A beautiful 100% cotton trousers. Compared to other natural fabrics, cotton is the cheapest option but still very breathable (Stefanel)\n2. Linen is the go-to choice for summer. The only downside is it will wrinkle as soon as you sit on it. But every linen piece I ever owned held together very well (Stefanel)\n3. I know those are jeans but sometimes I need something that’s not as delicate as the other 3 ones. A lighter color will be better for light reflection\n4. This is by far my favorite. Being made of silk you will forget you are wearing something. But out of all of those you need to be super careful with silk trousers (Maliparmi)\n\nIn general, I would try to buy something lighter colored and something with a loose fit, because the air circulation is improved a lot by this",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "These are so pretty, great for a beach day too",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "PashasMom",
            "body": "Old Navy high waisted linen pants. I have them in 4 colors!",
            "score": 12
        },
        {
            "depth": 0,
            "author": "unitedarrows",
            "body": "Very light coton pants from  men's collection, and pants in coton ripstop. Wide legs and high rise for confort. Big pockets to carry keys, cards, handkerchiefs and phone without needing a jacket. Long legs for protection from sun, cold AC and mosquitos.\n\nBrands: Lemaire and Eat Dust. Not cheap unfortunatly, but can be found second hand. I am sure cheaper equivalents exists somewhere. The more important factor is fabric and a roomy design",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "Love that. Wide leg, high rise is my go to for pants in general",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "plaisirdamour",
            "body": "I like linen pants but make sure they’re a good quality - I’ve had chub rub create holes 😅😅",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "SpiceGirls4Everr",
                    "body": "LOL I have this problem!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "plaisirdamour",
                            "body": "Omg one time it happened to me at work and I wanted to die lollll luckily my coworker had some leggings stashed in her desk ahaha",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SpiceGirls4Everr",
                                    "body": "My pair from last summer are getting pretty thin....living on the edge...lol!",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SilverProduce0",
            "body": "Extra High-Waisted Linen-Blend Wide-Leg Taylor Pants\n\nhttps://oldnavy.gap.com/browse/product.do?pid=857488002\n\n\nI got them in navy and wore them yesterday. They were really comfortable. I just need better shoes!",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "artfartspaulblart",
                    "body": "The lavender ones 😍",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "Looks great!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "olivestripes",
            "body": "On this note, any white linen pants that aren’t see through? Old navy and HM ones seem to be see through",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "blahblooblahblah",
                    "body": "Get a pair of the Thigh Society 21” cooling shorts (capris?) to wear underneath!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "good-luck",
            "body": "I have the Harlow Pants by Madewell in linen.  LOVE THEM.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "awholedamngarden",
                    "body": "Same… I bought 3 colors lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "biggerthanasquirrel",
            "body": "Uniqlo always has a ton of thin (but not see-through) [cotton pants](https://www.uniqlo.com/us/en/products/E466026-000/00?colorDisplayCode=56&sizeDisplayCode=004) and trousers. Preferably something on the looser side for the legs. I usually go for their light green or khaki color pants instead of navy or other dark heat absorbing colors. Asian brands in general do a good job of having breezy clothing bc it gets so hot in humid in East Asia.\n\nBTW they are having some sort of anniversary sale starting this weekend so if you find some to try, buy later in the week.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "Thanks for the heads up on the sale. Good point about the colors too! I was going to go for Navy probably but that’s a good point",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "ManonIsTheField",
            "body": "I've been living in Oh My Gauze pants on the warmer days and I love them",
            "score": 8
        },
        {
            "depth": 0,
            "author": "earz4dayz",
            "body": "I live in 100-115F summers, and I love big baggy pants. I have a few in linen (thx Old Navy!), 2 pair of white AE baggy mom jeans, and an AE 90s wide leg with big big holes in the front. I also have a pair of buddha pants harem pants, and the summer weight cotton is just dreamy. They're more for at home, because harem pants lol, but they're super comfy. \n\nI'm not a big leggings fan to start with, but when it's hot, I want air flow, and leggings are the opposite of that.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "True. I wore leggings the other day in 85F and wasn’t quite happy with my choice",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "grill-tastic",
            "body": "I have some slacks from lululemon that I love!! I’d check them and athleta out for athletic materials in more structured/dressy shapes.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "Could you link any of the particular ones you liked? I’ve been looking at Lululemon too but I don’t want anything too form fitting for this weather",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "grill-tastic",
                            "body": "Yes!\n\nMore formal, I got these resale:\n\nhttps://www.lulufanatics.com/item/56739/lululemon-your-true-trouser-high-rise-pant-black\n\nhttps://www.lulufanatics.com/item/41217/lululemon-on-the-move-pant-28-black\n\nMore casual, still available directly from Lulu:\n\nhttps://shop.lululemon.com/p/womens-sweatpants/Adapted-State-Jogger/_/prod10190128?color=0001\n\nhttps://shop.lululemon.com/p/women-pants/Dance-Studio-Pant-MR-Reg/_/prod11530198?color=30210 (I have these in several colors, and you can find older pairs resale/thrifting pretty easily)\n\nI don’t personally own but they look comfy:\n\nhttps://shop.lululemon.com/p/women-pants/Smooth-Fit-Pull-On-High-Rise-Pants/_/prod11380447?color=0001\n\nhttps://shop.lululemon.com/p/women-pants/Stretch-Woven-Wide-Leg-HR-Pants-MD/_/prod11510280?color=64820\n\nhttps://shop.lululemon.com/p/women-pants/City-Sleek-5P-WL-HR-Pant-L-Utilitech-MD/_/prod11460021?color=0001 (I do have a pair of men’s pants in utilitech and they are super breathable!)\n\nhttps://shop.lululemon.com/p/women-pants/Swift-Wide-Leg-Mid-Rise-Pant/_/prod11460294?color=45739\n\n\nI’d also like to add that old navy has some great fabrics as well! Very comfortable.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Background_Silver702",
                                    "body": "These are great!! Thanks a lot!!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "grill-tastic",
                                            "body": "No problem. I used to work there so I know wayyyy too much about their clothes haha",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Background_Silver702",
                                                    "body": "You know your stuff!",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PsychedelicMagic1840",
            "body": "Harem [pants](https://www.etsy.com/de/listing/830037974/bequeme-pluderhose-mit-mandala-muster-in), I have this style in many different colours. So light.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "thenfacetoface",
            "body": "Split hem pants —it’s kind of like wearing a skirt\n\nhttps://preview.redd.it/35ixrqb9s12d1.jpeg?width=1954&format=pjpg&auto=webp&s=12ac5587cb95def410178899123a10dedc757c36\n\nAlso aritizia effortless pants in Japanese crepe in a light color",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "Looks stylish and comfy!!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thenfacetoface",
                            "body": "Yes it kind of swishes about when you walk :)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "daddy_tywin",
            "body": "It’s 90ish and very humid here already. I’m wearing just-long-enough [linen](https://www.apieceapart.com/products/veras-shorts) or [tencel](https://www.thereformation.com/products/mason-short/1312641PPS006.html) shorts for work a lot. I also have a few pairs of silk pants, one [matte and dressy crepe](https://cuyana.com/products/silk-paperbag-pant)and the other a [nubby, washed silk](https://ozmaofcalifornia.com/products/clyde-pant-regen-silk-noil-black). ZSupply makes a cute-ish [linen trouser](https://zsupplyclothing.com/products/farah-pant?variant=39824049307748&utm_term=&utm_campaign=WP_G_PMAX_BSNA&utm_source=google&utm_medium=cpc&gad_source=1&gbraid=0AAAAADSOUgLxIVx2cHXRiLK9afZkVUuMD&gclid=EAIaIQobChMIr9Wbjv2ihgMVHYhaBR3ZvgRBEAQYASABEgKVn_D_BwE), but I feel like linen pants just get so wrinkly around the crotch. Rachel Pally had cute soft linen joggers last year.\n\nI recently got [this pair](https://ozmaofcalifornia.com/products/jardin-pant-tencel-bull-denim-putty) from Ozma that remind me of gardening pants (which is I think on purpose as they’re called Jardin pants) and they are both structured and lightweight. I’m 5’3 and really like the length for me.\n\nhttps://preview.redd.it/w1t0rdgay32d1.jpeg?width=1033&format=pjpg&auto=webp&s=d606666e921d9256517df3581f4da3fcd4b15db3",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Bad_Wolf212227",
            "body": "I am just doing cheap stuff right now b/c I am losing weight and have 20ish lbs to go, I got these in black and they are great for the office. Very light. [https://oldnavy.gap.com/browse/product.do?pid=811893022&cid=5475&pcid=5475&vid=1&cpos=33&cexp=2926&kcid=CategoryIDs%3D5475&cvar=26330&ctype=Listing&cpid=res24052208865414897848579#pdp-page-content](https://oldnavy.gap.com/browse/product.do?pid=811893022&cid=5475&pcid=5475&vid=1&cpos=33&cexp=2926&kcid=CategoryIDs%3D5475&cvar=26330&ctype=Listing&cpid=res24052208865414897848579#pdp-page-content)\n\nI haven't tried the pants yet but I just ordered a bunch of shorts for around the house. I have some shirts from Gap/J.Crew in this material and love it. [https://oldnavy.gap.com/browse/product.do?pid=857456022&cid=3033941&pcid=3033941&vid=1&nav=meganav%3AWomen%3ANew%20%26%20Now%3AThe%20Crinkle%20Gauze%20Shop&cpos=9&kcid=CategoryIDs%3D3033941&ctype=Listing&cpid=res638519881896409952&ccam=34024#pdp-page-content](https://oldnavy.gap.com/browse/product.do?pid=857456022&cid=3033941&pcid=3033941&vid=1&nav=meganav%3AWomen%3ANew%20%26%20Now%3AThe%20Crinkle%20Gauze%20Shop&cpos=9&kcid=CategoryIDs%3D3033941&ctype=Listing&cpid=res638519881896409952&ccam=34024#pdp-page-content)",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "The first ones great! I think I have something similar from H and M",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "therainshow",
            "body": "The linen pants from Old Navy that everyone has already mentioned. I much prefer the wide leg version. Harlow pants from Madewell. I have two pairs of linen pants from Abercrombie that I like, but the waistband isn’t as comfortable as the Old Navy ones and the fabric is much thicker (that’s good or bad depending on your preference).",
            "score": 5
        },
        {
            "depth": 0,
            "author": "not_rachel",
            "body": "Patagonia Garden Island pants -- new [here](https://www.patagonia.com/product/womens-garden-island-wide-leg-pants/56566.html?dwvar_56566_color=WWIB&cgid=womens-bottoms) but I actually bought my pair gently used via their Worn Wear site. They're a hemp blend, soft, and super breezy -- the side slit helps on hot days too!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "OverallDisaster",
            "body": "live in the deep south where it gets hot and humid as hell - I like Old Navy's linen pants, but they're a bit on the scratchier side. I have some linen and palazzo printed pants from Abercrombie this year that I really love. I've also bought several pairs from H&M - I'm wearing their wide cut pull on pants today (I think they're viscose) and they are SO comfortable and thin.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "I was actually eyeing pants at Abercrombie, so good to hear you liked them",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "LadyGoodman206",
            "body": "I love the Athleta Brooklyn pant. The material is feather weight stretch which is super breathable, wrinkle free I think they have UPF. They are a mid rise city pant. 9/10 recommend.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "jochi1543",
                    "body": "Was just about to post the same thing!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "LalalaSherpa",
                    "body": "I'm in TX and have these pants and actually hate them for summer. 😂\n\nYes, they are featherweight but the fabric is SO sticky and clingy if you sweat even a tiny amount.\n\nMaybe it's the humidity here - the dew point hovers around 70 - 75 which is super-high compared to many parts of the U.S.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LadyGoodman206",
                            "body": "I live in Seattle and they are perfect for our weather. I hate humidity. It is so gross.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "VirgoEsti",
            "body": "Kohls sells swishy wind breaker material pants (sorry I don’t know the name of them) you can pair them with a plain or graphic tee",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "I’ll look this up!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "SpiceGirls4Everr",
                    "body": "I get pairs of these from target every year!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kallmekhalleesi",
            "body": "I have two pairs of splendid wide leg pants that I think are viscose, they are sooo comfy in super hot weather",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "Is viscose generally good for hot weather?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kallmekhalleesi",
                            "body": "I find it to be pretty breathable and softer than linen, I wear them in 90+ degree days no problem, they feel like pajamas but I always get compliments on them",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Binsey1966",
            "body": "[https://shop.lululemon.com/p/women-pants/Swift-Wide-Leg-Mid-Rise-Pant/_/prod11460295?color=66090&sz=6&skuId=153157976&cid=pdp_share_link_icon](https://shop.lululemon.com/p/women-pants/Swift-Wide-Leg-Mid-Rise-Pant/_/prod11460295?color=66090&sz=6&skuId=153157976&cid=pdp_share_link_icon)\nI just bought these from Lululemon and they’re amazing!  So comfortable. And they have pockets!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Background_Silver702",
                    "body": "Looks sooo comfortable!! Great find",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "neonlittle",
            "body": "I've been wearing the Lululemon Dance Studio pants and I loooveee them. So breezy and comfy. Cute, too.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DLQuilts",
            "body": "Springrain tulip pants on Amazon.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SpiceGirls4Everr",
            "body": "I have several pairs of these from Target over the years! I wear the black ones with graphic tee or plain vneck tee or a thin chambray button up. they are great for traveling too because they are thin and dry so fast you can wash in the sink and dry overnight.\n\n  \n[https://www.target.com/p/women-s-stretch-woven-high-rise-taper-pants-all-in-motion/-/A-87184983?preselect=86867453#lnk=sametab](https://www.target.com/p/women-s-stretch-woven-high-rise-taper-pants-all-in-motion/-/A-87184983?preselect=86867453#lnk=sametab)\n\n  \n(have found similar pants also at gap/athleta).",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SpiceGirls4Everr",
                    "body": "I have some pairs of these cargo joggers too - these are def more casual vibe though. the other ones you can dress up more. [https://www.target.com/p/women-s-flex-woven-mid-rise-cargo-joggers-all-in-motion/-/A-89436891?preselect=89296666#lnk=sametab](https://www.target.com/p/women-s-flex-woven-mid-rise-cargo-joggers-all-in-motion/-/A-89436891?preselect=89296666#lnk=sametab)",
                    "score": 1
                }
            ]
        }
    ]
}