{
    "title": "Daily Questions Thread May 16, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "Weak-Classic7161",
            "body": "https://preview.redd.it/lte9zp0uet0d1.jpeg?width=944&format=pjpg&auto=webp&s=7fc7ebb568a2bec058eeb2204df3e6dde18b2e98\n\nCan I get some feedback on this outfit? Trying to create a ’classy yet casual/sporty look’ and not look like I’m trying too hard",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "EpidermGrowthFactor",
                    "body": "this looks so good omg",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Looks perfect to me! A watch would also be a great accessory for these types of outfits.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "morecookiespls",
                    "body": "i like it, it fits you well and it looks cohesive! you could swap the crop top with a v neck or something with a lower neckline as an alternative",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "For your goals, I suggest a longer crop or tucked tshirt or bodysuit!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Logical-Layer9518",
                    "body": "Wear the dress!",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Sundress sounds like your best option!",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "It's kinda hard to say without seeing the dress. How casual is it? Do you have other cute but casual dresses which would have a more laid-back vibe?",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "dcp3450",
            "body": "GF and I are about to have our 1 yr anniversary. She doesn't wear rings but always wears a necklace with two small pendants for her brother and grandfather (both passed). I wanted to get one that would encompass them in the center, such as a heart or circle. I found this (see below) on jewlr.com but I've heard some poor mixed reviews about them.\n\nWould love some suggestions and/or terms I can use to better and faster find something like this.\n\n[https://www.jewlr.com/products/JWLP0688/14k-yellow-gold-engravable-floating-circle-necklace-with-heart-cutout?shopfeed=1&sku=14KY](https://www.jewlr.com/products/JWLP0688/14k-yellow-gold-engravable-floating-circle-necklace-with-heart-cutout?shopfeed=1&sku=14KY)",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Proof-Tip2626",
            "body": "Hi all! I’m using a throw-away since I’ll be using old photos of me, but I’d love some help finding a jacket similar to one that used to be a staple in my wardrobe. I’ve been trying to figure out my style and whenever I think of outfits from my past that I felt like myself in, this jacket is always involved! It was originally bought from Forever 21 in like 2012 haha, so I don’t have hopes of finding this exact one, but I’m curious if anyone has found something similar. I’ll add photos below, but here are the qualities I’m looking for:\n\nHits around the hips (neither cropped nor longer fit)\n\nStructured with a slight waist emphasis (not a boxy fit)\n\nNot denim (something neutral that can be worn with jeans)\n\nI loved this jacket since it was neutral enough to go with anything but still felt like a sightly unique piece. I don’t love jean jackets since they usually have a straight/boxy cut, and I don’t love the utility jackets that are similar to this one since they’re longer and feel more casual to me. Most of the similar jackets I find are usually a straight/boxy cut so I’m struggling to find a look-alike! Moto jackets seem the closest but I usually don’t like the fabric of them. This unicorn jacket was cotton/twill, anyone know of a moto jacket made of that material that’s not too cropped?\n\nPhotos: [https://imgur.com/a/b2IWGK8](https://imgur.com/a/b2IWGK8)",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "You can try searching for “cropped twill peacoat”, that should get you pretty close to the lapel and button styling, at least. The issue you’re going to run into is that boxy/oversized are in so it’s going to be hard to find anything with the waist structure you want. Although it could be worth looking secondhand!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "OverallDisaster",
                    "body": "Ok so H&M has a short twill pea coat - I have a long torso and it's not too cropped on me, it would probably be past waist length otherwise. It is a boxier fit but you could size down and see if that helps. It's really cute and they have it in tan and grey.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Proof-Tip2626",
                            "body": "I actually just ordered this one after some recommendations in another subreddit! That’s good to hear you like it, I’m hoping it’ll work!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "You can have boxy jackets taken in at the waist to provide that emphasis if you find something that meets the rest of the requirements.\n\nWhile some jackets can be cropped by a tailor, too, it tends to be trickier to make that look right, due to pocket placement and some other things, so I don’t recommend that unless you know how to evaluate that before purchasing.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "weight_les",
            "body": "I need help finding trousers! I found these House of Harlow 1960 trousers recently in size medium. They were a little large, looking for a size small or similar style. I like that these have a zipper and button instead of a full elastic waist.\n\nhttps://preview.redd.it/i5nckeeris0d1.jpeg?width=496&format=pjpg&auto=webp&s=771357ac4009a4f539450864ed7719e5bfdb8423",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "ElsaMakotoRenge",
                    "body": "If you are not set on the particular color there are loads of listings on poshmark in a S! Here are a couple I found quickly without digging for long lol:\n\nhttps://posh.mk/WkQqQmqhEJb\n\nhttps://posh.mk/2LdPx7xhEJb",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Proof-Tip2626",
                    "body": "Can you get them tailored? It’s not very expensive and then they’d be the perfect fit",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "freelancinaintfree",
                    "body": "These look a lot like Madewell's harlow pants. Check out Posh for lotssss of options.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "weight_les",
                            "body": "Thank you - they do!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "psychosomaticstatic",
            "body": "Advice: Make this into a colorful outfit?\n\nHello! I’m (21) going to a wedding in Mexico next week. There’s going to be a parade the day before the wedding itself, and the dress code for this event mentioned ‘fiesta’ colors. I’m pretty sure that means bright and colorful, but I ended up buying this powder blue (lol) dress because it’s more practical for me in the long run than a brighter dress. However, I definitely want to be polite and otherwise follow the guidelines to the best of my ability, so I’m looking for advice on how to make this outfit more colorful! Advice on good color combos, patterns, etc. are welcome. This extends to shoes, scarves, jewelry, bags, etc., (though the shoes can’t be heels as the roads are uneven angled cobblestone and the parade will be a bit of a hike- I’m thinking espadrilles.) Thanks so much!\n\nhttps://preview.redd.it/w5ugbucbls0d1.jpeg?width=818&format=pjpg&auto=webp&s=e681d72c0d27d395d3be3044aa6b01f096aa47f7",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "intessen",
                    "body": "[Oltem ](https://www.oltem.net/products)and [Pulasu](https://www.pulasuco.com/) are both Colombia based stores that make absolutely beautiful beaded jewelry and accessories in vibrant colours. Not Mexican, but I do love them!\n\n [Erstwilder ](https://www.erstwilder.com/)has a lot of colourful pins and things, including a current collection designed after Frida Kahlo! I think the Flower of Life hair clips would be a good addition.\n\n[Chunks](https://chunks.shop/) has fun, brightly coloured hair accessories. You can throw in some pins or a claw clip to add colour. I personally think their little flower claws in yellow and pink are adorable, but they do read a bit more childish. [Eugenia Hair Clips ](https://eugeniahairclips.com/collections/shop-all)also has a bunch of fun, brightly coloured hair accessories--their whole thing is making childish designs, though. \n\nI think that shade of blue goes well with a red-orange shade, so you could look at adding that in with a handkerchief, scarf, headband, whatever. \n\nI also think your dress matches well with the [Sky colour of Fiestaware](https://cdn.shopify.com/s/files/1/2081/7373/files/ColorChronology_2024_b36780e4-8062-4de7-be7a-58ed85e4bd1d.jpg?v=1712675055), which I always think of when I am told something is 'fiesta coloured', so maybe look at the other colours they produced and choosing one or two to add to your outfit! Having a few accessories for both colours (or combine the colours, like a scarf) can help make it look a bit less random.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "I think a bright yellow or pink shoe would make it feel really colorful!",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "No advice but this dress is WAY CUTE 😍",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "dancingmochi",
                    "body": "French tuck into bottoms (skirt or pants with more of a straight silhouette) or tucked into wide leg pants.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "How oversized? Cuff the sleeves! You could tie the tee on the side or middle if it’s too voluminous or long. Or maybe crop it (not necessarily to a crop top, just something that isn’t tunic length if you don’t want to tuck it). You can also try leaning into the oversized aspect and do baggy jeans/cargo pants on the bottom (I think looking drowned in fabric has less to do with your height than the proportions of the shirt to pants, which is why shirt length is important). I also kinda like the bike shorts/no pants look with an oversized tee. Along those same veins, you could try a jersey midi/maxi pencil skirt for a more slim profile on the bottom.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DConstructed",
                    "body": "The tiniest bit of a mini or shorts showing under the bottom. Roll the sleeves.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Idujt",
                    "body": "I'm a Little Old Lady, 5', UK 14-16.  Last year I saw a tee in a charity shop which I HAD to buy, it has nearly my home town on it, great graphic and slogan.  It's an XL !  I just wear it in its rotation, I know it is way too big but that's fine.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "z0mbiezoo",
            "body": "How do we feel about the brand Halara? I've never ordred from them but am tempted.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Very cheap, doesn't look good irl from what I've seen of friends purchases.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "Patient-Couple9008",
            "body": "Skinny tall-ish inverted triangle looking for WFH outfits\n\nHi,\n\nI’m a skinny, kinda tall (105lbs, 5’7) inverted triangle in desperate need of comfortable but presentable work from home outfits. My current go-tos are skinny or flared black leggings + a plain long sleeve bodysuit or a collared shirt. I’m looking for recommendations on well-made, affordable and comfortable clothing as well as entire outfit ideas. \n\nThanks! 😊",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "I usually wear trousers, a slim crew neck tshirt, and a cardigan.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "North-Physics-1594",
            "body": "What shoes to pair with dresses?\n\nI have always struggled with this. I wear dresses of all lengths and so I need something that will go with a long ankle length dress all the way to mid thigh length. My dresses are a range of colours and patterns, but mostly florals. I have a pair of white and grey chunky Fila trainers which I think are fine for most dresses as it’s a casual look. My boyfriend says i should go for something a bit more elegant and feminine but I have no idea what to get. I usually just go for comfort but I want something a bit more stylish as well. I have narrow feet that are two different sizes which makes it hard to find something for both feet.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "waterproof13",
                    "body": "Maybe closed toe sandals or a knit Mary Jane shoe for summer",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Admirable_Anxiety_45",
            "body": "Lost weight, wardrobe upgrade\n\nHello! I’m 27 F and have recently lost 60 lbs. I feel like a whole new person and for the first time in my adult life feel confident! Most of my life I bought whatever plus-size clothing would fit and didn’t pay much attention to my style. But now that I’m in regular clothing sizes, I’m wanting to revamp my wardrobe! I don’t care too much about being “on trend” but would like to find items that are timeless and classy. I’m a stay at home wife so I don’t need anything super fancy or corporate looking but I do enjoy the “coastal grandma”/ old money look. Also I’m a winter so I wear a lot of jewel tones. Anyone have any suggestions on where to shop? Bonus if it’s reasonably priced. Thank you! 🥰",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "What’s seen as “timeless and classy” very much depends on the trends at the moment, unfortunately. If you haven’t already, make a pinterest board and pin outfits that you like and can see yourself actually wearing in your life (or pin everything you like, then narrow it down to what’s practical later). Then you can look through and find the core items that will help you dress like that style - for example, if a lot of outfits have black wide-leg trousers, or an unstructured linen blazer, those should be the first things on your to buy list.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Siouxsie_Sweet",
                            "body": "Are you able to elaborate on what you mean? Because to me timeless and classy means it will look that way regardless of what the current trends are.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fir6987",
                                    "body": "I’m mostly thinking about silhouette and style differences as trends keep moving. Looking at workwear, there’s always going to be blazers, trousers, blouses, low flat shoes. But the boxy menswear-style blazer of today is going to start looking dated in the future when silhouettes swing back to being more fitted. What style of trousers are considered “classic”? Low rise slim ankle pants? Super high-rise pleated wide leg trousers? If you’re going for a particular fashion era, either one might be the right answer.\n\nThe reason I brought that up is that timeless and classy aren’t very useful descriptors if OP wants help revamping their wardrobe. Different people are going to have different things in mind, so it’s better to have visuals (for yourself especially) on what you actually want to dress like.",
                                    "score": 8
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Weak-Classic7161",
                    "body": "Cos, Mango, Massimo Dutti, Abercrombie. Also depends on your budget but those are some of my favorites",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "booksandwriting",
            "body": "https://preview.redd.it/gycifp907t0d1.jpeg?width=4284&format=pjpg&auto=webp&s=825eeece83cf404be1ef1f8bb306899ba9a9af41\n\nDo you have any better ideas to style this cardigan? Does it look okay with these pants? The cardigan has some metallic threads in it.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "It doesn’t go great with those pants tbh. In general it looks pretty dated/frumpy, and the metallic doesn’t help because it’s making it more fancy/preppy than the silhouette really calls for. It seems like it’s meant to go with black trousers and a blouse, but you might end up looking like a grandma. \n\nIt would maybe look cute open over a longer dress if you’re going for a cozy cottagecore/librarian type style, but again the metallic threads and buttons kinda throw that vibe off.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "booksandwriting",
                            "body": "Thanks! That’s the feeling I was getting but I wasn’t sure! The pants are cotton with brown stripes so I felt it was a bit more casual than the cardigan. I’ll try the cardigan with some black trousers or a long dress instead!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Civil-Patient-7373",
                    "body": "This reminds me of one of my fav outfits from a PLL character - I'd try dressing it with a dress like this: [https://i.pinimg.com/736x/dc/b6/43/dcb643f3bd7fc5ee6e1b63103d005ecc.jpg](https://i.pinimg.com/736x/dc/b6/43/dcb643f3bd7fc5ee6e1b63103d005ecc.jpg)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "lmaoidontexist",
            "body": "What would yall wear to an event with “Snappy Casual (business casual but fun!) no jeans or sneakers” as the dress code? I need inspiration for an event I’m going to soon",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "FerociousFrizzlyBear",
                    "body": "A cool jumpsuit?",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I'd probably wear my favorite pants with a fun short sleeve button up - I have a bundle of really fun ones I've collected from Anthropologie over the years. Would pair with some shoes that were a little more fun and party than a normal work day.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "OverallDisaster",
                    "body": "Depends on the weather but I'd do a midi/maxi dress or some cute linen wide-legged pants with a button up.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "funny_fox",
            "body": "Has anybody tried the Vivaia shoes? Are they comfortable and breathable?\n\nI'm interested in the Aria style.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "That's a very pretty dress and I'm sure it will look great on you. Strapless dresses are often recommended for broad shoulders. Check pictures of Charlize Theron and Princess Charlene in strapless gowns - they both have much wider shoulders than you, and they both look good.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "impulsedragon",
            "body": "Hi all, what's your opinion on the most versatile diamond pendant setting?\n\nI want to surprise my girlfriend for her college graduation with a diamond pendant as she mentioned wanting one in the past. She mostly wears white gold / silver for daily wear and gold when she wants to feel fancy. I'm leaning towards white gold / platinum because she'd probably wear it every day. I'm currently looking at round 0.5 carat diamonds but I have no idea what setting to choose without asking her (don't want to ruin the surprise!).\n\nThe three settings I've narrowed it down are:\n\n- 4 prong floating: https://www.jamesallen.com/necklaces/diamond-pendants/14k-white-gold-four-prong-basket-solitaire-lab-created-diamond-pendant-050-ctw-f-g-/vs2-si1-item-68895\n- bezel:https://www.jamesallen.com/necklaces/diamond-pendants/14k-white-gold-bezel-lab-created-diamond-pendant-050-ctw-f-g-vs2-si1-item-133330\n- double bail - https://www.bluenile.com/diamond-jewelry/diamond-necklaces/design-your-own-pendant/double-bail-solitaire-pendant-setting-in-14k-white-gold-item-194822\n\nI'd appreciate any advice!",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "Bezel if she's more minimalist/architectural in her tastes. Double bail if she's more traditional.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "floracalendula",
                            "body": "Seconding this. Double bail says trad, bezel says \"bad b!tch\" in the best way.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Krindybluth",
                    "body": "Bezel",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "sawdust-arrangement",
                    "body": "My personal favorite is the bezel!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Saturday-Sunshine",
            "body": "Does anyone know how to handle a return with YOOX??? They are a Net- a -Porter company but NO ONE answers the phone or email.\n\nI bought a pair of pants that were $52 but hours after I purchased them the price went down to $26. I called them to get a price adjustment and they refunded less than $2.00 ( why??). Then I tried to return the item and no one will answer. Supposedly they put a return label in the package ( no they didn’t ) so I am trying to get a return label. I am tempted to just use the address to send the item back but afraid I will never get a refund. I guess I can try to file a claim with PayPal but I normally don’t have any luck with them either. \n\nOh wow, while writing this someone actually picked up. A miracle! They said they will email a label.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Saturday-Sunshine",
                    "body": "Well they did not email me a label. What a sketchy company!!!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BeepPeep",
            "body": "Posting here since my thread got deleted.\n\nDoes anyone own any platform sneakers that are heavy? Do they fit you well? \n\nI recently bought a pair of Buffalo Orcus shoes and I can't tell if they're just too big on me, it's a desgin flaw or if there is some trick to wearing such shoes. My foot keeps sliding out when I walk! I've tied the laces as tightly as I can. I CAN make the shoe fit better by lacing super tight but it always takes forever and keeps me from wearing the shoes often. I used to have a similar pair of lower end shoes and I was able to just slide my foot in and go without a hassle. They were much lighter though and my foot would still slide out just a tad bit but after some walking, my feet usually swell and this solved the problem 😅\n\nAny ideas on if this is solvable or do I just give up? I can't return the shoes since I've worn them  outside for test walks. And I can't size down because I own the smallest size.\n\nMaybe there is another sub where this question would fit better? I tried looking at some alternative fashion subreddits but it all seems to be just hot people posting selfies 😅",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I own platform buffalos. They definitely fit big on me (I got a size 37 and usually wear US size 7), I only wear them in late fall/early winter with thick wool socks.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BeepPeep",
                            "body": "Okay so it's not gonna be a summer evening concert shoe 😅",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Sounds like they run big. There are 80 million things, besides thick socks, you can do to add bulk/take away the empty volume: gel insoles, heel cups, heel pads, tongue pads, toe pads/ball pads, even foam inserts that go in the toes to eat up space.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BeepPeep",
                            "body": "As an owner of small feet, I'm familiar with all these methods. tried it all with these particular shoes. Gel insoles and anything that makes my foot sit higher in the shoes, actually makes the slipping worse because of the heel position. Can't really put anything in the toes because the length of the shoe is correct, but maybe I can attempt this. Also I'm doing a runners knot as well,  which helps but not enough and is a hassle",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "arbitrosse",
                                    "body": "Well, you mentioned none of that in your original post and since none of us have a magic wand, I’m left feeling that you’ve wasted my time. Good luck with your foolish purchase I guess.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BeepPeep",
                                            "body": "Sorry for wasting your time. I know I should've mentioned this in my post but unfortunately I forgot. I definitely don't post intending to waste peoples time and there's no malice from my side. Just an oopsie, which happens. \n\nWhy are you suddenly coming for my shoes being a foolish purchase for no reason tho lol. Like what's with the dramatics here. Are we supposed to be arguing about something. I'm lost",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sippin-tropicana",
            "body": "Hi! Does anyone have experience with Skims shirts? More specifically can someone tell me what the difference is between the \"fits everybody\" shirt and the cotton jersey shirt? I’m looking to invest in some well fitting basics and just looking at the pictures those two look identical to me but I’m guessing there must be some difference in the fit?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "The difference is the fabric - the fits everybody one is polyester and is likely thinner and more smoothing than the cotton version.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sippin-tropicana",
                            "body": "Thank you!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "whateverwhateverwut",
            "body": "hi! what shoes would you wear with this realisation par dress? \n\nhi everyone! my birthday is coming up and my mom bought me this [dress](https://realisationpar.com/the-lilou-black/?sku=RSLILOBXXL&gad_source=1&gclid=Cj0KCQjw3ZayBhDRARIsAPWzx8pijw-e_V5oPF9JCvHCVb-Xpjo9zZqIsrRarPKSJrmNqFAofErQAgoaArj5EALw_wcB). \n\n\ni’m having trouble deciding how to style it/ what shoes to wear. i’m not a super set on heels, also think for a birthday where i’m just going to a bar with friends it might be too much.\n\nanyone have any ideas?? thank you!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "muffingr1",
                    "body": "It’s a classic LBD, your styling options are endless. If you’re planning on dancing and bar hopping, try a sneaker or stomps boot. If you plan to go to a nice dinner before the bar, heeled ankle boots or sandals. Oversized leather/denim jacket for a casual vibe, blazer if you want to look dressier.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "swess7",
            "body": "Does anyone have experience with the brand Rixo? I Iove some of their styles but I’m not crazy about all the viscose- do they ever have more cotton/silk options? Also wondering about sizing- hoping to size up to accommodate a little baby bump but not sure how their sizing runs.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "On their website you can filter by baby bump friendly and by fabric.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EpidermGrowthFactor",
            "body": "can someone talk me out of buying these shoes. are they long lasting + super comfortable? i have a slightly collapsed arch and wide-ish feet. they're expensive. debating if it is worth saving up for them.\n\n* birkenstock boston\n* birkenstock arizona\n\n:')",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "Shoes are very personal. Berkenstocks are not wide enough for my feet and so are quite painful.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "ClassicEssay1379",
                    "body": "Ok. I think I can give you a bit of advice based on my experience. I have the arizonas, and while they’re fairly comfortable, there isn’t a lot of arch support or cushion for my feet. The bostons look like they have a similar sole. If you want them, maybe you could get a custom insole for them? I think that without more support, they might not be the most comfortable option for you based on what you’ve said. Or if you’re open to other styles of sandals, I can send a few recommendations your way. I’ve had a dilemma lately of trying to find cute but comfortable walking sandals and I did find a pair from Will’s Vegan Store that have held up pretty well so far, so let me know if you want the link.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "figdust",
                            "body": "This is the first time I've ever heard someone say Birkenstocks lack arch support. I don't have collapsed arches, but I do have insanely high arches and Birks are some of the only shoes that provide sufficient support for me. Usually people complain about there being too much arch support and having to break the arch in. I find Birkenstocks to be extremely comfortable right out of the box, but in a firm, supportive way, not a cushy way. All this to say, YMMV and it's worth trying them on in store before buying them if you can. In my experience, Birkenstocks last decently long and local cobblers can replace the footbeds and soles when they wear out, which is a pro for me.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ClassicEssay1379",
                                    "body": "True, I can see that because they’re hard, they’d have more arch support. And they have the arch in the middle. Maybe they just fit my feet differently. I think it’s the heel part that annoys me the most because without any cushion there, it can be uncomfortable to walk long distances in them.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "waterproof13",
                                    "body": "Like I said above they also come with a soft footbed for people that like it a little more cushy!",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "waterproof13",
                            "body": "Arizonas come in a soft footbed too for people who prefer that.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Civil-Patient-7373",
            "body": "I'm looking for a dress to buy similar to this but available in the UK - [https://smcdress.com/products/star-of-my-eye-gown-ala0824](https://smcdress.com/products/star-of-my-eye-gown-ala0824) Does anyone have any suggestions?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "shoofinsmertz",
            "body": "How can I smoothen out an itchy acrylic sweater?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "waterproof13",
                    "body": "What do you mean by smoothen out?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "shoofinsmertz",
                            "body": "make it stop itching",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "Fabric shaver?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "I don’t think you can. Acrylic is a synthetic, and it’s just not very comfortable. You could wear a thin undershirt under so there is a layer between",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "kaetrone",
            "body": "I've been seeing tops like [this](https://imgur.com/i902zDb) lately (the pic is from Fancí Club). The actual name of this type of top though, I can't find anywhere. Tried googling with a bunch of descriptors, nothing.\nDoes anyone know what this style of top could be called?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Asymmetrical or one-shoulder top. The fabric is a satin weave. The sleeve style is a bell sleeve.\n\nThe bra strap and bondage collar and cuff are separate pieces and not connected to the top.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "tahimpwmmsb",
            "body": "Does anyone have advice for making a sundress more work appropriate? I recently purchased the AE Tie Back Midi Dress   https://www.ae.com/us/en/p/women/dresses/midi-maxi-dresses/ae-tie-back-midi-dress/0395_7613_717?menu=cat4840004, and it is adorable but the tie back is too open for work.\n\nI want to look modern, and a lot of the Pinterest images I saw looked a bit dated (like belted cardigans). Any help is appreciated!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I love that dress but it shows too much chest/cleavage for my workplace. A crewneck sweater over the dress or full coverage cardigan buttoned up would work best for my office",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Workwear *is* dated, for the most part. It’s conservative and slow to change. (I would also argue that “modern” is not the same thing as “showing the small of my back to the accounting team,” but that’s a different quibble….)\n\nThat dress would not be anywhere near work appropriate in my life, but of course your workplace may be different. Anything with tiered ruffles like that is a problem; the colour is a problem (cute, but does not convey authority and gravitas, which may not be a requirement for you); and of course the bodice doesn’t work at all, I would probably have to wear a blouse and blazer over the top somehow and make the whole thingg look like I was trying to make a boho maxi skirt work for the office.\n\nFor a less formal office, just add layer over the top that you can button or close up to somewhere in the vicinity of your collarbone and that covers the cutouts, and a work-appropriate shoe.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "BeepPeep",
                    "body": "Try a lacy or crochet fabric jacket. Those materials are definitely in now. Also think boho chic, bell sleeves - that style is on trend now.\n\nhttps://pin.it/2YQigXIig\nhttps://pin.it/7mpSMtEUH",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ThinkingSalamander",
            "body": "I'm a guest at an upcoming wedding, ceremony and reception (at a museum) will be in the evening. Weather will probably be a little chilly (~50F). This is what the invite says: \"Attire: This will be a semi formal event. We’re asking men to wear suits with ties.\"\n\n\nWould either of these jump suits be appropriate? Is black bad for weddings or is it too much like business formal? I have a light blue dress too, but I'm not sure if it would be too casual?\nPictures of all three options: https://imgur.com/a/dI7sOjr",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I think all three would work, but maybe think of how they'd look with a jacket/shawl and see if that changes which you like best?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Of those, the topmost one seems to fit the occasion the best.\n\n> Is black bad for weddings or is it too much like business formal?\n\nThis is a \"know your crowd\" situation. In some crowds, black is inappropriate both for weddings and for business formal (it's considered funereal), but those crowds don't tend to have \"semi formal\" evening events, so black is most likely perfectly fine.\n\n> Weather will probably be a little chilly\n\nA velvet jacket or faux-fur evening jacket takes care of that",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wonderful_Sundae8720",
            "body": "Good day!!!!!! I have a wedding up coming in 4 weeks and I have no idea how I will fix my dress neckline with my schedule.\n\nMy dress is strapless, satin, and is a very noticeable not to be mistaken with white- semi vibrant gold dress. Generally speaking, the neckline is very Semi Sweetheart- Straight across but in detail, imagine a low neck Bateau with no straps. The dress is unfortunately made for my exact measurements so pulling it up will not work.\n\nI initially bought it because the bodice caught my eye but I never noticed it’d be that short but after further notice… it’s short. I want to not show any chest but still want to show the bodice (if that makes sense).\n\nAs a guest, I want to dress modest but still keep in touch with my fashion tastes, people in my culture are very lenient on what is worn in weddings as the bride will still be the main center of attention\n\n(gold, sparkles, red, anything except white is available to wear)\n\nHow do I make the dress less chest?\n\nhttps://preview.redd.it/rph3t0krn31d1.jpeg?width=1170&format=pjpg&auto=webp&s=b3b564d34bc1eb3ef37b4887decb7c62db230b09",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tyrango",
            "body": "Hi there!  I have a question regarding mixing yellow gold and silver jewelry.  It is our 25th anniversary (silver) this year, and my wife typically wears yellow gold jewelry, though she does have some silver.  I gave her a gold ring with blue and white stones (calling them sapphire and diamond would be generous, as I gave her that ring on our 5th and we had no money..) and it is so precious to her.  I want to get her a pair of earrings in silver with blue and white stones (very similar to her ring), but I have always heard you shouldn't mix wearing silver and gold. Is that a thing?  Any suggestions or help would be greatly appreciated - thank you!\n\nPicture of her ring and the earrings I'm looking at gifting her.. https://imgur.com/V0qfQbc",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Some people wear different metal colours together and some do not. We can’t tell you what your wife prefers.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I would look for something in gold since it sounds like she mostly wears gold anyway, and if you’re tying it into her wedding ring, then it’s definitely nice to have the metals match.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chamuel888",
                    "body": "How do you style this scarf?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "VersionNervous3452",
            "body": "Looking for high quality brands that have plus sizes XXL and up",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Universal Standard",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ClassicEssay1379",
                    "body": "https://goodonyou.eco/ethical-plus-size-clothing/",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "waterproof13",
                    "body": "Wool&",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DConstructed",
                    "body": "It’s a little sheer.  But the main thing for me is that I don’t think you can wear those three pieces together.  \n\nThe peach sandals pull the skirt in a more warm toned direction.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "I think it will look better with the wrinkles steamed out.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Puzzled-Nothing6985",
            "body": "Hi everyone, I need some major help. I seem to always find myself frustrated and crying after going shopping. I know some girls dream of it but having a perky chest is not fun. It was great until they got bigger. Now I absolutely hate dressing up because of my boobs. I couldn't even tell you what my size is because it truly changes every week (ever since I got an IUD my boobs become extremely tender and swollen for 1 1/2-2 weeks every month). So picture large and perky boobs and after some \"research,\" my shape/set would be considered wide side-set. With that info...PLEASE HELP!!!\n\nWhat styles/types of shirts work for others with similar shapes? I am leaving for a quick 3-day vacation next week and need to pack light, I'm looking to pack only dresses but I don't know what kind. The only style of dress I've had a good experience with is a V-neck tie front dress (here's the name of the dress, I got it off amazon: miduo Womens Satin V Neck Ruffle Short Sleeve Tie Front High Waist Midi A-Line Maxi Dresses). I know I could get more dresses similar to this style but I want some that aren't too revealing. I recently was a bridesmaid and the dress was a tank top cowl neck dress, it sort of worked I ended up having to go 3 sizes up because of my boobs (even then I had to wear tape, bra, and bodysuit to keep them in check) but had to do major alterations because it was too big everywhere else.\n\nPlease any recommendations/advice/tips literally ANYTHING will help.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "the-green-dahlia",
                    "body": "Honestly, and I know you didn’t come here for medical advice, it’s probably better to go back to your doctor and see if you can change contraceptives to something more stable because losing and gaining volume rapidly stretches the skin, which can leave stretch marks and may affect that perkiness over time. As for clothes, I would say it’s more about finding the right bra because a good bra makes everything fit better dress-wise. Again that may be difficult to do if your size changes regularly. Small changes in size over the course of a month are normal but large changes regularly should be something your doctor looks into.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "My breasts aren't perky but they are oversized (like 30E - 34J depending on my weight). I prefer high neck things like turtle necks, camp/resort shirts, high neck tanks. Check out the Abercrombie Paloma dress, or something like the [quince tank dress](https://www.quince.com/women/tank-maxi-dress?color=black&g_network=x&g_productchannel=online&g_adid=&g_acctid=978-058-8398&g_keyword=&g_adtype=pla&g_keywordid=&g_ifcreative=&g_adgroupid=&g_productid=39439458697386&g_merchantid=128669708&g_partition=&g_campaignid=20572575045&g_ifproduct=product&g_campaign=&utm_source=google&utm_medium=paid_search&utm_campaign=&utm_term=39439458697386&gad_source=1&gclid=Cj0KCQjw3ZayBhDRARIsAPWzx8pyaCTsteUMygaKPyNLMOuavU3-W8w2NZNxrNr2jmKc6MiXZry_o5oaAu6GEALw_wcB)",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "I mean, if you want to have saggy/pendulous boobs instead of perky, wearing a binder stretches out those ligaments pretty quick from what I've heard. Be aware that those changes are permanent though, and to go back you'd have to do a breast lift.\n\n\nI feel like wide, shallow necklines might off-set the visual weight of your boobs. Does off the shoulder count as more covered up? Stretchy fabrics work better for \"\"\"\"uncommon\"\"\"\" body shapes, so look for stuff with a high percentage of elastane.\n\n\n\nIt's kind of difficult to answer your question without knowing what your goals are tbh/what you want from the sub.",
                    "score": 1
                }
            ]
        }
    ]
}