{
    "title": "Daily Questions Thread May 18, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "booksandwriting",
            "body": "https://preview.redd.it/galv8ufjm71d1.png?width=3024&format=png&auto=webp&s=fdca719d8764e9357e2f3a421818b875f5e1b9aa\n\nMy boyfriend got me this beautiful purse for my birthday from his home country, Malaysia. The only thing is I’m stumped what to wear with it! My typical style Is more romantic, cottagecore, preppy, coquette, dark academia, etc.\n\nI’m looking around at options and I’m wondering if [this red dress from Poshmark](https://posh.mk/wqtO86iFHJb) would look nice with it? Or do you have any other suggestions?",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "IMO it would be a statement piece with a neutral dress (black, white, cream, gray, soft pink, etc)",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "booksandwriting",
                            "body": "Thanks! That gives me some good ideas of outfits I already have!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I think you could wear it with anything. The brown would look really nice with blue jeans and a blouse or tee, for example. Also any white cotton dress.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "booksandwriting",
                            "body": "Thanks! That is really helpful! I do have a white cotton dress already!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sexysmoothfig",
                    "body": "you could try to pair it with other warm tones in your wardrobe (off-white, jewel tones)",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "zigzagtitch",
                    "body": "I have a straw bag and I absolutely love wearing it with gingham clothing which imo fits really well with some of your style words (romantic, cottagecore)",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "allbitterandclean",
                    "body": "Anything from Farm Rio",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "booksandwriting",
                            "body": "Thanks! I’ll take a look!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "allbitterandclean",
                                    "body": "If price is a factor, check Poshmark for secondhand deals. Their dresses run large so go one full size down in most (if not all) cases.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LinverseUniverse",
            "body": "I am looking for a specific style (not the best examples but the only ones I can find). It's a high neck floor length gown (Or skirt if this is a particular type of blouse) with fitted lower arm sleeves and looser even billowy upper arm sleeves, and gathers in the bodice. Does anyone know what this is called?\n\nI've tried everything from victorian, vintage weddig dress, modesty, full coverage gown searches but nothing really hits what I'm looking for.\n\n[https://i.imgur.com/Z0tlwgk.jpeg](https://i.imgur.com/Z0tlwgk.jpeg)\n\n[https://i.imgur.com/vXbD9uI.jpeg](https://i.imgur.com/vXbD9uI.jpeg)",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "bittybro",
                    "body": "The sleeve style you are looking for [is called leg-of-mutton](https://www.objectlessons.org/clothes-and-accessories-victorians/leg-of-mutton-sleeve-dress-victorian-replica/s53/a1035/).",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LinverseUniverse",
                            "body": "Thank you greatly! This helped a ton!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "I tried [balloon sleeve high neck gown](https://www.google.com/search?q=balloon+sleeve+high+neck+gown&rlz=1C1RXQR_enUS1038US1038&oq=balloon+sleeve+high+neck+gown&gs_lcrp=EgZjaHJvbWUyBggAEEUYOdIBCDczMTRqMGo3qAIAsAIA&sourceid=chrome&ie=UTF-8) and that's what I got.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LinverseUniverse",
                            "body": "Thank you very much!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "squishyandbear",
            "body": "I fell in love with and purchased [this dress](https://www.thebay.com/product/ever-new-bonita-seam-detail-floral-midi-dress-0600093526349.html) for a wedding this summer, but am second-guessing myself now. The reception will be at an upscale hotel, and the dress code is listed as formal. Does it lean a bit too casual? I'd been thinking of wearing it with a similar heel as the model and some silver jewelry. Any tips on styling it or should I look for an alternative?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "NoHistorian7234",
                    "body": "To me something about the weight of the fabric combined with the scale of the print makes it skew more casual, or at least more like daywear, even with a heel like the model is wearing. I could imagine it at a beachy/al fresco type wedding?",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "squishyandbear",
                            "body": "Thank you! I was feeling that way and needed a second pair of eyes to confirm. I still love it so I'm sure I'll find a future occasion to wear it, but will keep shopping for something more formal.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NoHistorian7234",
                                    "body": "It's cute! I'm sure it'll come in handy for other outings.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AlternativeNme8950",
            "body": "What shoes are Gen Z wearing?!  Help an old millenial plz!!!  Can I please get some recommendations for trendy shoes - dressy, casual, anything?  White sneakers?  Mesh flats?  Platforms?  I need an update to my shoe collection, badly.  (Specific recs please - I need brands!!)",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Honestly, after noticing people's shoes for a day at my local college campus to answer this exact question, I concluded you should just buy something that's comfortable and that YOU think looks good.\n\n\nBecause people seem to be wearing the most random assortment of weird ass shoes. Like crocs with mismatched neon socks. Or thigh high leather heeled boots with casual shorts and a hoodie. There seems to be no consistency. The more offbeat, the cooler... maybe?\n\n\nI heard coloured sneakers are coming into fashion instead of all-white, but honestly \"you do you\" seems to be the most overwhelming trend. ",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AlternativeNme8950",
                            "body": "Haha I appreciate this and \"wear what you like\" is I think always the best answer.  But at the same time... I would love a little guidance.  Maybe it's the approach to 40 that's making me at least temporarily interested in jumping on the trend bandwagon.  Like even the sneaker thing!  Are the chunky gym shoe kind of sneaker now longer in?  I was just about to get a pair but now maybe it's back to a slimmer Adidas style?  ?!?!",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "desertdweller47",
                                    "body": "This will help! https://anindigoday.com/the-best-shoe-trends-to-try-this-year/",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CantHugEveryPlatypus",
                    "body": "This (probably) depends largely on where you live, but gen Z in my area tend to wear chunky loafers, Adidas Samba and the '90s dad style New Balance.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "Chunky shoes and white sneakers are slowly fading away, the new hottest sneakers are Adidas Sambas, colorful ones.\n\n\nSlingbacks in all forms are very trendy for dressy shoes. It's difficult to provide a concrete recommendation because they're everywhere, both as heels and flats. Low, thin heels seem to be trending over high and thick heels.\n\n\nMesh flats are a big thing online, but I haven't seen them irl yet (though it's too cold for them here). I feel like they'd be very impractical, you'll pick up every piece of grime you step near. But, they are very trendy.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AlternativeNme8950",
                            "body": "Thank you this is what I needed!  I was JUST about to get on the dad sneakers bandwagon and, of course, it's over!  Might do it anyway.  At least then I'd only be one step behind, not 5.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "cuticals",
            "body": "I’m trying to find some fashion inspiration so that I can start improving my style. My problem is, many of the fashion pages I follow are from tall, skinny women. My body type is 5’3”, small chest and waist and a massive ass hips and thighs.  When I try to dress like these fashion pages I follow, it doesn’t look good on me. For example, the oversized blazer trend; looks great on the tall skinny girlies but oversized blazers on me tend to hit my widest section (thighs) and make me look short and frumpy.  Cropped styles that emphasize my waist are better on me.\n\nAre there any influencers or fashion bloggers with larger bottoms? When I try to search on Instagram, tiktok, Pinterest etc I get a lot of plus sized / curve results which is fine but my body doesn’t quite look like theirs. Or I get really outdated “pear shaped” body results with like 2010s fashion. Tiktok doesn’t even give you results if you type in style/fashion for big butts it thinks you’re trying to search innapropriate content.\n\nIf anyone knows any accounts of petite but curvy gals please link! Preferably chic, trendy but timeless fashion like Scandinavian / euro style but on curvier girls.  I do NOT want BBL fashion which is another search result that pops up when I’m trying to look for fashion inspo for my body type.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "desertdweller47",
                    "body": "https://preview.redd.it/a01o3q3jp81d1.jpeg?width=1125&format=pjpg&auto=webp&s=df3429a29d48db9e2ad8fb416cf1c30e9b270bc4\n\nYou can search by body type on Pinterest. You could also try searching “midsize petite” if that’d be more accurate. Good luck!",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KingPrincessNova",
                            "body": "I like this feature in theory but the way these models are posing makes it impossible to differentiate their body shape on half of these",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "cuticals",
                            "body": "Didn’t know about this! Thank you",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dapplegray",
                    "body": "I'd look up with taglines like \"pear shaped\"",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tacky-Terangreal",
                            "body": "I’ve found “midsized” to be a helpful tag too. Especially if you have bigger boobs. I’m not the skinniest person but plus size doesn’t really suit me either. Sometimes it feels as if fashion models are either heroin chic skinny or really big",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "allbitterandclean",
            "body": "ISO flared yoga pants, like the 2008-2010 style. The VS Pink were a little too small/short. My favorite pair ever were Express. Any recommendations on where to find them now, 15 years later?!",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "queensendgame",
                    "body": "Aerie has a whole flared category of their leggings.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Scared_Parsley2617",
                    "body": "I like Athleta’s! I recommend waiting for a sale",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "Mate the Label has some",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Weak-Classic7161",
            "body": "https://preview.redd.it/jxxe0e1sn81d1.png?width=1133&format=png&auto=webp&s=b7311fc69e565252ba151bf6a33ab4719e45a1ae\n\nThoughts on this skirt? Should I keep or return it?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "osally",
                    "body": "The seaming on the side by your hip seems a bit off and pokes out by the waist. The overall drape is okay (assuming it’s linen?). Id only keep it if I got a deal on it. Otherwise I think you could probably find something better.",
                    "score": 12
                }
            ]
        },
        {
            "depth": 0,
            "author": "beachesatnormandy",
            "body": "I'm losing my mind over trying to find a white t-shirt. I've read all the previous threads on this as well as threads in other subs but am still striking out. Ideally looking for a basic white shirt to wear in the work place. I'm 5'9, 200lbs, 36DD, athletic hourglass frame (wide shoulders, wide hips) generally wear a 12/14 L/XL. Everything is either see through with a nude bra, fits poorly, or does not wash well. I do not mind paying extra for something that meets all the criteria. The closest thing I have found is the COS Clean Cut T-shirt but they do not currently have my size in stock. Any suggestions that I haven't tried, there has to be something our there :(\n\n  \n**Uniqlo Pima Cotton** - The most recommended, wanted to love it but it was see through and is just not made for my body type. L fit in the body, but was too tight around shoulders/armpits. XL was just too big all around. \n\n**Everlane Cotton Crew** - See through\n\n**Madewell** - I do not shop at Madewell because I have never felt comfortable or welcome in their stores. \n\n**Aritzia** - Not made for my body type \n\n**Abercrombie** - T-shirts aren't breathable and look like shit within 2 washes. \n\n**Old Navy** - Quality just isn't there for something I want to wear in the workplace. Looks ratty after a few washes. \n\n**Gap/Banana** - For some reason they cannot make a t-shirt that isn't that heathered pattern which is see through. Love them otherwise\n\n**Target Brands** - Don't love the quality, see through.\n\n**Universal Standard** - Have one of these already, the fit well/aren't see through but it's too fitted in the chest for me to feel comfortable in the workplace. \n\n**SKIMS Boyfriend Tee** - Collar is too high, fabric is too clingy",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "I'm almost those same measurements exactly except 5' 10\". The only tee I've ever fallen in love with is Anine Bing. They're over the top pricey but gorgeous fabric. \n\nYou could try Eileen Fisher and Vince but go for the non cotton slub, that's going to be too sheer. \n\nThe thing about white tees is they're underwear, they were designed for men to wear under button down shirts. So when women wear them, it's tough to not be sheer as they're being stretched. The shape isn't typically designed for a bust. Hence why tees tend to look \"effortless\" on the Jean Seburg types and like car wash yard wear on fuller figures. Sadly.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "beachesatnormandy",
                            "body": "You’ve captured everything ive been feeling about this whole thing so eloquently. Obviously button down shirts were also not made for our body type, so what is the next best thing for a casual light colored top, beige? I’m trying to bring some lightness into my wardrobe which is why I defaulted to the white.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chazzyphant",
                                    "body": "I like a linen or silk shell, preferably with darts. It's a structured piece that feels summery and comfortable but is specifically designed for women's bodies/busts. I also think a loose/open-weave cotton or linen boxy sweater over a same-color tank is a really sophisticated and upscale look as well.",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Tacky-Terangreal",
                            "body": "Dude preach. I want to love button down shirts but they always look weird on me. I have to size up to fit my bust and that results in a mega oversized fit that looks like a tent, as if I stole a large man’s shirt. Like the bottom of the sleeves come down to the bottom of my bust and it makes my arms and stomach look huge\n\nSo many tops nowadays have bust support as an afterthought. Those super wide cut necklines are basically designed to exclude anyone that needs to wear a bra. It’s ridiculous. As if we’re supposed to just wear Mormon or grandma fashion if we’re bigger than a C cup",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "[LL Bean](https://www.llbean.com/llb/shop/504209?page=womens-tees-and-knit-tops)?",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "botanygeek",
                    "body": "Big Bud Press baby tee and Gettees both have nice thick fabric!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "morbidpigeon",
            "body": "Looking for plain, black wrap around trousers for work that don’t expose a lot of leg and come in bigger plus sizes.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "cordialconfidant",
            "body": "anyone know where to get dark brown fisherman sandals under £150? i'm inspired by the HEREU Pescas, but i don't know if i'll ever be able to afford them. i've seen the white stuff fisherman (a bit orange) and the dr martens wrenlie (a bit chunky). is it worth just getting a pair of birkenstocks? it's for a week in italy in the summer",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fart_sandwich_",
                    "body": "I love my Birkenstocks but they were hell to break in. I certainly wouldn’t wear them to walk around sightseeing, especially more cobblestoney streets like Italy. If you want sandals that are good for trekking, I love my Tevas",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cordialconfidant",
                            "body": "damn even post-break in?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "passiveparticipator",
            "body": "Has anyone bought anything from @amoraclothingg on instagram. I thought they were legitimate but now I’m thinking they’re not. Has anyone bought anything from them?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pooppoopshit",
            "body": "\nI just bought my prom dress and it's not the color that I expected I would go for so I'm kinda stumped on what color jewelry, heels, and accessories (e.g. clutch) I should get. The color of my dress is medium red and with a more blueish undertone. The material of the dress is also sparkly but it's also pretty thick and heavy (idk if that changes anything!!) Any advice would be appreciated!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "allbitterandclean",
                    "body": "Pic would help but my gut says gold?",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "january_dreams",
                    "body": "Both silver and gold match red, you can choose either based on your preference or the color of the accessories you chose.\n\nFor heels and accessories: matching red ones, black, silver, tan/nude, white, and navy tend to be the traditional color choices for pairing with a red dress. If you want to be a bit more out there, though, certain matching shades of blue, pink, or even green (not Christmas green) could work. I can see a sparkly, blue-undertoned red dress looking very chic with teal shoes/accessories.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "TrashHistorical3814",
            "body": "Does anyone have the repetto Sophia ballerinas? I’m struggling to figure out how many sizes to size up 🩰🤍",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "Their website suggests sizing up one size from your usual for this model. They use French sizing, and their size equivalence chart for US sizing is (unlike many sites) correct.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TrashHistorical3814",
                            "body": "Ok thanks! That’s what I’ll go by. Hoping that’s enough as have heard some people size all kinds of sizes up 🤍 they’ve been out of stock all month though anyway 🥲",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Opening-Neck5785",
            "body": "Would it be weird to wear a long tight maxi skirt to a club",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "how would you dance in that? might be okay but not practical ",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Opening-Neck5785",
                            "body": "tight but stretchy",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "criticiseverything",
                                    "body": "I still feel it would be restrictive and awkward personally",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Opening-Neck5785",
                                            "body": "true, but i hate showing my legs when i go places and i don’t want to wear jeans either. any suggestions?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Chazzyphant",
                                                    "body": "Palazzo pants! Something fun, light and with a wild print",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Opening-Neck5785",
                                                            "body": "thank you! i think i have a pair of palazzo pants. this is what i was going to wear. i will probably just end up going with the pants instead.\n\nhttps://preview.redd.it/wmnmy8vs691d1.jpeg?width=1242&format=pjpg&auto=webp&s=3bf3ddc6c2724ebc479263c49c67c2de635c2409",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "always_unplugged",
                                                                    "body": "It's super cute! But I agree, that's a posing/sitting down kind of outfit, not a moving around kind of outfit.",
                                                                    "score": 3
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "criticiseverything",
                                                    "body": "culottes, wide leg pants, lots of options ",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "cordialconfidant",
                            "body": "tbh i don't know if it's an area thing but people really don't go wild dancing in clubs anymore, at least not the uk",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "criticiseverything",
                                    "body": "yes, agreed but there’s still some dancing not none so unless it’s a bar there’s some dancing",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "xiphosura666",
            "body": "Looking for a billowy arm shirt or top of some kind to wear with black suede shorts. Tight around belly but bigger arms (no shoulder pads pls)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CardiologistWinter85",
            "body": "ISO of soft pull on shorts (linen or similar) 3.5 inch inseam, mid rise, ideally dolphin hem. \n\nI found some at Maurice’s two years ago but they stopped carrying them and I haven’t been able to find anything satisfactory since, please help!!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "botanygeek",
                    "body": "Not a dolphin hem but Old Navy actually has a nice pair right now!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CardiologistWinter85",
                            "body": "I have some of those and they’re decent but not quite the same fit!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "Lithuania stores on Etsy have great quality linen & they can customize for you!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CardiologistWinter85",
                            "body": "Wow those look nice but unfortunately are a little out of my budget.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "_shYro",
            "body": "Hi! Do you know of any instagram accounts offering advice on dressing for A shapes?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aranh-a",
            "body": "[UK] Where can I buy women’s black smart trousers which have good sized pockets? The ones I have now are from m&s, they look very smart but there’s only 2 side pockets which barely fit my phone. \n\nIt might be because they’re slim fitting, I don’t mind a wide leg, as long as they look smart and have big pockets.\n\nI’m a student so don’t want anything too pricey, let’s say < £30?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Spook-er",
                    "body": "Try uniqlo, I have a pair of their wide leg trousers  and it fits my phone quite nicely. I think they should be roughly your budget.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aranh-a",
                            "body": "Thank you, though I had a look and I thought they seemed a bit overly baggy in the pictures, do they look alright in person?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 2
        },
        {
            "depth": 0,
            "author": "RaeNezL",
            "body": "I’m on the hunt for black and white (primarily) and neutral/colored semi-fitted tees with a straight hemline (no curved/rounded), not cropped, easily tuckable, available online, and not obscenely overpriced. I’d prefer to pay $20ish per shirt if I find good ones. I want to be able to tuck them into sari skirts, if that helps.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "botanygeek",
                    "body": "[Gettees](https://gettees.us/products/womens-easy-crew-hale) are the best!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Tacky-Terangreal",
                    "body": "Cotton on has some that appear to be baby tees, but they’re actually a pretty nice cropped cut that hits the waist at a good spot, even if you have bigger boobs. I picked some up recently in a sale and they seem like pretty decent quality for the price. Not sure how they’ll fare in the wash yet",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RaeNezL",
                            "body": "Thanks! I’m pretty sure there’s a Cotton On store in our local mall I can check out. Appreciate the rec!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "_CozyLavender_",
            "body": "Just found out about the Gap×Doen collab.... Why are women now insistent on dressing like sad farmers wives from the Depression?",
            "score": -12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "Okay I actually have some answers for this. \n\n1: CoVid influence. After the WFH and the focus on just surviving this worldwide trauma, many women are much less tolerant of uncomfortable, restrictive clothing. Or performing \"sexy\" or \"flattering\" for either men or other women's approval. They have found hobbies, changed jobs, had kids, moved to the country, started working from home full time, etc. They no longer have a need or desire for fitted, tailored, twee, \"sexy\", \"flattering\" clothes\n\n2: It's a natural extension of the renewed interest in slow clothing, conscious consumption, homesteading/farmsteading, and the cottagecore/dark academia look/trend. Grand Millennial style was trending recently, and it makes total sense to me that coastal grandma, cottage core, and dark academia (and all its sub-niche aesthetics like mushroom girl, fairycore, etc) are all offshoots of that cozy, old-fashioned, and very much unsexy and functional style. \n\n3: It's not just feminine, it's feminine in a way that actively rejects the male gaze. It's hyper feminine--calico, ruffles, big puffy sleeves, voluminous skirts, etc. With the recent political climate (especially in the USA), I suspect women are embracing these hyper-feminine but not sexy/flattering looks as a very subtle f-u to the powers that be and to compulsory heteronormativity/sexism/misogyny. These looks often celebrate a certain type of strong, interesting femininity that is about the past in a way that's not \"1950s nostalgia\". \n\n4: Fashion is cyclical. If you look at fashion trends from the 80s, and then the 50s, you can see there are distinct girlish, hyper-feminine, cottagecore, church-lady dainty feminine looks (ditsy florals, gingham, lace collars, piecrust collars, circle skirts, shirt dresses) trends that echo whatever \"30 years ago\" was for that time period. Fashion is speeding up, so now we're looking at blending 90s grunge influences with a prairie-chic look that echos the \"colonial\" craze of the mid-late 70s and the \"farm/cottage/rural America\" dream of the 80s.",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zigzagtitch",
                            "body": "I agree so hard with point 3. The amount of Instagram reels I’ve seen with the voice over of the woman saying “men are so mad I’m not hot” is crazy. I love it. I’m actively dressing in a way where I don’t feel like everything has to be flattering or accentuate my figure and yes, my boyfriend doesn’t love it but my friends do! It’s a whole movement and it’s SO empowering. (We should make a post on this.)",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "_CozyLavender_",
                            "body": "Thanks for actually answering ✌️\n\n\nBasically people feel like they've had the life sucked out of them by the stresses of the world and are subconsciously (or perhaps consciously) dressing to reflect that. It's \"a boring dystopia\" made aesthetic.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "P1cea",
                    "body": "Presumably because they like it.",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "_CozyLavender_",
                            "body": "That's the question - why??\n\n\nLike... you DO realize this is ugly, right? And not even fun ugly.",
                            "score": -17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "criticiseverything",
                                    "body": "Do you realize that people can have different tastes? ",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "_CozyLavender_",
                                            "body": "This is the \"beige mom\" of clothes.",
                                            "score": -7
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "Those must have been some slutty farmers wives if they were wearing crop tops in the 30s.\n\n\nIt just seems like fairly basic clothing to me. Summery and comfortable. Not every collaboration needs to be avant-garde, and some of the pieces are pretty fun (the blue midi skirt with the red trim is cute af). I don't really see the hyper-femininity that other people are seeing.",
                    "score": 3
                }
            ]
        }
    ]
}