{
    "title": "Daily Questions Thread May 17, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "am2370",
            "body": "Anyone have any brands/sites I can browse to look like a Scandinavian forest fairy (aside from Free People/Anthro)?\n\nI'm going to see Aurora in concert 2x this year both in autumn/winter so it's hard to find the right kind of boho dress that won't leave me practically naked, but of course I have some time to find an outfit.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "Linennaive? I’ve not ordered from there but I think that’s the aesthetic",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "am2370",
                            "body": "Thank you! Beautiful styles!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dandelionwine14",
            "body": "Does anyone have ideas about how to adapt a more “glam” personal style to a very casual lifestyle?\n\nI like details like satin, sparkles, lipstick, puff sleeves, etc., but I’m a stay-at-home mom of toddlers about to buy a house with land where we may get chickens and stuff!\n\nLike if I just wear a tshirt, jean shorts, and sneakers/birkenstock sandals all the time, I won’t feel like myself. But I also can’t wear fancy blouses and ballet flats running around outside with my kids all day!",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "DiagonEllie",
                    "body": "Maybe try going for some silhouettes you like in more practical fabrics, like puff sleeve dresses/tops made of cotton or linen, which will be comfortable and washable in the event of caring for chickens etc. You can also add sparkles and other textures in via accessories (jewelry, headbands, etc.), which are less likely to get damaged and can be temporarily removed for periods of messy activity. And remember, your kids will soon be old enough for you to safely wear silk and sparkles around them at least some of the time, and in that case, if a more country lifestyle is the concern, you can always throw a smock or sweater over a nicer outfit for chores and/or wear more fun tops with practical bottoms. And replace the ballet flats with boots maybe. \n\nYou could also try leaning into fancy countryside looks, like equestrian inspired, if you're into that.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "WillowNomad",
                    "body": "I wear lipstick and puff sleeves at home with my kids all the time. (I would wear sparkles if I liked them!)\n\nIf I'm doing yard work I wear wellies or Doc Martens.  With my same clothes still on.  An apron if I'm cooking or cleaning.\n\nIt's been 8 years of this, four babies during that time, and no regrets.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "PaulaLoomisArt",
                    "body": "Sounds like jewelry and lipstick might have to do some of the heavy lifting. You could also look for basics in the cuts that you like, like a top with little puff sleeves and an interesting neckline but in a cotton blend. Try to also stick with whatever color palette makes you feel like yourself… if you don’t wear brown, don’t get brown shoes because they’ll feel off. Get black or navy (or gold!) or whatever you’d normally go for. Even if you’re getting that color in a style of shoe that you wouldn’t normally wear, getting it in a color that you like will bring it closer to your personal style. Same with jeans… maybe you don’t normally wear jeans so typical blue denim feels off. So don’t get blue denim, get some white denim and dye it whatever color you’d actually wear. Cotton takes dye really easily, so don’t let dying things be intimidating!",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "kimchi_paradise",
                    "body": "\"But I also can’t wear fancy blouses and ballet flats running around outside with my kids all day!\"\n\n\nWell, I challenge you to ask yourself, why not? As a mom, you don't necessarily have to relent yourself to the T-shirt and leggings uniform!\n\n\nOne of the things I had to come to terms with as a mother is that I have to be comfortable with nice clothes getting washed more often because of kids. Once that was something I got comfortable with, I was able to open myself up to wearing nicer clothes. \n\n\nYou can also explore the cut of clothes without sacrificing comfort, such as more athletic fit ballet flats, mock neck or cropped tees or loose linen tops instead of t-shirts, and wide leg jeans instead of straight or skinny. You're still on trend, but don't have to give up comfort or functionality. Plus, investing in making sure your clothes fit properly can make a whirlwind of a difference.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Imaunderwaterthing",
            "body": "Have you bought a belt recently that you love? I just want a couple decent quality leather belts to hold my pants up.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Idujt",
                    "body": "Don't forget men's!  Probably better quality, cheaper, and plainer, than women's.  If you need extra holes put in, think a cobbler/shoe repair can do it.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Imaunderwaterthing",
                            "body": "Great idea!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Etsy has some great leather workers making quality stuff for way cheaper than commercial brands, could be a good place to look too.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "NoHistorian7234",
                    "body": "There was a fun roundup of them here: https://elizcardinal.substack.com/p/one-accessory-you-need-for-silhouette?utm_source=profile&utm_medium=reader2",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "BigfootBish59",
            "body": "Does anyone know where to get a similar shoe to the Vans Mary Jane? I think this sooo cute but it squishes my pinky toe 😭 \nI've never had vans so idk if they loosen up over time or if there's a way to stretch them out a little, or if I should just return them ?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "they look like they are made of fabric, I don’t think it would stretch very much - if it was leather then maybe it would a bit",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BigfootBish59",
                    "body": "https://preview.redd.it/kpxdzvsm601d1.jpeg?width=2992&format=pjpg&auto=webp&s=a8c278f7c0e84dc5fa50df5868e63cbc9e3723ab",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BigfootBish59",
                    "body": "https://preview.redd.it/h0csjxys601d1.jpeg?width=2826&format=pjpg&auto=webp&s=67fc13fadffc6fabf1f346cc8754c66193975b6f",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Charming-Target6617",
            "body": "Hi everyone,\n\nI struggle with confidence about my appearance and could really use some advice on transforming my wardrobe. \n\nI'm 35, 5'4\", and weigh 64 kg. I always find myself waiting to lose weight before wearing certain styles or outfits, and I'm very conscious of my arms and belly looking flabby. I often feel self-conscious, sticking mostly to joggers and hoodies, with long sleeves. I also think I lack creativity in styling and often end up with ill-fitting clothes. \n\nThis year, I've decided it's time to invest effort, time, and money into changing my wardrobe, but I need the confidence to get there. Can anyone suggest how I can:\n\n1. Find styles that suit my body type?\n2. Build confidence to start wearing new outfits like noodle straps or cropped blouses?\n3. Make better choices when shopping for clothes?\n\nAny tips, resources, or personal experiences would be greatly appreciated. Thanks in advance!",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Make a pinterest board of outfits you like! When I do this I usually pin everything that catches my eye. Then I make a second board that’s more curated to outfits that I can actually see myself wearing. Whole outfits are great because you can see how other people style and pair their clothing together. And you can also go through and pull out common items - maybe a lot of outfits have a white linen button down, so that would be a good first purchase. \n\nFor figuring out what suits you - go shopping in person to a store/several stores where you can try on a lot of clothes. Try on a lot of things, especially things that you don’t think will work on you (because sometimes you’ll be surprised). Take pictures and notes of what worked, if you tend to do more online shopping, it might also be helpful to take measurements of what fits and what doesn’t. The aim isn’t to buy anything here, it’s research to see what silhouettes and styles you like.\n\nYou can keep refining your pinterest board after that - if you find you prefer slimmer trousers, unpin wide leg trouser fits. Over time you want a curated board that you can use to define your style. \n\nGo slow with more revealing styles, there’s such a huge gap between a hoodie and a crop top. If you buy something and try to bully yourself into wearing it, you’re just going to feel less and less confident. Long sleeve button downs and short sleeve blouses (not cropped) are a great way to start. If you love your new blouses, then maybe take a step for a sleeveless one, or cropped one. You might also find that you don’t enjoy those styles for practical reasons, and that’s totally fine (for example, I’ll never wear anything that shows my belly, because my belly gets cold).",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "1. That's mostly trial and error, probably. Keep in mind that you can only add volume in clothes, not take away. So if you're self-conscious about your shoulders being too wide, you can balance it out with volume around your hips. If you want to elongate your legs, high-rise pants with hems that drag on the ground will do that. On the other hand, to shorten your legs, low rise and/or cropped pants are good. That type of thing.\n\n\n\n2. I think you just have to accept what your body looks like. No piece of clothing can change your body's shape other than shapewear, you'll look the same whether you're wearing sweatpants and hoodies or a strappy dress. For me personally, what helped with this was leaning heavily into fashion - I focus on making outfits that look cool and trendy, not on outfits that make me look hot or like I'm 10 kg lighter. Maybe something similar could help you too, to think of your body as just a place to put your clothes vs. the entire focus of the outfit.\n\n\n\n3. The best thing to do is to buy stuff slowly. Start with a few pieces you really like, wear them a few times, see how you feel. Making a Pinterest board or people watching and analyzing outfits is not a bad idea either, just to figure out what kind of stuff you like. Consider practicality, like which parts you're comfortable showing, whether a piece of clothing is comfortable, whether it fits into your lifestyle, and especially with pants and skirts, whether you can wear normal underwear under it or have to go for seamless thongs.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "Start by deciding what parts of your body you are comfortable with and want to “show off”. I.e. for me that’s my waist, it’s very defined so I like silhouettes that show it off. I have narrow shoulders so I wear things to make them appear wider, I have a big butt so I wear muted bottoms, etc.\n\nNext, try to look into r/coloranalysis this will help you decide what colours look good on it based on your features and hair, etc.\n\nStart a pinterest board on looks that you like and match your body to see what you want to mimic, you’ll see a pattern arise where you can narrow down styles you like.\n\nTo start with some suggestions, I think wrap dresses are great at hiding belly.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ace_Falcon_",
            "body": "I'm petite and I have a feminine figure, but I want to wear more androgynous clothes. My skin is very sensitive so I tend to wear long sleeves and pants. I love wearing high waisted pants with my shirt tucked in. \n\nI would love to dress more professional and my fashion inspiration for this would be Jane from The Mentalist, he wears casual three piece suits in a very casual way that have some textures to them. I would love to wear casual three piece suits, with color and texture. I like the layered look of men's suits, all the vests for women I see are either very loose cut or shown without an undershirt. I want a more tailored look if that's possible.\n\nI just have no idea of where to look and if I should even be looking at women's suits.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "For inspiration I would recommend checking out r/darkacademia. They are also discussing light academia and summer looks right now.\n\nFor fitted vests that you can wear shirts and blouses underneath I would look in the vest section of thrift stores. A lot of the major mall brands have done vests in the past.\n\nAritzia has a ton of styles right now but you need to just ignore the way they are styled on the models.\n\nHere are some vest looks I’ve done recently with shirts. The left one is from Dynamite, a Canadian mall brand. Top right is a second hand aritzia babaton deniro vest. Bottom right is an unbranded thrift store find.\n\nhttps://preview.redd.it/3cjoncz1111d1.jpeg?width=1920&format=pjpg&auto=webp&s=9629f9c2f8a5b4acf1f8da6f16c89fcd914e616b",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fir6987",
                            "body": "Your outfits are great! I abandoned vests awhile ago because they felt too stuffy on me, but you’re making me want to try styling them again!",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "thenfacetoface",
                                    "body": "Thank you! I never thought I would be a vest person but I was watching a pirate show and it gave me so many more ideas",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "symphonypathetique",
                                            "body": "I love these fits, and I absolutely adore \"everyday pirate\" fashion.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Check out Wildfang, Kieran Finch, and Arabecca.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thenfacetoface",
                            "body": "I love these suggestions",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "maybe try theory?",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jolly-Ad-1900",
            "body": "2000s bootcut jeans/trousers brands\n\nCan you recommend a list of good denim and pants brands from the 2000s that have great bootcut low-waisted styles? (For both casual/going out wear and office)\n\nLooking through eBay for them, the only type of style that is flattering.. thank you in advance <3",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "always_unplugged",
                    "body": "7 For All Mankind, True Religion, Joe's Jeans, Lucky Brand, Hudson",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "bittybro",
                    "body": "If you can get the original late 2000s Gap Perfect Bootcut, they were indeed perfect. Beware though, at some point later Gap made another version called the same thing, but the fabric content was different. The originals were either 99 or 98% cotton, 1 or 2% spandex, NO polyester.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "freewool",
                    "body": "Lucky and Guess",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "Miss Sixty, Roberto Cavalli",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Jolly-Ad-1900",
                    "body": "Thank u all <3",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Purple-Associate5695",
            "body": "https://preview.redd.it/guaxlu8lv21d1.jpeg?width=1170&format=pjpg&auto=webp&s=7a619e67a5ea4d25f61a1f206a9c28a16836808c\n\nWill this dress work for a 5 pm May outdoor wedding with cocktail dress code? On me it comes to right above the knee. I'd pair it with sparkly shoes & accessories. I'd get ripped to shreds posting on the wedding attire approval sub, so posting here instead lol. But be honest! TIA!",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Diligent-Pineapple-2",
                    "body": "I feel like it’s not structured enough, the fabric looks quite soft and flowy, so it’s giving t-shirt dress. The one you posted just below is lovely and in my opinion, more appropriate. ",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Purple-Associate5695",
                    "body": "What about this one?\n\nhttps://preview.redd.it/d12yjl0n231d1.jpeg?width=1170&format=pjpg&auto=webp&s=d07836517c00e795a4b631ae25197f0a1adc4c09",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "75footubi",
                            "body": "This is definitely the better choice.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Purple-Associate5695",
                            "body": "Just realized this would not be able to be shipped to me on time, so it's out 😩",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "Ooh, I feel like that's really casual. If you suspect that the wedding attire sub will \"rip you to shreds\" I wouldn't ask a bunch of 22 year old's who've attended 1.5 weddings, half of which were as children, heh. Not to be harsh on the typical commenter here, but the crowd is really young. \n\nThe length, material, sleeves, color, it's all reading very casual and daytime to me. Cocktail is shimmer, sequin, beading, satin, velvet, silk, things like that. Also the lack of structure (it's not a super-mini bell shape or other very intentional \"sack\" dress, it's just a shapeless dress) is reading as very casual too.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Purple-Associate5695",
                            "body": "Thanks! It's under the \"cocktail dresses\" section of this store's website, so I thought it could work if I dressed it up with accessories! Also, I posted a picture of a black & a navy dress, and I got responses on that sub that the \"color is too depressing for a spring outdoor wedding\".  So I was trying to go for a better color. I appreciate your advice!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "I feel like it’s fine but I would probably be cold where I live.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Purple-Associate5695",
                            "body": "Thanks! It will be in the mid 70s there, so I think it will be ok.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "womanphd",
            "body": "Is there anything I can practice yoga in that won't reveal every inch of my shape? I've tried t-shirts and sweatshirts etc. but everything just falls in my face or reveals my whole midsection when I do some of the most common poses. I generally practice in the same outfit as everyone else at my studio—Lululemon Align tank and tights—but I feel self conscious some days, especially if I'm bloated.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "LavishnessOk9727",
                    "body": "What about harem pants that are fitted at the waist and ankle but loose in between? And you might be able to tuck in a t-shirt, too!",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "womanphd",
                            "body": "This could work! Thanks!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Yep. It’s not like Spandex is traditional in India.\n\nExamples for inspo:\n\nhttps://isha.sadhguru.org/yoga/yoga-for-beginners/yoga-clothes/\n\nhttps://www.unidraa.in/collections/yoga-wear\n\nOr just wear whatever loose tee and drawstring bottoms you have. Tucking or slightly fitted helps keep the tee from falling in your face.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "womanphd",
                            "body": "Thank you, this is so helpful!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cyborgfeminist",
                    "body": "I find the align leggings way too revealing, plus they don't stay up for me. I like wearing a slightly compressive running legging, Lululemon has some of those, too.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Maybe track pants or light joggers, and tuck in the tshirt",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "always_unplugged",
                    "body": "The new Wunder Trains are a little more compressive than Aligns, but still light and stretchy! I have a pair and I love them. Looser harem pants are a good idea, assuming the bottom band stays put—I've been curious about [this brand](https://www.buddhapants.com/). I've worn some that ride up when you kick, which is still super annoying!\n\nBut yeah, I've had the same struggle as you and just accepted that fitted is generally more functional, especially for tops. I was worried about wearing more revealing stuff for a long time, but I started paying attention to what other people at my studio wore—we have people of every size and shape practicing in just a sports bra and shorts, and nobody cares. I'm still not comfy going full-on sports bra only, but tanks with built-in bras (like Align tanks), long-line bras (Lulu Wunder Train, Alo Movement), and lightweight fitted crop tops are my go-tos.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "cyborgfeminist",
                    "body": "I find the align leggings way too revealing, plus they don't stay up for me. I like wearing a slightly compressive running legging, Lululemon has some of those, too.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "criticiseverything",
            "body": "looking for quality floral tops & dresses -specifically linen & cotton",
            "score": 2
        },
        {
            "depth": 0,
            "author": "GalinToronto",
            "body": "I am 5’3 and looking for a dress for my best friend’s wedding on Canada Day weekend. I want something that is long and elegant but not heavy or dark. I have gone thrifting every weekend so far this year and found some great stuff but it’s always too heavy fabric, too dark, stained, cheap, too short, too big… I was thinking a light floral, but darker colours look better on me - I’m pale with grey blue eyes and brownish blonde hair. The bridal party is wearing purple so I was thinking something in a lighter blue or pink would be great. Already have a cute mint bag and sparkly silver heels that I would like to pair my dress with. Any suggestions for stores I can look at? I would prefer to try on in person and I hate itchy cheap polyester. My budget is $200 CAD. The dresses I’ve loved so far are Ever New but I’m not digging their online options. I’m in Toronto, Canada.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "What about Lulu’s? ",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Doesn't Le Chateau still make dresses? That would be my go-to",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "notabigmelvillecrowd",
            "body": "Where are the pear and hourglass ladies buying your denim shorts this summer?  I have a pair from abercrombie's curve line, but they're still crawling up my butt and loose in the waist.  I've tried jeans from everlane and they're *too* curvy for me, I only have an 11.5\" ratio, and they're more like 14\".  I have thick upper thighs, too, so anything with a cuff is out.  Not sure where else to look, I can never buy denim shorts!  I haven't had a good pair in like a decade.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "chili_eater20",
                    "body": "the A-line everlane short is perfect for me! it's not branded as curvy, but fits well on me w an 11-12 inch difference in hip/waist. i wear a 2 curvy at abercrombie and a 0 in the everlane shorts.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "notabigmelvillecrowd",
                            "body": "Actually I tried those ones too, haha, they didn't work for me!  I feel like I've been everywhere on this search.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PARADOXsquared",
            "body": "I recently bought a jumpsuit from a \"vintage\" shop on Etsy, to wear to my friend's wedding. What are some ways that I can style this to make sure it feels polished enough? The dress code is Black Tie Optional. I sent the model photo from the listing to my friend, and he said it's a great choice.\n\n[https://imgur.com/a/iVe1uss](https://imgur.com/a/iVe1uss)\n\nIt's probably my height, 5'2\", but something feels off? I'm hesitant to get alterations because this is actually my back up option, after alterations on my 1st choice made it feel more casual somehow.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "always_unplugged",
                    "body": "It's awesome!!! I agree with your friend, it's a great choice.\n\nI think the thing that's off in the fit is the waistline—I feel like it's hitting you slightly too low and so the blousey-ness is actually adding volume at the narrowest part of your waist. I think a large belt that echoes the shape of a traditional cummerbund could solve any problems AND add polish and intentionality to the outfit. Inspo/ideas: [one](https://bananarepublic.gap.com/browse/product.do?pid=785079012), [two](https://poshmark.com/listing/Womens-Beaded-Black-Cummerbund-Belt-6515be0fa0aeb7ec5f65cef2), or for something slightly different, [three](https://us.boohoo.com/metal-chunky-waist-belt/GZZ05886-128-35.html). Or something like [THIS](https://www.amazon.com/YALEMEI-Women-Cute-Elastic-Waist/dp/B07SQX3F43)! Could be a super fun nod to the \"tie\" part of the black tie dress code, since you're not going to be wearing an actual bow tie (I assume).\n\nBut honestly, it's already fabulous as is; I'm only nitpicking because you asked!\n\nAs for styling, I would do some really sleek pointy-toed pumps—you could go black or use this as an opportunity for a pop of color—and metallic jewelry (nothing blingy). I LOVE your locs; I think doing a little bit of a style like [this](https://hairaide.com/wp-content/uploads/2024/01/Untitled-2_0008_IMG_6339.jpg.webp) or [one of these](https://www.pinterest.com/pin/3307399717911101/) (especially #2, 3, or 5!) would help them (again) look intentional and therefore add some polish.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PARADOXsquared",
                            "body": "Thanks the cummerbund idea and examples! I felt like the waist area felt off but didn't have good ideas for how to fix it. \n\n\nI had a couple ideas for my locs, but I love the options you shared too. ",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "I like the idea the other commentor suggested of a belt to better define the waist.\n\nI'd also add a chunky/sculptural piece of jewelry, bracelet probably.\n\nI love the jumpsuit in general though and think it's a great choice!",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "chinchin_200",
            "body": "Tomorrow is my graduation ceremony, it an academic act. It starts at 18:00 which is still pure daytime were I live as sunset is at 21:45. Do you think a black midi dress is too dramatic or is it appropriat? Thank you in advance! (It is worth mentioning that we don’t ware caps and gowns)",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "mmkingsy",
                    "body": "I think it's appropriate!",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "funny_fox",
            "body": "Has anybody tried the Vivaia shoes? Are they comfortable and breathable?\n\nI'm interested in the Aria style.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "I haven’t tried them but I’ve heard they aren’t great. I personally wouldn’t pay that much for plastic shoes.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I have the original flats. I heard they have gotten better with the newer tech they adding, but I agree that they are not worth the price tag. \n\nI enjoy mine because they are easy to slip on and off and you can throw them in the wash (I tried it in a net bag and it does work). Also I got them second hand. \n\nI don’t think the arias are machine washable but they are wipable. \n\nBut they are basically just soft/smooshy. \n\nCannot comment on the Mary Jane’s or the boots or other styles.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "funny_fox",
                            "body": "That's unfortunate, I need new flats that are breathable and comfortable.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "Let me warn you: the flats have an ULTRA rigid back of heel. They shredded my heels so badly they bled in like 20 minutes. I was enraged. The rest of the shoe is incredibly comfortable, I was really, really bummed out. I am shocked that a so-called comfort shoe would have a plastic, rigid back-of-heel.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "funny_fox",
                            "body": "Thanks for the warning! That makes me sad, I always have problems with that area already, I definetly don't need rigid shoes. But don't they advertise it has an extra padding on the back of the heel? Or you mean even with the extra padding they're still rigid.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chazzyphant",
                                    "body": "The inside back is padded but the top uppermost outside edge (which still touches one's heel) is literally plastic and hard as a rock. I have no idea why they'd do such a thing, it baffles me. This may not be the case on all their styles, but I was SO upset. I found a NWOT pair in the thrift store and perhaps they were a half size too big? But I tried them on and they felt amazing while doing the try on, I was so excited. I thought I'd finally found a comfortable walking flat. NEWP.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "funny_fox",
                                            "body": "Oh sad news!!! RIP your heels!!! What's your favorite flat?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Chazzyphant",
                                                    "body": "I don't wear ballet flats for this reason, heh. Flat shoes I'd say mules from Mercedes Castillo or loafers from the same brand. But they're not a washable comfort shoe by any stretch of the imagination.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "wineninjaa",
            "body": "Help! Flat feet, hammer toes need shoes I can interview or go to work in!\n\nI’ve got hammer toes, bunions, collapsed arches, flat feet. I broke my right foot in the past which also messed up my ankles. I know I need wide toe boxes. I usually wear slightly oversized shoes to get that comfort I need. I usually just wear athletic sneakers and do best in sneakers with tons of cushioning, or slingbacks, or strappy sandals with less material because my ankles bleed easily and I have all sorts of bones sticking out everywhere.  I need nice shoes to interview in but ballet flats look terrible on me (bc of my collapsed arches), and when I wear things like loafers they don’t fit right bc I need them big and wide but then they are too long on my foot and slide off/have a huge gap behind the heel. When I buy things that look nice but are uncomfortable I end up limping after 20 minutes. Anyone have any suggestions? Help!!! 😭😭",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "criticiseverything",
                    "body": "I recently got Poppy Barley’s mary janes in wide, they for sure have no arch support but a very generous toe box and the interior is soft suede, very comfortable!\n\nVionic in wide are great for both arch support and toe box & look cute!",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I’ve been seeing a lot of ads for Empress in terms of a wide toe box.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "why_do_i_think",
                    "body": "I realize not the answer to your question but your insurance might be able to cover custom orthotics that you can slip in if you see a podiatrist about it. If you haven't done it yet, PT can help too. As someone else with flat feet.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "scope_levels",
            "body": "What stores are selling cute sundresses this year?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "morecookiespls",
                    "body": "there was a recent thread posted about it [here](https://www.reddit.com/r/femalefashionadvice/comments/1crgkeo/sundresses_2024/)!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Diligent-Pineapple-2",
            "body": "I’m still looking for a pair of cute, low heel, daytime appropriate sandals for the summer. I love these guys from Loeffler Randall, but they only come in white. I wanted to ask you if you find these read as too bridal?? Link:  https://loefflerrandall.com/products/aria-pearl-organza-heeled-sandal",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "always_unplugged",
                    "body": "Those are gorgeous, but I think they're a little fancy for casual/daytime wear! I don't think the color is an issue, but the satin reads very formal to me.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Diligent-Pineapple-2",
                            "body": "Yes, I now see what you meant about the satin and cannot unsee it 😭 ",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Your link is broken btw!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Diligent-Pineapple-2",
                            "body": "Thank you so much, fixed it now - I think! ",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "They look super cute! I think they’ll come off as bridal if you wear white dresses (even casual ones), but if you’re wearing different colours I wouldn’t think bridal at all.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EnsignEmber",
            "body": "I'm going to nashville next weekend and would like outfit ideas/tips! I sprained my ankle recently so I will have to wear an ugly brace and sneakers, so no sandals or boots for me (rip). I usually dress pretty casual but I've been really into cottagecore (and adjacent) styles, florals, stuff like that. But I also know that it's usually a big deal for tourists to visit and dress more western/boho there. \n\nI also don't like crop tops or short skirts, just a personal preference for myself",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "intessen",
                    "body": "My style leans more towards 'y'allternative' than true 'country' or 'cottagecore', but here's some ideas.\n\nBandannas/Handkerchiefs: as hair accessories, looped through belt loops for a pop of colour, tied around the neck for a choker or looser as a little tie. I'm such a fan of bandannas as accessories. [Handker](https://handkerbandanas.com/) and [Sendero ](https://senderopc.com/collections/bandanas)Provisions both have lovely ones, Handker is more cottagecore/florals and Sendero tends to be true Western. \n\n[Sendero Provisions](https://senderopc.com/collections/womens?page=2) also has some women's wear that is Western influenced. Think denim-on-denim, Western rodeo shirts, etc. You could grab a piece or two or use it as inspo.\n\nJeans and a t-shirt are always acceptable, imo. Boot cut is a farm staple. Add in a flannel in the evening or wrapped around the waist. If you have a specific artist you are going to see or are a fan of I'd say grab one of their merch shirts and wear it. I personally find the ['this is my first rodeo'](https://www.etsy.com/listing/1624466848/vintage-style-my-first-rodeo-western-t?ga_order=most_relevant&ga_search_type=all&ga_view_type=gallery&ga_search_query=this+is+my+first+rodeo&ref=sr_gallery-1-15&pro=1&sts=1&content_source=63566c4110abcd2ac6b631ffe9da061879a53b4b%253A1624466848&organic_search_click=1) shirts funny and would be kinda cool to wear to Nashville. They'd go well with jeans and an old work shirt or flannel on top.\n\nWestern wear shirts like those from [Colores MBoutique](https://www.etsy.com/shop/ColoresMboutique?ref=usf_2020) stand out (maybe in a bad way as a tourist) but are lovely. [Impressions, ](https://www.shopimpressions.com/)and [Jessa Kae](https://jessakae.com/collections/sun-dress) both have dresses (and some other items) that might be what you're looking for. [Vetch and Clover ](https://www.vetchandclover.co.uk/)is more pure cottagecore but can be styled more casually or dressed up. I think they wouldn't arrive on time, though.\n\nOverall, I think just picking up some Western or similar accessories would be the way to go since it seems like your trip is quite close. Bolo ties, handkerchiefs, maybe a  hat from [Neon Dancing Cowboy](https://neondancingcowboy.com/), flannels, and so on. Hope that gives you some ideas!",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "always_unplugged",
                            "body": "Living for the term “y’allternative” 😂",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Savage_Kween",
            "body": "Is it advisable to get clothes \"taken in\" (made smaller) after losing weight as I can't afford a new wardrobe",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "It depends on what you want altered and how much alterations cost in your area - it might come out to as much or more as buying a new wardrobe unless alterations are super cheap or you only want a few easy alterations.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Savage_Kween",
                            "body": "Thank you for your response ♡",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "I think it would be worth doing that for the clothes you already have and love! Finding new clothes that you like takes a lot of time and a while to build. Also, it’s more sustainable to get them tailored instead of buying all new",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "mmkingsy",
            "body": "# Which color silk skirt works best with my vacation wardrobe?\n\nHi All - I really want to get a silk skirt from Quince but I need one that works best with the existing shirts/tops I have because I am purchasing it for a long vacation so all my clothes need to mix and match. My tops are mostly whites (creams, ivorys, sand), black, and browns (beige, tan, chocolate brown, etc.). I have a few colorful tops but will pair those with my white linen skirt and sand linen pants. I'm thinking either basil green, moss green, or forest green but open to other ideas.\n\nHere's a link to the skirt options: [https://www.quince.com/women/silk/silk-skirt?color=basil-green&gender=women&tracker=collection\\_page\\_\\_women%2Fsilk\\_\\_Dresses%20%26%20Skirts\\_\\_1](https://www.quince.com/women/silk/silk-skirt?color=basil-green&gender=women&tracker=collection_page__women%2Fsilk__Dresses%20%26%20Skirts__1)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "intessen",
                    "body": "Personally I think the forest green but I also simply love that colour. I wear a lot of brown/black/green and it's always a forest green or adjacent shade.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "always_unplugged",
                    "body": "I love the forest green too, but I think moss green says *vacation* more to me! Keep the color palette light and breezy. Although I do think the basil green would function the best as a neutral, so if you want the option of pairing your colorful tops easily with this skirt too, that would be a good choice.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I think you can’t really go wrong but personally I like the moss; I agree with the other responder who said it looks more summery to me.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "stumpykitties",
                    "body": "Ohhh the basil green is stunning! \n- The other two colours are beautiful as well - I’m personally drawn to basil. I have a skirt from Aritzia in a very similar shade, so I’m biased.\n\nMoss feels the most “summer” vacation to me. It’s more of a soft pastel, and seems to be neutral.\n\nBasil feels like a good middle ground all-season colour because of its warmth and vibrancy.\n\nForest feels a bit more formal with the cooler darker tone, and could be a bit dark for a summer look?\n\nI’m torn! I would suggest - pick the undertone that works best with your wardrobe, both for vacation and your regular wardrobe so you can get more mileage out of it.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "DiagonEllie",
                    "body": "I'm going to add another vote for forest green, it just really works for me.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "oreganosally",
                    "body": "I say Basil (warm medium green IMO) or Moss (neutral spring/summery light green). Forrest is a little too dark and cool which gives fall/winter vibes.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "silver-_-richards",
            "body": "Would this be where I ask this? Also sorry it's a bit long...\n\n But I got invited to my boyfriends graduation yesterday and now it's in 3 days... Yea.  so what would you wear?? He told me yesterday and 'm sorta freaking out because it's such short notice....  I am honestly not quite sure if it's a masters ceremony or just a regular bachelors or if that even matters but if he wants me to come I want to be ready. But any advice would be great I guess in general my style is more conservative as possible  but I do wear a lot of tennis ao jeans  skirts if that helps I have a few dresses too but there's going to be a lot of people there and he dose come from a  slightly more conservative culture. so any help would be amazing!\n\nAlso I'm not sure if I can ask this here but what would you give someone graduating I have never actually been to a collage ceremony before and I'm very socially awkward with these types of things so what would be appropriate I guess when both me and him know I only have about $70 of my own money in my bank account at the moment...",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "always_unplugged",
                    "body": "You don't know what degree your boyfriend is getting...?\n\nAnyway, you probably already own something that will work. A nice dress is fine; think something that you might wear to church. A reasonable neckline, somewhere around knee length, nothing bodycon. Sleeveless is probably fine, although I would suggest having a sweater or jacket that works on top of the dress just in case the venue is air conditioned or you want to cover up further.\n\nAnd you don't have to get him a gift at all if you don't want to—I know people do things differently, but I certainly never got graduation gifts from anyone but my family. A card is fine, maybe something small and personal if you can come up with an affordable idea in time. Usually it's something that marks their transition into a new season of life—so like, for my high school graduation, I got a Tiffany keychain from my aunt (because I would be moving out and going off to college) and my own set of matching luggage (for traveling) from my parents. My grandparents just gave me money. You don't need to stress about it.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "silver-_-richards",
                            "body": "For me though I feel like longer sleeves is better one would jeans work if the top has to be shorter? I don't usually don't  like showing you too much at the same time.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "always_unplugged",
                                    "body": "What...? Yes, of course you can cover up more if you want to; it's a graduation, not Coachella. And no, jeans are not okay, but I have no idea what you mean, the top \"has to be shorter\"...? Nothing HAS to be short.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "silver-_-richards",
                                            "body": "I guess what I meant was it the bottoms are shorter then the sleeves would have to be longer if that makes sense. But I woulds want to underdress",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "always_unplugged",
                                                    "body": "Like I said,\n\n> I would suggest having a sweater or jacket that works on top of the dress just in case the venue is air conditioned ***or you want to cover up further.***\n\nI guess I'm just confused what the issue is here. You can be as covered up as feels comfortable; that doesn't inherently mean you'll be underdressed. Showing skin ≠ dressed up. I suggest you go to Pinterest and check out modest fashion or even hijabi fashion to get some outfit inspiration; fashionable hijabis absolutely slay without showing an inch of skin.\n\nExamples of completely covered outfits that would be perfectly appropriate:\n\nhttps://www.nordstrom.com/s/free-people-perfect-storm-smocked-eyelet-long-sleeve-maxi-dress/7676609\n\nhttps://balticborn.com/products/rebecca-maxi-dress-blue-coral-blossom?variant=41732570710181\n\nhttps://www.pinterest.com/pin/570690584047613179/ (obviously tie or tuck in the shirt instead of the weird thing the model is doing)\n\nhttps://i.pinimg.com/474x/e7/6d/8e/e76d8eee05122ca8035d800c0a879d84.jpg\n\nhttps://www.pinterest.com/pin/210543351396862362/\n\nhttps://www.marieclaire.com/fashion/news/g3060/muslim-women-style-fashion/\n\nhttps://www.instagram.com/reel/C6gMI9NyyIe/\n\nhttps://www.pinterest.com/pin/1100285752704783777/\n\nhttps://www.pinterest.com/pin/210543351366976447/\n\nhttps://www.pinterest.com/pin/30891947438686445/\n\nhttps://www.pinterest.com/pin/203506476905552765/\n\nhttps://www.pinterest.com/pin/798826052667276041/\n\nhttps://i.pinimg.com/736x/02/20/57/022057bfe936fceb47b735f710ebad75.jpg\n\nhttps://www.pinterest.com/pin/388224430397103589/",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I think that depends entirely on whether you like the fit of them or not.",
                    "score": 8
                }
            ]
        }
    ]
}