{
    "title": "WAYWT - May 19, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "LavishnessOk9727",
            "body": "[some spring-ish outfits](https://imgur.com/a/Bd9ovuV)\n\nI’m trying to remember to photograph my outfits, ironically I’ve missed most of the special ones (I’ve been to a wedding a few concerts lately) because I was trying to get out the door. These are all attempts to make my casual, wfh, toddler-minding life cute and fashionable.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I’m so fond of the multicolour jumpsuit! What eclectic style overall in the album and it suits you so well",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LavishnessOk9727",
                            "body": "Thank you!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Chazzyphant",
            "body": "Denver area, 45\n\nStyle is urban, unexpected, and vintage. \n\n[Album here](https://imgur.com/a/week-ending-may-19-qdmjj11)\n\nLooking at some of these, I'm wondering if maybe open toe shoes just aren't the move for me. I feel like my feet look so terrible--it could just be winter feet, the angle, they're swollen at the end of the day, but I feel like they look like medical illustrations of a condition! I don't want to be someone who has to \"hide\" part of their body but at this point, I don't even know anymore! \n\nLeaving that aside, I've been trying to set my hair in Velcro rollers every day for a \"90s blow out\" look (if it's not pulled back) and I'm really enjoying the results from that.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "StylishhhGambino",
            "body": "Another accessory post! I was gifted these beautiful Elizabeth Cole earrings for my birthday, and it gave me an idea for a photoshoot. Hopped in front of the camera for this self-styled shoot with the earrings front and centre. \n\n\nhttps://preview.redd.it/nmqzvfe9uf1d1.jpeg?width=3397&format=pjpg&auto=webp&s=bf863f14580012c8e63096b29679a46d40c13539",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "morecookiespls",
                    "body": "the soft lighting, the florals, this is gorgeous! thank you for sharing with us 🌸",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "StylishhhGambino",
                            "body": "Thank you! Fashion and photography are two of my biggest interests, so it's always nice when I can mix the two. :)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sexysmoothfig",
                    "body": "They look amazing! Your username is very fitting",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "StylishhhGambino",
                            "body": "Thank you. :)",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}