{
    "title": "Wear & Tear Maintenance",
    "comments": [
        {
            "depth": 0,
            "author": "fir6987",
            "body": "You can usually catch snags with a needle and thread and pull them to the inner side of the garment (if it’s a thicker sweater, you can tack it down with a couple tiny stitches too). \n\nI try to treat stains right away (I’m at home 99% of the time so I’ll spot clean with soap/water). If it’s still stained, I’ll treat it with a stain remover before throwing it in the wash. \n\nI think some items, like a basic white tee, will eventually get too stained/dingy to wear in public and you might need to replace them on a more frequent basis than black tees for example. But that doesn’t necessarily mean toss - you can keep them as housewear/pyjamas, or as clothes you don’t mind getting dirty/wrecked for chores/painting/etc. Or cut up and use as cleaning rags (my mom always did this with my dad’s old undershirts).",
            "score": 74,
            "replies": [
                {
                    "depth": 1,
                    "author": "smkscrn",
                    "body": "When my white and light colored shirts get too stained to wear, they go in a dye bag. Eventually someone I know will do a dye party and I bring them all - someone will want them even if I don't.",
                    "score": 30,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mini-mal-ly",
                            "body": "I've never heard of a dye party before, but I need to make some friends who do this!",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cinnysuelou",
                                    "body": "Look into snow or ice dyeing - it’s super fun!",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "smkscrn",
                                    "body": "It's the best! Some friends do natural plant dyes and some do classic tie-dye. I've been thinking of organizing something in my neighborhood since it's such a fun family activity.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EdgeCityRed",
                            "body": "I thought the dye bag would be a bag of things to wear when you're dyeing your hair! :)",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "smkscrn",
                                    "body": "That's a smart move too!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AnnieAnnie666",
                    "body": "To be honest, if there are stains on light-colored clothes, I will try many ways to wash them. If you really can't wash it off, you can use a brooch-like jewelry to cover the stain. If there are stains on dark clothes, if they are not easily noticeable, I choose to ignore them! Hahahaha, psychological hints are very important!",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "Sarah-75",
                    "body": "Snags … pull to inner side and use Prym FrayCheck to make sure this snag doesn’t cause further trouble 👍🙂",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fir6987",
                            "body": "Ooh, I’ll have to check that out, thanks!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "evelinisantini",
            "body": "\nIt depends. I always remove stains, regardless of size or how obvious they are. \n\nFor small damages, it depends on placement. If it's not too obvious and has little risk of getting bigger, I'll ignore. If it's in a \"high traffic\" area, I'll either do an iron on patch or mend with thread and needle. \n\nI would only toss if I can't reasonably restore it. Entire hem became unstitched? I'll fix it. Garment torn in half? Probably not lol",
            "score": 30
        },
        {
            "depth": 0,
            "author": "always_unplugged",
            "body": "I've just discovered that most activewear is made of nylon and can thus be dyed with acid dyes—this has unleashed a tie dyeing monster within me 😂 I had a couple white sports bras/tops that had stains I couldn't get out, so [I tie dyed them](https://www.reddit.com/r/tiedye/comments/1cxh2rn/my_first_three_projects_safe_to_say_im_completely/) and now they're so much cooler, and one of a kind too! I also just did a pair of Align shorts that were a super light blue, which I felt self-conscious wearing because of the super light color, so I never reached for them—I'm hoping the pattern helps hide my lumps and bumps and I actually get some wear out of them now.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jvnismysoulmate12345",
                    "body": "Holy cow those are so cool. Not sure I trust myself to nail it like you did but woooo very inspiring!!",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "always_unplugged",
                            "body": "Thank you!!! It's been super fun, and surprisingly easy—I bet you could do it no problem! I pulled out the Align shorts and they turned out to match the middle one kind of perfectly, so I'm wearing them today as a set 😍\n\nu/PaulaLoomisArt also asked, so here's the basic process. You need vinegar, powder acid dyes, synthetic sinew, some sort of permeable rack and a basin that's either stainless or you don't care about getting dye on, aluminum foil, and ice. I followed the basic steps on [this Kool-Aid dyeing tutorial](http://www.pburch.net/dyeing/FAQ/drinkmix.shtml), which is essentially how you handle any acid dye project. Then I followed [this tutorial](https://mythicseam.com/geode-dyeing-fabric/) on how to tie it—they're not kidding when they say you need to pull it TIGHT, but I found I was able to do that with just the spool the sinew came on.\n\nYou saturate the fabric in vinegar and tie it up. I have a metal rack thingy that I found in the drawer under my oven (no idea what its original purpose was lol), so I put that across my (stainless steel) sink and put the tied fabric on that. I've been sprinkling the dye directly on the fabric and placing ice over that, but you can also put the ice on first and sprinkle the dye on the ice—I've seen some people even do both. Either way, make sure you don't skimp on the dye; it should look completely solidly covered, unless you want to leave large un-dyed areas. Then you need some way to keep the ice directly on top of the fabric, so I've been surrounding the whole thing with aluminum foil \"walls\" and then filling that with ice. Make sure it's good and covered. Let the ice melt completely. After the ice melts and the dye has been absorbed, you need to cure it with heat; I've been doing the microwave method described in the Kool-Aid link. Let it cool, then rinse out. And that's it!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PaulaLoomisArt",
                    "body": "These are so pretty! Is there a guide to the basic steps that you could share? Would love to try something similar! I’ve dyed some stained and faded clothes before, but just with a single color bath. This looks way more interesting and the monochrome palette you picked is so wearable. :)",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "always_unplugged",
                            "body": "Thank you so much!!! ❤️",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "b_xf",
            "body": "I don't particularly mind \"textural\" wear and tear like snags, non-structural rips etc as I feel like there is often a way to disguise these with a bit of sewing. \n\nStains I don't love and if I can't clean the stain, then I would either dye the piece, cover the stain in some intentional way (embroidery or patch, depending on the item) or upcycle it in a way that removes the stain if possible (eg shortening the sleeves, shortening the hems).\n\nI think it's wasteful to throw an item away as soon as it's showing wear! ",
            "score": 38,
            "replies": [
                {
                    "depth": 1,
                    "author": "DiagonEllie",
                    "body": "I'm just going to second this answer, you said everything I was thinking!",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "crazycatlady331",
            "body": "I will treat stains with a stain remover as soon as I notice the stain (even if I'm not doing laundry right away).  \n\nAs far as the snags go, it depends on the item (I wouldn't care as much for things like PJs/gym clothes/only wear around the house) and how bad the snag is.\n\nWhen the clothing gets to be unwearable, I take it to H&M's clothing recycling program.  I keep a bag for this and will drop off when the bag is full.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "always_unplugged",
                    "body": "In my experience, letting stain treatments sit usually helps them work better! Or at least to a certain extent; that's what I tell myself anyway. Same energy as letting the dishes \"soak\" when I don't want to do them right away 😂",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "PoppyHamentaschen",
            "body": "Stains get treated immediately: first with baking soda (let it sit overnight), then a pre-treat with the detergent before washing. White clothes with sweat stains also get treated by working Vanish onto stains with a brush, then soaking in warm water with baking soda and Vanish for a few hours before washing. All my tops get washed in garment bags to avoid wear in the washing machine. I use a depiller on sweaters. I tease small snags back into line. Any rips or repairs go to the seamstress. If a garment has a blemish I can still notice after treating, it goes to the charity shop. If it's ripped and can't be fixed, it goes into the local textile recycling bins. I don't wear ripped or stained clothes- it's not fabulous, and life is too short to not be fabulous :)",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Aphrodisiatic922",
                    "body": "Where did you learn this??",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PoppyHamentaschen",
                            "body": "The baking soda thing, I stumbled on it by accident years ago, when I was trying to remove an oily food stain. Adding baking soda to warm water with Vanish and using a brush to work it into the stain, I learned from some guy on YouTube who did a comparison of different techniques. The garment bag thing, I started doing it on my own (if it's good enough for my lingerie, it's good enough for my tops- you can also launder inside-out, btw). Using a depiller, I probably read it in some magazine years ago. Teasing snags back in, I learned from when too much toothpaste would come out of the tube- I would squeeze the tube and suck it back in, a reverse squeeze, if you will- so I used the same concept for little snags. I tried wearing garments that still had a small blemish after washing, and I was so self-conscious, I couldn't deal, so now I give them away. The fabulous part, that's all me- I always say that I'm too fabulous to wear ratty tatty clothes :)",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PaulaLoomisArt",
                                    "body": "Would baking soda remove an old oil stain do you think? I’ve got a small oil spot on some lilac dress pants that has been driving me crazy. It’s subtle but I know it’s there.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PoppyHamentaschen",
                                            "body": "It's worth a shot. I put a good plop of baking soda on the stain and let it sit there for a day (I put it on a chair, out of the way). You might want to leave it a couple of days. At worst, it doesn't do anything (boo); at best, it works (yay).",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "christinasasa",
                                                    "body": "Like, dry baking soda? Or a paste?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "PoppyHamentaschen",
                                                            "body": "Dry. I use the baking soda you cook with (like Arm and Hammer). When I'm ready to wash, I brush the baking soda off with my hand into the sink. I put a little bit of the liquid detergent I use onto the stain, fold the fabric and rub it together. I launder as normal. If you see improvement, but the stain remains, try it again. If there's no improvement, you'll need to reassess your garment.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "christinasasa",
                                                                    "body": "Ty",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "christinasasa",
            "body": "My daughter had a white sweater that got a stain. I spent hours trying to get it out but it was still slightly visible. I used black tea and dyed it so it's khaki! It's ok now.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "ama_da_sama",
                    "body": "That's a brilliant idea on how to hide a stain you can't get out. I'm terrible with white clothes, so I may have to try this.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EdgeCityRed",
            "body": "I'm good at treating stains, but if a stained item can't be fixed, it's relegated to \"wear around the house\" status.",
            "score": 2
        }
    ]
}