{
    "title": "How do you compare items before buying?",
    "comments": [
        {
            "depth": 0,
            "author": "NotElizaHenry",
            "body": "I order a bunch and return the ones I don’t like. For me there’s no point in narrowing it down to just one before I order because who knows if it’s going to fit right? I need options. ",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "Active-Performer9813",
                    "body": "Agreed. Online shopping is gamble. Read the reviews, they are often helpful and then just make your selection, live with it or donate it or gift it.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "fir6987",
            "body": "For online shopping, I make a spreadsheet of all the options I’m considering with prices, brand, links to the item, etc. Then I rank them based on how much I like them (and also price… if one item is $$$ and not a clear favourite, I’m probably not going to order that one) and then decide to order based on that. Anything with bad reviews doesn’t make it onto the spreadsheet in the first place. \n\nIt’s a little more time intensive to make the list, but I feel like making it and then walking away and coming back to it the next day makes some decisions a lot easier. Also sometimes really quantifies what you’re looking at - if I need 1 dress and have 20 possibilities, it’s easier to cross out the ones that I like a little less. I usually grey them out so they’re still on the list just in case. \n\nIf I return it because something was wrong with the fit, then I can try the next one on the list, so it’s useful to have those backups handy too.\n\nIdk it’s def a time consuming process for me too, but I’d rather put more thought into it before I buy, then have to waste a lot of time on returns later (or settle for something that is ok but not exactly what I wanted, that I end up not wearing as much as I was expecting to). \n\nI have a “future purchases” board on pinterest too that I just pin things that I like when I see them (which helps so much with impulse purchasing), but I do the spreadsheet when I’m actually deciding to buy since it’s more focused. Pinterest is nice if you want to visually compare several things at once though, so that might be another option (could also share with friends easily for opinions rather than sending a bunch of links).",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "thatbitch2212",
                    "body": "I do something similar with Pinterest. I have all my carts brought onto a board, I rank order by which one I like best and maybe order the first 2-4 of whatever it is. There is a lot of returning involved, but I do think I make better decisions as a result. ",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "dapplegray",
            "body": "I have a few cocktail dresses in my closet, so for weddings and special occasions I don't buy new anymore. \n\nBut if I had to, I already know what shapes I like and what colors I like. Combined with the given dress code, it's pretty easy to narrow down to slim pickings. Then I go looking for that in various online stores that are within my budget.",
            "score": 23
        },
        {
            "depth": 0,
            "author": "ClassicEssay1379",
            "body": "This is actually exactly what I do, so it’s interesting to see others’ advice on shopping online. But yeah, I have tons of tabs open and it takes me days to make a decision. Sometimes I don’t mind it because I like to give myself time to think something over, but it can be tedious sometimes, as much as I love shopping. I narrow down my options by choosing my favorite brands, which are all sustainable/ethical, and looking there first to see if they have what I want. I also use Good On You as a resource because they have a search and filter tool where you can search specifically for dresses, which sometimes helps me.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "scrollgirl24",
            "body": "My exact process :( it's overwhelming but it works\n\nThis time I tried going to 1 in person store, trying on a bunch of different colors/silhouettes/brands, then doing the same online hunt. It was easier to narrow down what I was looking for because I already knew what looked best on my body.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "symphonypathetique",
            "body": "Less intense process: keeping a bunch of tabs open for days or weeks on end/liking a bunch of listings on Depop/Poshmark\n\nMore intense process: making an Excel spreadsheet comparing the qualities of each item",
            "score": 4
        },
        {
            "depth": 0,
            "author": "mgumbs",
            "body": "I save urls to Notion as I see them - across social media, email ads, browsing websites, just about anywhere. It’s great because I can do it from my phone and also with browser extensions on my computer. When it’s time to go to a wedding, I have a database of links and prefilled pictures of all the dresses I’ve liked for as long as time. I have categories for just about everything from bed frames to skincare. Basically I f I want to save it for later, it goes into its proper place in Notion. (If there’s no URL I send a screenshot!)\n\nI’m 3 years deep into this database and my strategy for organizing it has evolved so that I truly have a place for every piece of digital clutter. I’ll never call it perfect because it already is perfect in that I can move things around whenever and however I need to. I’ve pulled together a vision board for refreshing my closet. I have another for the interior design and aesthetic of my home. All my work notes/tasks live on a notion dashboard. That stack of random receipts for car maintenance in your glove box? Mine is a QR code connected to a Notion database. It’s the most powerful free tool available these days imo",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "thatbitch2212",
                    "body": "I do something very similar on Pinterest. \n\nDo you have notion templates for pictures/ vision boards. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Liscetta",
            "body": "I'm ashamed to admit it, but when there is an upcoming ceremony i scroll through a famous second hand website. I know that some brands fit me very well in a very specific size, so i first set filters (brand, size, price, conditions) and add to my wishlist a lot of dresses that i like, then i check the wishlist and remove those i can't match with accessories i already have. I also try to buy something i can wear again.\n\nThen i let everything sit for a couple of days and recheck the list. I ask the measurements of my favourite one and if it fits i buy it. My price range is 20-30€.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dancingmochi",
            "body": "I haven’t had to do urgent purchases in a while but I did not have a good system lol. But new purchase question for me is, does it really matter if I go with style A vs B, if you’ve already considered the normal questions (is it functional for the occasion, is it flattering, can it be used again). It’s more about the event than the dress. \n\nIf it’s not an urgent purchase and more to curate my closet, I try to make it more specific by first identifying the gap, what is the occasion and requirement, how does this affect my current style, what details or accessories would really drive this style home. And be absolutely ruthless before making the purchase! I try not to limit myself to “I have to have this one piece”, because style is more about the combination and how you wear it. It’s time consuming for sure but so are other hobbies.",
            "score": 1
        }
    ]
}