{
    "title": "General Discussion - May 21, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "Low-Cartographer9326",
            "body": "It's so irritating that retailers can't agree on what constitutes a mini, midi, and maxi dress. I'm not looking for an effing ankle-duster when I look for a midi dress.\n\n\n* Mini: just-above-the-knee and shorter\n* Midi: knee-length to mid-calf\n* Maxi: longer than mid-calf\n\n\nIt *should* be that simple but it's not and it makes it impossible to consistently sort by length between different retailers.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "dapplegray",
                    "body": "Could it be that this depends wildly on the height of whoever is wearing the dress?",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Low-Cartographer9326",
                            "body": "Petite/tall/curve fits still exist in dresses so I think it'd be silly to label a dress \"midi\" because it hits mid-calf on the 5'10\" model (who has to buy the \"tall\" fit in basically everything else) while knowing full well that the vast majority of women wearing that dress will be a lot shorter just statistically. And even on tall models, many of these so-called midi dresses hit the top of the ankle (check out Meshki to see what I mean).\n\n\nI liken mini-dresses to shorts, midis to capris/culottes, and maxis to pants. Bermuda shorts are still shorts though they almost hit the knee, and once they go under the knee they become capris/culottes. Then once the capris hit the top of the ankle, they become pants.\n\n\nEdit: just for my own edification I checked out the tallest average height for women on the planet and that honor goes to Latvian women at ~5'7\" on average. Female models, on average, are 5'9\". So designing and labeling dresses based on the average model exceeds even the tallest demographic of women by two inches which is a significant change in fit. Most height averages for women per country are 5'4\"-5'5\" or so. If they're labeling based on where it fits on the model, it makes absolutely no sense to label a dress length based on such a skewed demographic.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "oat-beatle",
                                    "body": "I mean I usually just look for the length. Simons for example provided the length for each item.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Low-Cartographer9326",
                                            "body": "I do as well along with model height, but not every retailer provides that info unfortunately. It's just one of those hazards of online shopping that I just grit my teeth and bear, because in the end I'm not built like those models anyway so it'll look different on me regardless.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "_whatnot_",
                    "body": "You might get more answers if you post this in the Daily Questions thread. And I'm curious too, because I'll be in Mexico in July!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "ladolceLolita",
                    "body": "Ticks are demons. I'm in the woods every day however here in N New England the ticks aren't as bad as usual for this time of year. I do believe there are some Lyme disease inoculations in clinical trials, which is encouraging. Where do you live?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "kiwipapabear",
            "body": "Hi! New and just joined - I actually already posted this as a comment on one of the FFAQ posts before I discovered the general discussion thread 😊\n\nI’m NB (AMAB, raised masc) and used to dress very femme in college, but I didn’t really give a crap if the outfit looked good or not. I just wore what I liked, and it was a small college full of other weirdos so nobody batted an eye.\n\nAfter graduation I started working in a chemistry lab and gradually got rid of everything that would be dangerous (skirts, dresses, loose blouses, heels) or would make it difficult to wear full Tyvek cleanroom gowning (basically the same list), which just left my guy clothes. After 10y as a working chemist all I had in the closet was dockers and men’s shirts.\n\nJust recently I realized that I’ve now been out of the lab for over a decade but haven’t updated my wardrobe at all, so I’m trying to rectify that. I’m no longer shaped very well for the sort of dresses I once wore, but I *love* skirts and tailored blouses (though it’s hard to find the latter that work well on a dad bod) and I’ve been hitting up department and thrift stores to rebuild my wardrobe.\n\nExcept now I’m working in an office rather than hanging out with a gaggle of eccentric scientists, and am discovering that I don’t have a *clue* how to properly coordinate women’s clothing. And when you’re bald and bearded and wearing a skirt and blouse you already stick out, so I have to make *very* sure my outfit helps rather than hurts 😆\n\nLooking forward to reading more!",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Weak-Classic7161",
            "body": "I hope I can share this here, if not please remove. I created a community where you can share your outfits and ask for others to rate them: https://www.reddit.com/r/ratemyoutfit_/s/wKPz6AIrE2\n\nJoin the community, share an outfit and rate some outfits that are posted! Also I would appreciate it if you share the community so we can grow bigger:)",
            "score": 0
        }
    ]
}