{
    "title": "Non-US FFA, what societal/cultural style associations do you have that US FFA doesn't?",
    "comments": [
        {
            "depth": 0,
            "author": "genie0327",
            "body": "LOL my SO and I have run into a version of this!! We're both American but I'm first-generation Asian and he was raised Mormon so while I see my mori girl-esque sweaters and skirts as light, airy, and flowy, it just makes him think of church. 🤣",
            "score": 361,
            "replies": [
                {
                    "depth": 1,
                    "author": "throwaway957436",
                    "body": "They are super cute, and I can see why he would. Looks like a more “today” version of what I’d see women wearing to church growing up.",
                    "score": 56
                }
            ]
        },
        {
            "depth": 0,
            "author": "chiono_graphis",
            "body": "Not Japanese but I've lived in Japan for over a decade, and here's some I learned: \n\n-sunglasses are iffy outside of a beach/sports context because covering the eyes was associated with organized and petty crime. PSA posters about scams at ATMs still often show illustrations with the perps wearing sunglasses and evil grins. Pretty sure most people don't think someone on the street wearing fashionable sunnies is a criminal, but it looks \"cool but only on tall foreigners or celebs, not for lil old me\" so they're not a common accessory and most use hats or parasols for sun protection instead. Nowadays also connected with FX+crypto bros/YouTubers who hide their identity (there was a whole trend on insta just before the pandemic of shady influencers promoting MLMs using pics of poses on luxury hotel beds with sunglasses and huge stacks of cash lmao) and it's also considered a bit rude to talk to someone while wearing them. Most visually impaired people I see out and about don't wear them either. \n\n-same with tattoos, also historically associated with crime unfortunately, places with communal nakedness (hot springs, pools, gyms) and most workplaces still often have rules against them. Hanging up a poster prohibiting entry of people with tattoos was just a way for businesses to show they're not run by organized crime, but even today if someone mentions it, it forces staff to enforce the rule sometimes. Best to just cover up and don't ask don't tell lol. \n\n-cleavage isn't a neutral body part or something you walk around showing in the daytime for free lol. Growing up in the U.S. I remember it was so normal for ladies of any age with a v-neck top (not talking like cakes on a plate pushed up to the high heavens with a bandage top, I mean as something unsexualized that just happens when some people wear a v-neck blouse). But here cleavage always has sexual connotations and is something men pay money to see in adult entertainment lol.",
            "score": 309,
            "replies": [
                {
                    "depth": 1,
                    "author": "Falafel80",
                    "body": "“Something that just happens” is pretty spot on for a country with body diversity. In Japan women tend to be more petite and cleavage doesn’t just happen in a v-neck, right?\n\nI lived in Vietnam and I remember how it was totally ok to wear super short skirts or shorts, but no cleavage, no shoulders or back. In Brazil, it’s easy for shorts/skirts to look more scandalous because we have a completely different body type. So as a Brazilian it took a while to find my groove.",
                    "score": 181,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chiono_graphis",
                            "body": "Yes a lot of norms are rooted in the prevalent body types. Japanese society isn't religious at all but context is *very* important and it's also trend based. A Japanese acquaintance told me in the early 90s she and her friends used to go out in a single spaghetti strap tank top no bra and tiny shorts in the hot summers, so much skin all at once is unheard of now lol. Her theory for the change was the awareness of the possibility of being photographed or recorded without your consent, uploaded to god knows where, has made people more careful about modesty in public.",
                            "score": 75
                        },
                        {
                            "depth": 2,
                            "author": "Yay_Rabies",
                            "body": "I was going to say that as a US teen in a rural area a lot of arguments my parents had with me about inappropriate or revealing clothing honestly boiled down to “I was a teen with breasts” rather than the shirt was too low cut/tight.  ",
                            "score": 132
                        },
                        {
                            "depth": 2,
                            "author": "jrochest1",
                            "body": "Yeah — most Chinese, Japanese and South Asian women have less body fat and great legs. I’m an apple, and EVERYTHING has cleavage, even if it’s a freaking turtleneck. I would never be able to live in Japan.",
                            "score": 26,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nebcurls",
                                    "body": "\"EVERYTHING has cleavage, even if it’s a freaking turtleneck\" made me laugh. SO relatable!",
                                    "score": 15
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Subtle_But_Essential",
                    "body": "I used to live in Japan and people were definitely more uncomfortable with me when I wore sunglasses. It was so bright so much of the time though that I really couldn't avoid it! ",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "llama67",
                    "body": "Oh my god the v neck thing would kill me. It’s the only neck line that looks decent on my big boobs 😂",
                    "score": 47
                },
                {
                    "depth": 1,
                    "author": "juicyfizz",
                    "body": "As a woman with a half sleeve on one arm and a partial on the other, I guess I’ll wear long sleeves when I visit Japan lol. I had no idea about this.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "wittyrepartees",
                            "body": "If you look Western, people will give you a pass on this in public. Like... You're obviously not Yakuza. \n\nHot springs are really iffy though, I got in because when my husband asked the desk guy what to do about tattoos, the guy was like \"I don't see any tattoos, carry on\". Then I made sure to cover as much of the tats as possible with the towel you bring, so as not to scandalize the older ladies in there.",
                            "score": 21
                        },
                        {
                            "depth": 2,
                            "author": "chiono_graphis",
                            "body": "You'll be fine unless you want to visit hot springs/onsen (the dress code is strictly birthday suits only, so there's no way to cover up), in which case you should look into booking a ryokan (traditional hotel) that has a private onsen for each room, or a mixed genders one where a rashguard or tee would be allowed.",
                            "score": 10
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "norrainnorsun",
                    "body": "Cakes on a plate😂😂",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "spamchow",
                    "body": "to add to this, bare shoulders in EA seem to count as cleave. Even a classy sleeveless blouses seem to still be a big workplace nono to my Korean mom. Legs are somehow fine? Like an ultra mini skirt/shorts probably not for the office but it's not as big a deal in Asia as it is in NA....?",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ZenythhtyneZ",
                    "body": "The idea of someone trying on incredible sunglasses and putting them back because they think it makes them look like a criminal is so funny to me, how weird\n\nI would expect a super patriarchal and repressed society to objectify breasts so extremely, that seems inevitable",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "pap3rdoll",
            "body": "Australian here - Ugg boots outside of the house and flannelette shirts identify you as a bogan (the Australian version of a hillbilly).",
            "score": 127,
            "replies": [
                {
                    "depth": 1,
                    "author": "deathcabforkatie_",
                    "body": "The ugg companies did really well to market them outside of Australia as actual shoes, ‘Oh Australian surfers wear them to keep their feet warm!’ Bullshit, they’re fucking slippers, and my mum used to make me wear them when I was 7.",
                    "score": 82,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "double-dog-doctor",
                            "body": "It definitely worked in the little Coastal Californian town I grew up in. All the surfers wore them; like peeled off their wetsuits, toweled down, and put on Uggs. Same deal for by the pool. If you were a swimmer, you were wearing Uggs because your feet just get so damn cold sitting on the side of a pool in the winter.",
                            "score": 9
                        },
                        {
                            "depth": 2,
                            "author": "savealltheelephants",
                            "body": "You will pry my “uggboots as snow boots” from my cold dead midwestern soccer mom hands",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ZenythhtyneZ",
                                    "body": "How do they not get soaked? I live in the PNW and winter is wet, our snow is wet, if I wore them out of the house I’d have ~10 minutes before they were saturated and my feet were wet. How can you wear them outside in the wet and not have them soak through?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "savealltheelephants",
                                            "body": "I spray them with water proofer",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "fluffgnoo",
            "body": "I’ve lived in the US, the netherlands and germany and from my experience it’s uncommon in europe to wear gym clothes/activewear unless you are actually working out or on the way to the gym. I was surprised by how many people dressed in workout clothes to go to cafes or shopping in america!",
            "score": 222,
            "replies": [
                {
                    "depth": 1,
                    "author": "ofjune-x",
                    "body": "I’d like to say the UK and maybe Ireland too are an exception to this. A lot of younger people go around in sports leggings/nike pro shorts and hoodies etc if they’re just shopping or eating somewhere very casual like McDonald’s or a cafe. Joggers/trackies are also pretty common more so on men or very very casual wear. I work in a clothing shop and see a lot of under 35s in leggings and sporty crop tops/sports bras even if it’s warm out who are just out shopping with their kids. I think the Kardashians etc have a big influence here for that sort of athletic wear as everyday wear similar to the US.",
                    "score": 40
                },
                {
                    "depth": 1,
                    "author": "marooples",
                    "body": "I noticed this on a recent trip to my family in the US, so many people in workout clothes or pajama pants! I'll see an occasional gym bunny at the grocery store in Germany who's obviously just been at the gym, but very few people in leggings and gym shorts in the US seemed like they were at the gym.",
                    "score": 63
                },
                {
                    "depth": 1,
                    "author": "turnipturnipturnippp",
                    "body": "this is true, and yet adidas tracksuits are somehow not gym wear in europe?  it's definitely young dude casual wear but I saw a lot of it in Germany.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MakingMoves2022",
                            "body": "I kinda get it bc as a Russian-American, I’ve never even considered working out in an adidas tracksuit. I’ve seen it so many times as casual wear that I’d never even associate it with exercise, lol.",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ZenythhtyneZ",
                                    "body": "They don’t seem especially suited to working out? Seems like you’d get hot and sweaty and they wouldn’t breathe well",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "libra-love-",
                    "body": "As the American-born daughter to a Dutch immigrant father and German immigrant mother, they were super weirded out by this style too. And athleisure. “Why would you wear sloppy clothes outside the house??”",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "floracalendula",
                    "body": "My kin would NEVER. I was also raised to not, by a German mother. Who does not. She indeed only goes to yoga in her yoga pants.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "dickbuttscompanion",
            "body": "I *think* Moncler and Canada Goose parkas are for wealthy people in North America, but in Ireland they're a status symbol worn by drug dealers and teens in the trade. A CG pop up opened in Dublin a few summers ago and was promptly looted.",
            "score": 189,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mariannereddit",
                    "body": "Same for those small LV and Gucci bags, worn by teens with questionable hustles.",
                    "score": 64,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GimerStick",
                            "body": "depending on where you live in the US a lot of those are just assumed fake.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "Same in the UK. With black padded North Face jackets for the ones who can't afford Canada Goose.",
                    "score": 38
                },
                {
                    "depth": 1,
                    "author": "diwalk88",
                    "body": "They're for regular people in Canada, not wealthy people. Everyone owns a parka that costs $500+ because it's a necessity for 6 months of the year, otherwise you'll literally freeze to death.",
                    "score": 71,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jrochest1",
                            "body": "It depends where in Canada you live, and when you got the CG. Toronto and Vancouver don’t really need the crazy expensive parkas — but if you’re in the Prairies, Quebec or Ottawa, absolutely. \n\nI lived in SK for 20 years, I have a Canada Goose and another, warmer parka that’s basically a sleeping bag with arms. 😁",
                            "score": 49,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kallisti13",
                                    "body": "Toronto can get horrifically cold because of the humidity so they need it. Vancouver people get them as status symbols.",
                                    "score": 23,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tyRAWRnnosaurus",
                                            "body": "I’ve been living in Toronto for over 10 years now, and I really have to disagree.  \n\nIt’s not that cold here.  Even with the humidity, it’s *very* rare that I’d break out the parka, and if an expensive one is necessary it’s because Torontonians are a certain type of way, not because of the cold.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "doyouhavehiminblonde",
                                                    "body": "Not that I have a Canada Goose, but I think people feel temp differently and if you're outside a lot most people are going to need a warm winter coat in Toronto.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tyRAWRnnosaurus",
                                                            "body": "That is a valid point, which I hadn’t considered.  We have a large immigrant population and many of them come from warmer countries where their perception of ‘cold’ might be different.  I can see that. \n\nWhat I will say is that the average winter temperature in Toronto is hovering around 0c/32f which is not that cold relative to most other Canadian cities, and for me personally does not require a parka.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "floracalendula",
                                                                    "body": "Average winter temps here are about that, and I'm probably just not outside enough, but at the rate I'm going, my parka will last 50 years. I just... live in layers.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "b_xf",
                                                    "body": "It's so true that it's because they're a certain type of way! ",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tyRAWRnnosaurus",
                                                            "body": "It was the nicest way I could think of phrasing it haha",
                                                            "score": 3
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "double-dog-doctor",
                                                    "body": "People perceive cold differently; it isn't a universal feeling that is experienced by everyone. I'm always freezing and once my core gets cold, I cannot stop shivering. A very warm winter coat is a necessity for me, even though Seattle doesn't get \"that cold\". \n\nI know plenty of people who go the whole winter wearing a sweater and a waterproof shell and still complain about being warm. \n\nIt's all unique to the person.",
                                                    "score": 3
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "jrochest1",
                                            "body": "I’m in TO now, and I wear the Canada Goose (but not the other one) mostly because I have it. TO csn feel chilly, between the damp and the wind, but it isn’t ever really -40 C COLD.\n\nEVERYONE has a stupid expensive parka in SK. Old people, farmers, minivan moms, little kids. If you don’t have one you’ll die, in some weathers, and you wear it for 5 months a year. And if you don’t have 400+ for down, you buy one sscondhand.",
                                            "score": 13
                                        },
                                        {
                                            "depth": 4,
                                            "author": "MissPearl",
                                            "body": "Vancouver I was able to wear my fancier formal Montreal city coat on coldest days, the parka was much too warm. \n\nIt's a great place for real wool because they aren't kidding about \"a wet cold\". I only started getting ache in my joints chilly after moving.",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "oat-beatle",
                                    "body": "Meh I'm in the Ottawa region and most women do super puffs from aritzia, most men are still on snowboarding jackets hahaha",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "b_xf",
                            "body": "Yeah I'm in the prairies and can only think of a handful of people I know with $500+ jackets. Most of us office folks are some online brand or Costco lol. Mine was $260 and is great.\n\nPeople who are actually doing outdoor work in the winter tend to have their hi vis work jacket and just wear that as their day to day coat.\n\nDefinitely more options for decent quality coats now than there were 10-15 years ago! ",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "MissPearl",
                            "body": "Can't leave home without your space suit!\n\nYou can do cheaper than $500 but you have to shop very carefully. For me, back when I lived in fuck off levels of winter I would wait until Jan/February when you would get a shot at seasonal clearance to buy coats. But it would be a whole ordeal of seeking various stores.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "FireflyBSc",
                            "body": "Definitely not. At UAlberta, Canada Goose was worn exclusively by international students. It’s like wearing a giant red flag that you aren’t originally from Alberta or are just wealthy. Normal people buy affordable parkas, or technical ones. I personally go with MEC.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cyborgfeminist",
                    "body": "I grew up in the northeastern us and went to ivy league universities. They read sorority girl to me. This is pretty funny!!",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "CantHugEveryPlatypus",
            "body": "Denmark.\n\nBusiness formal or business casual is an unusual dress code for a workplace here. Not saying it doesn't exist, or that nobody adheres to it, but it's just not something you automatically expect of a workplace. I have worked at several large, international offices, and some of the managers might wear suits or other semi-business formal wear, but most people lean wayyy more casual. Jeans, t-shirts, sweatshirts, sneakers, those are all common. Even if there is a dress code, it's rarely strict on suits and stuff, more like \"don't wear flip flops, and wash your hair occasionally\". The things I wear to work (again, large international company, office work) is what Americans would probably consider extremely casual, sometimes maybe even unprofessional. Of course if you work someplace where you often have to look very professional in the eyes of a client (like a attorney or accountant) there might be different expectations, but I know very few people who have to dress based on a client's expectation. \n\nI always have to hold back when people in this sub ask \"is this appropriate for office work\" because, yeah... Most clothes are appropriate for office work in my (casual Danish) opinion lol.",
            "score": 89,
            "replies": [
                {
                    "depth": 1,
                    "author": "ApplesBananasRhinoc",
                    "body": "I think wearing suits and dressing up to work in the office is more of an East coast of the USA thing, the west coast is more laid back with office clothing as you are.",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cyborgfeminist",
                            "body": "I honestly think it might even more specifically be only a DC and maybe Boston thing at this point. I'm in NYC and my partner is a fresh lawyer. He's shopping for Cole Haan sneakers and Lululemon pants on the recommendation of his colleagues. He'll have two suits for court but in his specialty he will almost never go in anyway.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PussyCyclone",
                                    "body": "IME by and large most of the Southern East Coast still leans overly formal as a general rule, too.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cyborgfeminist",
                                            "body": "That definitely makes sense!",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "floracalendula",
                                    "body": "It also depends on what kind of law you practice. Not in DC, but do see very casual bizcaz on Family Court counsel!",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ialwaysusesunscreen",
                    "body": "This is not country-based, but I can relate! I am in academia, and before that, I was in marketing, so I never realized how /strict/ some office dress codes are! I think I first realized this on this sub when someone said that crop tops aren't office-appropriate. My supervisor wears micro shorts all the time, I wear crop tops, and a big researcher in my field has bright green hair...",
                    "score": 33,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ayayadae",
                            "body": "it even happens in academia sometimes!! i worked at a very stuffy university alumni outreach office for a year and once wore corduroys (!!!) with a button-up shirt and dress shoes. \n\ni was told in no uncertain terms to NEVER wear those pants ever again. full business blouse with skirt or slacks only.  ",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cantaloupe_penelope",
                                    "body": "Ah but that makes more sense when you're doing alumni outreach? I would put that more with fundraising rather than academia, and then you always have to play up to a more conservative crowd. ",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ZenythhtyneZ",
                                            "body": "Corduroys are pretty traditional/conservative friendly.",
                                            "score": 4
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ialwaysusesunscreen",
                                    "body": "I agree with the other commenter that alumni outreach is similar to like a \"client-facing\" position, but I still find it crazy!!",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ZenythhtyneZ",
                    "body": "Seattle in the US is this way. \n\nThe poorest looking person in the room is the tech billionaire",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CantHugEveryPlatypus",
                            "body": "I don't think we look poor in Denmark just because we don't wear suits",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lazy_berry",
            "body": "the idea of needing a nice black outfit for a funeral. i’m australian, and most of the funerals i’ve been to haven’t had people in all black. i’ve also been to several that specifically asked people to wear bright colours.\n\nalso, “wedding season” doesn’t seem to be as much of a thing here.",
            "score": 149,
            "replies": [
                {
                    "depth": 1,
                    "author": "llama67",
                    "body": "My sisters funeral was on the beach, footwear was optional, and because of the waves they had to get a surfer to swim the ashes out past the break line 😂 most Aussie funeral ever. \n\n(Yes she did live in Byron Bay and was a stoner artist, why do you ask? lol)",
                    "score": 124,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lazy_berry",
                            "body": "we did the lazy route and used my uncle’s boat when we scattered my grandparents ashes, same reason haha",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "llama67",
                                    "body": "Yeah the surfer was a ‘impromptu’ situation (or they hadn’t thought about it before hand 😂)",
                                    "score": 13
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "rengothrowaway",
                            "body": "I’m sorry for your loss, but that sounds like the coolest funeral ever.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "llama67",
                                    "body": "It’s okay, kind of a complicated story. A very ‘her’ send off for sure :)",
                                    "score": 14
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ellski",
                    "body": "Interesting, I'm in New Zealand and every funeral I've been to everyone is wearing black, or at the very least dark colours. Never bright.",
                    "score": 37,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ZenythhtyneZ",
                            "body": "Yeah unless explicitly requested you were black in the US, typically shoulders should be covered too even if you’re not religious/in a religious place.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Jevia",
                    "body": "To be fair, our weather is mild in majority of the country that I don't think its as necessary to schedule the weddings around it (compared to say, the US). Might explain lack of wedding season?",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lazy_berry",
                            "body": "that’s also true of a lot of the US though, so idk if that fully explains it",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "c800600",
                                    "body": "Other reasons - The US has major holidays in November and December that can be exhausting. Then January and February are out because of winter weather. Even if the wedding location's weather is fine, a big storm in another part of the country can impact flights everywhere. And with summers getting hotter, summer weddings are less popular in the south than they used to be. I'm only in TN, not the deep south, but we've already had 90° days with heat advisories and stuff.",
                                    "score": 37
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kitsunevremya",
                    "body": "To be fair, also Aussie and unless specifically directed to wear something else, I would wear a dark colour to a funeral. Nobody in their right mind is turning up in a bright colour when they haven't been asked (hopefully). \n\nWedding season 100% agree though, I chalk it up a bit to our climate - I'm literally having a winter wedding this year because inland Queensland winter isn't exactly Mount Buller cold, lol - but I wouldn't have a wedding in summer here because it's wet. Pretty much anywhere though, you can happily have a wedding 9 months of the year without having to worry too much about weather, at least certainly not the way some people worry about avalanches blocking roads and snowstorms grounding flights.",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lazy_berry",
                            "body": "> Nobody in their right mind is turning up in a bright colour when they haven’t been asked\n\n1) i’ve seen it done and no-one was bothered\n2) plenty of people will show up in non-bright colours that aren’t black",
                            "score": -7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sloppygreens",
                    "body": "Indians wear white to funerals! and we don't wear white at our weddings, we wear red! Some widows will also only wear white clothes forever after their partner dies. my grandma only wore white clothes for the last 15 years of her life because my grandpa died!",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "lumeleopard",
            "body": "I've been out of the country for 5 years now, but while living in Korea (things did start to change toward the end of my stay), it was always wild to me how showing any kind of cleavage was generally avoided/frowned upon (except for like...when going to the club) and spaghetti straps without a coverup were almost never seen but super short miniskirts and hotpants were totally fine? Cover up any sign of boob but a slice of butt cheek is no problem! I was also really shocked when I went to the beach and everyone was wearing rash guards or tshirts, shorts with long rash guard pants underneath and baseball hats while swimming/at the beach to avoid the sun. In my county, wearing as little as possible and getting a lot of sun at the beach is the norm. Korea did make me become religious about sunscreen though.",
            "score": 144,
            "replies": [
                {
                    "depth": 1,
                    "author": "DarkSideofTaco",
                    "body": "They are smart to cover up. Right now both my parents and my husband's parents are battling skin cancer. They're all >65. I asked my MIL about it because we really don't want that and she said sunscreen wasn't even available until the 1970s! Even then, both she and her husband didn't wear sunscreen and were \"sun worshippers\". So I'm not going to feel bad about my rash guard, I just wish they had some for adults that were as cute as the ones for toddlers with their ruffles and frills. All I can find is black or athletic style.",
                    "score": 32
                },
                {
                    "depth": 1,
                    "author": "anon28374691",
                    "body": "They sell skin bleaching agents in Korean drugstores. The rash guards are about staying pale, not necessarily modesty.",
                    "score": 24,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sacademy0",
                            "body": "respectfully disagree. most people don't bleach skin, but most koreans def use sun screen and wear hats/visors/arm sleaves v thoroughly, and don't do things like tanning. and rash guards are absolutely for both not burning skin and modesty lol. there's been a lot of progress for sure but korea's still socially conservative compared to the US",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "anon28374691",
                                    "body": "The products are called “brightening” but they contain skin lightening ingredients. They’re some of the most popular skincare products in Korea.  You must know it’s considered a sign of “purity” to be pale/white in Korea.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ilcorvoooo",
                                            "body": "Brightening is NOT lightening/bleaching. *Actual* skin lightening/bleaching/base tone changing ingredients like hydroquinone or glutathione are rare/extreme/questionably legal even in Asia. They absolutely do not sell these things at drugstores.\n\nVirtually all skincare/makeup in EA can be labeled “brightening”, they’re almost always things that clear up/even out blemishes but don’t actually change your skin tone (like niancinamide or acids or vit C, which are just as available in US).",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HappyBreak7",
            "body": "Denmark\n\nRalph Lauren = Middle class teenagers, who want you to think they’re old money.",
            "score": 108,
            "replies": [
                {
                    "depth": 1,
                    "author": "JLGJLGJLGJLG",
                    "body": "This is true in much of the US as well.",
                    "score": 27
                }
            ]
        },
        {
            "depth": 0,
            "author": "oat-beatle",
            "body": "Hey that was me! Glad my spite dressing is sparking conversations lmao\n\nThis is very specific to rural Ontario (and Quebec, robably others as well but those are the only two ive personally experienced), but there is a clear difference between work boots and cowboy boots. A lot of ppl have dress cowboy boots they wear to formal events but would *never* wear those boots on the farm, that'd be steel toes from the feed shop.\n\nSo seeing people at a truck pull in pristine cowboy boots, you know they're from out of town lol",
            "score": 96,
            "replies": [
                {
                    "depth": 1,
                    "author": "diwalk88",
                    "body": "Oh man, the boot distinctions are so real and so specific. I'm in the English (equestrian) world, so cowboy boots aren't a thing, but you have your boots for mucking out/feeding/working at the barn, your paddock boots for schooling (probably with half chaps), your nicer paddock boots and half chaps for casual off property things, field boots for showing hunter/jumpers, and maybe also tall boots for dressage. You probably have more than one of each.  I've been hunting for cowboy boots I like just to wear for fashion, and when I find them I'll be one of those people at events wearing them lol. I bet a lot of those people are English riders/horse people who like cowboy boots and have nowhere else to wear them!",
                    "score": 23
                },
                {
                    "depth": 1,
                    "author": "punani-dasani",
                    "body": "Same in Texas.  Having a pair of “good” cowboy boots is definitely a thing.  \n\nI’m not a native Texan but I have a pair as well. \n\nSome of them can be hand tooled, made out of exotic leathers, etc.  and super expensive.",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "anon28374691",
                            "body": "I should wear mine more often. They’re beautiful.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "vereliberi",
                    "body": "Same in upstate ny! You can tell the blue collar trucks and fits apart from the pavement princesses from a mile away",
                    "score": 29,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oat-beatle",
                            "body": "My friend was running for office and sent me a picture before going to a truck pull in a political capacity, I had to call him and tell him to change lmao. Mother fucker was wearing cowboy boots, hat and big silver buckle 🤦🏼‍♀️",
                            "score": 36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "vereliberi",
                                    "body": "😭 omg no. That’s a great way to alienate your voting base lol",
                                    "score": 11
                                },
                                {
                                    "depth": 3,
                                    "author": "b_xf",
                                    "body": "How do you do fellow blue collars",
                                    "score": 9
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "anon28374691",
                            "body": "I had a work friend at my white collar office job who really, really wanted a Ford F-150 truck and talked about it all the time. I was like why do you need an F-150? For driving to the BART station?\n\nThen my husband and I went on a long road trip and stopped for lunch at a local diner near the east side of the California-Oregon border, and while we were there all these Ford F-150 trucks started pulling in, loaded with bales of hay, tools, and other farming/ranching related paraphernalia. The guys (all guys) getting out were largely in worn western shirts, jeans, work boots, and John Deere caps. My husband, originally from the east coast, said “holy shit, real cowboys!”\n\nThen I went back to work and gave my work friend shit about his F-150 dreams for months.",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "vereliberi",
                                    "body": "That’s amazing lol. My spouse has a large truck, but it’s needed for plowing our driveway (sometimes we even plow our road, if the town doesn’t get to it) and hauling all the equipment and trailers for his property services business. Honestly I don’t get why people want them aside from utility. They’re EXPENSIVE tools! I wish we didn’t have to put gas in it!!! lol. It’s just silly to me to want such an expensive thing that you don’t need or have use for.",
                                    "score": 12
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "b_xf",
                            "body": "Side note I love pavement princess so much, it was immediately added to my vocabulary when I heard it for the first time a couple days ago",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "vereliberi",
                                    "body": "Such a perfect descriptor 🧑‍🍳💋",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Yay_Rabies",
                    "body": "When I used to show quarter horses I had someone explain to me that she preferred competitors to use pointed or almond shaped toes because square cut was for work boots and less formal.  I think k was looking at a fancier pair of boots that had a square toe.  ",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oat-beatle",
                            "body": "The formality levels of various boots is more complicated than wedding dress codes tbh lmao",
                            "score": 35
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "anon28374691",
                    "body": "I’m from rural CA originally (have been in the Bay Area for decades now) and I totally know what you mean about cowboy boots vs work boots. Guys wearing fancy cowboy boots with everyday clothes - not dressed up for an event - were called “drugstore cowboys” ie fakes.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "Falafel80",
            "body": "I can’t think of any, but denim maxi skirts are totally associated with evangelical christians in Brazil as well!",
            "score": 94
        },
        {
            "depth": 0,
            "author": "LilyMarie90",
            "body": "Flags of Germany as a part of clothing or decorations aren't a thing in Germany lol. Thank God.\n\nYou know how the US has bikinis/bathing suits with the stars and stripes flag, baseball caps, random accessories, applications or patches on denim with the flag, and it's not seen as a big deal (especially before the country was as divided as it it now)? That's not happening in Germany with the German flag. Probably no explanation needed.\n\nIf anyone decorated themselves or their home or car with the flag in any way, people would absolutely assume they're far right and/or nationalist. So it's basically a taboo unless they want to get into trouble or at least - rightfully - get some really mean looks from most people around them. Symptoms of patriotism like this just aren't socially acceptable for most people here (which is a good thing ofc)\n\nThe literal ONLY exception is for soccer, during the World Cup or the European Cup. That's when everyone just kind of knows the flag is about supporting the national soccer team and it's normal for people to have it on their balcony or wear the team's jersey, or paint their nails in the colors of the flag. Everyone makes sure to take any flag stuff down after the tournament ends though.",
            "score": 121,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ultimatedream",
                    "body": "Same here in the Netherlands, we only have the flag out on special days like Kingsday, remembrance day and liberation day. We don't really wear the flag either, only orange. Even orange is reserved for things like the world cup, Kingsday and other sport events, you don't wear Dutch orange or the flag on other occasions. It's weird.",
                    "score": 39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LilyMarie90",
                            "body": "I was on vacation in the Netherlands for some of the World Cup 2006 🧡🧡🧡 :D It was lovely",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "goatsnboots",
                    "body": "Same in Ireland, except I also saw flags out during the week of the Eurovision.",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ultimatedream",
                            "body": "Bambie Thug definitely deserved those flags waving! They gave Eurovision one of the best performances in its history. It was a true work of art, even if you don't like the song.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "squeegee-beckenheim",
                                    "body": "Yeah the song won't be everyone's cup of tea but you've gotta hand it to the staging, it's incredible!!",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JLGJLGJLGJLG",
                    "body": "As an American who is not white, our flag is also moving that direction, unfortunately. Beyond July 4 (Independence Day), seeing someone decked out in American flag gear would indicate right wing ideology and I would likely steer clear. Particularly if you top it off with a red MAGA hat and a gun, which is a common combination in some parts of the US.",
                    "score": 76,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "darkwolf131",
                            "body": "I think we need to reclaim American flag gear. Don't let a certain subculture take over a symbol that's supposed to be for all of us",
                            "score": 15
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ktwhite42",
                    "body": "American here who cannot understand how the same people who think kneeling during the national anthem is a mortal sin (realizing that our need to play the national anthem before EVERY sporting event is also odd), and that no one should be allowed to burn a flag - even if it's their own property - are quite happy to flagify every piece of clothing they own.\n\n(Also as an America, we are...facing an existential crisis, please bear with us until November 6th, when we will know if our  battle to remain a democratic republic has been won,)",
                    "score": 40,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LilyMarie90",
                            "body": "Not just you guys are facing some truly serious shit if he's elected. 🫠⚰️ https://www.cnn.com/2024/02/10/politics/trump-russia-nato/index.html",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ktwhite42",
                                    "body": "Oh yes, we know.",
                                    "score": 7
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "JLGJLGJLGJLG",
                            "body": "It makes no sense at all!!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Truant_Muse",
                    "body": "As an American I never used to think anything of the prevalence of the flag when I was a kid, then 911 happened and everything changed and \"patriotism\" got way more intense. I'm 39 now and honestly I won't wear stuff with flags on it, I won't wear red white and blue on the 4th of July.  \n  \nI now assume anyone wearing flag gear unironically is a Trumper (conservative right wing nut) and to be avoided at all costs.",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -77,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ultimatedream",
                            "body": "I guess most European countries are not surviving in that case. Rip Europe.",
                            "score": 19
                        },
                        {
                            "depth": 2,
                            "author": "LilyMarie90",
                            "body": "If we're gone, it's because of the rise of right wing populism (just like in most other Central/West European countries), and climate change, and the possible upcoming war with Russia.\n\n Not because we *don't put FLAGS on stuff.* 🤡\n\nEdit: turns out this guy is German, mostly spamming German dating subreddits with red pill/incel BS. And a man, anyway. No idea what he's doing on *this* sub. Like... leave women alone.",
                            "score": 29
                        },
                        {
                            "depth": 2,
                            "author": "spicy_pea",
                            "body": "Why are you male and reading a female fashion advice sub lol",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Paula_Polestark",
                                            "body": "You know everyone doesn’t follow the same god/s, right? And nothing you’re doing is inspiring anyone to convert.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "imakemyownroux",
                            "body": "Gotta love the cowards who create accounts just to talk shit they aren’t man enough to own on their regular accounts. 😂",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "diwalk88",
            "body": "One that comes up to me is Burberry. Where I'm from in Canada it's a luxury brand associated with classy older women, when I moved to Scotland I discovered it's associated with young people from schemes. It was banned from all the clubs! Lol. I told my husband that my Nana would be banned for being a ned",
            "score": 60,
            "replies": [
                {
                    "depth": 1,
                    "author": "vaulttecsubsidiaries",
                    "body": "I have two questions, pardon my ignorance:\n1. What are schemes?\n2. What is a ned?",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "lucky7355",
                    "body": "About 6 years ago Burberry got a new head designer and started releasing tons of urban streetwear styles that was never their look in the past. They still make classic trench coats but the majority of their collection is streetwear now, worse quality, and more expensive. I stopped shopping with them as a result.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "eilatanz",
            "body": "I’m in the northeastern US and also don’t associate denim maxis with evangelicals, but we have far fewer of those up here. \n\nBut, once when on the bus to a job interview, a Hasidic or very Orthodox woman assumed I was, too, and handed me her baby to watch so she could distract her toddler. I had no problem with it—but it was pretty funny as she slowly registered my nose piercing and lack of other clothing signifiers!",
            "score": 75,
            "replies": [
                {
                    "depth": 1,
                    "author": "b_xf",
                    "body": "I also was once handed a baby on a bus by a very religious mother (in this case Pentecostal) - what a niche experience for two people to share 😂",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "cranbeery",
                    "body": "I do make the long denim association! But I am from the south before moving to the northeast.\n\nI went through a wide headband phase a few years ago and definitely got more positive attention from certain Jewish neighbors when I wore one with a skirt (unless it was a miniskirt, then it was all double takes).",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EdgeCityRed",
                            "body": "I heard about the long denim skirt thing on this sub! I'm from the US (though I did live in Europe for nine years, maybe that's when this was a thing?) I didn't hang out with any evangelicals, though.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Truant_Muse",
                    "body": "Yeah, I grew up in Michigan right outside of Detroit and I associate long denim with either conservative Christianity (we actually called them \"sister wife skirts\" for a while when I was a kid), OR orthodox Jews, as we had a fair amount of them in our area. When orthodox women wear them though their vibe was generally different/chill compared to the white Christian women so I think that's why I have a stronger association there.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "foldedspace24",
                    "body": "That is hilarious!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "penguin_0618",
            "body": "Lilly Pulitzer and Ralph Lauren is what the entire northeast wears when visiting the aquarium, if their vineyard vines is in the laundry that day. Especially Lilly.\n\nSource: worked at (easily and verifiably) the best aquarium in New England for three years.",
            "score": 56,
            "replies": [
                {
                    "depth": 1,
                    "author": "cranbeery",
                    "body": "Mystic?\n\nI can't say I noticed a lot about what people were wearing when I was there years ago, but your anecdote vibes with Connecticut coastal in general.\n\n(I looked back at pics from a visit, and my husband was in fact wearing a pastel Polo RL button down. I was in nautical stripes, but from Old Navy.)",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "penguin_0618",
                            "body": "Haha, yes Mystic.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "doyouhaveacar",
                    "body": "Neither are that big at all in Toronto, surprisingly",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "unripeswan",
            "body": "In Australia sportswear + mullet = eshay/probably a criminal.",
            "score": 19
        },
        {
            "depth": 0,
            "author": "Ok-Bridge-1045",
            "body": "I’m Indian. I see a lot of posts about people saying bigger jewellery looking too “flashy” etc. the jewellery in question will be studs that are 1mm larger or something. \n\nWe wear a lot of jewellery. By American standards, I’d say it’s all very “flashy”. But by Indian standards, it’s all very normal.",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "double-dog-doctor",
                    "body": "I've never had a more fun shopping experience than going jewellery shopping in Mumbai with my Indian colleague. I think I told her I wanted some basic studs, and she just looked at me like, \"...but why.\" \n\nYeah, she was completely right. It was much more fun to search for bold pieces.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ok-Bridge-1045",
                            "body": "I have 6.5mm (1 carat each) studs in gold. They are my smallest, most understated pieces. My mum tells me they were a waste of money. Bigger earrings are definitely preferred here, and they look so pretty! At least gold hoops if nothing else. But with ethnic clothes, we tend to go all out. Large jhumkas and chandbaalis and drop earrings are a necessity.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Iris-Ng",
            "body": "* Any coords with or without prints, or completely plastered in logo = pyjamas, but can be worn to the groceries and anywhere in the streets.\n\n* Chanel- imitations = \"classy\", social-climbing young professionals (heavily influenced by chinese romance drama).\n\n* Dated 70s-80s corporate core = classy ladies (if they are not yet retired).\n\n* Any high fashion, dramatic looks = eccentric, gay, or showbiz people.\n\n* Ralph Lauren = girls who golf in the weekend (very very rare)\n\n* Succession-style quiet luxury = work outfits for women after 40s.\n\n* Wearing authentic mall brands or a few branded handbags = middle class.\n\n* Wearing fake brands = almost every normal people.\n\n* Wearing no brands or unidentifiable brands = upper crusts.\n\n* Anything linen = Buddhists or Japanophile (mori-girls).\n\n* Any exposed skin (thighs, shoulders, décollage, midriff) if it's a healthy tan= you look cheap and begs for attention.\n\n* Any exposed skin if it's pearl white (nights only, under 30) = you're a sexy goddess\n\n* Any exposed skin if you're over 30 = desperate \n\n* Grey hair = you are decrepit\n\n* Wearing mostly black = elegant and serious style (also wearers believe they look slim)",
            "score": 79,
            "replies": [
                {
                    "depth": 1,
                    "author": "mini-mal-ly",
                    "body": "Interesting! Which country are these coming from? Sounds like maybe China?",
                    "score": 31
                },
                {
                    "depth": 1,
                    "author": "bananaphone16",
                    "body": "Omg I’m assuming China, this is so amazing and hilarious, I love the tan vs pale and under 30",
                    "score": 32
                }
            ]
        },
        {
            "depth": 0,
            "author": "intessen",
            "body": "I'm in Central Asia and while I am largely insulated from much of the fashion norms, the bright colours and patterns here astound me! I was gifted a velvet fabric that is a green plaid with baroque style curly-cues which opened up these 'windows' on the fabric for...different big cat prints? Cheetah, tiger, etc. I love seeing people out and about in their velvet two-pieces, generally a knee/calf length dress and pants, with patterns that I most closely associate with a bad movie gangster wife. \n\nAlso, the uniform culture here is strong. White shirt, black skirt, black heels. Men get suits. It's starting to shift a bit in the bigger cities but not so much in my region! It can also be fun to see where exactly the 'shorts regions' are, ie where shorts suddenly become acceptable for people other than tourists!",
            "score": 13
        },
        {
            "depth": 0,
            "author": "danysedai",
            "body": "Cuban, although I emigrated to Canada 15 years ago, so I'm going with what my relatives and friends say people are wearing. \nGrowing up in the 70s,80s and early 90s, my mom and her friends all had a seamstress, and would buy fabric using the rationing coupons and have amazingly well made clothes, made to their measurements. Cuban women used to be very well dressed, but things went downhill due to lack of resources, rationing, the embargo, government idiocy and corruption, and much more. \n\nThe traditional \"guayabera\" shirt was then associated to members of the Communist Party as it became almost an uniform for most ministers. I love to see a man in a white starched linen guayabera(bought one for my son's \"culture day\" tomorrow at school) but most younger men at home will refuse to wear one. Same with plaid shirts for the same  reason.\n\nLong denim skirts are associated with \"Cristianos\", meaning non-Catholic christian religions.\n\nIf someone is dressed all in white, it is usually associated with Santeria(afro-cuban religion), especially if the head is covered.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "theHoopty",
                    "body": "I loved seeing all the older Cuban men in guayaberas, hanging out in Miami. \n\nI didn’t know it had associations in Cuba. So interesting.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Truant_Muse",
            "body": "American: my knee jerk reaction to a red baseball cap is to avoid that person like the plague because of the M.A.G.A. (make America great again) hats.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "dancingmochi",
            "body": "Wearing a green hat in China is associated with adultery. Also white hair decorations as that’s associated with funerals. I can’t say this is widely practiced but more traditional folks follow it.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "IamNobody85",
            "body": "Ralph Lauren is old money? Holy shit! It's produced in my country (not the very high end woolen stuff but the knits) and I've grown up wearing this brand almost as pajamas! Last year, I got two sweaters for my bf's father from back home and I think in total is cost me like 25-ish euros 😂.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Ralph Lauren has a ton of diffusion lines. The high end stuff is old money, not so much the lower end department store stuff.",
                    "score": 105
                },
                {
                    "depth": 1,
                    "author": "nadjasdolly",
                    "body": "Brand perceptions are funny! Zara and H&M are considered luxury brands here in South Asia while everyone outside calls them trashy fast fashion",
                    "score": 23
                }
            ]
        },
        {
            "depth": 0,
            "author": "misoharpy",
            "body": "got very confused before I realized this post was not about Future Farmers of America -- the talk about the denim maxi skirt only reinforced what I thought I was reading!",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "siiriem",
                    "body": "It gets me every time!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sterna-hirundo",
            "body": "I'm from Israel and we don't really have dress codes for events. My professor sais he's only had to wear a suit like three times in his life, and only abroad. Schools and some workplaces have written rules, sure, but the idea of telling your wedding guests what to wear is very strange to me! \n\nLong skirts are very much associated with the orthodox standard of modesty. I usually wear them with a tank top because I don't want people to get the wrong idea. ",
            "score": 34
        },
        {
            "depth": 0,
            "author": "b_xf",
            "body": "Wedding attire seems to be more rigid. We definitely have a lot of the same unspoken rules but where I am in Canada at least, black is totally acceptable for weddings. (White not, but I have seen a lot of white-based floral). ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "kimchi_paradise",
            "body": "Yikes! Seems like I've got to get with the times! LOL sorry, didn't expect my honest comment to gain such negative attention. Guess that's life 😅 \n\n\nTo be honest, I'm a non-american living in America, and I've never heard of any of those lol. Especially the denim maxi skirt thing (???????) aren't those on trend right now?  If I had to come up with a few more for US it would be loose, patchwork cotton jumpsuits tend to fare more hippy/boho, and Patagonia being associated with hikers. But it feels so weird to label a person based on the clothing that they wear. Isn't that what we want to get away from? We are much more than our clothes. Like I've worn modest black and white outfits, it would be strange if someone assumed I was Jewish? Lol",
            "score": -51,
            "replies": [
                {
                    "depth": 1,
                    "author": "QuartzPigeon",
                    "body": "> I'm a non-american living in America,\n\nThis is why you're not making the same associations American born people are, most likely",
                    "score": 112,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kimchi_paradise",
                            "body": "Sounds like it! I didn't think my comment would garner such negative attention, but here we are 😅\n\n\nPerhaps then I might be missing the cues in people's fashion... ",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "doyouhavehiminblonde",
                                    "body": "I don't understand why you have so many downvotes either",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "anon28374691",
                    "body": "I totally associate long denim skirts with fundamentalist cults. It’s their version of wearing jeans, but women can’t wear pants.",
                    "score": 122,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mariannereddit",
                            "body": "In the Netherlands the maxi Jean skirt is also a thing for strict Christians when women can’t wear pants.",
                            "score": 43,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "llama67",
                                    "body": "Really? I lived in NL for 10 years + Dutch husband and I’ve never seen that. Must be common only in the Bible Belt, right?",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Mariannereddit",
                                            "body": "Yes, I’ve lived in Zeeland in my youth and there it was very common.",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "catxcat310",
                    "body": "Patagonia fleece vests are associated with Wall Street bros.",
                    "score": 42,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mini-mal-ly",
                            "body": "Omg can't believe I forgot about this one! Also associated with tech bros.",
                            "score": 16
                        },
                        {
                            "depth": 2,
                            "author": "llama67",
                            "body": "This is relatively new I think, due to outdoor activities becoming the new rich guy hobby. \n\nSame with Carhart becalming so popular - although that might be a European thing",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "catxcat310",
                                    "body": "I think it’s also a popular corporate gift from a lot of finance and tech companies to their employees.  They put their own logo on it.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "herefromthere",
                                    "body": "I've only ever heard of Carhart on this forum - I'm in the UK.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "llama67",
                                            "body": "In NL, Denmark, etc it is EVERYWHERE. It was originally a workwear brand (stop is) but for example they opened a big store in a very expensive part of Copenhagen and there was a line around the block 🙄",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Kallisti13",
                                                    "body": "Was in NL in 2022 and saw the Carhartt fashion line stores there. We have normal \"working mans\" Carhartt in Canada haha.",
                                                    "score": 5
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "nomarmite",
                                            "body": "I think you may need to go shopping more. Carhartt is huge in the UK, though mainly with men, with stockists all over the country and several branded stores. It's been a cult workwear brand since the 80s.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "herefromthere",
                                                    "body": "I am a middle aged woman with an office job, I have no need of shopping for men's boots.",
                                                    "score": -3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "spicy_pea",
                                    "body": "Is it just hiking, or other outdoor activities?",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jrochest1",
                    "body": "I ABSOLUTELY don’t know why this comment is so downvoted, especially when the rest of the thread is happily saying the same thing!",
                    "score": 8
                }
            ]
        }
    ]
}