{
    "title": "Daily Questions Thread May 22, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "LittleMissCoder",
            "body": "I have an autoimmune disease and work from home so I basically live in PJs. Does anyone have any suggestions for soft, comfy clothes to elevate my style?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "zurriola27",
                    "body": "I like jogger and sweatshirt sets from Mate the Label and Pact! I also find Jungmaven's loungy stuff to be super comfortable.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Are you looking more for clothes that are comfy but pass as office/outside wear? Or more elevated lounge wear?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LittleMissCoder",
                            "body": "More towards the \"comfy enough to wear inside but cute enough to wear outside\" side if such a thing is possible haha 😄 I don't need office wear since I'm never on cam or in office, but clothes that work for both inside and out would be awesome",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "astrobeanmachine",
                                    "body": "I live in Old Navy linen blend pants in the house in the summer. They're light enough that I don't get sweaty, but thick enough that they don't wear out too quickly, at least for me. And because they're a blend rather than pure linen, they wrinkle less, which I appreciate when I sit down all day and then suddenly go out on an errand or soemthing. They're often on sale too, which is nice.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "I like Roots ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "astrobeanmachine",
            "body": "I'm on an endless quest for **comfortable city-type sneakers** to wear to a dance club, concert, the like. On most days my hobbit feet and I get away with [these crunchy Bedrock clogs](https://bedrocksandals.com/collections/bedrock-mountain-clogs) (I love them, 10/10 would recommend for the girlies with wide, high-volume feet) or Blundstones, with sandal Birks occasionally thrown in. But these are all either too heavy for dancing (especially in the summer), or not the right setup for the context (wearing sandals for nightlife is a recipe for gross, painful feet). **Comfort, for me, doesn't mean a lot of arch support or stack height, but it does mean being wide enough, and I need to feel secure enough not to get blisters from jumping around and dancing.**\n\nSome options I've considered:\n\n* I loved the look of [these Vans](https://www.vans.com/en-us/shoes-c00081/together-as-ourselves-sk8-hi-shoe-pvn000cmxcyl), with the paint splatter print, but it's been a long time since I've had Vans, and once they arrived I remembered why I haven't had a pair in a while - they're both too long and too narrow for my feet, despite being a unisex fit. And the sole feels dull, for lack of better word, though if the shape was right I bet that the sole would break in over time.\n* I had [Saucony Jazz sneakers](https://www.saucony.com/en/jazz-original/11843W.html) in college for a brief time, but the way that the sole tapers then flares out didn't work for my feet at all.\n* I had [Birkenstock Bend sneakers](https://www.birkenstock.com/us/bend-low-natural-leather/bendlow-smoothleather-naturalleather-0-rubber-u_2.html) for a restaurant job for a while, and they were alright, but the sole is somewhat stiff, and they never were my favorite.\n* I've tried multiple styles of Hokas, even though they're not quite what I'm looking for, because they're trendy and culturally accepted in my area for all occasions lol. They're just not for me, dawg.\n* I'm considering [Lems Primal Zen](https://www.lemsshoes.com/collections/womens-primal-zen-shoes/products/womens-primal-zen-suede), as I think these are cute and fit my needs on paper, but it's hard to justify that price for something that I worry will break down with not much wear (I've read this can happen with the outsole).\n\nI'd like to keep this purchase **under $100**, with U.S. availability and ideally free exchanges (sizing is my nemesis). My general aesthetic is queer granola artist, but for the right fit and comfort I'm open to a lot of aesthetics. What else should I be considering?\n\nEdit to add: I kind of love these [Allbirds Couriers](https://www.allbirds.com/products/womens-couriers-dark-grey-natural-black-natural-white-sole?price-tiers=msrp&size=6) but I worry about comfort for long days/intense use, and also durability. I have Wool Loungers and those are great for low-walking days, but after walking in them a lot my arches hurt (I think they've stretched significantly over time). I also love the aesthetic of these [Allbirds trail runners](https://www.allbirds.com/products/womens-trail-runners-swt-blizzard-natural-black?price-tiers=msrp%2Ctier-1%2Ctier-2%2Ctier-3%2Ctier-4) but they might be a hair too sporty in their construction for the purposes I need. Has anyone had either of these sneakers for a while and can report back?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "biggerthanasquirrel",
                    "body": "New Balance has a width filter on their website. Their [574s](https://www.newbalance.com/pd/574-core/WL574V3-40378.html?dwvar_WL574V3-40378_style=WL574EVW) are still super popular (more popular last summer) but I see them all the time. Comfy for all day wear (I used them as a 5mi+ walking, gym, everything shoe), they are lightweight, and they are under $100. You can find them at a lot of different shoe stores too, if you want to try them on before ordering. I went to Nordstrom but they have them all over. \n\nThey also clean really well. I went on an impromptu hike in them and went ankle deep in mud. They washed really well, even though I couldn't wash all the mud off straight away and some of it dried on.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "astrobeanmachine",
                            "body": "I haven't tried on these particular New Balance ones, though I've heard wide foot folks love them, so I may need to check them out. I'm worried about the similar heel construction to the Sauconys I linked above - do you find that you wobble at all while walking in them? That was my problem with the Sauconys, since it tapered in and wasn't a straight cut down from the heel to the bottom of the sole.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "biggerthanasquirrel",
                                    "body": "I found them very stable but tbh I don’t have wide feet. I have friends who have wide feet who also like these shoes. I would def try them out! They're easy to resell if they don’t work out.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "I think my feet are the same shape as yours. Two shoes that fit me brilliantly are Allbirds wool Mizzles and the Mephisto Niro, though I'm not sure if they'd work for you aesthetically.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "astrobeanmachine",
                            "body": "Hello fellow hobbit footed friend! I haven't tried those particular Allbirds; I do have a pair of their Wool Loungers, and I like them alright, but they're almost too loose and sloshy for dancing in. I might have to check out their other options though. The Memphistos are not winning any style awards, in my book, but hey, if they fit sometimes that's enough to overrule aesthetics!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "I found the most brilliant and comfy brand of sneakers yesterday! The store said they're so popular they have to keep ordering more. The brand is \"Vessi\" - I liked the Weekend shoe, it comes in a lot of cute colours too. I also discovered Allbirds which seemed comfy too but maybe more flimsy.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "botanygeek",
                    "body": "Not quite in budget and idk if they are your style but my favorite sneakers are the [Taos Z Soul](https://taosfootwear.com/collections/sneakers/products/z-soul-12) with the zipper.  I love being able to zip them off and on and they have several colors and arch support!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "astrobeanmachine",
                            "body": "I've heard of Taos but never tried them! It looks like they have a lot of arch support though, which might actually be a problem for me. How do you find that they compare to, say, Birkenstocks?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "botanygeek",
                                    "body": "I would say they have similar arch support to Birks but I need arch support so I like them!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I find nike daybreaks to have more room than my other sneakers and they are comfy enough to wear all day",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "astrobeanmachine",
                            "body": "Oh wow, these look classic! Thanks for the rec. I worry about the fit in the heel (they have that cut similar to the Sauconys) but I might consider them anyways.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HalpWithMyPaper",
            "body": "What does \"dressing old\" mean?? People keep telling me I dress like a granny, but when I ask them how to change it they just say \"idk, just take that outfit off and burn it\" or \"wear more bright colors and less black\" \"Show some skin\" but I like black! I don't like bright colors and I don't like showing skin. If a dress or skirt is above the knee, I feel naked. If I have any cleavage showing, I feel naked. If the sleeve is less than 4 fingers wide, I feel naked. Is there any way to keep my looks modest and black without looking \"old?\"",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "biggerthanasquirrel",
                    "body": "They sound super rude. Burn it? Get out of here. Textured black clothing is cool. Find something with a [wrap](https://thelinebyk.com/products/felix-top-black) or [different structure](https://thelinebyk.com/collections/tops/products/becks-short-sleeve-top-black). Try[ flare](https://shop.lululemon.com/p/womens-leggings/Groove-High-Rise-Flared-Pant-with-Pockets-32/_/prod11680318?color=0001&locale=en_US&sl=US&sz=6&cid=Google_SHOP_US_NAT_EN_X_Hybrid_Top-Sellers_OMNI_GEN_Y23_ag-SHOP_G_US_EN_DM_X_GEN_NO_Top-Sellers-All&gad_source=1&gclid=CjwKCAjwr7ayBhAPEiwA6EIGxH9yzelQt5GEfvENhsjWlYEMG2MqjnRwoVOhiTqIkOCi0OYP1BISIBoC5xUQAvD_BwE&gclsrc=aw.ds) pants or [cargos](https://www.uniqlo.com/us/en/products/E468583-000/00?colorDisplayCode=09&sizeDisplayCode=004&gad_source=1&gclid=CjwKCAjwr7ayBhAPEiwA6EIGxD-ngTWKScBELACIbyXSj2kmOgPPkunE73YhU-vtFYb4xGHQzyBfaxoC_d4QAvD_BwE). If it's something that genuinely bothers you, you can try to switch up your style. But there's nothing wrong with prioritizing comfort over trendiness.\n\nI actually have an all black [Pinterest board](https://www.pinterest.com/hel4o/all-black/). I love fashion and online it's easy to feel like you dress boring if you aren't in eye-catching colors. But for every day I prefer black. The images aren't super modest (I dress relatively modestly day to day, but enjoy a backless top every once in a while.) Anyway, it could give you an idea of how you can mix textures and stuff for an all black outfit that isn't just a tshirt and jeans.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "It sounds like we dress really similarly! Your outfits might always look “old” to some people. If you like how you dress, then don’t listen to them! Also if it’s your friends that are hassling you, set boundaries and tell them not to even if they’re trying to do it with good intentions - if they keep doing it, they’re not good friends. Regardless of what you wear, someone somewhere is going to have a shitty opinion about it, so honestly don’t feel pressured to change your style. \n\nIf you do want to make little changes - all black/monochrome outfits look great with bold pops of colour with accessories - like lime green shoes or a red silk scarf or cobalt blue handbag. \n\nIf you want to break into other colours, going for jewel tones or grey/denim/navy/brown/olive are not too far of a step from black. And lighter neutrals like white/light grey/taupe/tan will provide a lot of contrast without being flashy, if you want to try those (I like doing monochrome outfits with one white, mid-grey, and black item). If you like the way black looks near your face, it’s easier to add colour on the bottom as pants/skirt. I wear olive green pants with black tops a lot. \n\nIf you really just like all black, lean into it. I think there are a bunch of old albums for goth/witchy aesthetics in here - if you’re wearing a long black skirt and bell-sleeved sweater with a big silver nature-themed pendant and a darker lip gloss, it looks more intentional.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "avocadoandpear",
                    "body": "If you're happy with what you wear, wear it. If you want to elevate it or make it feel more \"age appropriate,\" you can rely on your hair, makeup, accessories and tailoring. Check out Pinterest for \"dark academia\" for some ideas. Just changing your shoes can make a huge difference. Back in the day, Courtney Love wore babydoll dresses and barrettes. NO ONE thought of/accused her for dressing like a child. I'm in my 40s and my advice is to remember when you get dressed, it should be for you. You like it? Comfy? Happy? Then that's all that matters. (That said I'd never wear any of the crochet shawls my 76 year old mom makes because it would make me feel old-old) 🙃",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Look at hijabi fashion tags on Instagram or tik tok for inspo",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "klgmac",
                    "body": "My spouse says I dress like an old lady. I realized that certain clothes didn’t fit well and needed to be taken to a tailor. Don’t know if that applies to your situation. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "2020_inspiration",
            "body": "Dresses with hoods for the summer? I’m beginning to consider whether sleeveless dresses with hoods are a good choice for summer in my country- imagine heatwaves but with regular spells of rain!",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I've never seen sleeveless dresses with hoods but maybe something from Title 9 would fit the bill - they have a lot of cute dresses that are best suited for wearing outside in the elements",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "Not a great idea. The hood won't be waterproof, and while it's down it will create a thick bunch of fabric at the back of your neck which will make you feel hot.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Local_Wave",
            "body": "My 3/4 of the year casual wardrobe involves throwing an oversized sweatshirt over my outfit. I don’t like to wear bras and feel more comfortable with a second layer for nip coverage. Now that it’s heating up, I’m wondering if there is a summer equivalent — a white linen shirt comes to mind but interested in other ideas! Doesn’t have to be a second layer if it is thick enough as a single layer to provide the same coverage.\n\nThis is for day to day running errands, so while I like to look put together it is definitely casual.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "Nippies nipples covers maybe? I like that brand fwiw.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "shibalore",
            "body": "Are there anywhere you buy shorts that are a \"curvy\" cut, but come in smaller (aka, not plus) sizes? I've had no luck with American Eagle's cuts -- I think their curvy offerings have just been atrocious the last few years --  which is the main one I am aware of. I'm not looking to spend a ton, but I'm open to just about anything at this rate.\n\nI used to be a size 10/12 and I never had this issue when I was that size, but now that I'm a 00/0, it feels like smaller sizes are almost cut \"straight\" if that makes sense, like a kid's size? I haven't bought clothing in years because 90%+ of things turn out too big or too small, no matter what size I buy.\n\nWith that being said, if someone has a similar issue and has had luck with non-curvy shorts they think I should try, I'm all ears. I'm mostly looking at denim shorts because I'm a tired human more often than not and like being able to throw on a cropped tee and shorts and go.\n\nThe best fitting shorts I had consistently were American Apparel, but I acknowledge they were far from the perfect fit. This photo is a few years old (from the 2010s, be nice to me Gen Z), but my body hasn't changed much: (edited out) -- I was wearing a 24 here. They were great in the torso; the style was suppose to be a little looser around the thighs, but c'est la vie. (Quick ETA: I know this is quite the look, I got dragged on a hike last minute and was not expecting it, haha).\n\nI think I'm looking for more mom style cut -- fitted in the torso with mild looseness in the thighs -- but am open to anything. Sorry for the essay! I appreciate y'all. I spent a lot of time looking today and just ended up upset and overwhelmed.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "astrobeanmachine",
                    "body": "I don't have great recommendations, mostly just solidarity, because this is my struggle too. I've heard great things about Abercrombie's curvy line, but I think that might mostly be for jeans and not other types of shorts. If you do find a good option, please share!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "shibalore",
                            "body": "I'm really happy it's not me. Non-denim shorts always fit me weird in the crotch, I think perhaps for the same reason I struggle with denim shorts, so they're even more hopeless for me. I'm not very tall, either, which doesn't help. I find that AEO's curvy shorts hit me so high that I look stubby, I think because of the visual lines that shorts create, because I don't have the same issue with super high rise jeans jeans. \n\nI had to go run errands today in my poor fitting shorts (American Eagle \"Curvy Hi-Rise Shortie\" in a 2 curvy) and I looked so silly. They're both too tight and too loose. I walked by a girl in denim shorts that fit her exactly the way I've been trying to get shorts to fit me for years, and man, the envy I felt. \n\nI will report back if I find them and you do the same. Saved your comment!!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kimchi_paradise",
                    "body": "Check out Madewell! They have a wide range of curvy sizes in their shorts, I know as that is where I get mine! \n\n\nAlso check out Abercrombie and Fitch! ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "belindabellagiselle",
            "body": "Is [this dress](https://www.kohls.com/product/prd-5945264/womens-london-times-print-cap-sleeve-fit-flare-dress.jsp?color=Royal%20Ivory&prdPV=160) too white for a semi-casual wedding?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Nope, looks perfect",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "up_down33",
            "body": "Ideas on how to style this for spring and summer mostly? I am in college and between 5'8 and 5'10. I weigh around 135 to 140lb\n\nhttps://preview.redd.it/a5istrr9v02d1.jpeg?width=4000&format=pjpg&auto=webp&s=af0eca359b833485010dc7c2a34d300eb32eb0d7",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Statement socks with cropped pants or skirts (any length on skirt). Going super feminine with the rest of the outfit would be a cool contrast with the shoes. Or lean more gender neutral with a loose button down/oversized cardigan.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Effective_Cricket810",
            "body": "Anyone working in fashion, what do you do and would you recommend it? \n\nThinking about pursuing a career in fashion and there are many options that I’d like to do but I also know it’s a hard industry with low payments. If you work in fashion I’d love to hear your experience",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "There’s a bunch of podcasts more about the business side of fashion and that interview a bunch of different people in various roles in the fashion industry, those might be interesting if you want to get ideas of what it’s like.\n\nZoe Hong on youtube also has a ton of content about fashion school/the industry, and really knows what’s she’s talking about as both a professor and a designer.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "unpaidbabysitter0919",
            "body": "Would you say a blazer is too small if you can’t button all the buttons? There are three buttons. The top two button at ease, but if I button the last one, the jacket doesn’t fall down straight and makes a triangle shape. People wear jackets open usually unless it’s cold. Would you wear it all unbuttoned then? The blazer fits well everywhere else",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "intessen",
                    "body": "Not particularly. On men's suit jackets the bottom button of three is never buttoned, and the top one may not be, and only when standing. If you're comfortable with how it looks with only the middle button done up and don't mind a question or two, go for it.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "avocadoandpear",
            "body": "I bought a dress especially to go to a concert next month and I love it except....it's really deep cut. I bought a size 18 to accommodate my chest and the dress does fit correctly everywhere but to fit in the chest the V neck opening top is now really far apart. \n\nSee a pic here (https://www.adriannapapell.com/products/cap-sleeve-mikado-midi-dress-with-high-low-skirt-in-black-ap1d105274 ) then imagine the lapels are 6 inches apart showing a lot of cleavage. I'm not comfortable being that exposed. Besides wearing something underneath or going to a tailor, any ideas what I could use to bring the lapels closer together or camouflage a really deep V neck?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "Fashion tape?",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Olander-e",
            "body": "Slump\n\nHello ! I’m in a major fashion slump after a long hospital stay and I want to tackle this head on with some much needed help! Depression has got me down and lacking a lot of confidence too- so I’m struggling to find a way to kick start this project.\n\n—- Context: —-\n\nI’ve been stuck in an oversized black and white rut for over 20 years and I feel like life is too short to stay in that corner for so long. So, with your wisdom, I would like to build a new capsule wardrobe- adding more colour and actual fashion sense that you think would suit my curvy + midsize shape.\n\nI work in the humanitarian sector, so pieces that could suit basic office, diplomatic meetings, but also smart casual for regular days!\n\n35, 167cm, midsize/curvy, usually sized between 38-42 EU, neutral skin tone according to ChatGPT, brownish hair (which I’m trying to grow long after sporting a bob for almost 10 years).\n\n—- How you can help: —-\n\nI’m looking for a sustainable capsule wardrobe, meaning natural fibers, “easy” colours, timeless silhouettes, high quality, “fashion crime” proof and interchangeable. I’m willing to invest in tailoring if needed as well. So ideally timeless pieces and the good quality stuff that could be repaired over time if/when needed.\n\nI’m also interested in some accessories since I lost that Casio watch I always wore and maybe it’s time for something a bit more grownup and feminine for everyday.\n\nIf anyone could also suggest a fashion app that could help me store the ideas and make outfits- that would be super appreciated!\n\nHere is the black and white situation…\n\nhttps://preview.redd.it/2e2neplat32d1.png?width=1080&format=png&auto=webp&s=b53dade3b2484bad9e9c69a2bb8c8d7b3717a0a3",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I would approach this from several angles at the same time:\n\n1) Figure out what colours you like/look good in. I suspect you would look great in brighter colours like kelly green, cobalt blue, hot pink etc, but I’m not a colour expert. Honestly the easiest way to figure this out yourself is to go shopping and try on tops in every colour imaginable (even/especially in colours that you think will look terrible on you - sometimes you can be surprised). Take photos for reference. You can build a capsule wardrobe around several “statement” colours, or just have a couple and mix in more neutral colours, whichever you’d prefer. \n\n2) Start getting more specific about what items/silhouettes you’re looking for. Look for blogs/instagrams/youtube videos of people who have the style you want. Try to find some with a similar body type as you. And it’s an extra bonus if you can find someone in the same general location, because it usually means you’ll easily be able to order from the same shops as them. But don’t worry about all that to begin with, just start with looking for visual inspiration. You can also start a pinterest board and pinning a lot of outfits you like (then later on get more specific and narrow it down to specific silhouettes/colours/and filter out anything that’s not practical or comfortable for your lifestyle). Once you have ideas of what kinds of clothing you’re looking for, go to shops and try on all different types/cuts of clothing. This is where you’ll figure out that you look better in tapered trousers rather than wide, or flowy, less structured blazers rather than really structured ones, etc. You likely have a pretty good idea of this already, but again like the colours, it doesn’t hurt to try on some silhouettes that you naturally don’t gravitate towards, to see if there’s anything new you might want to add. \n\n3) Read blogs/watch videos about building a capsule wardrobe. Identify which pieces you can pull from your current wardrobe, and then create a wishlist of items to fill in the gaps , using the research from the first two steps. This could be really specific or more general, like “a kelly green single breasted blazer” or “a blazer or cardigan in one of my three statement colours”. You can use pinterest to pin ideas for everything all together for an easy scroll through, or make a collage of all the images if you want to be able to see everything without scrolling. \n\n4) Only start looking to buy items after you’ve done the first three steps. It might be time consuming and take longer than you want, but it’s better than buying some things here and there and ending up with an awkward mix of items that end up not being ideal for your dream capsule wardrobe.\n\n5) For jewellery, pick gold or silver (whichever you think looks best on you) and make a little jewellery capsule too. Pick up a watch (Olivia Burton has really gorgeous ones that aren’t super expensive) and anything else that you feel like you’re missing in outfits (maybe a necklace or ring). Don’t invest a whole lot of money into anything, try out the less expensive version first to make sure you’re going to wear it a lot. \n\nFor apps - if you have an iPhone, I use Stylebook mostly to track clothes I own and cost per wear. But one of the features is creating outfits - you could create a “potential purchases” category, save photos of wishlist items, and then build different outfit combinations in the app (along with your own clothes if you add in your wardrobe). You can also have it generate random outfit combinations, which is sometimes hilarious but would be pretty good for testing out how versatile your capsule would be.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Olander-e",
                            "body": "Awesome! Thank you! 🙌🏻",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bringbackradarto4077",
            "body": "https://preview.redd.it/9xq6w7mk042d1.jpeg?width=2000&format=pjpg&auto=webp&s=6bcf589cf2d4c1bbca58ed9079b9e2fd9dd5bd0a",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "bringbackradarto4077",
                    "body": "Thoughts on these? They're speaking to me and on sale",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Silly-Addendum-6465",
            "body": "looking for pants and long sleeve button ups, in green, brown, burnt orange (think autumn colors) in cotton gauze or linen?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "healinghobbit",
            "body": "I have been looking for my style, what feels right, for years, and I haven't found it. I need a pair of shoes that aren't my brown Oxfords because I can't wear them with everything and I got a pair of flat white Mary Janes. I don't feel super happy with them because I've always leant \"androgynous\" but I like them aesthetically. I can't find shoes that I like aside from my beloved Oxfords. Do I keep the Mary Janes? They weren't too expensive",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Spook-er",
                    "body": "I think that with shoes like mary janes since they are a little bit girly, you can actually lean a bit more masculine/androgynous styles without loosing balance in an outfit as gives a nice contrast. Other types of shoes that you could look into are loafers, combat boots, sneakers or chelsea boots if you decide against keeping the pair of flats. Personally, I would keep them for now, especially since you stated you do like them aesthetically, and see if you can find a way to make them work.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "avocadoandpear",
                    "body": "Check out GH Bass shoes (sandals and loafers), Office of Angela Scott shoes (mules, oxfords), Camper shoes might have something & definitely check Julie Bo derbys. https://www.juliabo.com/collections/derby-shoes-women",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "The_Sp0iler",
            "body": "Similar to Michelle Wie West Collection? (Diamond Friendship Bracelet)\n\nHi all, I saw [this](https://wovemade.com/shop/michelle-wie-west-jewelry/custom-diamond-friendship-bracelet-yellow-gold-bracelet) and fell in love. Then I saw the three months rent price tag and died a little inside\n\nI am looking for something with **beads,** not hanging charms\n\nI found this on [Etsy](https://www.etsy.com/listing/1656110694/tnt-diamond-bracelet-in-gold-and?click_key=665fb7818f2897736a96eea7371398dff3a73188%3A1656110694&click_sum=0b12c0c0&ref=user_profile&frs=1&sts=1), and it's close, but I really liked the jewels on the letters of the MWW collection.\n\nI started looking at charm/Pandora-like bracelets, but most have dangle letter charms, and I didn't see very good reviews of Pandora\n\nAnything in the direction of something similar for under $250 would be lovely",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jeweledbeanie",
            "body": "Thoughts on [these](https://www.everlane.com/products/womens-way-high-drape-pant-ankle-white) Everlane high rise draped pants? If you own them how is the fit and material feel? Any alternatives?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "merelyindisguise",
                    "body": "I have these in the Ash Brown color. I'm about 5'3\", so I had to hem them about 3 inches - other than that, no issues. I wear them a lot in the summer!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jeweledbeanie",
                            "body": "Oooh I’m 5’3 too. Do you wear heels with them? Do they drape well or wrinkle?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "merelyindisguise",
                                    "body": "I only wear flats, no heels. They drape very nicely & I find it's a good amount of volume for my frame. They wrinkle moderately with wear, not so much that it bothers me - different story after washing though; then you would need to steam or iron them.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jeweledbeanie",
                                            "body": "Thank you!!!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "scrumperumper",
            "body": "i need narrow sneakers!! i wear US 8-9 EU 39-40 but my feet are 3.2in at the widest and 2in at my heel. i’m looking for below-ankle casual sneakers. i’ve tried various styles from most major brands but have yet to find a truly narrow shoe",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Idujt",
                    "body": "My feet are narrower than yours, I wear Converse.  May not work for you though as I wear a 34-35.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "scrumperumper",
                            "body": "thank you for the suggestion. i have a lot of experience with converse and they are too wide for me. my feet are 5-6 sizes larger than yours. when the shoe sizes go up, they don’t go up in length only but also in width.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "FunnySpirited6910",
                            "body": "I also like converse for my narrow feet 😉",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "klgmac",
                    "body": "What type of sneakers? What kind of function? I found the slip on sneakers from Birkenstock in narrow width worked well. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "import_laura_as_lr",
            "body": "Does anyone have any recommendations for tall one-piece swimsuits available to try on in Canada? I'm about 5'9\" and most of the ones I've tried are just a little too short to be comfortable",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Aerie carries them online and has super easy returns",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "astrobeanmachine",
                    "body": "If you want a modest coverage suit (think 1920s/1930s shorties and high necklines), I'd check out Beefcake Swimwear. They're a fun, small company, and I tried to make one of their suits work last summer, but I am short and especially so in the torso. So their length might work perfectly for you! They even have \"long\" versions, if you're worried that a regular size would still be too short.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "zurriola27",
            "body": "Another NYC question. I’m coming from a drier climate and more rural coastal area. I’m trying to figure out how to pack for this weekend. Saturday is a high of 76 F with ~70% humidity. I know everyone’s temp thresholds are different but in general, I’m not sure how much the tall buildings affect the temp walking around the city? Like is it cooler in the shade? Like will jeans be too hot and sticky? Any and all tips welcome.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "Shade will be cooler BUT that will be counteracted by all of the dark surfaces sucking up heat and radiating it back at you. At those temps, I'd definitely be heading towards shorts, skirts, and wide leg flowy pants.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zurriola27",
                            "body": "Thank you so much! I don’t live in a big city so I have no idea how much temp can be affected. This is so helpful!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FunnySpirited6910",
            "body": "Has anyone found a Birkenstock like for skinny feet?\n\nI know Birkenstock has the narrow option but I find it very difficult to walk with this kind of shoes when we have very skinny feet. Even if the sole is narrower the feet don’t seem to fill the sandals and I feel like I’m dragging the shoes or they will fall off my feet.\n\nI have seen many brands selling similar shoes but I don’t know which ones could work for skinny feet. Have you tried one of them?\n\nThanks 😉",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "astrobeanmachine",
                    "body": "My partner's mother has tried to get me to wear Naot sandals, as she has long narrow feet (the opposite of mine, lol). I think they're a similar style to Birks, but just made for a different foot shape!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FunnySpirited6910",
                            "body": "Thanks for your feedback 🙏🏻 I’m going to check those out. I have long narrow feet just like her 😅",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Moment_of_Tangency",
            "body": "My mom has tasked me with finding her a dress for my brother's college graduation. She is worried about being too over and/or underdressed. This will be an outdoor event in California. She is in her 60s but IMHO looks 40s. She tends to be shy about branching out stylistically but has become more open in recent years. Thanks in advance!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "avocadoandpear",
                    "body": "Outdoor event in the summer here, I recommend a dress in cotton, jersey, linen or silk for breathability. Dress up with nicer accessories, shoes and purse. Shawl or light cardigan can make it a bit more casual. Also consider sunglasses or a hat for the sun. Check out dresses from Quince, Marcella NY, and Karen Kane.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "LIL_T-O-X-I-C",
            "body": "Shapewear with an apron belly.\n\nI have a trip coming up that I want to look amazing for and while there is nothing wrong with my body I have a skin-tight dress that I believe would look better with shapewear underneath. I have an “apron belly” that gets wider as it gets lower making it protrude on the sides. I have tried some shapewear but it normally just lifts my belly up instead of shaping it. This gives me a weird shape around my midsection and takes away from my curves. I was hoping someone would know of good shapewear that could pull my apron belly away from my sides to show off my actual figure. \n\nTo avoid any confusion it is an apron belly that physically hangs down due to several previous major weight fluctuations. It’s not loose skin it is my belly. It is also not hip dips or love handles. It’s simply just my tummy so if anyone with a similar issue or any ideas for helpful shapewear could help out that would be much appreciated. Thank you! Preferably something sold online!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "I’ll do the best I can. It depends on the dress, because higher control shapewear will show through thin fabric. In general, I would suggest:\n\nSpanx oncore -> Rago \n\nWith Spanx being less compressive but also difficult to see under a slinky dress, and Rago being more compressive but showing through more. In both I like the ones with shorts and sometimes straps, if you can. \n\nI don’t have the apron belly fit concern so you might want to look for reviews that address that if it’s possible. \n\nIf you’re brave, you can also consider layering shapewear. Be smart about it though, that can get unsafe. Make sure you can move and breathe. \n\nI also like the maindenform women’s waist nipper. You could experiment with layering it over a shapewear. It does have boning and may show through thin fabric.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LIL_T-O-X-I-C",
                            "body": "Thank you so much! I’ll definitely look into all of these!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "District98",
                                    "body": "Youre welcome!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "thenfacetoface",
            "body": "Has anyone tried the Uniqlo body silhouettes? What do they feel like? Do they show lines?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Luluafficionado",
            "body": "Comfortable luxury sandals? \nIm eyeing the Tory Burch miller cloud sandals for their comfort. The soles are thick and wide which helps my flat foot. Because of this most designer sandals won’t work for me. I refuse to buy these because I don’t care for this brand. The logo is kinda tacky to me. I like simple or small branding. Less is more. I want something with a sole like this that I can style up or down. Another reason why I refuse to buy these is because my coworker has them in multiple different colors. Although our jobs are hybrid remote. Our work attire is business to business casual depends on the day/event. Anyone know of anything similar? Not really limited to budget as long as it’s not outrageous (over 1k). I’m a bit frugal but am willing to splurge 300-500 for something classy, comfortable, and durable.  Please let me know if you all have anyhing in mind. TIA. 🤗",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Illustrious_Talk6153",
            "body": "Advice on different ways to wear Saree? I bought two because my best friend is indian and as part of her wedding party I had to look the part on multiple events (hennah ceremony, wedding ect... ) But I don't know if I can really wear it without it being culturally insensitive, and I don't want these beautiful garments languishing in the obscurity of my closet. Any suggestions for styling that doesn't infringe upon an uncomfortable culture line?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "I mean why not talk to your best friend about this? Presumably she will be happy to help",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Illustrious_Talk6153",
                            "body": "Because she responded with what was essencially \"idk man\"",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "oat-beatle",
                                    "body": "Oh I thought you meant at the wedding events themselves, my bad. I'd just save them for the next indian wedding or celebration you attend tbh",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "If the pallu (end section) is embroidered or decorative, you could cut this off and wear as a scarf. I have a few of these and they're really useful.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "There probably isn’t a way that isn’t going to get you a lot of side eye, apart from events where you’re being invited to wear it or it’s expected, like your friend’s wedding or maybe a cultural festival. Also I assume the sarees you have are quite fancy - so it’d be weird to wear them more casually. People have the same problem with bridesmaid dresses, they’re often too specific and formal to wear in other circumstances.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Charm-Bomb",
            "body": "I have a weird work event coming up and need advice. My boss is planning a full-day meeting with a workout session at the end for our team consisting of several staff and faculty members. He said we should plan to dress casually since we likely won't have time to change and head over to the gym, where we will do some breathing exercises and sparring. I will be presenting at this meeting throughout the day, so I don't want to look too sloppy or wear anything too revealing. It's scheduled for late June, so it will probably be pretty warm by then and I'm guessing we might get a little sweaty with the sparring.\n\nAny suggestions on what to wear? I'm hoping to avoid leggings, as I think they'll feel too form fitting, but it might be too warm for joggers. I don't know...I'm feeling lost.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "klgmac",
                    "body": "I would say screw the schedule and change before the workout anyway. Depending on the culture of your department this might be a good opportunity to point out some unintentional sexism. Casual/workout clothes for men is shorts and tees. Women’s workout pants (in summer) are not the same, as you mention. ",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Charm-Bomb",
                            "body": "That is a really great point and I had totally missed that! I do think it’s worth bringing it to my boss as he likely didn’t think of that either.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mini-mal-ly",
                    "body": "I really love these [technical wide leg pants](https://www.quince.com/women/performance-tech-wide-leg-commuter-pant?color=black) from Quince! Strongly recommend them. You can then wear a tank with a button down on top.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Charm-Bomb",
                            "body": "Ooh I like those! Thank you!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mini-mal-ly",
                                    "body": "No probs! Warning that the elastic is pretty tight on these, so consider sizing up and/or buy two sizes and return one.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "floracalendula",
                    "body": "Linen tee, linen trousers. You can move in them and you won't drown in your own sweat.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "1000tragedies",
            "body": "i'm in a situation where at work (first professional job), at a law firm, really only the lawyers are meant to be dressed up (i was told business casual, it seems loose enough but really only 3 people/20 actually dress down every day) - especially if they're meeting clients. but then the paralegals i work with (not a paralegal myself) wear nice enough clothing. one lady really dresses up despite never going anywhere. the other person who does the same work i do wears graphic tees, cargos, and basically sneakers but he's literally 70. next to me, jeans are worn everyday. the other person who semi dresses down wears khakis and island tees and hey dudes. the other ladies wear sandals/slippers and nicer ish clothes like a shawl, dress pants, blouse.\n\ni just got hired and want to keep a good impression going, and do not want to insult the people who dress up every day, but i also reallyyyy want to wear jeans and chucks. but am also a 25 yo woman. any advice? would possibly keds and chinos with a tshirt be an okay alternative?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "Read the room and move slowly, I think put-together business casual seems appropriate. I would aim to dress like the metaphorical or literal woman who is 3-5 years more senior than you who seems most likely to be promoted. Chinos and a work-coded nice tshirt or blouse.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I'd lean towards dressing on the nice end of business casual - you're young and new to the professional environment, and people are more likely to subconsciously view you as \"just the intern\" if you dress like a teen, especially in a law office",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "avocadoandpear",
                    "body": "Go for a happy medium - really dark denim immaculately clean and crisp with equally spotless flats. Converse used to make Chucks that had a low sole and could pass for canvas flats. Then, from the waist up, wear knit tops and nicer accessories. Add a cardigan or blazer/jacket to dress it up more. You'll look professional from the waist up, which is enough for being at your desk & on Zoom calls. Also recommend making your hair and makeup really professional and neat. From there you can feel out what to add and subtract to feel like you but also like you fit in at work. If you like purses and backpacks, try out a large \"laptop bag\" - looks like a modern suitcase and that screams professional and serious in a good way. Good luck!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "criticiseverything",
            "body": "Where can I get [shoes like she’s wearing in these photos](https://www.ravelry.com/patterns/library/celeste-sweater-4), what are they called?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Fisherman sandals, they've got a bit of a t strap sort of cut our as well",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I’m pretty sure they’re the [Hereu Pesca sandals](https://hereustudio.com/products/pesca-for-all-fisherman-sandal-black)",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "intessen",
                    "body": "They look a bit like [fisherman sandals](https://www.zappos.com/fisherman-sandals), with thicker woven pieces and a heel.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "avocadoandpear",
                    "body": "You may want to do a search for Pikolinos  - they make sandals  in that aesthetic.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "avocadoandpear",
                            "body": "Actually, I think these are them https://www.camper.com/en_US/women/shoes/dn0/camper-dana-K201489-001?_gl=1*8ktcsu*_up*MQ..&gclid=CjwKCAjwr7ayBhAPEiwA6EIGxPP9mD3eyflepkJdiVCXw_JmMVCGSliXfHYiElqmR3MfvT5yGWRe7BoCFx4QAvD_BwE",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tacotaco7612",
            "body": "im traveling to europe this summer and i have a slight outfit problem. my usual airport outfit is sweatpants t shirt and a hoodie/jacket of some sort. however for my current trip, i realized i might not have time to change outfits after landing and i kinda wanna have a cute but comfy outfit that'll be okay for the summer weather. any links or specific outfits you guys can recommend? or any cuter sweatpants that can double as regular outfit? thanks!!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "A sundress with leggings under, and then you take off the leggings once you land?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "avocadoandpear",
                    "body": "Try ponte knit pants - very soft and dressy looking, like linen but they won't get wrinkled very easily. You can also wear a cotton or jersey dress - wear sneakers, hoodie & leggings or thin sweat pants underneath, then take the leggings off when you land. Good to go.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "avocadoandpear",
                            "body": "Forgot, Quince has some price friendly options. Ann Taylor usually carries them too.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SizeOk7484",
            "body": "I'm not familiar with anything but a sports bra, but now that I am interested in sundresses I need opinions on what to wear underneath. I don't have a huge chest, but my boobs are low and needing of support. What's the best type of bra/recommendations? For example, these dresses:\n\n[uniqlo dress](https://www.uniqlo.com/us/en/products/E466527-000/00?colorDisplayCode=00&sizeDisplayCode=001)\n\n[anthropologie dress](https://www.anthropologie.com/shop/the-gabbie-strapless-ruched-tube-dress?color=230&size=XXS&type=STANDARD&inventoryCountry=US&countryCode=US&quantity=1)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "r/abrathatfits is good, if you want a lot of support.\n\n\nFor the first dress, I'd try on some balconette bras. They usually have more wide-set straps than other bra types.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BlackCherryMagic001",
            "body": "What are some trendy and walkable shoes that look a bit polished? I don't like the look of Adidas Sambas, they look too sporty to me. Both summer and spring/fall recommendations are welcome :)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ellawellyy",
            "body": "https://preview.redd.it/ecum4wh8v62d1.jpeg?width=1125&format=pjpg&auto=webp&s=6c9e31b3ca746685d64855d8395546ab804c3ea2\n\nanyone got any idea where u can find ultra-voluminous dresses and blouses like this - simone rocha style- that don’t cost like £1000",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ellawellyy",
                    "body": "https://preview.redd.it/d884tj3iv62d1.jpeg?width=1125&format=pjpg&auto=webp&s=51edfb8a6f0aa4c3243493f6c8185aa1db469371\n\nor like this! wow! i just want mega volume",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "I suspect this was post was meant in response to someone. You may want to repost it as a response to the correct post so that the person can see your thoughtful and detailed response.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fir6987",
                            "body": "Ugh, I usually catch it when I do this, thanks so much!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mjk25741",
            "body": "I'm 5'6 looking for casual pants for the office. Weather is currently 80s and will reach 90s eventually. Thanks!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lizatethecigarettes",
            "body": "My post was removed with no reason given. Any idea why? \n\nMy post: I have a V neckline dress that I need advice how to cover up a bit? \n\nIt's a green dress with a v neckline. I'm a little busty and short, and the event is mildly formal, plus I'm not comfortable. So I want to cover the cleavage a bit. I'm thinking a tank top underneath but I'm not sure of the color or texture / fabric to pick. I'll try to post a similar pic in the comments. The dress material says 100% polyester on the tag. But I'm pretty sure just the lining is polyester. I think the dress is chiffon or a fake chiffon.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "The daily advice thread is for specific questions like this. Posts are for general topics applicable to most people.\n\n\n\nI'd recommend against a tanktop under a dress just to cover up cleavage. It's not formal enough, and I've never seen it look goodm I'd consider options that will look more deliberate. Maybe a bolero, a shrug that comes together at the cleavage and covers it up a bit, or a mesh shirt? You could also take it to a tailor to see if the V can be sewn up a bit or maybe a lace insert could be added.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "mini-mal-ly",
                    "body": "Sometimes if the V is too low for my taste, I just safety pin it from the inside a little higher up. Could that work for this dress?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lizatethecigarettes",
                            "body": "I will try that!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "You could try layering with a square neck lace cami for more coverage if pinning doesn’t work. \n\nBtw, chiffon is a type of fabric (like lace, jersey, woven, satin) whereas polyester is the material it’s made of. There’s polyester chiffon and silk chiffon, and same with all the other fabric types - woven fabric can be cotton, linen, polyester, etc.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "appaholic8",
            "body": "https://preview.redd.it/qh7mcoplq22d1.jpeg?width=1816&format=pjpg&auto=webp&s=c2686042d3c0bd47c340ab0d8a06758ab009132b",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "appaholic8",
                    "body": "I feel like my text didn't show for some reason but what to wear under this? And doesn't matter what sleeve length of a top to wear under?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "avocadoandpear",
                            "body": "I'd wear a solid color soft tank top or cami under, OR wear it over a solid color dress with spaghetti/thin straps. Shouldn't add too much weight or heat.",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}