{
    "title": "Wedding season is upon us! What is the dress code for the event(s) you're attending this year and what are you planning to wear? Any absurd/baffling dress code requests?",
    "comments": [
        {
            "depth": 0,
            "author": "DiagonEllie",
            "body": "Wedding dress codes are a whole mess. I don't think people really understand them regardless. I showed up to a black tie optional wedding recently and people apparently thought the \"optional\" meant \"or whatever you want!\" bc there were people in business casual. \n\nI think the worst dress code is \"come however you feel comfortable\" but they don't really mean it. I'm probably in a disproportionately people pleasing friend group, but I'm like, I need you to make a rule. The weirdest one I've seen recently IRL is \"coastal formal.\" What coast??? \n\nI'd kill to get invited to a maritime boho goth wedding lol. Catch me making a gown out of ancient fishing nets.",
            "score": 512,
            "replies": [
                {
                    "depth": 1,
                    "author": "EllaMinnow",
                    "body": "The best dress code I ever saw was \"wear the thing(s) you always want to wear but never have anywhere to wear it to.\" I wore a floor-length green sequin ballgown. My friend wore a penguin onesie with a cape made out of feathers. (The cape got worn by a lot of people that night.) It was the most eclectically dressed wedding crowd I ever saw.\n\nWorst dress code so far this season: \"Whimsical fancy.\" Ugh. Also have a friend whose parents insist on her wedding being white tie/full evening dress. She's fully aware that most guests are not going to meet that dress code.",
                    "score": 549,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IamNobody85",
                            "body": "I want to wear a floor length sequin ballgown!! I love the theme! \n\nBTW, What did you wear for footwear? I'm currently hunting comfortable heels but I don't think those exist anymore.",
                            "score": 70,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Iammeandyouareme",
                                    "body": "Not the poster but there’s a brand called life stride that I’ve found works nicely. They’re just high enough to give you some lift without being uncomfortable.",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bananakegs",
                                            "body": "YES I wore these for my wedding and they were SO comfy",
                                            "score": 11
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "EatsAlotOfBread",
                                    "body": "Got some Tamaris golden colored high heeled sandals for wider feet that look amazing and feel so comfy. Didn't think it was possible.\n\n\nSearch Tamaris 8-88310-42-909 there's a bunch of colors.",
                                    "score": 16
                                },
                                {
                                    "depth": 3,
                                    "author": "endear",
                                    "body": "I’ve worn the Aerosoles Camera heels to multiple weddings and can vouch for their comfiness!! Lasted through many hours of dancing with no pain or soreness at the end of the night. The platform makes a huge difference. Plus they come in wide sizes and a bunch of colors!",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "CultivatingBitchery",
                                    "body": "Wear dancer heels!! They have wider soles and they have arch padding AND toe padding so they reduce pain and swelling a LOT. dancer heels/character shoes. Top tier I swear by it as someone who wears heels daily. Did the switch and BAM",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "itsacalamity",
                                    "body": "there's a brand called clark's that makes shoes that are actually cute that don't make my feet want to die",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "IamNobody85",
                                            "body": "I'm actually wearing a Clark's sneakers right now. It's OK. But somehow it never fits me exactly right. ☹️",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Ezira",
                                    "body": "Söfft brand is worth it. Most comfortable heels I've ever owned.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "DebiDebbyDebbie",
                                    "body": "Marmi has a lot of really comfy heels, some very dressy.  [https://marmishoes.com/dress/?page=10](https://marmishoes.com/dress/?page=10)",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "itsacalamity",
                            "body": "holy shit now i know the theme of my next birthday party",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "tintinsays",
                            "body": "I tried to make the first theme happen for my wedding but it didn’t really happen. Oh, well!",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "HostCharacter8232",
                            "body": "This is going to be my wedding dress code!! I’ve been thinking about it for years I’m glad to see it works in real life. This makes me so happy!!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HuckleberryLou",
                    "body": "I agree they are a mess. We recently were invited to Black tie optional. The bride and groom were really casual – she had a Boho dress I’d have felt fine wearing to brunch with the girls and he had on a suit and a bolo tie. They looked great, but it was so strange to have listed such a different dress code.\n\nSo glad my husband spent money renting a tux and I spent money on a gown when our entire closets would have probably been fine for it 🙄",
                    "score": 169,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tyRAWRnnosaurus",
                            "body": "Hosting black tie wedding means the bride/groom are required to provide a black tie experience.  This is a hill I’m willing to die on.",
                            "score": 304,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "StasRutt",
                                    "body": "Yes! So many people just pick black tie because it’s the fanciest without realizing what it actually means",
                                    "score": 46,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "suckmybush",
                                            "body": "It's not as fancy as white tie - but people still don't dress to it lol",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "StasRutt",
                                                    "body": "I forgot about white tie and Im sure they did too lol",
                                                    "score": 11
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CeeDeee2",
                                    "body": "Agreed, experience should match the dress code no matter what the formality is. We’re going to a wedding next week that’s formal and from 4pm-10pm but only passed hors d'oeuvres.",
                                    "score": 76,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Glass_Birds",
                                            "body": "Only passed hors d'oeuvres for an entire evening? That's wild. I hope there are lots of proteins and starches to carry you through 🙏🏼",
                                            "score": 72,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CeeDeee2",
                                                    "body": "I’m really hoping there’s like sliders or they’re accounting for people eating a substantial amount of hors d’oeurves! My parents live across the street from the venue and told us we can pop over to eat if we need to",
                                                    "score": 55
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "HuckleberryLou",
                                    "body": "Agreed! If I have to buy a gown, I’m expecting Tito’s, salmon/steak, the works!",
                                    "score": 8
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Canadasaver",
                            "body": "I just googled boho wedding dresses and they are all so pretty but not black tie at all.    I found a few I loved but still not enough to want to get married again.",
                            "score": 28
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "_whatnot_",
                    "body": "Ugh, years ago I attended one with a dress code that was something like \"colorful and funky.\" No indication of formality level. (Apparently it meant standard wedding guest attire but \"fun\": The groomsmen all wore the same suit but with different colored ties.)",
                    "score": 63
                },
                {
                    "depth": 1,
                    "author": "z0mbie_boner",
                    "body": "“What coast” cracked me up",
                    "score": 67
                },
                {
                    "depth": 1,
                    "author": "bubblegumdavid",
                    "body": "I’m on the spectrum, big into fashion, run formal events for my job, and was raised in an etiquette-heavy household. So when you combine all that with the mess of people not bothering to google dress codes before saying it’s what they want for their event makes me *so* stressed out.  \n\nI recently went to a “formal” wedding where the bride and groom actually meant “cocktail”. Fortunately I knew them well enough to know that was likely, but good grief there was every outfit under the sun from casual day dress to floor length, and in enough of a range that seemed disorganized rather than interesting when you looked at the whole crowd at once. \n\nI just find it so frustrating, you google SO much stuff when you’re planning a wedding, why would you not at least check this to give your guests some piece of mind??? It’s just bafflingly bad hosting in a way that makes me nauseous to consider doing to others. \n\nI understand a huge chunk of this is my personal neuroses, but damn bro, words mean stuff, if you aren’t sure, GOOGLE IT",
                    "score": 105,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DiagonEllie",
                            "body": "\"Formal\" is the WORST because people often think it just means \"dressed up in general.\" \n\nI already know if I have a wedding I'm only inviting my close friends because if you hate receiving information and following rules you're really going to hate any event created by me.",
                            "score": 79,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bubblegumdavid",
                                    "body": "YES exactly!!\n\nMy husband and I fortunately were the first one in our crowd to get married, so most of our friends hadn’t been to a wedding yet. So they asked a lot of questions and did a lot of googling. People really put the effort in which was so fun.\n\nThere’s obvs some classist stuff wrapped up in dress codes, but personally I love the clarity and opportunity for fun outfits that they provide.\n\nMy solution to dress codes being increasingly meaningless has been to host dress coded parties with friends at our home. We all dress up to the rule/theme, the whole crew gets super into it, and other than the outfits it’s a regular party for people in their mid twenties. Complete with dumb drinking games and too many pets and cheap snacks. It’s a blast, and anyone in this thread who is sad about a lack of fun dressy outfit opportunities should give it a go!",
                                    "score": 56,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "justasque",
                                            "body": "I have absolutely attended a black tie & ballgowns keg party.  Guests in jeans and such were refused entry at the door.  (Thrifted ballgowns and tux jackets were very accessible for next to nothing, as this was before thrifting was in any way trendy.)",
                                            "score": 22,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "itsacalamity",
                                                    "body": "I once went to an \"everybody LBD\" party where no matter who (or what gender) you were, you had to show up in some variety of a little black dress. it was AMAZING.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bubblegumdavid",
                                                            "body": "This is an amazing theme will be using this over the summer for my crowd",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "yourock_rock",
                            "body": "Ugh I just got invited to a wedding that said “semi formal” on the invite but on their website it says jacket required for men and floor length/ballgown recommended for women. That is not semi formal!!  Plus I will be 6 months pregnant and I do not want to splurge on a ballgown that I can literally never wear again",
                            "score": 44,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "justasque",
                                    "body": "I think I’d go with an aggressively high-low hemline.  Works for the baby bump and touches on both formal and semi formal lengths.",
                                    "score": 30
                                },
                                {
                                    "depth": 3,
                                    "author": "glitchwoven",
                                    "body": "can you Rent the Runway for this?",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "yourock_rock",
                                            "body": "Oh that’s a good idea, I didn’t know they had maternity styles!!",
                                            "score": 12
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "hg57",
                            "body": "I’m invited to a wedding with this dress code: Formal (no jeans).  This is super confusing to me. Am I overthinking this?  Formal to me means gowns and tuxedos but no jeans says business casual.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bubblegumdavid",
                                    "body": "Yeah I really hate that whole thing it makes me so irrationally angry and is for sure an insane person level of pet peeve of mine \n\nJust went to a wedding where a freaking adult male super close family member of the happy couple wore shorts and boat shoes and the dress code was clear about being cocktail, which also annoyed my autistic rule-loving ass. \n\nLike I’m out there in a floor length gown and high heels and my husbands getting stabbed by a bad boutonnière  and you’re chillin like you’re at ya boi’s barbecue??? Can you not",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CultivatingBitchery",
                            "body": "This is exactly why when my wife and I have our ceremony, it’ll have examples of what to wear with the note “don’t be afraid to ask is if it fits the theme!! The brides are fashion lovers we can and WILL help if you’re not sure!”",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AuntNarn",
                    "body": "I didn't have a dress code at my very laid back backyard wedding, which I regret because a few people showed up in jeans. I can't imagine showing up to a wedding in jeans unless that was an intentional theme.",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fantastic_Platypus",
                            "body": "Same here. Everyone was dressed nicely except for the girlfriend of one of the groomsmen. She wore short shorts.  You would think if your other half is wearing dress pants and a tie that you would know shorts were inappropriate.",
                            "score": 30
                        },
                        {
                            "depth": 2,
                            "author": "lady_guard",
                            "body": "Scrolled the comments for someone mentioning jeans. \n\nI'm relieved my husband and I ended up cancelling our wedding and eloped in Vegas. I was stressing a bit because he said he had a few older male family members who would probably show up in a T-shirt, jeans, and cowboy boots. My husband also insisted that if we had table numbers, these family members would sit wherever they wanted anyway. Meanwhile, my dad and stepmom would probably overdress for the occasion, because they like the attention. It would have been a hot mess 🤦‍♀️🤣",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lady_guard",
                                            "body": "You would think! They all live out in the country, but to my knowledge they don't farm or raise livestock. But they do spend a ton of money on guns and ammo, so I know it's not an issue of whether they can afford a suit rental lol",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MsJulieH",
                            "body": "I literally had a Vegas wedding when I married my ex husband because his aunt said she didn't care where we got married or how fancy \"I thought I was\" she was wearing jeans and a t-shirt and they had FOOD FIGHTS in their family at receptions. Eff that. I was like good luck getting across the country on a Monday Auntie!",
                            "score": 18
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aliasgraciousme",
                    "body": "I did ‘come whatever you feel best in- no jeans please’. \n\nI truly don’t care, but want people to be slightly dressier than jeans. Many of my friends don’t have a lot of money, so I didn’t want people to feel like they have to buy something new or expensive",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "THE_DINOSAUR_QUEEN",
                    "body": "My best friend is getting married this summer with me as her MOH (no bridesmaids/other wedding party members so no specifically-chosen dress), she told me directly “It’s a formal daytime church wedding. That means your dress should be longer than knee-length but not floor-length and your shoulders should be covered. As long as the color won’t photograph as white anything is fine, send me a pic first if you’re not sure.”\n\nI was very very grateful for the clarity.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "fashionbitch",
                    "body": "I agree when my friends said that I was like oh nooooo please give the guests guidelines, surprisingly we all didn’t look like we were going to different parties like I thought we’d look like lol",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "crickcrackkickback",
                    "body": "I went to one of these, people were in JEANS 🫣",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "muffingr1",
            "body": "“maritime boho goth” = Pirates of the Caribbean themed wedding 🤣",
            "score": 290,
            "replies": [
                {
                    "depth": 1,
                    "author": "midnightbarber",
                    "body": "Hahaha I didn't even know what I manifested when I came up with that as a sarcastic theme but I love it",
                    "score": 54
                },
                {
                    "depth": 1,
                    "author": "creativewhinypissbby",
                    "body": "Okay but imagine the bride in Elizabeth's [Pirate King outfit](https://images2.fanpop.com/images/photos/7900000/Elizabeth-Swann-elizabeth-swann-7993641-850-1100.jpg)? (And then the ceremony happens under pouring rain and the officiant marries the couple mid-swordfight.)",
                    "score": 69,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "muffingr1",
                            "body": "🔥🔥🔥",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "KalliMae",
                            "body": "This makes me want to renew my vows. Arrgh!!",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GWillikers_",
                                    "body": "Ye be my Matey for life!!",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "KalliMae",
                                            "body": "This could be so much fun!",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "herefromthere",
                                    "body": "Meheartie!",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "e-spero",
                    "body": "One of my favorite weddings was pirate themed! It was super low-key (<20 people) and we went out for sushi afterwards. When the sushi came out on boats ... omg!",
                    "score": 26
                }
            ]
        },
        {
            "depth": 0,
            "author": "billsmoney",
            "body": "In general I assume all weddings are semi formal unless explicitly stated otherwise.\n\nIf you don’t understand the dress code cause it’s something dumb, look up the venue on Instagram and look for photos of people at other weddings there. That’s the best way I’ve found to gauge the vibe.",
            "score": 131,
            "replies": [
                {
                    "depth": 1,
                    "author": "Atwood412",
                    "body": "This is good advice.",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "sensitiveskin80",
                    "body": "Mine was \"garden cocktail party\" but I did include an image search link for inspiration. Lots of khakis and sun dresses. It was lovely.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DiligentEmployment59",
                            "body": "Yes! I’m going to provide a moodboard with inspiration pics so I can have my guests match the theme!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Elemcie",
                    "body": "See also: Pinterest",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "lobsterpasta",
            "body": "I recently attended a wedding where the invite specified “casual cocktail” attire. Beneath that, in big, bold letters, “NO SHORTS”. I feel they had a very specific person in mind 🤣",
            "score": 119,
            "replies": [
                {
                    "depth": 1,
                    "author": "ohslapmesillysidney",
                    "body": "Stuff like that always makes me laugh because you just KNOW it’s targeted at that one uncle everyone has. 😂",
                    "score": 60
                },
                {
                    "depth": 1,
                    "author": "BelleRose2542",
                    "body": "wtf does \"casual cocktail\" mean???? those words are opposite!",
                    "score": 46,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lobsterpasta",
                            "body": "Everything about the event was confusing haha",
                            "score": 26
                        },
                        {
                            "depth": 2,
                            "author": "THE_DINOSAUR_QUEEN",
                            "body": "whatever it means, it does NOT include shorts. hope this helps!",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "treaquin",
                            "body": "Sounds daytime / summer or outdoors\n\nOr, leaves room for more trendy or bold styles over classic. I always assume cocktail dress = LBD.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Jessicreep",
                    "body": "For my sister’s wedding the dress code was formal. My uncle paid to rent a tux, wore it for the ceremony, then during the reception he leaves and comes back in shorts and a short sleeve button up. \n\nAlso he brought his random 30-something year old friend last minute (like asked the day before or day of) and that dude got wasted, offered my cousin weed, and pretended like he was gonna help lift the bride’s chair (Jewish wedding) and then just walked away once the other two people had the chair up—one of those two being my 60+ year old dad that has had numerous shoulder surgeries and dislocations.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "bad33habit",
            "body": "Friends, is semi-formal a step below or above cocktail in formality? I can't get  a straight answer",
            "score": 79,
            "replies": [
                {
                    "depth": 1,
                    "author": "phoenix_flames0124",
                    "body": "Technically, semi-formal is a step below cocktail attire. So like if you look up dress code things on Brides Magazine or whatever you’ll see white tie->black tie->black tie optional->formal->cocktail->semi-formal->casual. But a lot of people mix these up, or equate BTO with formal. I was once invited to a wedding with a “formal attire” dress code but the dinner was at a picnic table barbecue joint and none of the men wore jackets. They meant semi-formal but no jeans, and did not give any other direction.",
                    "score": 49,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "herefromthere",
                            "body": "Perhaps they meant daytime formal, or morning suits. Something you might wear to a day at the races.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kenikigenikai",
                    "body": "love how the two replies you've got continue the trend of getting conflicting answers lmao \n\nedit: I'll add in my own opinion that they're largely interchangeable and how formal they lean is probably more about context than which of those two descriptors is used",
                    "score": 71,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bad33habit",
                            "body": "😭",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kenikigenikai",
                                    "body": "I've edited to add my own opinion just to complicate things further for you 😂",
                                    "score": 9
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "eyepocalypse",
                    "body": "Semi formal is a step below cocktail in formality",
                    "score": 33
                },
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Most accurately it's below. But most ppl don't know that lmao. So if they mention gowns, just assume they think it's above lol",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "Vegetable-Drawing215",
                    "body": "Well just going by the dress code of the “semi formals” I went to in college, everyone wore cocktail or maybe just a step above",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "thegirlwhosquats",
                    "body": "Below! I'm going to one that is cocktail or semi formal.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "creativewhinypissbby",
                    "body": "I'd say a step above but like just a step. Like, longer dresses but not gowns. Men, jackets but not ties perhaps",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "kitsunevremya",
                    "body": "If it helps, our dress code is literally \"semi-formal/cocktail\" followed by a description of the weather to expect at that time of year, because frankly especially being a semi-outdoor winter ^(in a warm part of Australia!!) wedding it doesn't make a meaningful enough difference.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "kjauto23",
            "body": "The confusing one we got this year was “wear whatever makes you comfortable.” Bro WHAT ? So some people are for sure gunna be in jeans and others will be in gowns ?????",
            "score": 68,
            "replies": [
                {
                    "depth": 1,
                    "author": "The_Real_Chippa",
                    "body": "Haha! I have a friend who said that is what she will want to have as a dress code for her future wedding. I interpreted it to mean, show up in whatever fashion style makes you feel like you look good (so you feel socially comfortable), but I think she actually meant physical comfort, like leggings or something. \n\nIt is a super unclear descriptor!",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "emeline13",
                    "body": "I'm going to one of these at the end of this summer. I have a dress in mind but I'm cringing at the thought of being \"overdressed\" if everyone else wears jeans or their dressiest leggings. I appreciate that the couple wants guests to enjoy themselves but like... please sir may I have some guidance?\n\nEdit: I should have linked to the dress! It's no longer available on the Nordstrom Rack website, but it's [this one](https://poshmark.com/listing/Marina-Beaded-Gown-Lilac-lavender-light-purple-v-neck-formal-dress-6-4-s-m-nwt-64ddb11c02760b918a71bfd8). I got mine at Nordstrom Rack for much cheaper than this person on Poshmark sold it for! :o",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "grill-tastic",
                            "body": "God I hate the idea of this dress code! Maybe I’d wear loose slacks or linen pants depending on season, and a classy blouse? Or is that too business-y?? I hope I never encounter this 🫣",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lumenphosphor",
                    "body": "To be totally honest, I know a few parties that were like that and the bride and groom expected that and I think it was very fun for everyone! I don't mind working under constraints and sometimes that's even fun for me but if the people hosting a party say \"come as you pleae\", then people will really come as they please",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "Stunning-Note",
                    "body": "This is from my cousin’s: “women wear a dress, pantsuit, or dressy jumpsuit (whatever makes you feel most comfortable).” \n\nI have so much anxiety about dressing up and this is unhelpful.  Whatever makes me comfortable is not a dress, or pantsuit, or dressy jumpsuit.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kitsunevremya",
                            "body": "I think they mean more *which*ever makes you feel more comfortable",
                            "score": 13
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lecreusetbae",
            "body": "I'm a little past the wedding season of my life but for 4 consecutive years it was 5+/year so I've got the experience. After so many, my logic is now that it depends on my relationship to the couple. \n\nAre they my best friends and I know their whole family? Then I'm going to go to great lengths to ensure I fit in exactly with what they expect and don't try to outshine anyone. I'll be in pictures, I'll want to be around all night, and I want to be remembered as good company who looked nice. It doesn't mean I dress down, more that I do what I can to help make their day as perfect as possible.\n\nAre they a stranger I've never met or a distant relative? Then I'm breaking out the costume jewelry, furs, sky high heels, and fancy bags. I love going to weddings and seeing that one plus one who looks so much better than everyone else. No one cares, you won't be in any pictures, and it's a great time to experiment with pushing your fancy-pants style boundaries without being too out of place. Usually an aunt or cousin will gush at you in the bathroom about how they love your outfit and you get to say \"No *you* look amazing!\" and everyone feels good.",
            "score": 254,
            "replies": [
                {
                    "depth": 1,
                    "author": "ThreePartSilence",
                    "body": "lol I’m planning on doing exactly this at a wedding next month. Especially because when the couple sent the save the date, the wedding website listed the dress code as “formal” and then by the time the invite came they had silently changed it to “cocktail”. Well too bad, because I already bought a dress and shoes. The dress is midi length so I’m not too worried, but it definitely a little fancier/louder than cocktail attire would require.",
                    "score": 25
                },
                {
                    "depth": 1,
                    "author": "ReginaldStarfire",
                    "body": "I subscribe to the Shia LaBoeuf “dress like trash 99 percent of the time so that one percent HITS” school of fashion. \n\nI went to a wedding last year with a stated theme of “funky psychedelic” and I used that as an excuse to turn. It. OUT.  I wore this super low-cut Farm Rio dress with a giant print of zodiac signs, I busted out all my most fabulous gold and turquoise jewelry, I did a full beat. People were coming up to me all night to tell me how awesome my outfit was. It felt great.",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mamaneedsacar",
                            "body": "Honestly this is the type of dress code I can *get behind.* I think when it comes to dress codes, as the hosting couple, you gotta do it with your chest. If it’s black tie, expect ballgowns. If it’s cocktail, you know how to dress accordingly. But if you aren’t going to abide by traditional dress codes it better be “18th century aristocrats letting them eat cake” or “under the sea mermaid couture” or some shit like that. I’m so tired of vague descriptions like “whimsy formal” and “dressy casual” (this is not a middle school dance!)",
                            "score": 14
                        },
                        {
                            "depth": 2,
                            "author": "RunawayHobbit",
                            "body": "Ummmm please can we get a link to that dress??",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DConstructed",
                                    "body": "Just googled Farm Rio Zodiac dress.  It looks like they have a few styles and an amazing jumpsuit in that print.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "midnightbarber",
                    "body": "I definitely fall into the latter group you mentioned but I feel SO nervous about standing out in a bad way that it didn't occur to me I could stand out in a good way - thank you for your perspective! \n\nI def do want to be respectful enough that I don't stick out and draw attention away from where it belongs, but I do like the idea of passersby going 'o0o0o0h who is that mysterious and stylish stranger' lmao",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lecreusetbae",
                            "body": "Yes! You can absolutely stand out in a good way and be the mysterious and beautiful stranger! I'm not suggesting you wear a ballgown to a beach wedding but a slinky backless bias dress paired with an extra large hat and giant sunglasses is definitely called for",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "_Pliny_",
            "body": "Going to a wedding this fall on a baseball diamond. The dress code is: whatever you’d wear to a baseball game. \n\nThe reception is going to be beer, hot dogs, and popcorn!",
            "score": 112,
            "replies": [
                {
                    "depth": 1,
                    "author": "midnightbarber",
                    "body": "Stop I love getting super glammed up for special occasions but a baseball bbq is also kind of my dream",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "_Pliny_",
                            "body": "They are great, laid back people. He’s a huge mlb fan and she’s an umpire (locally, not in the mlb). And I’m 100% sure if a guest asked, “I know you said baseball game casual, but is it okay if I wear a gown” she’d say go for it.",
                            "score": 23
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "six_digit_uin",
                    "body": "I just bought a pair of Keds sneakers that have baseball stitching to wear to games this summer. Highly recommend",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "herefromthere",
                    "body": "I'm not into watching sports, so if it was outside on a hot day, it'd be a midi sundress and hat and flats and hope to somehow tie in with the appropriate team colours if that was an invitation I received. Cooler weather would probably be jeans, flats and a top of an appropriate colour.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "candyapplesugar",
            "body": "My cousins dress code was ‘eccentric’ and I thought that was super fun.",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "MsBluffy",
                    "body": "My wedding was 7 years ago at an art gallery, I just looked back at the dress code from the website and we said:\n\n**Dress code:** Semi-formal (but fun!) - feel free to take the art gallery location into account and wear something bolder and more fashion forward than you normally would! We encourage bold prints, fun textures, sequins, velvet, and tweed!\n\nI know that's a bit lengthy but I've always found \"don't outshine the bride\" dress codes boring. I was the bride, no one was going to be confused about that, I wanted my wedding pictures FULL of my beautiful people in beautiful clothes!",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "midnightbarber",
                    "body": "That sounds so fun!! What did people wear?",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "candyapplesugar",
                            "body": "Lots of bright colors, jewel tones, the bride herself cHanged into these amazing silk hot pink pants and bridal corset, which had originally been paired with a bridal skirt. Theatre kid 😎",
                            "score": 33
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wondercat87",
            "body": "At my cousin's wedding there was a guest wearing swim trunks. Swim. Trunks.\n\nThese weren't even a neutral color. They had a whole colorful beach scene on them! He thought that was appropriate...to wear to a wedding! Everyone else was wearing dressy attire.",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "ohslapmesillysidney",
                    "body": "😱😱😱\n\nPLEASE tell me it was a beach wedding. Not that swim trunks would be OK there either, but if this happened at a banquet hall in Kansas or something, I have never been more at a loss for words.",
                    "score": 28
                }
            ]
        },
        {
            "depth": 0,
            "author": "BelleRose2542",
            "body": "When I'm not sure, I default to moderately colorful floral A-line dress and wedge heels, and my husband defaults to dress shirt (no tie) + slacks. So far, it's never failed.\n\n(Caviot that we are USA West Coast, and have never been invited to a wedding with a \"formal\" dress code. Most weddings are summer outdoors, so I also often bring a dressy sunhat.)",
            "score": 128,
            "replies": [
                {
                    "depth": 1,
                    "author": "grill-tastic",
                    "body": "Caveat :)",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BelleRose2542",
                            "body": "Whoops, no idea where that spelling came from in my brain lol",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Handbag_Lady",
                                    "body": "We are the same, husband carries a tie in his pocket just in case.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ssdgm12713",
            "body": "I’ve never seen any weird dress codes IRL. Kind of wish I had! I have four weddings total this year. Two already passed. Both were cocktail (I was a bridesmaid in one and wore a cocktail dress for the other). The other two are also cocktail. Will probably outfit repeat (still trying to get back to my pre-baby size and don’t want to buy too much in my current size) 🤷🏽‍♀️",
            "score": 39,
            "replies": [
                {
                    "depth": 1,
                    "author": "pamplemousse2",
                    "body": "I knooooooow, I keep hearing about wild dress codes like \"everyone in red\" or whatever and want to see it happen in real life! 🤣",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Weirdest I've seen is \"please don't wear green\" lol. But that was fine really",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KingPrincessNova",
                            "body": "I almost put this because my wedding was in a greenish-teal room. half the women wore green dresses lmao. they looked great tho, I'm glad I let it go",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lady_guard",
                    "body": "Have you tried Rent the Runway or another rental site?",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "smkscrn",
            "body": "I've got three this year: one black tie optional but no black gowns allowed, one \"garden party,\" and one cocktail. I'm not particularly close to any of the couples so they're getting whatever I already have in my closet.",
            "score": 88,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lamitamo",
                    "body": "I’m going to a “garden party” wedding and I am interested to see how it’s interpreted by different people",
                    "score": 45,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Canadasaver",
                            "body": "To me garden party means shoes you can wear on grass and colours or floral patterns that would be perfect for Sunday brunch at somewhere fancy.  Knee length dresses and gentlemen in jackets but no ties.",
                            "score": 85,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hitheringthithering",
                                    "body": "Also an opportunity for a hat and, if the venue is fancy enough, little lace gloves!",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Canadasaver",
                                            "body": "The old movie Four Weddings And A Funeral has all of the styles of weddings.  I suggest a rewatch for anyone unsure of what to wear - just tone down the big shoulder pads.",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "WoollenItBeNice",
                                                    "body": "\"old movie\"\n\nCries in millennial",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Canadasaver",
                                                            "body": "I am an old geezer/borderline boomer and always think of redditors as being almost children and they would only know Four Weddings And A Funeral if they were stuck at old grandma's house without internet and were forced to watch old VHS tapes.",
                                                            "score": 5
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "BelleRose2542",
                                            "body": "I’ve started incorporating hats into all my outfits for outdoor weddings, and I get soooo many compliments! (I do make sure to sit at the end of the row so I’m not blocking anyone’s view)",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "KingPrincessNova",
                                    "body": "I feel like \"garden party\" is the easiest to interpret, if not necessarily pull off. it's \"Sunday best\" with more florals. I hate florals and light colors but most people would be fine",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Canadasaver",
                                            "body": "I am not a floral fan and would probably go with a navy wrap but add a brightly coloured clutch so it looked like I was was trying.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "herefromthere",
                                            "body": "You could still go for colours and if you wanted to go for a print, there's tile, abstract, spots and dots and various types of stripes.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "modernvintage",
                                    "body": "my sister just had her garden party attire wedding and it was basically exactly this! this was what i went with and it was spot on for the theme. ☺️\n\nhttps://preview.redd.it/pfl8uhhi5q0d1.jpeg?width=4284&format=pjpg&auto=webp&s=950aa2e242186c4ad2498c4a7f93ea53ddc46360",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Canadasaver",
                                            "body": "Unfortunately, the link does not work.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "herefromthere",
                                                    "body": "worked for me on old reddit on a tablet.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "smkscrn",
                            "body": "My partner got a floral blazer that I'm excited to style and I'll definitely be wearing a big hat. I like it as a dress code, plus knowing this particular group of friends they encourage more extravagant and silly interpretations so you really can't go wrong",
                            "score": 19
                        },
                        {
                            "depth": 2,
                            "author": "bookowl",
                            "body": "I went to a garden party wedding last year- half the people interpreted it as 'Queen's garden party' (including me)... turns out it was more 'party in a garden'.",
                            "score": 7
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "creativewhinypissbby",
            "body": "I'm a total wedding geek - love attending them, talking about them, would even plan them if I could - so I like to assign myself unofficial dress codes based on the venue vibes. In the past, I've come up with \"French romantic floral,\" \"presidential summer home,\" and \"urban editorial.\"\n\nI'm going to a \"galactic glam\" wedding in a few weeks at a planetarium! DESPERATELY wanted this [Teuta Matoshi dress](https://www.teutamatoshi.com/products/midnight-flaneur-gown) for it but LOL. And I didn't want to buy a dress that I wasn't going to wear so I settled on a very sparkly sequin dress from Rent the Runway.  NGL, I was so excited for the dress code at first, but it's hard finding something that fits galactic but also black tie/not too costume-y!\n\nAlso going to a \"smart casual\" wedding celebration - I say celebration because there are no formal wedding activities, just drinks and light bites. But I have no idea what to wear because of this friend group (my boyfriend's friends) I am consistently over-dressed and the \"high maintenance\" one. I don't want to be fancier than the bride but I'd like to dress up just a little bit!\n\nOP, for \"summer formal\" I'm picturing maxi length, bright colors, but thicker material than a sundress (while not being so heavy as say a winter formal dress). Maybe something like [this](https://i0.wp.com/www.heatherbien.com/wp-content/uploads/2019/07/IMG-3872.jpg?resize=1440%2C1920&ssl=1), or [these](https://i0.wp.com/greenweddingshoes.com/wp-content/uploads/2023/02/peachy-and-botanical-dresses-black-tie-optional-wedding-attire-for-women.webp?fit=1024%2C9999), or [this](https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1673304383-1310176-1-1673304354.jpg?crop=1.00xw:0.751xh;0,0.249xh&resize=980:*)!",
            "score": 59,
            "replies": [
                {
                    "depth": 1,
                    "author": "midnightbarber",
                    "body": "Wow I love that dress!! But yes very $$$ ugh I know the struggle. Also fun fact, the name of the dress (flaneur) is a literature-adjacent term for [someone who idly strolls around a city](https://en.wikipedia.org/wiki/Fl%C3%A2neur)! I love the idea of someone wandering around under the stars in that dress\n\nAnd ugh yes so the summer formal wedding is outdoors in New England in September and I ended up buying [this dress ](https://www.nordstrom.com/s/akila-pleated-tiered-gown/7509477)on sale secondhand bc I thought it was the answer to all my prayers - turns out that since I'm way shorter and wider than the model that in my size the dress lays on me by puffing out a lot at the hips like a princess gown and now I'm freaking out that the silhouette is too bridal. It's so pretty but there's like a mountain of material that does not come across in the pics",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rubystreaks",
                            "body": "I think it will look great OP! It’s nowhere near white",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aleca_zam",
                    "body": "My partners friends are very casual and outdoorsy and I also feel overdressed and high maintenance around them. It’s a wedding! It’s a celebration! Let’s dress like it!\n\nWe have a casual wedding in the fall that I’m at a loss for. Last casual wedding people wore jeans and blundstones",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "creativewhinypissbby",
                            "body": "I'm considering a fun but not too dressy jumpsuit! Something like [this](https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1646759813-7c77a133-18dd-4492-b5e4-d9a604734cef-1646759791.jpg?crop=0.963xw:0.944xh;0.0144xw,0.0565xh&resize=980:*) or [this](https://hips.hearstapps.com/vader-prod.s3.amazonaws.com/1696013447-petal-and-pup-usa-jumpsuits-danica-jumpsuit-copper-32264763277489_1024x1024.jpg?crop=1xw:1xh;center,top&resize=980:*) with some accessories maybe",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "madamesoybean",
                                    "body": "The blue is pure class! The bronze is so swanky for a jumpsuit. Great vibe!",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cookies_and_Games",
                    "body": "My wedding dress was a Teuta dress :)",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "glutenfreep4ncakes",
                    "body": "I would loooove to see your inspo boards for your personal themes!! ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "creativewhinypissbby",
                            "body": "Alas, I never made inspo boards! The vibes are all based on the pictures I can find of the venue",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "nim_run16",
            "body": "Black Tie Optional with cocktail dresses allowed…..I’m going to wear a silk midi floral dress from reformation.",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "muffingr1",
                    "body": "Justified 💯. Even if you don’t, 10 other women will.",
                    "score": 15
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kataryu2",
            "body": "Iciest drip. What does this mean? Google has been unhelpful. I’m 34 like come on",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "pamplemousse2",
                    "body": "Ice is diamonds so... Show up covered in crystals? IDEK\nThat's a fucking obnoxious \"dress code.\"",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "herefromthere",
                            "body": "Uuugh, I would hate that dress code. I would find it hard to comply. I'm not going to wear sequins for anything. They are hot and scratchy.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pamplemousse2",
                                    "body": "Yep yep yep, same here.\n\nI wonder if they sell giant blow up ice cube costumes. Like the T-Rex ones, but an ice cube. Hahaha.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "herefromthere",
                                            "body": "Or the squirrel from Ice Age.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "pamplemousse2",
                                                    "body": "LOL yes",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "phoenix_flames0124",
                    "body": "I would def wear my fanciest, most fashion-forward gown to this. And maybe source some giant fake diamonds.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bananakegs",
                            "body": "This screams sparkles to me?",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Purplegalaxxy",
                    "body": "Elsa cosplay ",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "e1dar",
            "body": "In the next year I’m lucky enough to be going to weddings in Nepal, Malta and the UK! Less stymied by dress codes than figuring out what is the norm for weddings in those countries/regions??",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "WoollenItBeNice",
                    "body": "UK wedding - unless a dress code is specified, it's just 'a nice dress'. Some women will wear *short* dresses, especially in Essex, but largely it's knee length.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "e1dar",
                            "body": "Thank you! My husband is very unhelpful despite being British 😂 this wedding is in July, on a farm/countryside, with many kids around, so I’m guessing less formal than I’m used to (which is not very formal, mostly PNW).",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bookishexpat",
                                    "body": "One point from someone who has been to many British weddings: even if it’s on a farm, be prepared that many of the guests are probably wearing hats/fascinators! (This might read more formal to you if you’re not used to it)\n\nIt’s also likely that many guests (or at least most of the older guests, like the mothers and grandmothers) might be wearing a jacket over a dress, or a long-sleeved dress. \n\nGenerally, shoulders tend to be covered - strapless and spaghetti straps are unusual, or else covered in a scarf (also because the weather can be variable!)",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ellaasbury107",
            "body": "I've have not experienced many weird dress codes.  I just had two weddings and have two more this year and these are the dress codes and dresses.\n\nWedding 1: Dress code black tie optional, I wore [this sequin dress](https://imgur.com/FMn3Zsp)  \nWedding 2: I don't remember seeing a dress code but it was at a winery venue. I wore this [floral long dress](https://imgur.com/xsQ3YBX).   \nWedding 3 upcoming: Dress code: formal and THEME old Hollywood.  I will be wearing [this dress](https://www.asos.com/us/asos-design/asos-design-premium-halter-v-neck-maxi-dress-with-exaggerated-outer-skirt-in-black/prd/205141555) and might add gloves.  \nWedding 4: I don't have the official invite yet so have not seen the dress code, but it's in Colorado and I'm planning on wearing my go wedding guest dress - [this floral wrap dress](https://imgur.com/zgQR6l4).",
            "score": 19
        },
        {
            "depth": 0,
            "author": "notjewel",
            "body": "I’m buying more funeral dresses than wedding guest ones, sigh. \nThat said, I’ve worn the same dress to three funeral lately. So I finally decided to get a funeral dress I felt good in. Because, I doubt they’ll be slowing down as I get older. \nWent thrifting and found a classic Gap sheath dress with pockets and heavier material for colder days and a gorgeous wrap dress that my daughter actually exclaimed, “That looks SO good on you!” \n\nSo, there you have it. Cycle of life my fashion friends. \n\nWedding to funeral I always go with something respectful to the occasion and something I feel good and comfortable in.",
            "score": 18
        },
        {
            "depth": 0,
            "author": "shedrinkscoffee",
            "body": "The more words in the dress code, the less likely that any guest will understand or follow it lol. \n\nIf it's a color I'll try and will generally follow the formal/informal/black tie guidelines. Beyond that I do let the couple know that I cannot do dessert fairy in winter or whatever the fuck and if that's a deal breaker I will happily sit out that wedding and/or event.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "xliezelz",
            "body": "https://preview.redd.it/iovbj6vw6n0d1.jpeg?width=1080&format=pjpg&auto=webp&s=87e53e5d2d15bc3cb91fc256c46819e5d80bbe0e\n\nBlack tie formal. Im wearing this number with an updo",
            "score": 15
        },
        {
            "depth": 0,
            "author": "NearbyBreakfast",
            "body": "I’m invited to a “mountain chic” this fall….I’m thinking velvet dress but maybe it means your finest flannel shacket?!",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "rhytidiaceae",
                    "body": "Velvet dress sounds good! And the flannel shack set might even fly if the reception is outdoors! I went to a mountain chic wedding last year and the bride told me I “nailed it”. I wore a sage green midi Reformation dress (the same dress I wear to pretty much every wedding), but paired it with brown leather boots, turquoise earrings, and a southwestern print blanket scarf for the reception when it got chillier. I think it’s all about the accessories. I live out west and it’s been the unspoken dress code at my friends weddings. Lots of bolo ties, felt hats, lace, natural color palettes, vests, flowy dresses, and belt buckles. However, in prep for the wedding, the internet says it just means to consider colder weather and being outdoors. Probably depends on vibe and location!",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NearbyBreakfast",
                            "body": "Great ideas! I think you’re spot on about accessories. Thanks!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bittybro",
                    "body": "Sundance catalog to the rescue!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "occasionallystabby",
            "body": "First of all, I feel like I could really rock some maritime boho goth. 😆\n\nFor our wedding, we listed the dress code as \"business casual.\" If anyone asked what that meant, I told women to wear whatever they would have worn if I had had a shower, and men to just not wear jeans and a t-shirt. \n\nEveryone looked nice. A few overdressed, one underdressed. Honestly, I was more concerned with everyone being comfortable than with how perfect they looked.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "stellalunawitchbaby",
            "body": "Most weddings I go to are cocktail or semi formal, sometimes formal, or more rarely black tie optional. It’s not *super* unusual for them to have an extra word in there, esp on the website, to describe the setting or vibe further (“garden cocktail” is one I’ve seen - I don’t mind it, it lets me know there will probably be grass and I’ll probably lean into florals). I think my website described my (2023) wedding as festive cocktail, and people really leaned into it and it was great. \n\nAnyways I have some go-to dresses, from midi to floor length, and a jumpsuit if ever needed, but I also love stealing clothes from my sisters for weddings (or renting from Nuuly).",
            "score": 27
        },
        {
            "depth": 0,
            "author": "msmith1994",
            "body": "https://preview.redd.it/eb8zshkc0n0d1.jpeg?width=3024&format=pjpg&auto=webp&s=3278e4f92d71a6dea5a791f523b99003af92711a\n\nGoing to a wedding this weekend with a cocktail dress code and I’m wearing this dress. I ended up deciding on different shoes because the ones I bought were not comfy. They’re an open toe gold/silver low wedge.\n\nI got [this](https://www.jcpenney.com/p/liz-claiborne-flower-stretch-bracelet/ppr5008399175?pTmplType=regular&catId=SearchResults&searchTerm=flower+bracelet&productGridView=medium&badge=fewleft) bracelet and the matching earrings. I have a light pink metallic clutch. My husband is wearing a navy suit, light pink shirt, and hot pink tie.\n\n[Dress link](https://www.jcpenney.com/p/danny-nicole-plus-long-sleeve-floral-maxi-dress/ppr5008396057?pTmplType=regular&catId=SearchResults&searchTerm=danny+and+nicole+green+maxi&productGridView=medium&badge=fewleft)",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "midnightbarber",
                    "body": "That's super cute!!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SnooRobots8049",
            "body": "I have two this summer. First is a formal wedding in upstate New York. I  [got this dress](https://www.anthropologie.com/shop/v-chapman-june-corset-front-slit-gown?category=dresses&color=001&type=STANDARD) and just had my tailor add removable straps so it stays in place dancing!\n\nThe second is semi formal, outside under a tent, August in upstate New York. Dress code is midi or long dress and have fun with color and pattern, so [I got this](https://www.anthropologie.com/shop/sachin-babi-sloane-asymmetrical-bow-a-line-midi-dress?category=dresses&color=066&type=STANDARD&quantity=1). I've worn it once already to a semi formal work dinner thing I was a +1 at and got so many compliments!",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Ohkermie",
            "body": "Come join us at r/weddingattireapproval dress codes don’t mean anything anymore!",
            "score": 12
        },
        {
            "depth": 0,
            "author": "hedwig54",
            "body": "Formal is by far the worst dress code. I Google extensively every time but I don’t find good guidance. I’ve been relying heavily on midi dresses that are probably more cocktail. Always better to be overdressed I think. \n\nI’m getting married in July and I requested black tie. I would love if guests really went all out, to me it’s not about upstaging me but about showing respect for the affair by dressing formally enough. Unless you wear white how can you really outshine the bride? but I get that might not be in everyone’s budget or willingness so I just hope people show in their best at a minimum :).\n\nThe other key thing with dress codes that I think gets lost is keeping in mind what your venue and what time of day your wedding is calls for. I have an evening wedding at a very high end estate - black tie felt appropriate.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "pamplemousse2",
                    "body": "Formal is the worst! I just checked, and our one wedding this summer (outside, at a winery) is \"formal attire.\" My husband is a groomsman, my kids are in the wedding (I'm not, thank goodness!) and now I'm wondering if the dress I had in mind is nice enough... Although now that I think of it, the bride has seen pics of me in it and said I should wear it so probably I'm safe 😅",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Atwood412",
                    "body": "Yes. The dress code and wedding venue and food should all fit together.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "imaLurkyLurker",
            "body": "2024 bride here! Would “cocktail cozy”qualify as a cursed dress code? Trying to say “cocktail but also please add what ever layers you want to be comfortable when the sun goes down. 99% chance I’ll have a light puffy coat over my wedding dress at some point.” Brewery / outdoorsy wedding with a heated barn and fire pits outside. ",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "midnightbarber",
                    "body": "I don't think it's bad but if you're worried about coming off as unclear, another idea could be to just say \"cocktail\" under dress code and specify the venue environment elsewhere and leave people to use their best judgement?",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "therealbayonetta",
                    "body": "You could specify \"cocktail\" as the dress code and add a note that the wedding will be outdoors and it may get cool at night, so bring layers. Knowing that the ceremony or reception will be outdoors is way more helpful when planning an outfit. \"Cozy\" could be interpreted as sweatshirts okay (unless you are truly okay with it).",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "ScumbagMacbeth",
            "body": "The wedding I was invited to in January was \"cocktail casual\".  That's not a thing!  Words have meanings!  \"Cocktail\" and \"casual\" are two very different things!!  \n\n\n\nAnother friend had a very casual wedding last week.  invite said \"no shorts or sweats\".  ​I was in the bridal party and she didn't have a color or vibe in mind but she eventually arrived on \"forest fairy disco\" to give me some outfit inspiration. ​",
            "score": 9
        },
        {
            "depth": 0,
            "author": "BinxTheWarlockPatron",
            "body": "I only have one this year and it’s a Halloween wedding where costumes are optional. I’m thinking of dressing up like a spooky doll.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "sellerofdreams",
            "body": "The funny thing about British weddings is that there’s rarely a dress code for women. Somehow, the entire country has landed on an appropriate “wedding guest dress” aesthetic and even if the bride and groom request something a bit different, those are the dresses that are getting pulled out! \n\nMost British weddings are in the afternoon so black tie / full length gowns aren’t particularly appropriate.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "kss114",
                    "body": "I'm about to go to one. Can you link to a picture of the aesthetic?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bookishexpat",
                            "body": "Here is one I pulled off the internet! [Link](https://cdn.shortpixel.ai/spai/q_glossy+ret_img+to_webp/www.denisewinterphotography.co.uk/wp-content/uploads/2018/02/Millbridge-Court-Wedding-Photography_0069.jpg)\n\nIn general, British wedding guest attire for women often includes:\n* hats or fascinators\n* knee or midi-length dresses (the bride and bridesmaids usually wear floor-length, but that’s not common for guests)\n* lighter colours, floral or lace patterns (black or sequins would be quite unusual)\n* covered shoulders - jackets or cardigans or shawls over dress, sleeved dresses etc. This is as much due to the variable weather than cultural expectations.\n\nIn general, the vibe tends to be more “Buckingham Palace garden party” than gala dinner.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "munnycent",
            "body": "A very specific one - \"semi-formal maxi dress\" for female guests. I have a few rental dresses picked out but keep waffling over if they are too formal or not formal enough for \"semi formal.\" 😅\n\nThis is a top pick so maybe y'all can let me know if you would call this a semi formal maxi dress:\n\nhttps://preview.redd.it/ia6fszrtkn0d1.png?width=1080&format=pjpg&auto=webp&s=08f3829c0beb9e6a82dbf9872e47ad5baa9d88be",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "pamplemousse2",
                    "body": "Oh I would be so mad, maxi is a TERRIBLE length for me!",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "kjb76",
            "body": "I’m in my mid 40s so not many weddings on our calendar. But we have some friends getting married in July who are around our age. Second for him, third for her, five kids between the two of them. But she didn’t have big weddings the two previous times so they are going all out. The dress code is semi-formal/cocktail attire. I don’t want to spend a ton on a dress because I don’t have very many events. I have had success with Rent the Runway in the past but because of my age and current trends, finding something that suits me is a struggle. Carrying a lot of perimenopause weight and there are lots of skimpy styles I don’t feel comfortable in. It’s a struggle.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "zfragd0ll",
                    "body": "Have you looked at Nuuly rentals? I used to use fashion pass but I also felt a little too old for their offerings. Nuuly is also cheaper than FP but you can’t swap as often.  PS the details of the wedding you’re attending sounds so much like my upcoming wedding, I had to read this twice hahaha.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kjb76",
                            "body": "That looks more like a subscription and you get six items. Am I seeing that correctly or do they do one off rentals line RTR?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "zfragd0ll",
                                    "body": "Yeah you're correct, it works just like fashion pass with a monthly sub but you only get to swap once a month.  Which actually was better for me anyways, I felt a lot of pressure to get my money's worth out of Fashion pass and took a lot of time picking and returning new outfits every week hahaha.  Nuuly does take longer to get to me than Fashion Pass did though so maybe keep that in mind if you sign up for it.  I used to get FP items in like two days.  Nuuly is more like 5-7.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "zfragd0ll",
                    "body": "Also, adding that I am an idiot and I misread your RTR as Fashion Pass.  I don't know why my brain did that but here we are.  I also did RTR as well but I did it on subscription.  The good thing with all of these plans is if you do a sub, you can get the items and return them and either cancel or pause it but I now realize that's way more money than the one off rental price at RTR.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "pathologicalprotest",
            "body": "My sister got married a couple of years ago. I asked her whether I could wear a floor-length, midnight blue silk gown I had and that she’s seen. She said absolutely. Our mother flipped her shit saying it was too close to black (that’s apparently bad) and wouldn’t drop it until my sister told her to shut up and mind her own business. It was a lovely wedding party. Never saw my uncle dance before.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "sharpiefairy666",
            "body": "The dress code is wedding dresses!",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Fine_Cupcake8958",
            "body": "“Northwoods formal” with “Jorts recommended”",
            "score": 4
        },
        {
            "depth": 0,
            "author": "darknailp0lish",
            "body": "Dress codes are a mess. Last summer we went to a wedding and the dress code on the invitations said “casual - sundresses, etc.”. I wore a floral dress that was fancier than a sundress but not formal. The bride was in a full glittery princess ballgown and the groom in a black tux. Bridesmaids in floor length gowns and groomsmen in tuxes. That is…not casual.\n\nSome guests were in cargo shorts! One guy wore a black tee and jeans. It was a hot mess.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "JurassicFlora",
            "body": "I just went to a wedding for my husbands sister Sunday. We were given no details other than where it was and when. I kept asking my husband leading up to the wedding if there was a theme or dress code and he said his parents didn’t even know. I think okay it’s May, Spring, nice pastel colors, flowers and found a nice light pink floor length dress with flowers embroidered on it. My husband thought it would be cute to match so he got a dress shirt in the same shade.  I also saw a super cute olive green dress that I just wanted to have and ended up wearing it to the special dinner the night before the wedding. Both dresses ended up being her wedding colors and the matching color we wore ended up being the exact shade of the bridesmaids dresses. We all ended up laughing about it and I like to think I’m really on the family wavelength lol",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Gengars",
            "body": "Surprise invite from a friend to their wedding in July and I was able to find a topshop dress in great condition for only $7 at goodwill!!!!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "juicemagic",
            "body": "Year 34, another total lack of weddings. At what age are we usually getting these invites? While I'm grateful for the lack of stress and money spent on dresses, it is disappointing that I've never been invited to non-obligation (read: a cousin's) wedding, thus never had an excuse for fancy summer dresses.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "snickerdoodlesandtea",
                    "body": "I'm an introvert who regularly disappears from friend groups. Between that and the trend toward smaller weddings, I have only been to one wedding as an adult (the dress code was \"any of your dresses will be fine\", per my fiance). \n\nIf you want to go to weddings, check out the Facebook group Sisterhood of the travelling wedding guest (and some other words) members with spots to fill invite group members to their weddings and it seems like a great time!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "snowfallnight",
                    "body": "Lol same. Even though I’ve gone to a bunch of weddings in the past few years, I’ve only ever gone as someone’s date / +1. \n\n\nl wouldn’t mind one wedding attendance a year but I’m also kind of grateful to spend the money traveling to places I want to go instead. Blessing in disguise.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BeverleyMacker",
            "body": "I’m assuming you’re all US as I’ve never seen invites with this in the UK",
            "score": 6
        },
        {
            "depth": 0,
            "author": "rbetters",
            "body": "This isn’t too out there but I have “garden party semi-formal/smart casual”. To me semi-formal & smart casual are two pretty different levels… but I’m thinking a nice floral midi dress would suffice?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "SHIELDnotSCOTUS",
            "body": "I am getting married next year and we have decided we are just going black tie. All the guys can rent tuxes. Everyone knows what black tie means. Simple.\n\nI’ve seen too many shorts and Hawaiian shirts at “cocktail garden casual” weddings.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "RarRarTrashcan",
            "body": "As the bestwoman for my brother's wedding I'm wearing a black version of the bridesmaids' dresses, which are green. Black to match the groomsmens' suits. Apparently his soon-to-be MIL is having a fit over the fact that the tips of my hair are blue (it's almost completely faded at this point) and my tattoos (wearing makeup to cover them). Funnily enough the groomsmen and my brother don't have to cover theirs though.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "barrellungs",
            "body": "Friend's wedding coming up. \"Garden party black tie.\" So does that mean men tuxes and women floor length but colorful/floral? I feel like garden party and black tie mean different things.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "too-muchfrosting",
            "body": "I am truly shocked and dismayed at the audacity of couples to assign dress codes of anything fancier than, say, cocktail. Unless they know all their guests are wealthy, I guess. \n\nThen again, I'm a frugal person who doesn't care too much about pageantry or tradition, so maybe I'm in the minority.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hungry-Internet6548",
                    "body": "It’s pretty easy to dress up on a budget by renting or buying second hand. I personally would love to either have or attend a white tie event (I could definitely never afford to host) which would be a bit harder to get something on a budget, but I’ve seen dresses on rent the runway that would be appropriate. Black tie would definitely be doable on a budget!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dying4aCure",
            "body": "I went to a 5 day wedding that provided color pallets for each event along with suggestions.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "bag_fits",
                    "body": "Ok this sounds like a dream! I would have so much fun with this! Did people dress to the color code? If so I bet the photos turned out great!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dying4aCure",
                            "body": "They did.  It was an Indian wedding so ethnic clothes were an option.   I felt like a princess in my Lehenga.  It is gorgeous.  Now I have to make more Indian friends so I can wear it again.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "briefingsworth2",
            "body": "One of my besties is getting married in Greece (not on the beach though) and her dress code is Summer Festive. What does that even mean?! She’s asked me what I’m wearing and I feel like I have to get something great vs wearing the same two dresses I always wear at weddings… but idk where to start!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "LowAccident7305",
            "body": "Just went to one that was “formal” on the invitation but the bride later told me that anything slightly nicer than a sundress was great and to not stress it. \n\nI wore a midi length satin dress with flower print and was one of the better dressed people there. Paired it with a scarf for warmth and nude lace up heels. The ladies wore all sorts of things from floor length red dresses to two piece clubbing outfits. \n\nBest advice, read the room! What’s the family like? The friends? How would you expect them to show up to a nice function?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Pink_Floyd29",
            "body": "I’m a bridesmaid so my dress was chosen for me but my mom is a guest and the dress code is Caribbean cocktail. At least they included a color palette for everyone’s clarity!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "penguin_0618",
            "body": "My husbands best friends are getting married and he’s a brides man. He has no info. I have to text his best friend, the bride for any info. We got a save the date but not an invitation because “you don’t have a choice you have to be there.” \n\nAnyway I asked the bride what the dress code is/what should I wear? She said “whatever you’re comfortable in. You can wear jeans if you want.” I told her that I would never wear jeans to a wedding.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "b_xf",
            "body": "I went to a wedding a few years ago with no specific dress code and a man came in like 5-inch inseam jorts, a t shirt, a leather vest, and a backpack. Like sir where did you roll in from??? What was possibly the thought process???\n\nI'm in Canada and black is okay for weddings in my area, so I have 3-4 black patterned dresses/jumpsuits and corresponding simple heels. I only wear black and white so that's been my formula - though I did attend a formal wedding in a different country earlier this year and I just decided to wear a plain and simple satin maxi dress - it was perfect for the occasion and I felt comfortable! ",
            "score": 3
        },
        {
            "depth": 0,
            "author": "g00d_rat",
            "body": "Your writing style is *chefs kiss* hahaha. The couple whose wedding I’m attending must’ve felt inspired by Barbie, because we’re all wearing pink! I am not a pink gal, but I found this multicolored dress with pink as the main color. First thing I tried on too! Counting my lucky stars that I wasn’t forced into buying the dress hanging up behind me.\n\nhttps://preview.redd.it/jpl84gt2ut0d1.jpeg?width=3024&format=pjpg&auto=webp&s=a0e195c08c61fbdc4e70aafb50019f1336e4b687",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "That dress is amazing, what a find! It fits the theme perfectly without being over the top pink.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "g00d_rat",
                            "body": "Thank you so much! That’s what I was going for. I got it at Kohls!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LoveReina",
            "body": "I feel like infinity dress from Amazon is a good catch all answer. I have one in green I’ll be wearing to every event all summer. Or at least half of them.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "atheologist",
            "body": "A friend of mine from grad school is getting married at the end of this month at a botanical garden and the dress code is business casual. I'm fine with business casual for work, but that feels odd to wear to a wedding.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "gingerbitch1111",
            "body": "I haven’t been to any weddings with weird dress codes yet BUT my fiancé and I have been thinking about the dress code for our upcoming wedding in 2026. \n\nWe both dress very eclectic and colorful in our everyday lives and want to add that vibe to our wedding with decor and theming. We’re also hoping for our dress code to be:\n\n“fun but formal; colors, textures, and patterns encouraged”\n\nI want everyone to look an appropriate level of “dressy” for a semi formal wedding, but want to see fun colors, polka dots, feathers, sequins, velvet, satin… something funky!\n\ndoes that one-liner address that well? looking for feedback ha",
            "score": 2
        },
        {
            "depth": 0,
            "author": "disney_princess",
            "body": "I have no idea what to do with the code “dress to impress,” specifically when it comes to the length of the dress. How short can I get? Are cut-outs okay? How high should a slit go?\n\nSide note, the wedding will be in Estes Park, Colorado in June.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "tinteacup",
            "body": "I’m going to a wedding that says cocktail on the invitation but then on the website says to bring your jeans and boots because it is an outdoor laid-back wedding with a burger and brat bar\n\nIt’s in like a week or two and I have no idea what to wear",
            "score": 2
        },
        {
            "depth": 0,
            "author": "theLizardMum",
            "body": "My brother in law is getting married next week and we’ve talked enough about this that I’m pretty sure I ordered an appropriate outfit. But they didn’t do a website or anything and didn’t put dress code on invite. So I asked the bride what the dress code was for the wedding. The response? “I don’t know, the normal one?” What.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BudgetAbalone835",
            "body": "I am scared of Black Tie Optional… like is it black tie or not???? Is it semi formal then??? Ahhhhh",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Sparklemagic2002",
            "body": "I have to buy a floral sundress to wear to a wedding and we have to get a light colored suit for my husband. I literally have enough clothes to give 20 people a full wardrobe but no floral print dresses.  I always feel like I’m wearing my grandma’s 1970’s slipcovers when I try on something floral. 😬 WHBM has a cute tropical floral print I’m hoping it will look okay.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "HappyBreak7",
            "body": "Going to wedding with a “colourful and festive” dresscode. Bringing a 1,5MO baby. Don’t know what any of us will wear.\n\nBut still it will most definetly be more fitting than the lady at my cousins ‘formal’ wedding; who showed up in basketball shorts and an orange tie-dye tshirt.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "startingtohail",
            "body": "I am going to a wedding soon that has the ceremony and hors d'oeuvres 12-4pm and then the reception starting around 8 and continuing into the night. They listed the dress code as \"cocktail\" for the ceremony, and \"cocktail or formal\" for the reception. I am traveling to this wedding, and wasn't planning on changing during the dinner break, but the separate dress-code has me wavering. I am excited regardless!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "WillowNomad",
            "body": "I was adjacent to a wedding party (spouse of the best man but not actually IN the wedding party) that gave a dress code for the rehearsal AND for the wedding. And they were specific, sort of.  Cocktail and \"formal, full length gowns not required.\"\n\n... Guess who was the ONLY guest who actually cared about those directions and put my whole big family in the specified clothes at great personal expense (some of my kids were in the wedding also).  🤦🏻‍♀️ There were all kinds of malarkey being worn to both evenings.  And this was outside my own region/friend group so I dunno if it's different over there but golly gee whiz.\n\nI didn't even give a dress code for my wedding.  I'm from a religious background (not one with a dress code) so everyone pretty much wears \"church clothes\" to weddings in my circles if not specified.  This is pretty much ties with optional jackets for men, knee length + dresses in any fabric or jumpsuits for women.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ItsGotElectroLights",
            "body": "I’m going to a wedding in June and the ceremony is at a mosque. So full coverage everywhere, including a head scarf. I’m non Muslim white girl, so I’m not doing traditional Indian formal. I’m big busted so high necklines are unflattering. AND I’m a “face sweat-er”. I’m going to be miserable. I’m not wearing a high neck, long sleeved, floor length dress. \n\nThinking of wearing high waisted palazzo pants and a boatneck top. Dressed up with a fancy gold belt and jewelry. Maybe a long duster to cover my arms that can come off after the ceremony. \nAt least they’re encouraging bright colors so I can play with that. And I have lots of nice jewelry. The bride is wearing red. \n\nI’m very unfamiliar with Islamic cultural rules, if anyone has advice?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Your post has been removed for containing Amazon referral links, which are banned in this subreddit.  If you believe this is incorrect, please [message the moderators](http://www.reddit.com/message/compose?to-%2Fr%2Ffemalefashionadvice)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/femalefashionadvice) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "takis_4lyfe",
            "body": "I must have some boring friends because it’s almost always cocktail/semi formal!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bag_fits",
            "body": "I have one this summer and the dress code is “typical wedding attire”. So a hot pink cutout maxi dress it is!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lisabutz",
            "body": "We were invited to our good friend’s daughter’s wedding. Dress code was semi-formal and our friends were decked out in a satin dress and new suit for him. Bride came in a boho dress with flowers in her hair and groom came in a lavender suit and espadrilles. We showed up in semi-formal and felt a bit foolish since the entire wedding party was boho. Kinda different.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MarblesFromSpace",
            "body": "I'm thankfully not attending any weddings this year but next year I'll be hosting my wedding, ideally in our backyard and so the dress code will likely be \"summer party (please no Hawaiian shirts)\". Is that confusing? Basically \"dress for the July weather but make it somewhat nice please\". I just have no idea how to phrase it clearly!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "biggerthanasquirrel",
                    "body": "I think Garden Party would be more clear. Especially if you have a few sample images of what you mean. Or Cocktail - Outdoors. Or Sunday Best. \n\nSummer party doesn’t mean much to me. In my mind, a summer party = barbeque, where denim shorts or mini dresses would be appropriate, chino shorts for men. I think specifying the length of pant for men would do a lot to clarify. Are jeans ok? Shorts? Short sleeve button ups? What about crop tops for women? Backless dresses? \n\nA friend of mine is going to a wedding and the bride put together a moodboard and though it said semi-formal, it was all revealing cutouts and backless, and high thigh slits. Very clubbing formal. She's leaning in but if there was no lookbook she would have worn a normal wrap dress.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "lizbunbun",
            "body": "We have a \"boho steampunk\" wedding tbis weekend!  We're gonna wear the best costumes I manage to create from whatever suitable articles Amazon will deliver in time because I procrastinated on planning.  Some stuff started arriving last night and I'm delighted with the skirt, kinda more victorian goth. Some fun leather armor should have come today, will be embellished with gold paint and glued-on gears Friday night.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "akw329",
            "body": "Just got invited to a “dressy casual” wedding and I have literally no idea what to wear lol\n\nAs far as I know, dressy casual is a step or two below cocktail? I’m worried that I’ll be overdressed, because I honestly don’t own any dresses in between an extremely casual sundress and nicer formal dresses (silk, etc)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yekship",
            "body": "I have a wedding in July in the mountains that’s “cocktail” but Colorado is a very casual state so I don’t know if it’s real cocktail or not. I have no idea what I’m wearing yet. Maybe a safe black midi dress, but that feels boooring",
            "score": 1
        },
        {
            "depth": 0,
            "author": "snarkshark41191",
            "body": "I’m going to one in June that says “formal, tuxedos encouraged” which makes me feel pressured to buy/rent a tux for my husband. We’re already spending a good amount of money to attend so I just bought him a new suit, which he was due for anyway, and keeping my fingers crossed that he won’t be the only one not wearing a tux",
            "score": 1
        },
        {
            "depth": 0,
            "author": "astreet1290",
            "body": "Ugh, “church clothes” in August in TX, outside at 6pm. We’re going to melt.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "greydawn",
            "body": "My one wedding this year is \"summer formal\" dress code and honestly I have no clue what to wear.  I have a couple dress options but can't get a read if my cousin intends the dress code to mean \"fun, bright florals\" or \"really dressy, but like, summer!\".   I think that I'll just accept that I can't know and may be a tad under-dressed if people go way dressy (it's a destination wedding and I don't want to spend even more money on dress options).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "VioletaBlueberry",
            "body": "My personal wedding rule is if the ceremony is outside, wear wedges instead of regular heels. You'll be able to walk on uneven ground, grass and sand and stand longer. But we don't tend to have as many fancy weddings here.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "clwoboe",
            "body": "I’m going to a wedding in Costa Rica next weekend and the dress code is “Beach Cocktail”. I’m going to be wearing this dress from J Crew because I didn’t know the dress code until after I bought it.\n\nhttps://preview.redd.it/fluikjvsct0d1.jpeg?width=200&format=pjpg&auto=webp&s=8686bdd66a45025bedccce673fd1ec5feb9df7b4",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dapper-Confection-84",
            "body": "Going to a “wear whatever you want” wedding. We are dressing in semi-formal attire, the reception is Saturday evening at a higher end hotel, so it feels appropriate. There may be people in shorts, jeans and whatever but this is how I will feel comfortable.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Brilliantifyouaskme",
            "body": "The wedding invitation I currently have hanging on my fridge for this summer says, “The bride kindly asks women NOT to wear burgundy or dusty rose.”\nI have never seen this! I can’t figure out why?!?!  Even if she wants a large group photo of wedding party plus guests, like from a drone or something, why would it matter? The number of women who would have naturally picked those colors would be few, and dispersed in the crowd???\nI had to read it and examine it two or three times to be sure she was not requesting that we DO wear those colors. WTF? I guess our friend is marrying a control freak…and she’s not hiding it.🤷‍♀️",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "snickerdoodlesandtea",
                    "body": "I've never seen this before, but I think this sub has said that wedding guests should avoid wearing the bridal party's colours, so maybe she believes this is custom?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Inevitable_Score5847",
            "body": "Just bought this dress for a cocktail attire wedding :) [https://www.abercrombie.com/shop/us/p/plunge-pleated-mini-dress-54426323?faceout=model&seq=02](https://www.abercrombie.com/shop/us/p/plunge-pleated-mini-dress-54426323?faceout=model&seq=02)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "_GingerBlueEyes",
            "body": "I have a “wear whatever makes you look fabulous” dress code for an evening wedding this summer in CO. Thanks for no help whatsoever guys. \n\nI’m wearing this cocktail dress:\n\nhttps://www.nordstrom.com/s/7136230?color=320&size=8",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lumenphosphor",
            "body": "The most offbeat dress code I've had was: \"Be hot.\" (but also: the bride and groom did also have a faq wherein they said it was \"where what you want that makes you feel hot no other requirements matter\", so it was also the easiest to follow).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "fashionbitch",
            "body": "Last wedding I attended my friend said wear whatever you want jusT has to be a shade of blue or green. I wore a short blue dress because the wedding was an outdoor beach wedding. Most women were in long dresses but my dress is elegant enough for me not to feel underdressed.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DiligentEmployment59",
            "body": "I’m going to four weddings this summer. Two are garden formal and I got this dress https://www.wedtrend.com/products/lavender-a-line-v-neck-spaghetti-straps-embroidery-long-wedding-party-dress-with-slit?currency=USD&variant=40536395677766&utm_source=google&utm_medium=cpc&utm_campaign=Google%20Shopping&stkn=ee18a9f46d34&gad_source=1&gclid=EAIaIQobChMIjJKNstWThgMVP3N_AB1YxQTZEAQYGSABEgL55PD_BwE\n\nAnd the others are formal and held at wineries and bistros so I am still looking",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Schminnie",
            "body": "My mom is getting married and refuses to specify a dress code because \"everybody is just going to wear whatever they want anyway\". I HATE it. She then throws out examples of what the most fringe attendees have worn to weddings in the past and tells me her best friend is wearing black. She even at one point encouraged me to wear white! (She is wearing white). Also, I am petite but not in the \"cute enough for a romper\" way and fall right in the middle of the dress/suit gender continuum. I have been scouring the internet to no avail.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "offwithyourthread",
            "body": "From the start of May to the end of July, I have 2 bridal showers + 3 mehndis + 6 receptions to attend. My key to survival? I picked out and hung up every outfit at the beginning of May. I get decision paralysis so this takes care of the bulk of decision making.\n\nDesi weddings are a bit chaotic when it comes to dress code. There is always a hierarchy to the level of fancy, where reception is the fanciest. However, all receptions are not equally fancy. And then it depends how big the wedding is, what type of people are there (mostly family vs people you need to impress), if you're a throwaway guest vs a direct member of the wedding family, if the couple is more religious and prefers simpler festivities, if the event is at home or at a venue, etc. So much to consider because it's not as straightforward as \"black tie\" or \"cocktail\".",
            "score": 1
        },
        {
            "depth": 0,
            "author": "devohr901",
            "body": "I have 3 weddings on the schedule this year. The one coming up soonest has a subtly-mandatory \"no black/grey/neutrals\" dress code. I wear almost exclusively those colors. I have no idea how to shop for a dress that is a bright color, or god-forbid, a floral print. \n\nIt also doesn't help that I'm curvy with a UK 30HH bra size, so dress shopping is already a fucking nightmare. \n\nI'm currently looking [at this dress from Abercrombie](https://www.abercrombie.com/shop/us/p/drama-bow-back-taffeta-gown-53805846?categoryId=67557931&faceout=life&seq=01) in green but the spaghetti straps are scaring me a bit. We'll see!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ElectricCrescent",
            "body": "Where do you shop for wedding guest dresses?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueBassist",
            "body": "Going to a wedding in Perth, Australia in early July. I've been told floor length dress, husband in a suit, but the bride is wearing cownoy boots under her dress. Bridesmaids are wearing peacock colors. (blue/green?)\n\n\nI was thinking this (dress)<https://www.peruvianconnection.com/milena-maxi-dress/5637193458.p?code=24USG101&utm_source=google&utm_medium=cpc&utm_campaign=pla&nooverride=1&gad_source=4&gclid=CjwKCAiAibeuBhAAEiwAiXBoJHyAOWlTU2qduewlDP0LMNMzr5FIBeoV5k3bMHF4jUEMSgAB9opC6RoCZj8QAvD_BwE&gclsrc=aw.ds>\n\n\nHoping the colors would coordinate without looking like a bridesmaid. Not sure how I'd style it. Thoughts?? Help a northern hemispherian out",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FireflyBSc",
            "body": "Not a wedding guest this year (last year was our busy one. But my company is having a delayed holiday party in June on a Saturday night with a business casual dress code. I have absolutely no clue how to interpret that.",
            "score": 1
        }
    ]
}