{
    "title": "General Discussion - May 17, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "Algrenn",
            "body": "I’ve been wondering for a while about people who sell stuff for like $5-10 on Poshmark, Vinted, etc. Does it make economical sense? You cannot even buy a coffee with that money!",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "xoxogracklegirl",
                    "body": "I used to do this -- shipping materials from USPS are free and at the time I didn't have to go out of my way at all to put packages in the USPS drop box so even if I only made like a dollar from the sale it wasn't a big deal. Everything I sold was similar in size/style so more often than not people would bundle a couple $5 items together, which made it more worthwhile. Now that I have kids I don't have space to store a bunch of stuff so if I go back to selling on Poshmark it will only be nicer items that I can get at least $20 for.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Algrenn",
                            "body": "Yes, with bundles and such it makes more sense!",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dapplegray",
                    "body": "Yeah but $2 is two dollars more than zero. I could use every dollar I could get because I live in a HCOL area and have poor pay.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hihelloneighboroonie",
                            "body": "And if you have stuff you want to get rid of anyways...",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Algrenn",
                            "body": "Yes, but you also spend lots of time answering questions, commenting, adding photos, etc. maybe I have low tolerance for this lol",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I was thinking about this recently too. I wanted to make a potential buyer happy by giving them a deal on some shoes, but when I calculated all the posh fees and shipping I would make like 2 dollars and it didn’t feel worth it to pack and walk to the post office especially with my disability.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Algrenn",
                            "body": "Yes! Also you lose time to take photos, post, answer questions. As a hobby - yes, but that doesn’t look feasible from financial point",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Mintyest",
                    "body": "Back when I was younger and strapped for cash, I did the same thing. I've also noticed some of these sellers are selling a *ton* of stuff. One $5 sale may not even be worth going to the post office for, but 20 x $5 would be.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Algrenn",
                            "body": "Yeah, it makes more sense if you sell stuff in big volumes ",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dancingmochi",
                    "body": "I only bother to list things which might sell, but honestly once I learned a lot of donations do not even make it to the sales floor of charity shops because of overflow, that motivated me to at least find a buyer. I noticed clothes on Buy Nothing groups here don’t get attention, friends are in different sizes, and have missed out on larger community clothing swap events.\n\nIt is also very easy for me to ship things (post office near by, stash of old shipping mailers, get to skip the line with prepaid shipping labels created by the app) while I still have the time to do so.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Algrenn",
                            "body": "I didn’t know that about donations. That’s what I do most of the time with my clothes. I donate them to the church nearby, partly because I don’t have much time (or patience) to sell it online.  ",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dancingmochi",
                                    "body": "I’m sure smaller organizations like churches are more committed to the effort, and it varies by how much they get. Don’t sweat it if you aren’t able to do it differently though.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Algrenn",
                                            "body": "Thank you. I feel sometimes like that’s a game you cannot win",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "500DaysofR3dd1t",
            "body": "I bought a pair of very expensive sustainable patent leather heels online last night. They are a size 6UK. I'm usually a 6W or a 8.5W in the US. I'm worried they will be uncomfortable, but they are double strapped Mary Janes and I couldn't find a wide alternative anywhere else that looked as nice as these. Would it be possible to break them in or should I return them when they arrive?\n\n\n[Shoes in question.](https://joanieclothing.com/rouen-patent-leather-mary-jane-shoes-burgundy.html?gad_source=1&gclid=Cj0KCQjwgJyyBhCGARIsAK8LVLNOCgrx_zPN_FIprDZOIYMLNtzevAw1AUNPyaBEgVMa6rd1kaxI-PcaAvAqEALw_wcB#product-info-delivery)",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "DiagonEllie",
                    "body": "If they're too tight when they arrive, I'd return them. Patent leather doesn't stretch very well, so they can only be broken in so much.",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "troubHELL",
            "body": "Hi everyone! I have a somewhat formal event to go to. I have compiled a few pieces together already, but I’m unsure how to accessorize it. Hoping for some input :)\n\nI am thinking of adding a hair accessory, gold or silver jewelry?  Please add your suggestions!\n\nhttps://preview.redd.it/abptyonkh21d1.jpeg?width=2880&format=pjpg&auto=webp&s=3ab1137f1347e60b3b0c86d093f9f2412ec66377",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Less is more? I'd just do a very fancy faux diamond drop earring",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "gradstudent1234",
            "body": "I'm spending about two weeks in Hawaii and I need under $50 outfit ideas! I'm chonky in the middle",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "A few colourful, flowy dresses would be appropriate.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gradstudent1234",
                            "body": "Do you have any suggestions on specific ones",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blackberrycat",
                                    "body": "Sorry I haven't been able to find any that don't fit weird for the past few years. I just ordered one on LL Bean if that helps but it was $100. I think Lands End has some cheaper ones. I'd just try some of your local shops.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}