{
    "title": "Daily Questions Thread May 23, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "bigbotanybtch",
            "body": "**Tall women who wear Everlane Tall pants - I need you!** I purchased 2 pairs of the Everlane Utility Barrell pants in size Tall and they fit wonderfully, a perfect ankle height on me (5'8\"). I'm looking to buy another pair of Everlane Tall pants in a different style, probably denim. Any suggestions - what else has fit you well?",
            "score": 5
        },
        {
            "depth": 0,
            "author": "english-rose-1764",
            "body": "https://preview.redd.it/4v5igeeni52d1.jpeg?width=828&format=pjpg&auto=webp&s=1011f5fa7ca8f78d1b1029d6f4f2f2ff313d5e59\n\nHow do I style this dress! My brain is saying gold jewellery, but I can’t decide shoes/accessories!! Any and all help appreciated :))",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "PoppyHamentaschen",
                    "body": "Gold or wooden jewelry. You can do something lovely with wood, polished coconut or maybe tiger's eye. I would go with hoop/thick earrings (either wood or gold), and a big ring on one hand. I probably wouldn't do bracelets, because of the sleeve detail. If you are going to do a necklace, it would have to be bold, so that it won't be lost in the print, or a large pendant in a solid color. Gold or beige sandals. I wouldn't wear it with black, because it would weigh the whole outfit down. I need to define my waist or else I look like a potato, so I would add a belt, either beige, raffia, woven camel colored leather, or the same color as the shoes.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "BlackCherryMagic001",
            "body": "What are some trendy and walkable shoes that look a bit polished? I don't like the look of Adidas Sambas, they look too sporty to me. Both summer and spring/fall recommendations are welcome :) ",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChickWithPlants",
                    "body": "Most people here suggest Veja. For a more budget friendly pick, I’ve been wearing these [Lucky Brand sneakers](https://www.dsw.com/product/lucky-brand-divahna-sneaker---womens/557041?activeColor=100&cm_mmc=CSE-_-GPS-_-G_Shopping_AllProducts-_-All_Products&cadevice=m&gad_source=1&gclid=Cj0KCQjw0ruyBhDuARIsANSZ3wohKzWh02ObvcYMCsosSpCbcODAe-QxaqC7aQcwBtQIk1wFwyIaF8AaAnhQEALw_wcB&gclsrc=aw.ds) to work.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "BlueBassist",
            "body": "Going to a wedding in Perth, Australia in early July. I've been told floor length dress, husband in a suit, but the bride is wearing cownoy boots under her dress. Bridesmaids are wearing peacock colors. (blue/green?) I was thinking this [dress](https://www.peruvianconnection.com/milena-maxi-dress/5637193458.p?code=24USG101&utm_source=google&utm_medium=cpc&utm_campaign=pla&nooverride=1&gad_source=4&gclid=CjwKCAiAibeuBhAAEiwAiXBoJHyAOWlTU2qduewlDP0LMNMzr5FIBeoV5k3bMHF4jUEMSgAB9opC6RoCZj8QAvD_BwE&gclsrc=aw.ds) Hoping the colors would coordinate without looking like a bridesmaid. Not sure how I'd style it. Thoughts?? Help a northern hemispherian out",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "PoppyHamentaschen",
                    "body": "So, July in Australia is winter, with temps from 9-18 celsius (48-64 F). The dress looks nice, and the teal is more in the background, so you probably won't be mistaken for a bridesmaid :) . I would wear it with closed-toe heels. Check out Zappos, there are some fun options, like this bronze metallic by Aldo [https://www.zappos.com/p/womens-aldo-jan-bronze/product/9897900/color/200](https://www.zappos.com/p/womens-aldo-jan-bronze/product/9897900/color/200) or one of my favorite brands, L'Artiste by Springstep [https://www.zappos.com/p/womens-lartiste-by-spring-step-rockin-lorna-camel-multi/product/9911480/color/12123](https://www.zappos.com/p/womens-lartiste-by-spring-step-rockin-lorna-camel-multi/product/9911480/color/12123) or [https://www.zappos.com/p/womens-lartiste-by-spring-step-toolie-red/product/9108742/color/585](https://www.zappos.com/p/womens-lartiste-by-spring-step-toolie-red/product/9108742/color/585) .",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "Wow the colors on that dress are so beautiful!!!!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "tshody",
            "body": "I have a very long rise and need 12-13” rise in shorts. Any idea where to look for them?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Agolde has some. Contemporary to designer brands are more likely to have the super high rises - I think it tends to be harder to find them in lower level mass market/fast fashion because they’re too extreme for most people (so aren’t going to sell as well).",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "im_avoiding_work",
                    "body": "madewell high rise shorts like that. [This one](https://www.madewell.com/clean-button-tab-shorts-in-100-linen-NQ408.html) has a 12.75\" rise, [this one](https://www.madewell.com/the-harlow-short-NO938.html?dwvar_NO938_color=BK5229&cgid=apparel-pantshort-shorts) is 12\"",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "biggerthanasquirrel",
                    "body": "curvy lines tend to have higher rises and especially higher in the back. I bought the Abercrombie and Fitch Curve Love dad jean shorts and love them. (2 washes). Also Everlane list all their garmenr measurements on the product pages. You can see exactly the rise on each size of shorts.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "FairTone2833",
            "body": "Which of my dresses would you recommend for a friend's wedding in the Balkans?\n\nhttps://preview.redd.it/199kj5k1w52d1.jpeg?width=1118&format=pjpg&auto=webp&s=b7c380399b606b1afbf4ef4254aa4443eee89ac0",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "FairTone2833",
                    "body": "https://preview.redd.it/tevo7oz2w52d1.jpeg?width=1171&format=pjpg&auto=webp&s=55e370e24fa7b516cf5d9fc67ab7d7f98ce27453",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thenfacetoface",
                            "body": "I love this one.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "PaulaLoomisArt",
                            "body": "This one!",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "FairTone2833",
                            "body": "https://preview.redd.it/8hzrd26fw52d1.jpeg?width=1329&format=pjpg&auto=webp&s=3d175c0078722372cf2c0e47682b456078a20d3a\n\nI really want to like this one but I feel like it's a bit too small :(",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PoppyHamentaschen",
                                    "body": "It needs a lot more fabric in the skirt. This is the kind of dress I would wear with dark tights and boots for a cold weather wedding. I like the middle option best (the one with the tulip hem).",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FairTone2833",
                                            "body": "Thank you!",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I personally love this one’s texture and colour, but the 2nd one’s style looks a little more sophisticated for a wedding.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "jaderust",
            "body": "https://preview.redd.it/owvy9q1gg62d1.jpeg?width=761&format=pjpg&auto=webp&s=2e15e2ae41f48a570ef48ba8c2be247655b9667f\n\nI’m going to a baby baptism where I’m going to be named a secular Godmother. I’ve been looking for an excuse to buy this blouse, got it, and now I can’t figure out what to wear on the bottom. I was thinking black wide leg pants but when I got a pair it turns out that wide legs look terrible on me. I’m only 5’2” with most of my height in my torso so the wide legs made me look stubby.\n\nAny suggestions? I can’t figure out if I should have black or grey bottoms, pants or a skirt. I’m just feeling a bit lost with a very expensive top mocking me for buying it before I figured out the bottoms!",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "The key is balancing out your proportions. Looking for a higher rise straight leg pant, and tuck the blouse in. Also if you go for a lighter colour, like lavender or green (either pastel or a mid-tone, as long as it doesn’t clash with the colours on the blouse) it’ll be less high contrast which might be easier in terms of not feeling like you’re awkwardly cut in half by your outfit.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I am 5'2\" and a bit curvy - I don't know anything about a baptism or the level of formality expected. I'd personally wear that blouse tucked into a pair of high waisted black skinny jeans with a belt and some cute sandals or low heels. If the tuck didn't look right, I'd probably roll up the sleeves and lightly tie the shirt to make it more casual.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "trevlikely",
                    "body": "What I would personally wear (5’2, mid twenties) is a high waisted short black skirt and black tights with boots. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "kick_g",
            "body": "Ladies, would an ArcTeryx Patera parka be warm enough for the Patagonia region of Argentina in July and August? Ty!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "tigertrap666",
            "body": "Can anyone recommend a bag that's similar to a Baggu crescent bag? I like the lightweight material of the baggu one and that it can change from shoulder to crossbody. I don't like the lack of compartments..at least an outer pocket would be nice.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Flurinziks_06",
            "body": "HELLO 👋 \n\nSo I recently got a pair of baggy cargo pants they are sorta beige or guess you could say khaki but idk what I could wear with them they are super cute and comfortable but I was sorta thinking of getting some chunky sneakers to wear with them cuz they looked cute from the ones I had seen. \n\nThe top I’m not really sure at all. All I really own are t shirts and a single zip up hoodie jacket along with two other hoodies that I can really wear. \n\nSo I was wondering for some advice if possible, please and thank you.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I like going oversized on top with my cargos - oversized tee and hoodie. I love chunky platform sneakers with them too. You can also do a tighter tee (baby tee will give you Y2K vibes) or tank top. Then layer a flannel shirt (open or tied around the waist) or an open zip up hoodie.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Flurinziks_06",
                    "body": "https://preview.redd.it/5ejtdzcmi62d1.jpeg?width=606&format=pjpg&auto=webp&s=08570895b81de40fcfc620cd018582b10b8d2ac2\n\nSorta like these",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "astrobeanmachine",
            "body": "Thanks to the people who suggested some sneaker options in response to my request in yesterday’s thread. I think I have an evolved idea of what I want: **court-style sneakers** that are **wide**, **comfortable** and **colorful** (or able to be DIY colored/illustrated). \n\nWhile I respect a lot of cool sneakers out there, I’m no sneakerhead, and more subtle branding is preferable. I’ve got a few options below that I like aesthetically; what I need to know is relatively how wide these run (none of them are officially a “wide width”) and how comfortable they are for wearing for hours on end (think dancing at a club or walking a museum), as I can’t find them in stores near me, and I’m getting weary of the buy-try-return-because-it-doesn’t-fit process. For size reference, I wear an EU36 Wide in Birkenstock sandals. \n\n- [Saucony Jazz Court Pride](https://www.saucony.com/en/jazz-court-pride/59060U.html?dwvar_59060U_color=S70804-1): I kind of love these? They’re almost campy, but I think I could dig them. Even the non-Pride version seems like a viable option, as I hear Saucony runs wide. \n\n- [Adidas Superstar](https://www.adidas.com/us/superstar-shoes/FV3284.html): I’ve heard these also run wide. I would likely get the all-white edition, then make them colorful myself. \n\n- [Allbirds Couriers](https://www.allbirds.com/products/womens-couriers-dark-grey-natural-black-natural-white-sole?price-tiers=msrp): These are perhaps the most boring options, but I’ve also had moderate success with Allbirds comfort for my feet. \n\n- [Gola Tennis Mark Cox](https://www.golausa.com/womens-gola-classics-c15/tennis-mark-cox-c156/vegan-gola-classics-womens-tennis-mark-cox-rainbow-ii-sneakers-p2035): I’ve heard of Gola but don’t see them around my area much. Some reviews I read said they’re well-cushioned, but the shape of the shoe makes me worried that they’re going to be quite narrow. \n\n- [Reebok Club C Double](https://www.zappos.com/p/womens-reebok-lifestyle-club-c-double-chalk-core-black/product/9380326/color/963391): Also not the most colorful. I also worry these are low-volume (I have a high midfoot), but they look potentially wide enough. \n\nI have tried Cariuma, Vans, and Converse, and they do not work for me. I’ve also heard of Superga, but not necessarily for comfort, and they appear pretty narrow like the Golas. New Balance isn’t off the table, but their branding is a bit too much for me most of the time. And I’m not keen on the idea of Air Force 1s either. If there’s another option not on my list that I should consider, I’m open to it!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Logical-Layer9518",
                    "body": "If you want colour, take a look at M. Moustache.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "helicopter_corgi_mom",
                    "body": "i own multiple pairs of Gola tennis shoes - they’re my favorite. i think they’re well cushioned, and super comfortable. i don’t think they run especially narrow, but not wide either. i do recommend going a size up if you’re inbetween sizes or you just want a bit more toe box space",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Separate_Future2434",
            "body": "Anyone know where I can buy feminine long sleeved clothing for the workplace that’s not a hoodie? \n\nI’m a teacher and it’s freezing in the building, however when I have to go outside around this tine of year it’s pretty warm. I’m looking to buy something that’s feminine, professional, will keep me warm, and something I can take off when going outside. \n\nI’m tired of wearing frumpy hoodies and a bunch of layers. Unless someone knows how to layer and still wear something nice. Also, a lot of my cardigans are just too thin, even when wearing layers. Or they are thick but aren’t feminine. \n\nI really want to be able to wear something nice but I feel like I’m too cold to do that.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CitizenDildo",
                    "body": "I'd check out uniqlo!  Lots of Japanese professionals shop there for the workwear that's versatile in Japanese summers (humid AF outside, freezing in the office).  And the women's cuts are pretty feminine imo",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "intessen",
                    "body": "I like to layer a flannel over my high-neck shirt for true 90s professor looks. \n\nI've been eyeing Big Bud's Press [Ricky Jacket ](https://bigbudpress.com/products/ricky-jacket-basic-black-1)as a fall/spring jacket, it might be a bit too thick depending. Naadam has both a [twill](https://naadam.co/products/twill-oversized-jacket?variant=40140930547808) and a [terry cloth](https://naadam.co/products/unisex-terry-shirt-jacket?variant=39590592872544) shirt jacket that may fit what you are looking for. I've also been eyeing up a lot of Cord Studio's [overlays](https://www.cordstudio.com/collections/overlays-for-women), and think they're absolutely stunning! The June Cape is an easy layer, and I think they've convinced me on the gilet they have. I have a very limited palette and am very much an outfit repeater, so ymmv!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "How about a sweater/fleece jacket without a hood, like the Patagonia Better Sweater? Figs and other medical companies also have some slim fitting jackets https://www.wearfigs.com/en-CA/collections/jackets-and-vests-womens. I feel comfortable wearing them in a professional setting over, say, a sheath dress. \n\nYou could also try a blazer made from a warm material like a wool-blend.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "bookmonster015",
            "body": "I’ve been salivating about buying a poplin trench from banana republic, and now it’s gone on 30% off for the Memorial Day weekend. Should I snag it now or do we think the sale will increase before the weekend is up?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "You could order, then if the sale increases you could pre-order and cancel the original maybe?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bookmonster015",
                            "body": "Such a good idea! Thank you!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mem1003",
            "body": "I bought a pair of these Crocs but for $16 and they're light blue, not white:\nhttps://www.crocs.com/p/baya-platform-sandal/208188.html\n\nI'm debating whether I should keep them or not.  Of course they're not the most stylish shoes, but they are comfy.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "spooteeespoothead",
                    "body": "I mean, it really comes down to how much you value the comfort level over the style level. I know that my Birkenstocks are by no means the most stylish shoes, but I'll be damned if I ever give them up because they're the most comfortable sandals I've ever worn in my life. And I'm at the point in my life where I'm not willing to part with comfortable shoes just because someone might think they're ugly lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "cats-the-musical",
            "body": "I have had [this vegan leather Moto jacket ](https://poshmark.com/listing/Sales-LOFT-Hunter-Vegan-Leather-Moto-Jacket-Green-Size-US-4-65ecc0cd02760b57c2e76c6a?utm_source=gdm&utm_campaign=19942816543&campaign_id=19942816543&ad_partner=google&gskid=pla-2320815644327&gcid=654175041312&ggid=146527818126&gdid=c&g_network=g&enable_guest_buy_flow=true&gad_source=1&gclid=Cj0KCQjw0ruyBhDuARIsANSZ3wrNbs-MJG0s4r5_jdFgvO0dI7UVXu7woG_TPubIGVwzzPZOhBubR-YaAgX0EALw_wcB)from Loft for years. It's falling apart and I'd like to buy a quality, comparable leather jacket to replace it. Any recommendations?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "lumeleopard",
                    "body": "All Saints is usually the main one being recommended for leather jackets. Or thrift shops!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "kimchi_paradise",
                    "body": "Madewell sometimes has sales on their leather jackets, so keep a lookout! ",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "Second hand! There are SO many amazing used leather jackets out there, super cheap, and they look better broken in than brand new.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "fridgesaviour",
            "body": "Are 70s style prints, like waves/swirls/psychedelic out of fashion again?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChickWithPlants",
                    "body": "I feel like everything is in fashion all the time now. I say go for it!",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "im_avoiding_work",
            "body": "Does anyone know of a good place to find dresses in silk crepe? I know Reformation does quite a bit of silk but it's all silk charmeuse/silk satin, and I'm looking for a 100% silk dress with less sheen",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "iorelai",
                    "body": "Amour Vert has a whole line of reasonably priced washable crepe 100% silk dresses. I wish their prints were better though, or that they would do more classic solid colors. I own two and they are the best travel dresses.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "tea-spoons",
                    "body": "Réalisation Par has a similar vibe to Reformation. Most of their silk dresses are crêpe",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "im_avoiding_work",
                            "body": "thank you! I'd never heard of them before",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "Max Mara?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ordinary-Chemical-41",
            "body": "I really like [this pair of loafers](https://imgur.com/a/hnvAyV4) but it's like 1cm too narrow comparing to the shoes I'm comfortable with, my toes feel clamped while length wise it's more than enough. (loafers are EU41 and my feet are about 24cm L, 10cm W) Can't upsize anymore because no larger stock in the shop.\n\nIs it possible to stretch it that much without damaging the finish and deform it significantly? Or does it just not fit me and I should keep looking?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "lumeleopard",
                    "body": "I think this kind of style of loafer is pretty easy to find these days, so I would suggest to keep looking to find something that actually fits you out of the box since trying to stretch the toe area sounds like too much work. Maybe look for wide fits? As I've gotten older I've realized that there's no reason to put up with uncomfortable shoes.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "MeAl88",
                    "body": "I asked about chunky loafer recommendations above. Here are some comfort-oriented options that I found: \n\n1.  [Boulevard Loafer | Women's Shoes | Metatarsalgia | ABEO – The Walking Company](https://www.thewalkingcompany.com/products/abeo-boulevard-loafer-metatarsal-dark-brown?variant=42878210638001)\n2. [Naturalizer Adiline Loafer](https://www.naturalizer.com/product/womens-adiline-loafer-3019977/cranberry-leather-ec0203120)\n3. Vionic [Kensley Loafer (vionicshoes.com)](https://www.vionicshoes.com/kensley-loafer.html?color=1492)and [Cheryl II Loafer (vionicshoes.com)](https://www.vionicshoes.com/cheryl-ii-loafer.html?color=749)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lilaciel",
            "body": "Are there any thick or lined white dress shirts that are tailored in at the waist? Something I could wear a black or dark-colored bra underneath and not have it show through?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Vegetable_Chemical44",
            "body": "I hope it's okay to ask this here, I recently bought a top that I love because of the colour and fit, but I can't wear it without a bra and it's a bit see-through.... Do you think it's socially acceptable to wear it like this to a restaurant, cinema, brunch?\n\nhttps://preview.redd.it/8exm7wo3p72d1.jpeg?width=3021&format=pjpg&auto=webp&s=5d3c8d1e685128386b32d4a2acfb6330dd62590b",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "kimchi_paradise",
                    "body": "Have you considered nipple covers, if you are concerned with modesty in that regard? \n\n\nNippies is a good, seamless brand to consider! Otherwise if you're not concerned with that I think it's fine! ",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Vegetable_Chemical44",
                            "body": "Thanks! No, I didn't know those existed! Thanks for the rec :) And glad to know you think it's fine!! I don't really care if my nipples show a bit, but I was afraid this top was stretching it a bit too far (literally haha)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "Why wouldn't it be? I think it looks fine.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "Personally, I wouldn't feel comfortable wearing that out and about. It's not so much the outline as the amount of motion that I don't like displaying. Your mileage, of course, will vary.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "up_down33",
            "body": "I am a genz college student who lives in mostly baggy, straight, flares/bootcut jeans with Converse and vans high top. So like normally casual. I need help building a summer closet that is close to casual. I am trying to wear more skirts and dresses too. \nMaybe something like combat boot and dresses? I am confused. Also something O can transition to fall from summer or spring to summer.\nThanks.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "It's unclear what you're confused about. If you can clarify that you can get better answers. \n\nIt also really depends on where you are in terms of being able to transition clothing. If you're in a four-season climate, there really are very, very few items you can wear on December 28 and July 17, you know? \n\nFall to summer is also very tough. Fall clothing is made for layering, and the colors, materials, and textures are very different than bright, light, breezy summer stuff. If you're \"confused\" about why you can't find items to transition from fall to summer it's because they don't exist pretty much! I guess you could grab a bias cut midi skirt and pair it with a sleeveless top in summer and a sweater + boots in winter but that's a big step up from Converse and jeans or flared leggings. \n\nGenerally speaking, start with a slightly nicer version of what you have or the \"summer version\" for summer. Like summer version of jeans is jean shorts. Summer version of a sweater is a jean jacket. And so on.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bozenfisch21",
            "body": "First date and torn what shoes to wear with my sage green floral midi/maxi dress\n\nI have a first date  which is fairly casual. I (24F) have a sage green floral dress with small green flowers on it, no sleeves, the skirt is cut from the sides. I don’t have many shoes the two options I got are white sneakers from KG and dark green converse (thin soles version). if it helps I’m petite and slim.\n\nI have a feeling that the white sneakers are kind of going out of style.. Which one is better in your opinion? Thank you 🙏",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "Definitely the dark green converse!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "funwithbubblegum",
            "body": "Can anyone recommend their favorite UPF clothing? Mainly looking for tops! I find that a lot of the uv protective clothing out there is a little basic or matronly. Any favorite brands that are stylish but still protective? I love color and am not afraid of interesting patterns. Thanks!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "zurriola27",
                    "body": "Patagonia is really high quality. I also like mountain hardwear.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "wildflowerhustlers",
                    "body": "Most UPF clothing I’ve found leans outdoorsy. I’ve had the best success with NRS, Mountain Hardwear, and REI’s Sahara shade line. MH has a fabric called Crater Lake that is incredibly lightweight and effective, and they offer multiple cuts on their site (eg hoodie, long sleeved shirt, cropped shirt). I hike in the high desert and have a couple large tattoos on my arms, and all three companies keep me cool in the heat and burn-free. Good luck!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "funwithbubblegum",
                            "body": "Thank you so much! The Crater Lake stuff is really cute! I love the cropped options",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "I don’t know, I’ve always just worn regular old clothing (like, long-sleeved lightweight linen shirt or trousers) when I’ve needed sun protection and it’s not been an issue. Could you wear just normal clothing? It would certainly expand the options.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "plumcock",
            "body": "Outdoor terrace ceremony in Vegas this weekend\n\nIs [this dress](https://imgur.com/a/JyNP9nX) appropriate for an evening wedding, cocktail attire dress code? Forgive my mediocre attempts at trying to obscure my identity. The wedding invite states cocktail attire, “evening dresses anywhere between floor-length to just above knees”. It also advises the ceremony will be on an outdoor terrace with the temperature expected to be in the upper 80’s at the time of the ceremony (6:30pm in Vegas), so be sure to take that into account when dressing for the heat. My main concern is if this looks like too much cleavage.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "livthelove",
                    "body": "I think this works, but I think it will be heavily dependent on the bride/groom and their families. I wore a similar style dress to a cocktail wedding outdoors in the summer and it was totally acceptable, but some people like to be more conservative for weddings.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sweet-Entrance-2185",
            "body": "where are you supposed to wear these tight unitard rompers?\n\ni don’t really know how to use imgur so please tell me if the link doesn’t work but i’m talking about these: https://imgur.com/a/YO9rfH3\n\ni’ve been seeing so many women online wearing tight unitards and they all look super cute so i bought one too. i really like it but i have no idea where i would be able to where it in public. are they meant for your home only? where do other women where them?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "zurriola27",
                    "body": "Your link isn't working for me but I wear them only to yoga/pilates classes",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MeAl88",
            "body": "# Work Shoes for My Wife (Plantar Fasciitis-Friendly)\n\nHey all,\n\nMy wife (33yo) works in a health clinic and recently mentioned that all her work shoes are uncomfortable and/or worn out. She has struggled with plantar fasciitis and some chronic ankle pain from a bad sprain.\n\nShe walks half a mile to work and she is usually walking around a lot at work, so her shoes need to be comfortable on the go. Her sense of style is typically quirky: colorful jumpsuits, colorful chunky accessories, denim jacket adorned with enamel pins, chunky glittery boots, etc. For style reference, we live in Northern California. She tones it down for work - usually darker colors, blouses, slacks, the occasional oversized sweater - but she still has a unique style. She leans heavily into Madewell for work clothes.\n\nShe is currently overwhelmed with work and health issues recently, so I'm just trying to take something off her plate. I showed her a couple of shoe styles and she OK'd the general chucky loafer style and I've been finding some interesting styles and options in terms of comfort-oriented shoes.\n\nSince I don't keep my eye on women's fashion, I wanted to get opinion from this forum. Any thoughts on these in terms of fashion trends and/or comfort? New recommendations are also welcome:\n\n1. Top pick right now: [ABEO chunky loafer](https://www.thewalkingcompany.com/products/abeo-boulevard-loafer-metatarsal-dark-brown?variant=42878210638001) - I was thinking the dark brown color\n2. Not like what she usually wears, but I think she would pull off very well: [Bared monkstrap](https://baredfootwear.com/products/coua-black-leather-flat-monks)\n3. [Naturalizer Adiline Loafer](https://www.naturalizer.com/product/womens-adiline-loafer-3019977/cranberry-leather-ec0203120)- Probably in cranberry or black leather\n4. Vionic [Kensley Loafer (vionicshoes.com)](https://www.vionicshoes.com/kensley-loafer.html?color=1492)and [Cheryl II Loafer (vionicshoes.com)](https://www.vionicshoes.com/cheryl-ii-loafer.html?color=749)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "QuercusMuehlenbergii",
            "body": "I have two weddings to go to this summer, one in early June and one in late September. I had wanted to wear the same dress to both of them, but it turns out that I’ll (most likely) be about 27 weeks pregnant for the second wedding. I’ve never been pregnant before, so I don’t really know what to expect, but I’m guessing that this same dress plan isn’t going to work. Should I just plan on getting two different dresses?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "…could one of those infinity dresses work? They cover sizes from like XS to XL, so I feel like that might work with the size fluctuations. This place has a straight size and a plus size: https://www.infinitydress.com/en-nl/products/burgundy-multiway-infinity-dress?variant=37671324057771",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Unfortunately, no one can answer this for you (and be very skeptical of anyone who claims otherwise). \n\nBy 27 weeks, you might be carrying very slightly, or you might be carrying quite enormously. If you are long-framed, especially if you are long-waisted from shoulders to pubis symphysis, you might show a bit less, but there’s really no guarantee. Some people start out pregnancy quite slender and gain 70 pounds. Some people start out pregnancy overweight and gain 15 pounds. \n\nMost women aren’t really, really big until months 7, 8, and 9.\n\nThere's probably a pretty good chance that you might be able to wear the same dress (assuming it's not form-fitting) to both weddings, but no one can make any promises.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "canyonmoon",
            "body": "https://preview.redd.it/kmjfpndpo82d1.jpeg?width=1370&format=pjpg&auto=webp&s=2bf44902edefe634b0b8539e774c278ca09342ca\n\nHelp! I was planning on wearing this to an alt concert with one of these shoe options but now second guessing the whole outfit. The skit is making me feel business and also bar hopping 2012. Any ideas? I like the top I think, but should I maybe try jean pants? I don’t know!!!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "livthelove",
                    "body": "Tbh I think the shirt + skirt + platform sandals is really cute for a concert",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "canyonmoon",
                    "body": "Jeans for reference!\n\nhttps://preview.redd.it/4w2uv5hus82d1.jpeg?width=2048&format=pjpg&auto=webp&s=f6053340b3da6ee1554a5873f201bfd931261997",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Wild-Onion8201",
                            "body": "I think I like the black jeans with the boots. ",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Expensive-Elk6594",
            "body": "How do I make my breasts look more appealing in this top? I don't really know what the top is, it's kind of like cami but tight. I tried a bra but it shows too much at the back as it's quite low. I love the top a lot but I want to make my breasts more flattering in them as they're sort of parted. Help would be much appreciated. Here's the top I bought by the way but I know how sketchy links can be these days: [https://www.shein.co.uk/SHEIN-ICON-Women-s-Lace-Patchwork-Pleated-Y2k-Cami-Tank-Top-p-26752877.html](https://www.shein.co.uk/SHEIN-ICON-Women-s-Lace-Patchwork-Pleated-Y2k-Cami-Tank-Top-p-26752877.html)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "Boob tape is probably the only thing that could work. Or maybe Misses Kisses (the boob tongs)?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wild-Onion8201",
            "body": "Does anyone buy from therealreal? I saw a jacket on it that I want but saw the site has mixed reviews. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Wild-Onion8201",
            "body": "Does anyone buy from therealreal? I saw a jacket on it that I want but saw the site has mixed reviews. ",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "Yes, here's my 2 cents: \n\nFirstly, they have really, really high shipping costs. And it's the same shipping if you return something. So it's $13 USD both ways. \n\nWatch out for final sale--IMHO it's not marked clearly enough\n\nThey're doing this weird (and I think predatory, frankly) partnership with a service that offers \"final sale UNLESS you spend more and get this return insurance service\". I mean, for a 3-figure item, I guess I can see it. But it gives me the ick. I've seen it on a handful of items and it's unclear which ones and why/how they're eligible. \n\n  \nThe additional % off only works on full price items \n\nI would carefully think through how to use your $25 coupon for signing up for emails/first time customer coupon. \n\nThe biggest issues I've had is not disclosing clearly the condition of shoes or bags (more worn than they appear, but not ultra-dramatically so) and labeling things wrongly. \n\nI just had an unpleasant experience with them that is making me second guess ordering from them again, though, after years of regular orders.. I ordered Dress A. I got Dress B with Dress A SKU tag on it. I took pictures, and initiated a return. I printed out the order, and the wrong-dress listing and wrote a note explaining that the correct SKU tag was attached to the wrong dress, with print outs of Dress A and B. \n\nIt took two weeks after the return reached the warehouse and multiple customer service chats to get a refund. And I had to ask them directly \"I want my entire refund now\" and borderline threaten them with a chargeback to get it. They were giving me the run around about how they were escalating it, and so on. I understand it was confusing and it could appear I was trying to return the wrong item on purpose. But the wrong item was a $1000+ original cost Balenciaga dress and the right one was $130. I mean come on. I could have easily kept the much more expensive item and sold it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "baboobo",
            "body": "i'm having a hard time finding low rise straight jeans!! Any recommendations",
            "score": 1
        },
        {
            "depth": 0,
            "author": "This_Baseball_9240",
            "body": "Does anyone have recs for elevated mom outfits? Just had a baby and all my Pinterest inspo is a mix of office outfits and trouser/blouse/sweater combos. I’m having a hard time knowing what to search by on Pinterest specifically to get outfit ideas that still look put together but are actually practical for having super young kids.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Redheadedcaper2",
            "body": "I am looking for the perfect work pants. Ideally they’re high rise with elastic/stretch waist, pull on style as I have some medical issues resulting in bloating. I am looking for a straight leg preferably and they must have pockets. I also love jogger style pants but seem to only find types that are athletic material. They need to be business casual or dressy. Khakis are fine. I’d love any leads please!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Humcred",
            "body": "My mom's Catholic. My Mom bought this 20 bucks necklace - which is beautiful - at Walmart years ago.\n\nI'm looking to spend a huge amount of money on a surprise gift for my Mom. Without her I am nothing. She was always there for me in my time of need and I want to show a nice gesture. Anything like Cartier or even better? I want new, not vintage or old.\n\nCan anyone on here recommend me a brand to check out?\n\nI really appreciate it.\n\nThanks",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "bubblegumdavid",
                    "body": "Would help if we knew what the necklace she loves looks like so we can get a sense of what she likes!",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "PoppyHamentaschen",
                    "body": "What a sweet sentiment! It's obvious your mother has done a wonderful job of raising you. I suggest you take a detailed picture of the 20 bucks necklace, and take it to a high-end jeweller, and have them custom-make you a real one (or something that looks very similar) with diamonds and/or both your birthstones. It will be unique, it will be expensive, and it will be even more special, because it comes from the heart.",
                    "score": 2
                }
            ]
        }
    ]
}