{
    "title": "Daily Questions Thread May 19, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "AlternativeNme8950",
            "body": "Old millennial is back, this time looking for advice on bags!  What is the trend now?  Is the fanny pack worn as a cross body thing still in?  (Got good advice yesterday on shoes - bought sambas and Veja Venturi - and now I'm moving on to bags!!)  Btw not talking like designer bags here (although I'd love to) but just like a standard every day run-around bag.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "hennipotamus",
                    "body": "I still see a lot of the fanny pack cross body thing, probably most specifically the lulu lemon cross-body. I also see a lot of bags like Uniqlo’s [round mini shoulder bag](https://www.uniqlo.com/eu/en/product/round-mini-shoulder-bag-464484.html) worn across the body. This [Madewell](https://www.madewell.com/the-essential-sling-crossbody-bag-in-leather-NQ285.html) one is a similar shape but leather, if you want more polish. Caveat that I am also a millennial, but I personally think the cross body fanny pack could be on its way out, but general cross body bags will be in for awhile.\n\nEdit- I actually meant to link[this one](https://www.madewell.com/the-sling-crossbody-bag-in-leather-NN848.html) from Madewell as being more similar to the Uniqlo.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AlternativeNme8950",
                            "body": "Oh these are super cute, thank you",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "The [Cos quilted bags](https://www.vogue.com/article/cos-quilted-crossbody-bag-fall-2023) are still in.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AlternativeNme8950",
                            "body": "Oh wait now I really like this too.  I wish the mini size could be worn crossbody...",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sexysmoothfig",
                    "body": "canvas tote bags with a cute print are still having their moment",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I don't know what what's \"in\" exactly but I feel like Portland leather co is selling a ton of cute crossbody bags in all sorts of fun colors",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "artfartspaulblart",
                    "body": "I have [this fanny pack ](https://www.baggu.com/products/fanny-pack-bluebell) from Baggu in mauve and the lime green/ lilac gingham. It has so much space. Great for hiking and also great as a bag while I'm on crutches. 🦿",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AlternativeNme8950",
                            "body": "Ooh I think I like this better than the Lululemon one!  Buying.  Thank you!  (And fast healing!)",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "artfartspaulblart",
                                    "body": "I've had to stop myself from also buying the periwinkle one, it's so pretty. Thanks! Two weeks til physical therapy. 🤞",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mjk25741",
            "body": "Where are we getting those cute 2 piece vests/pants outfits??",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Plastic-Passenger795",
                    "body": "I have one from Favorite Daughter, and Aritzia also has them.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "Abercrombie has some, as wells as Old Navy!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "daddy_tywin",
                    "body": "I’ve seen a bunch at J Crew, Apiece Apart has an amazing pinstripe linen set like this that I love but can’t justify",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I think j crew and banana have some oversized linen options",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "I just bought a set from Mate the Label!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fluffy_Yesterday_468",
            "body": "Overall how is Pact? I keep getting their instagram ads but you never know with instagram stores",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "_liminal_",
                    "body": "I really like their stuff! I have a dress I wear lots and it’s held up great over the years. Lounge/activewear pants are great too. Also like their undies. ",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "floracalendula",
                    "body": "I've only had misses from them, no hits. I just don't like the quality of the cotton, and the one sweater I loved instantly developed a hole.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "I don't love them. Their underwear specifically seems to only go up to an XL (at least in stores where they are carried) and that's a run-small very little stretch XL. The pants I got as well were a bust. They felt too small, tight, and short as well as not the quality and longevity I wanted at that price point.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "KingPrincessNova",
                    "body": "their now-discontinued pocket leggings were my favorite for a while but the color (black) fades quickly compared to other cotton clothes I own, which causes them to show sweat stains like crazy. super breathable though, I'm gonna miss them",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "botanygeek",
                            "body": "wait they discontinued the pocket legging??  WTF",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KingPrincessNova",
                                    "body": "it's already gone through a few iterations since I bought my first one a couple years back. I think they try to sell out the old stock before they introduce the new design (or at least the new product name 🤷‍♀️)",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "triangalicious",
                    "body": "I got some kids tshirts from there and they were  nice and soft and good quality. Not sure about adult stuff",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "artfartspaulblart",
                    "body": "I like their underwear. Especially the French cut briefs.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rubystreaks",
                    "body": "I have one pair of twill pants from them. I don’t like the fabric at all, I think it’s stiff and not at all stretchy, and I was annoyed that it was final sale just because it was on discount",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "waterproof13",
                    "body": "I like their cotton dresses but not at their full price point. The cotton underwear is good quality, too. I didn’t like whatever else I got, the cuts were odd.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "I think their leggings are good, but I ordered some t shirts for my Mom but they were too thin and see through. We returned them",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "oldcushion",
            "body": "I wanted to buy a dress from the brand Oddmuse but I’m a bit skeptical about their quality and if they are a dropshipping website. Has anyone here gotten something from them before? Is it worth the price?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "voilsdet",
            "body": "I want a casual, sleeveless top that isn't a workout top, or just a tank top. I have an everlane muscle tee from like 2015 that I love but they don't seem to sell it in that cut any more (also have heard everlane isn't what it used to be anyway). \n\nAnyone know where sells casual sleeveless tops that drape (aren't fitted all the way down), and can be worn casually?  I'm about to weather another Texas summer and I don't have many sleeveless tops that aren't just straight up tank tops or workout clothes. I also am not into the trend lately where sleeveless tops have weird triangle-things that hang over one's shoulder - I want the top of my shoulders covered but for the sleeve holes to go straight up and down, if that makes sense.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "this pleated uniqlo sleeveless top looks kind of interesting [https://www.uniqlo.com/us/en/products/E467047-000/00?colorDisplayCode=68&sizeDisplayCode=003](https://www.uniqlo.com/us/en/products/E467047-000/00?colorDisplayCode=68&sizeDisplayCode=003)",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Idk if this it too much of a tank top, but I have one of [these]( https://athleta.gap.com/browse/product.do?pid=384043422#pdp-page-content) and really like the drape",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "It's over my budget but I feel like sezane has some, and both Abercrombie and American Eagle have some none fitted options in a variety of fabrics",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "e1dar",
                    "body": "I really like my sleeveless tops from Old Navy, [like this](https://oldnavy.gap.com/browse/product.do?pid=790935182#pdp-page-content)",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "I'm wearing a vintage Jones New York linen knit shell with tiny beads knitted into it here and there. It's a cute and easy-to-wear shirt that reads casual but also polished and pulled together enough that if I need to leave the house it's not a disaster. So in other words, linen knit? Or vintage :)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mbluish",
            "body": "# What quality clothing line has great styles for woman over 50? I want to look and feel my best and have some things for a nice dinner night out and things for a casual daytime look.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "dapplegray",
                    "body": "I believe Ann Taylor, Chicos, and Talbots tend to cater to older women, but it would greatly depend on your style because age doesn't necessarily determine your size, shape, or personal taste.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "mask_chosen",
                    "body": "Talbots is a good place to start. Also check out J. Jill and Eileen Fisher.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "please pop over to r/fashionwomens35 --we have tons of lists and posts about brands and options there",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "xiphosura666",
            "body": "I have had a lot of anxiety and dread around clothes for a long time. I feel like I have pieces I like but I have a hard time isolating my personal style or putting together outfits I feel good in. I want to stop always buying stuff I end up selling at a loss. Pls help :(",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "Oh man I'm sorry. \n\nIt might help to isolate the steps and moments where you feel upset and name the emotion. So for example: \n\nBrowsing, picking something, putting in cart, buying, unboxing, styling, wearing, washing/care and then upkeep. Which steps, if any, give you that feeling? \n\nOr is it more generalized, like around fast fashion and climate change? Recently I went on a hunt for vintage Donna Karan runway or RTW Collection pieces and I had this sickening, gut churning feeling realizing that at one point there were hundreds, maybe thousands of each item out there on shelves and racks and in closets and now they are impossible to find second-hand. Which means either they're still in collections (best possible outcome) or in landfills--gone but not gone. The idea of thousands of garments that cost 3 figures each in the 90s rotting away gives me vertigo. And that's ONE brand. I also get that same vertigo when I see hundreds of name-brands I've never heard of in the thrift store. Like...where's the rest of it? Rotting away somewhere. Again, best case it's rotting back into the earth! \n\nA third might be (and this is me especially as I get older) the dreams and fantasy self is gone or slipping away and I don't love the reality that's replaced it. I've sold 90% of my chic, flattering, upscale work outfits. I don't work in an office anymore and likely won't for some time. And even if I do, the office culture is such now that pencil skirts and heels don't make sense. I used to go out a lot more and my health thanks me for not doing that, but the days of costume parties and art gallery crawls and going to see someone's play, and bar hopping and club hopping are over. I don't need cocktail dresses pretty much at all--very, very occasionally if then. \n\nReading that I realize I may not be helping and I'm sorry! But it might help to pinpoint the cause of the anxiety. For me, I used that anxiety to reel in my shopping/spending, focus on secondhand pieces almost exclusively, shop natural fibers, and keep track of my outfits and wardrobe more tightly so I can track what I actually wear vs. my fantasy life. \n\nLeaving all that aside, when you sell something and don't make back your money, it's okay. The cost was learning that you don't like it, that it doesn't work, or that it does't fit in your life. And think of how excited someone's going to be to come across it at a bargain price!",
                    "score": 13
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "allbitterandclean",
                    "body": "Odd question because I’ve never thought about it, so I feel drawn to try and answer lol. They should fit your crotch like underwear does. Snug, but not up any holes. If it’s uncomfortable, try a different style (such a high rise). Now here is perhaps a more relevant question: do your thighs rub together when you walk? This is a very pronounced feeling in jeans specifically, and if you’re not used to it can be incredibly irritating. (For a lot of people, over time, the denim will rub away in the thighs - both men and women.) This may be part of what’s causing any crotch discomfort as well.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "astro-08",
                    "body": "No. If you feel it rubbing against your crotch, there’s not enough room in the front or back (I.e. you have a little stomach pooch). The fabric is being pulled forward or back to accommodate, hence the friction. You will need to size up. If the waist is too big sizing up, you may need curvy cuts or get the waist tailored.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "spoonwalk",
            "body": "hi all, i’m graduating in a few weeks and in need of sandal suggestions!\n\ni broke my back recently so i’ve had to neglect my high heel collection, unfortunately have to wear flat shoes for graduation as well. i’ve been looking at dainty, strappy sandals, but most of the options come off as too casual or flip flop-y. any help is appreciated!\n\ni’ll most likely be wearing a white mini dress, and my gown is navy",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "floracalendula",
                    "body": "Is there a reason why the shoe has to be a sandal? I'd personally do a pair of white pointed flats.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spoonwalk",
                            "body": "the shoe doesn't have to be a sandal, but i wore lot flats exclusively when i was a kid and it's kind of a bad memory lol 😭 i also can't see myself wearing them after graduation, they don't fit into my wardrobe very well",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "floracalendula",
                                    "body": "So, [this](https://www.dsw.com/product/kelly-and-katie-nymie-sandal/544265?activeColor=230) is one idea. It's minimalist, yet elegant. You could also do it in [diamante](https://www.dsw.com/product/kelly-and-katie-nymie-sandal/567526?activeColor=740). \n\nFor some reason, I love the idea of a statement shoe, though? Like [this](https://www.dsw.com/product/betsey-johnson-dacie-sandal/582865?activeColor=077)?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "spoonwalk",
                                            "body": "thank you so much for the links! also yea i like the statement shoe too, i was thinking something like that too. i was hoping to find something like [this](https://www.walmart.com/ip/Scoop-Women-s-Lace-Up-Stiletto-Heel-Sandals-with-Flower/5161466731) or  [this](https://www.krystledesantos.com/blog/2017/7/31/diy-orchid-heels-) (just by vibe, i haven't looked too closely yet) because i like the little detailing! i'll definitely be heading to dsw ^ ^",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mariekenna-photos",
            "body": "Where can I buy maxi dresses for an office setting that *isnt* Shein? \n\nI’m currently trying to loose weight but it’s so hot so I’m trying to stick to under $50 since it (*hopefully*) won’t fit long. \n\nI like many of the ones I see on Shein with the florals and defined waists ect, but can’t find anything like those anywhere else and don’t personally trust Shein. \n\nI typically shop at places like target or old navy but they don’t quiet have what I’m looking for right now.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "KarateDimension",
                    "body": "It's not much better, but I have a lot of luck with maxi dresses at outlet stores like TJ Max or Nordstrom Rack.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "waterproof13",
                    "body": "Honestly? Try Amazon!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "pwnkage",
            "body": "Purchased the Nana's Bridget Mini Dress in Cherry Red, but I had a lot of issues with it when it arrived. Aside from the construction and materials being a bit poor, the fit was completely off, and the cut was unfortunately not flattering on me. I still desperately want a cute red dress, but I'm inverted triangle so I want a fitted top and more poof at the bottom. I love love great sewing and construction so I'm happy to pay high prices for anything luxury or handmade, ideally ethical. Any brand or dress recommendations? Thankyou!\n\nhttps://preview.redd.it/z2slvkxfli1d1.png?width=642&format=png&auto=webp&s=7f84b013a8aaec34f2df317927640b00e284326a",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TrashPanda_049",
            "body": "https://preview.redd.it/rsuqlc88rl1d1.png?width=720&format=pjpg&auto=webp&s=16e2909f4a118ca5ab2743baba529a100accfc24",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "TrashPanda_049",
                    "body": "I was wondering if this was work appropriate for a business casual office",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Acme_Co",
                            "body": "Absolutely!",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Yelrak94",
            "body": "https://preview.redd.it/6w35f6qxod1d1.jpeg?width=2400&format=pjpg&auto=webp&s=4a9217ea1faef2cad8e1e7adecb68be3309082c7\n\nI have a corporate awards black tie dinner coming up (not just my employer, it's a national award night following a conference). My boss and his boss will possibly be attending.\n\nI haven't been able to find a dress, and these are two options I own (black I wore to my engagement, the olive one as a bridesmaid). Having trouble knowing if either of these are appropriate. Worried as the black is not floor length (although close to it on me, it's a bit shorter on the model). But the olive feels very 'bridesmaid' to me and I'm worried about the cleavage showing at a corporate event. Would either of these dresses be appropriate? Or should I keep looking?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "As this is a work event, it's not the time to flout the dress code, even if others do. The black is too short and too sundressy. The olive will be fine if you can pin it over your cleavage a bit - a 'diamond' or fabric-flower brooch would be ideal for this purpose. \n\nIf you want to buy a new dress, I think both of these shapes and colours suit you well - I'd just go for something  floor length, in an evening fabric, that doesn't show any more skin than everyone's already seen in the office.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Yelrak94",
                            "body": "That's a good call, thank you for the advice.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "The olive is probably better. Can you pin the the v a bit higher up?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Yelrak94",
                            "body": "Thanks! It's pretty structured / padded but I might see if I can!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "KingPrincessNova",
                    "body": "the first definitely isn't black tie. the olive looks good on you but personally I'd find something new with a high neck. as a busty woman, I've pinned cross-front tops plenty of times but it's not something I'd want to risk for a formal event with coworkers",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Yelrak94",
                            "body": "Thanks! I've definitely been trying but in my country/state it's been pretty hard to find something that suits in my size (and isn't $900). Most formal gown shops don't stock plus sizes and take months to order them in :( \n\nI'm wondering if I can just find a bra that makes my boobs sit in a way that they don't look quite as out there, but worst case I'll take it to a seamstress to see if they can help actually stitch it a bit higher.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "Can you have a seamstress shorten the olive dress to mid calf length? That plus pinning up the V a bit will do a lot to make it corporate event ready.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Yelrak94",
                            "body": "Thank you, something to consider! They did specify a Black Tie dress code for the dinner, which makes me wonder if the floor length gown is actually what is expected. I'll do some more googling to see if the length is something I can play with to make it feel less like a bridesmaid dress.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "75footubi",
                                    "body": "There should be pictures from the event in previous years on social media so you can always use that for inspiration/vibe check",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ManonIsTheField",
            "body": "is anyone willing to share any \"hidden secret\" eBay stores they like? I'm trying to buy more high quality items, sustainable is great but not a deal breaker, I wear a size large and love brands like Rujuta Sheth, Damson Madder, Toast, Molby the Label, etc.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "Linda's Stuff\n\nBFHO",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Rupss16",
            "body": "Where are folks getting their cute, ergonomic, everyday sandals? My old pair from Naturalizer finally fell apart",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Teva",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "dapplegray",
                    "body": "Clarks",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "carigobart648",
            "body": "What’s the name and origin of this type of design? [https://imgur.com/a/NaPSTWc](https://imgur.com/a/NaPSTWc)",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "pwnkage",
                    "body": "I've seen it called scarf-print or chain-print. I'd say Versace and Hermes are well known for this pattern, but I can't say who started it.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "BirdieStitching",
            "body": "My teenage niece is a dancer (primarily ballet) and does acrobatics, she's a uk ladies size 8 waist but she's really tall and her leg muscles are so big normal leggings don't fit her. Where can I find leggings suitable for daily wear that will fit comfortably? She loves funky and unusual prints.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "rae_is_not_okay",
            "body": "I live in Mississippi and need new casual clothes that wont kill me in this heat. I like fun patterns and colors and all the stores I’ve found are too minimalist for me. I’m trying to avoid polyester at all costs. Any store recommendations?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "dapplegray",
                    "body": "Can't give you store recommendations without knowing your budget or style, but I buy linen everything from whatever store sells them for cheapest.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "waterproof13",
                    "body": "What’s your budget?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rae_is_not_okay",
                            "body": "I don’t think I’d pay more than 35 USD for a shirt. Not looking for super expensive stuff.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Algrenn",
                    "body": "I would try second hand like Poshmark or eBay ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "dj_white",
            "body": "Has anyone found a good white cotton maxi skirt that isn't see through? I live in a pretty hot climate so the 100% cotton content is must",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "pwnkage",
                    "body": "SueHillCraft on etsy has a variety of 100% cotton maxi skirts. I've been looking at them for petticoats, and I haven't purchased from them, so I don't know what they're like, but that is an option for you.\n\nhttps://preview.redd.it/q1yqxykxni1d1.png?width=1261&format=png&auto=webp&s=9423b74390d631d66654cea8f878e335d50392a8",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dj_white",
                            "body": "What a gorgeous store, thank you!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "Relaxed fit vs the \"Hummus\" shirt which I'd call slim fit",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "wanderedoff",
                    "body": "I'd cuff the sleeves and see how you feel. The sleeves on the first one are shorter, the sleeves on the second one is longer. The sleeves on yours are in the middle, and don't look intentionally oversized imo",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "OnTheRunToo",
            "body": "Commuting Shoes\n\nI’ve been commuting to work in Denver for about a year now, and I’ve been wearing high top converse most of that time on the light rail and walking to my building. I usually wear ankle length trousers with the occasional dress in the spring summer but I can’t keep this up and need something with more support.\n\nSome girls I see wear Brooks or some athletic shoe, but I’d like to keep it somewhat wearable in the office, too since were able to wear sneakers as well but also having it look out together. \n\nSome of my friends are saying Keds, some say Superga. What do some of you use that had worked, been comfortable and even wearable throughly the day?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "floracalendula",
                    "body": "I'm really feeling my Merrell Keens. Uh, not with dresses, but with trousers yes.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Chazzyphant",
                    "body": "I also live in Denver and did the light rail commute thing! I loved Tsubo but I think the brand is not in the market anymore. You might be able to get some NWOT or very lightly used secondhand. Joseph Seibel is another option for a \"walking sneaker\". Finally, Cole Haan Zero Grandes. There's something about the way they look on my foot and leg that doesn't work for me but comfort and performance wise they are terrific.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "A lot of Skechers transition well from travel to office. ",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Idujt",
                    "body": "I love Converse, they fit my tiny narrow flat feet well.  I have custom orthotics, well worth the money.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "theinspocompass",
            "body": "I'm in the market for a new everyday bag, something I can dress up and dress down. I'm also going to be traveling this year, so something that will be comfortable to wear all day. I've been watching a TON of reviews and doing A LOT of research. Here are some of the bags I like most. Does anyone have any other suggestions/advice. Also if you have experience with any of these bags please let me know.\n\nMZ Wallace Metro Sling: [https://www.mzwallace.com/products/mushroom-metro-sling](https://www.mzwallace.com/products/mushroom-metro-sling)\n\nPoppy & Peonies The Sidekick: [https://poppyandpeonies.com/collections/crossbodys/products/the-sidekick-camel](https://poppyandpeonies.com/collections/crossbodys/products/the-sidekick-camel)\n\nMonos Metro Sling: [https://monos.com/products/metro-sling?variant=43718641746119](https://monos.com/products/metro-sling?variant=43718641746119)\n\nBellroy Mini: [https://www.amazon.com/dp/B0BW7XFX7P/?coliid=I3ISTYMTNNH755&colid=3H81F5Q1867XX&ref\\_=list\\_c\\_wl\\_lv\\_ov\\_lig\\_dp\\_it&th=1](https://www.amazon.com/dp/B0BW7XFX7P/?coliid=I3ISTYMTNNH755&colid=3H81F5Q1867XX&ref_=list_c_wl_lv_ov_lig_dp_it&th=1)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "Personally, I think the sidekick is the most versatile and looks nicest!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "dukky77",
            "body": "Can folks help me style this dress? I received it as a gift from family — it is not my style (I dress more casual (simple tops and dark jeans or black cargo pants), and more edgy). I’m wondering if there is a way I can dress it down so it’s not so femme / “womanly” haha. Shirts underneath the dress? Jacket over the dress?\n\nI should say I’m short and nowhere near as leggy.\n\nhttps://preview.redd.it/cfwhc2vyjj1d1.jpeg?width=1179&format=pjpg&auto=webp&s=530707010a92a6f676011d0f6e95acd4fc9dd2c4",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "zigzagtitch",
                    "body": "oh i LOVE this! you could probably get away with wearing a tight white tshirt underneath it or even some kind of shirt?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "KarateDimension",
                    "body": "What about pairing with doc martins and a leather jacket?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dukky77",
                            "body": "I like that! I think I will try that with a mesh tee underneath—and some edgier accessories",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dukky77",
                    "body": "https://preview.redd.it/ue26nm6fkj1d1.jpeg?width=594&format=pjpg&auto=webp&s=eb33401f0ce7846e3064de0cda0ab944d13b0275\n\nDetails",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "symphonypathetique",
                    "body": "Would take some finessing but you might be able to tuck it into cargo pants (a la Ashley of bestdressed on YouTube)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fluffy_Yesterday_468",
            "body": "Where are we buying shorts online? Nicer summer shorts, size 8, have a tummy",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I bought some from Abercrombie, felt like they had a good selection of cuts, longer lengths, and a wide variety of formality and fabric",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Separate_Future2434",
            "body": "I’m looking to purchase long sleeve fleece pajama sets like what you see during the winter time. Preferably I want the button long sleeves so that I can wear them over a short sleeve shirt. \n\nI usually purchase ones from Joe Fresh but there aren’t any online. I gained some weight and am need of some as it is freezing in the house where I live. \n\nPrice wise I’m looking at nothing above $50. \n\nI’m from Canada. \n\nAny advice is appreciated!!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "Try marks work wearhouse but since they're out of season, you might have to hunt irl sale rack",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Separate_Future2434",
                            "body": "Thanks!!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Bluenotes has amazing fleece pyjama pants! So comfy and warm. For a full set I buy flannel from La Vie en Rose. Idk if either retailer sells warm PJs in the summer tho. Maybe there's a local/smaller PJ store near you? Littlebluehouse.com is one I know ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Separate_Future2434",
                            "body": "Thank you!!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "weezerfan300",
            "body": "I bought a really cute pair of jean shorts, but I’m unsure how to make them fit. It doesnt seem to want to fit round my hips. Does anyone have any tips for stretching it ever so slightly around the hips? They can button and zip but not very comfortably.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "EbbAdministrative983",
                    "body": "I've heard that you can stretch jeans by spraying them with water and wearing them while damp. Never tried it myself, but might be worth a try!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "It's not Jacquemus. Your link says it's the Aspen jacket from Babyboo, which is a cheap fast-fashion brand that gets [terrible reviews on Reddit](https://www.reddit.com/r/AusFemaleFashion/comments/187lbd3/do_not_buy_from_babyboo_fashion/).",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "...is this a suit? I'm not sure if I'm misunderstanding what a suit is or you linked the wrong thing lol\n\nSkims sells similar-looking stuff. [This hoodie](https://skims.com/products/cotton-rib-zip-up-hoodie-soot) or [this one](https://skims.com/products/modal-french-terry-shrunken-zip-up-cyan), and [this pant](https://skims.com/products/modal-french-terry-shrunken-zip-up-cyan)?",
                    "score": 1
                }
            ]
        }
    ]
}