{
    "title": "Share your favorite hats with me!",
    "comments": [
        {
            "depth": 0,
            "author": "thenfacetoface",
            "body": "Ok this is a bit niche but if you want to wear a high ponytail with a baseball cap and can't because of the back, there is this thing called the Ponyback hat with a slit that closes magnetically in the back. They have tons of colors. Also my husband is pretty crafty and just bought me a baseball cap, cut it open and sewed magnets on the sides and it works great!! [https://ponybackhats.com/](https://ponybackhats.com/)\n\nAlso sometimes I just embrace the costumey-ness of it. Love a wide-brimmed sunhat. I like the ones with wire at the brim so you can adjust to a cool little S-shape. I think they work with dresses and jumpsuits just fine in the summer. I also got this hat that is extra wide-brim and it looks like a taco. It's very Jacquemus inspired.\n\nThis is Anya-Taylor Joy at Cannes recently in one: [https://hips.hearstapps.com/hmg-prod/images/anya-taylor-joy-is-seen-arriving-at-hotel-martinez-ahead-of-news-photo-1715853962.jpg?crop=1.00xw:0.880xh;0,0.120xh&resize=1200:\\*](https://hips.hearstapps.com/hmg-prod/images/anya-taylor-joy-is-seen-arriving-at-hotel-martinez-ahead-of-news-photo-1715853962.jpg?crop=1.00xw:0.880xh;0,0.120xh&resize=1200:*)\n\nAnd me in my taco hat\n\nhttps://preview.redd.it/58zxvkit471d1.png?width=1683&format=png&auto=webp&s=bef42f922bce302c153fb128e3694616a43fe1b5\n\nThe ones on the left side of the mirror are my wire-adjustable hats.",
            "score": 55,
            "replies": [
                {
                    "depth": 1,
                    "author": "chemical_syntax",
                    "body": "Wait, LOVE your whole outfit there. Where are the pants from??",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thenfacetoface",
                            "body": "Thank you! They're not pants. It's a Zara skirt (satin effect skirt with knot). Here is a poshmark listing. [https://poshmark.com/listing/Zara-Satin-Effect-Skirt-with-Knot-Detail-61f585269c3378db698ef3cc](https://poshmark.com/listing/Zara-Satin-Effect-Skirt-with-Knot-Detail-61f585269c3378db698ef3cc)",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "electriceel04",
                    "body": "omg ponyback has xxl hats, perfect for a big-skull girlie like me :’) \n\nalso love your whole fit in the taco hat pic!!",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "neon_wizard_poster",
                    "body": "Girl that fit is fearless and powerful!! Love that you leaned into it cause it works so well",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thenfacetoface",
                            "body": "Thank you 🙏",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kimblem",
                    "body": "Do you have a link to your taco hat?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thenfacetoface",
                            "body": "https://preview.redd.it/96aocvbh2a1d1.jpeg?width=750&format=pjpg&auto=webp&s=4474fbc5df638e0368dd77eb6e7be1ca2784fbdc\n\nIt’s second hand. It came rolled up and sewn like this and I think it helps it stay up. The keywords could be rolled up straw oversized hat. There are some on Amazon.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kimblem",
                                    "body": "It’s hard for me to tell on Amazon if the brim has that wire that make the brim stay…",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "wavecrashrock",
                    "body": "Where are your wire adjustable hats from? They look great!",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thenfacetoface",
                            "body": "Thrifted but they are all very similar. The blue one had a tag that said Gold Coast Sunwear.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "rK91tb",
            "body": "Coolibar, Solbari, Wallaroo and Sunday Afternoons have good hats.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "DaphneNS",
                    "body": "Seconding Wallaroo, look for their hats made of UPF! I love that they have petite sizing too.\n\nI love wearing hats and just embrace that they're a bit costume-y. I know I've found a good hat when I get compliments from older people; they know hats!",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "AptCasaNova",
                    "body": "Coolibar has a sun parasol that is amazing and I use it when I can be bothered with hats.\n\nI have a ball cap in brown and a bucket hat in blue that I wear alternatively.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "umbri_elle",
                    "body": "Sunday Afternoons has great hats. I have everything they do in women's widebrims. They check out their Taylor! It's adorable and works great for like early dinner or something that needs to dress up more than straw.  \n\nAnd now I'll recommend San Diego Hat Company.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Polishment",
                            "body": "I googled [Sunday Afternoons Taylor](https:// www.sundayafternoons.com/products/taylor-hat). Very versatile! I like how it has the coverage of a rancher without being cowgirl. \n\nWill explore San Diego Hat Company next, at first glance they have a LOT!",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "umbri_elle",
                                    "body": "Yeah, I don't know what happened... actually - I know exactly what happened. I had surgery and had to keep the sun off my face at all costs. So I was wearing scarves and thought: \"I'm not a hat person, but let's try cool wide bring sunhats\"... and now I'm not just a hat person, I have a room full of them. Normalize sunhats in winter please! :) (the Taylor is a winter hat for me)\n\nGood luck on your hat journey! If you find something cool PLEASE SHARE! I have four more hats on the way. ;)",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ohheyyeahthatsme",
            "body": "I've had a Nike featherlight (aka dri-fit) cap for 4 years and it's fabulous. I wear a lot of black and white anyway, so it goes with everything. If you put on earrings and a blazer it's very \"cool girl\" but you can also wear it running, near water, etc. because it's not made of cotton. It's thin to keep you from sweating in hot weather. You can put it in a lingerie bag and wash whenever you want. I love the dang thing, perfect for travel. \n\nCuyana is a great online source for made-in-Ecuador (aka panama-style) hats for reasonable prices, around $100. I have two and love them! I added \"stampede string\" hat straps from LeatherByPeter on Etsy to keep them from blowing off in windy conditions.\n\nLa Rubia is another favorite hat store, located in Key West, FL. They have some amazing pieces if you ever get a chance to visit in person, but are also on IG. \n\nhttps://preview.redd.it/c9ykbd9l871d1.jpeg?width=1728&format=pjpg&auto=webp&s=b2ee9b37a0a6231dac693bf888ed439933554da5",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "Haha my husband has that exact Nike hat! Genius to wash in a lingerie bag. It needs a wash and then I will give it a spin. \n\nDid not even realize cute Cuyana made hats! I’ll take a look. \n\nGoogled La Rubia and saw a pic of the brick & mortar storefront. What a cute spot!!",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "daddy_tywin",
            "body": "I am very fair and go full theatric. This is my current sun hat, by Eugenia Kim. Soft, packable, I can tie it to my bag when not in use.\n\nhttps://preview.redd.it/zld1q7gpc81d1.jpeg?width=533&format=pjpg&auto=webp&s=0edc223cda32b26d12a9354758a22456a95d80e4",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "Haha that is a way to go about it, just embrace the theatrics! That’s how I’ve treated hats in the past; mainly for vacation and I would feel glamorous with a statement hat, like Rose peering up at the Titanic.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "turnipturnipturnippp",
            "body": "I own this:  https://www.costco.com/solar-escape-sun-hat.product.4000022638.html\n\nI love it because of how flexible it is.\n\nAnd it works with... basically every outfit?",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "Ummmm… less than $10. Has a string to keep it from flying away. Very versatile. Nice brim.\n\nAs a new Costco member I will be PROUD to buy this and add it to my new hat wardrobe. Awesome reco!!",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "omar_strollin",
                            "body": "I have the less fashionable grey one, and I wear it everywhere. I get some sly comments, but your health is more important! I throw it in the wash every week and it’s been fine for years.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GittinItTagatherrrr",
                    "body": "I have this (and have had for years)- and it's PERFECT.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "artfartspaulblart",
            "body": "I've been mildly obsessed with this hat maker [Ellini's work](https://ellenithelabel.com/?fbclid=PAZXh0bgNhZW0CMTEAAabahagB5D3r5Wl1XtCXdURB7_FPR9WXZdf6wAIKHS6gLhzmBOYBxWsPdHU_aem_AdQf6lmnYQ81jIwH2z8XHZ02YQAD5d-JagPGCOfO-1ZyjnXjtvd73balwbhUggTG7a_a2oGpmRoh9HdDgAD2QIou). She's Australia-based and makes all of her own designs. I particularly like her [heart hats](https://ellenithelabel.com/collections/the-heart-hats).",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "I am now obsessed too! Ah the Taylor Swift ones, too cool.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "artfartspaulblart",
                            "body": "I hadn't seen those until this morning. Not a fan, but glad she's making what makes her and her customers happy. I'm quite obsessed with the pink strawberry heart hat.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lumenphosphor",
            "body": "There's a pretty [great inspo album](https://www.reddit.com/r/femalefashionadvice/comments/vt2678/inspo_album_the_romance_of_the_sun_hat/) that might also help you!",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "teenprez",
                    "body": "Wow, thanks! I prefer my hats on the sculptural/statement-making side so this is perfect!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "lumenphosphor",
            "body": "I have a floppy black straw hat and a neutral beige one with a ribbon that I wear in the summer over and over--both I got in an emergency because it was very bright at some touristy store in different countries, and I have tried to keep them for as long as possible lol--They feel and look pretty cheap close up but I don't think most people can tell.\n\nPersonally, I don't care for the short brim bucket hats because they aren't functional for me, and the height of those hats are also generally short so they sit high and provide even less protection, (not so for this [janessa leoné](https://janessaleone.com/collections/bucket-hats/products/felix?variant=31724187779134) hat, but that's a very expensive straw hat lol) but the [wide brim ones](https://www.freepeople.com/shop/lake-washed-bucket-hat/?color=072&countryCode=US&type=REGULAR&size=One%20Size&quantity=1) look like they could work.\n\nI did used to wear baseball caps from time to time when I was running or going to a gym (until I lost my hat alas). I'm considering getting another one that better accommodates hair for when I'm running lol, but otherwise given what I tend to wear in the summertime baseball caps don't really go with the outfits I wear (which tend to be [sundresse](https://imgur.com/qSrp7kJ)s or lightweight [pants](https://imgur.com/JzWiAUL)/[skirts](https://imgur.com/YRrzJkz)).\n\nGenerally the hat needs to fit the vibe of the outfit, otherwise it might look out of place or added on. That is, why the fedora became much maligned because a very formal suiting hat was worn with like very casual clothes.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "I LOVE that FP wide brim hat you linked to in the washed black shade. Thank you! That’s perfectly low-key and just what I’m looking for I think. I’ll see what else FP has for hats too. \n\nI was scouring Anthro  and & Other Stories last night and saw several hats that were similar to the Janessa silhouette you shared. I think I might feel like I have blinders on if I wore it but I do really like the style.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lumenphosphor",
                            "body": "(Also I know you're not thinking about this, but since sun protection is unfortunately necessary all year round--I feel like [this hat](https://www.freepeople.com/shop/rancher-felt-hat/?category=SHOPBYBRAND&color=015&type=REGULAR&quantity=1) might be something you might like in f/w. I think it isn't styled as casually as the fabric bucket hat, but I think it could work with jeans and a tee or a dress tbh--for like the athleisure times I really like the corduroy baseball caps I see other people wear \\[I would link some but I think those are better off being perfectly like in your color range and such\\]).",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Polishment",
                                    "body": "You’re right, it’s a year round need. I’m 5’2” which adds to my personal hat issues. I feel comical when the brims are too big! I do like the look of this hat though!",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "neon_wizard_poster",
                            "body": "I’m a big hat girl, so i think the biggest thing for those straw bucket styles is making sure they fit your head because of how they sit on your head! I have one from lack of color i had to Frankenstein to get it from flying off so they can be sized down even. \n\nHats definitely need to fit the vibe of the outfit, but can also throw the balance off. Sometimes my outfit itself needs a third piece of interest to tie it all together. So scarves under the hat or around my neck. A linen cardigan, blazer, vest, or kimono over my top. An asymmetrical crochet skirt over my pants or skirt. Have fun with it! I sometimes ask what would Vivienne Westwood do? Don’t fear aesthetic mixing cause hats can be magical and you’ll see it all click when you got it where you servin and are comfortable.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "lumenphosphor",
                            "body": "Oooh I'm going to take a look at anthro and & other stories for that janessa leone dupe thanks so much!! I kind of liked the blinders vibe myself (?? I knoww but it vibes when I try to do all black outfits in the summer and look a little spooky a la [2014](https://imgur.com/a/i1lZU) lol) so I'm on the hunt for it.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mrdu_mbee",
            "body": "https://preview.redd.it/5ka1hvmz571d1.jpeg?width=960&format=pjpg&auto=webp&s=d77c2dc25081fcfcc807895ca4afa1c5f735f63a\n\nI just can’t get over this hat…my favorite!! Although my go to are baseball caps",
            "score": 8
        },
        {
            "depth": 0,
            "author": "LilyMarie90",
            "body": "I have two hats for summer. An olive green H&M baseball cap that's made from like a satiny fabric so it looks a *little* bit nicer than your average baseball cap, it literally goes with everything and I feel hella cool in it lol. Keeps the harsh midday sun away from your face nicely.\n\nAnd a classic straw sunhat with a wide floppy brim, also H&M. That one definitely keeps the sun away from all sides and looks cute as hell with a sundress and sneakers/sandals/wedges etc. Toned down with jeans and T-shirt.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "all_style_adventures",
            "body": "https://preview.redd.it/o3dw8x1t351d1.jpeg?width=3024&format=pjpg&auto=webp&s=dc7a0240259285be5e3b8cd6f9ec9eac1b3c6267\n\nMy go to hat is an old beat-up black felt hat that my mother embroidered flowers on to. I also have a tan felt hat with a small brim, similar to [this one](https://www.citybeach.com/au/lucid-mendes-felt-hat/20350307-01.html). My next hat purchase will probably be an [Akubra](https://akubra.com.au/products/traveller-fern), I love the fern colour because it feels a bit more formal than a light coloured hat, but I didn’t want to drop the coin on an expensive hat until I was in the habit of actually wearing one regularly. For baseball caps, I like “ponytail” style caps because they allow me to wear my signature high bun, but if I’m in the sun too much wearing one I find my cheeks don’t get enough protection.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "gchimmel",
            "body": "I also felt unnatural and like I was wearing a costume when wearing hats, but eventually got used to wearing them. I think starting out with something neutral that can go with just about anything (black baseball cap, straw wide-ish brim hat) can help ease get over that hurdle of feeling too costumey. \n\nI love my [green Stetson explorer](https://stetson.com/products/explorer-outdoor-hat-loden-mix). I wear a lot of black and grey neutrals so the green is a nice pop of color. If I'm feeling particularly summery I'll wear a straw Panama hat, but I don't wear it as often since I'm afraid of getting it wet.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "That Stetson is great! I really like the brim on that. You think “Stetson” and have a very particular image in mind. I didn’t realize they have so many more options. Thanks for the idea!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "AskMrScience",
            "body": "I’ve found my “packable” straw fedora to be super versatile. It dresses up or down, folds in half to fit into a bag or suitcase, and it looks good on men, too, when I need to loan someone a hat. \n\nhttps://bananarepublicfactory.gapfactory.com/browse/product.do?pid=887937011",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "That’s a good looking hat! Love both color ways. It’s subtle enough that it compliments an outfit instead of fighting for center stage. This is a great reco, thank you!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "bittybro",
            "body": "I bought a linen baseball cap from Anthro last year and have found it very very versatile with all my casual outfits. I'm not sure [this one is the exact one](https://www.anthropologie.com/shop/san-diego-hat-co-linen-baseball-cap?category=hats-gloves&color=098&type=STANDARD&size=One%20Size&quantity=1) but if not, it's similar.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Eatcheez-petdogz",
            "body": "Highly highly recommend a sun hat with an upturned brim. Gives you great protection without impeding your field of vision. Mine is a tj maxx find, but I gifted a friend [this one](https://www.llbean.com/llb/shop/122417?productId=1727700&attrValue_0=Natural&sku=1000084254&pla1=0&qs=3155268&gad_source=1&gclid=CjwKCAjwo6GyBhBwEiwAzQTmc0Gk0Wy23bmO80qFN7UokZ2p46EA8O8whX2nxBb0WNtinR09RDcMyhoCYEsQAvD_BwE&gclsrc=aw.ds) and she loves it.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "New petition for all sites: show every hat on a model!! \n\nGreat tip about an upturned brim, I am so weird about things on my head, from sunglasses to hats. I hate when my field of vision feels different. As I build my hat wardrobe I will keep this feature in mind!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "80aprocryphal",
            "body": "I wear a hat almost everyday, though the style is dependent on the season, & I've just come to accept that they tend to pull your outfit in a particular direction & you've gotta lean into whatever vibe they're giving.  I just swapped to my sunhats this month, & I'd say the trick of it is finding a shape that works for you & then building out from there.  \nFor sunhats, if you're not looking to spend a ton & don't want something that leans too dramatic, I've had luck at TJMaxx & Kohl's but department stores in general are usually worth a look- they're not super popular so they're usually on sale right after the start of the season.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "That’s a good way to phrase it; a hat is an added element that affects the overall outfit. Got to accept it and lean in! Hoping to find my preferred shape soon… Thanks for the tip re: sales!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "hundredpercentdatb",
            "body": "Everlane versions of the plain white (or ecru) I tend to wear to the point of replacement (I’m on my third).  I used to love wearing a Yankees hat but I no longer live in NYC and some people have strong feelings about that, my favorite yankee hats are grey and khaki.  I also have a full blown hat box and love a derby day party, I might actually have more hats than shoes (counting shoes as pairs).  I love a wide brim, a wire brim but I live in a breezy Oceanside city so big hats go flying away, damn I need to plan a non-breezy vacation just for all the hats.  \n\nI also like nature themed baseball caps, a bird, a national park, gnomes.  Have a couple floral ones but the plain ones are easier to wear without having too much going on.  In baseballs alternate between having my hair down, basic ponytail or if I’m trying to elevate a plant white hat baseball hat I do a twist with a long gold clip across the back in the “pony hole” it holds the hat in place.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "I love the image you painted of a plain white baseball cap with the twist and the gold clip. My hair is long enough to try that! Everlane is great, didn’t think of that brand for hats — I’ll take a look. :)\n\nYour collection of hats sounds very unique, and very cool. I’d get a kick out of seeing a baseball cap with gnomes on it!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hundredpercentdatb",
                            "body": "Thanks. The gold clips are elegant I get lots of compliments I had a really nice one from ficcari (I think) but now I just get dupes on Amazon. I wear twists allot in the fall/winter I’m so glad clips are back, I’m extra the ponytail out the back is too basic for me.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "teenprez",
            "body": "Rachel Comey has a very cute fisherman hat but with a Huuuuuuuge brim that I love! https://rachelcomey.com/products/fisherman-hat",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "This is a very serious hat. Futuristic, too. I like it because it is clear in its purpose: it’s here to cover you. Thoroughly. Also reversible?!\n\nUghhh I respect the design and no shade to the price… but I just can’t spend it. I want to though!!",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "teenprez",
                            "body": "Yes, reversible! No longer available on her website, but if you can find Rachel Comey's \"baseball hat\" somewhere else or used, it also has a very cool extended brim and is a little easier for everyday wear.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "artfartspaulblart",
                    "body": "That's a cool design. You can wear it with the longer side of the brim in front or back. I really like the citrine color.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "sexysmoothfig",
            "body": "I love berets and newsboy caps when I'm going for a more twee/vintage-inspired look   \nI also enjoy a good oversized beanie \n\nI typically associate bucket hats with looser, streetwear-inspired fits, whereas woven hats may be good for a breezy warm weather outfit, and likewise with baseball caps for most casualwear",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "I love that your avatar is wearing a hat!\n\nI’m realizing I actually already own a lot of hats, it’s a) feeling comfortable wearing them out and about and b) feeling like they are adding to v. competing with my outfit that I’m struggling with. \n\nMy woven hats look very vacation-y to me. Or maybe I just associate them with vacation? I’ve got some decent baseball caps on hand but none are what I’d call good quality. There’s always something a little off about them that keeps me from thinking they’re a perfect hat.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lumenphosphor",
                            "body": "Is it discomfort from wearing something that's new for you? (A lot of people can feel uncomfortable changing their style, that's normal (normal enough that I wrote a guide on here[ 5 years ago](https://www.reddit.com/r/femalefashionadvice/comments/dg3vgn/changing_your_style_and_keeping_calm/) (oof) that I notice I get tagged in the shares of still lol).) \n\nOr do you feel like the hat doesn't work with your outfit/face/coloring? \n\nThe solution for the second is very different from the first, and I'd say you might need to try on a bunch of different hats to figure out what works for you and what doesn't work for you and get rid of the ones that don't work!",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "sexysmoothfig",
                            "body": "Haha ironically enough, I don't wear headwear as often as I'd like \n\nConsidering most woven hats are neutrals, it doesn't seem like they'd compete for attention, especially if it's appropriate for the occasion. As long as it's not a large fruit hat, I think you may be overthinking it! Not sure what your stance is for hats indoors, but getting used to wearing them at home (akin to how someone may warm up to an outfit by wearing it indoors) may help.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "kunoichi1907",
            "body": "Solbari wide brim hat, I have the linen version. Australian brand specializing in sun protection clothing.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "I’ve got this in Cream! I use it at home for gardening but haven’t worn it “out” because it feels so “sun protection” to me instead of naturally part of an outfit. Maybe a different color would address my hang up.\n\nGreat reco, bc it is well-made and breathable. Hot tip, Anthropologie sells this line at a markup, so don’t fall in that trap, whomever else reads this.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kunoichi1907",
                            "body": "Fair enough, my personal style is more casual. I bought it directly from Solbari website, arrived from Australia to Sweden in 2 days, no customs duties or tax.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Polishment",
                                    "body": "I think it’s on me for relegating it to “garden only” in my mind. I’ll take it out into the real world and see how I feel!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "kunoichi1907",
                                            "body": "I noticed they have the linen one and some other material, both in wide brim...the other material looks a bit more stylish I think.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Inner_Injury2940",
            "body": "Goorin used to make fabulous hats and I’ve bought probably 10 in the past 15 years. \n\nThey mostly make and promote The Farm crap now, but their straw hats are well made and stylish. \n\nIf there is a store where you live check it out.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "chocolatepotatochips",
            "body": "I bought a Jacquemus baseball cap a couple years ago and wear it often. I love that it comes in multiple sizes for those of us who have larger heads! The one I got is an ecru color with a very subtle logo on the side, and it's a perfect neutral that matches a lot of outfits and keeps my head cool in the sun.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "[Oooh like this?](https://www.neimanmarcus.com/p/jacquemus-la-casquette-logo-baseball-hat-prod268490078) This looks chic. Love it.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chocolatepotatochips",
                            "body": "Yes! I love that hat! I remember I bought it from a site that had a promo code at the time, too.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Polishment",
                                    "body": "A promo code you say. And Memorial Day right around the corner… The hunt begins!",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "pigbutttturbo",
            "body": "https://preview.redd.it/qab8mynu981d1.jpeg?width=3024&format=pjpg&auto=webp&s=018e4be61ff394180bfe01eb8fddb004490fad9e\n\nJust got this from target yesterday",
            "score": 3
        },
        {
            "depth": 0,
            "author": "criesforever",
            "body": "hats are trendy, don't worry! i wear either a denim colored dad cap or a wide brim looser weave straw hat. both seem to  fit easily with most of my slightly sporty but also feminine style. i personally think wearing a baby tee, relaxed jeans, platforms or wedges, and literally any kind of hat (bucket, cowgirl, etc) looks so put together and breezy. accessories like hats are a fashion hack,imo. plus hats are great for me personally bc i like to drive with my windows down so my insane highway side bangs need to be tucked away.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "InSeine4Paris",
            "body": "https://preview.redd.it/hfaju425w51d1.jpeg?width=3656&format=pjpg&auto=webp&s=860dd176db63df74fd9809e62ce10acbce346e3c",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "InSeine4Paris",
                    "body": "After watching Rebecca Ferguson in Doctor Sleep, l was so obsessed with her hat that l HAD TO have one. So l found a very similar one on Etsy and bought it. I gave the seller my head measurements but it was slightly too small so l had to purchase a hat stretcher.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BigPinkPanther",
                            "body": "I believe this is a Western Top Hat.  I also had to purchase one after seeing it on the show Hell On Wheels.  Such a great hat!",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "InSeine4Paris",
                                    "body": "Where did you buy yours? I had a difficult time finding one.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BigPinkPanther",
                                            "body": "I contacted the show to find out where hers came from and they referred me to a custom hat shop that was expensive!  So we were shopping in a small town touristy leather shop and I found a moss green leather one.  It was luck.  \n\nI just looked on Etsy and they are calling them short top hats or some are steampunk top hats, low or short top hats.  I would love to see what you come up with!",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "oybiva",
            "body": "Every spring I go to Costco, Target, Sierra Trading Post, Marshals, and other sporting goods stores to look for a hat that fits my face shape. I always end up with some kind of wide brim straw hat.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "GardenGood2Grow",
            "body": "Tilley hats are the best. Baseball cap = skin cancer on your neck and ears.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "umbri_elle",
            "body": "I live for my sun hats. Adding a ribbon or fabric strip around them in a color that pulls your outfit together, or even adding fabric or silk flowers. I have fabric flowers in probably three dozens colors and designs to complement every summer outfit.\n\nBut 100% it took me awhile to learn to wear hats instead of hats wearing me. Ultimately they become such a signature though. I have an entire closet full and if I'm not wearing one, people ask.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Lacie_Starling",
            "body": "https://www.walmart.com/ip/Americana-Bass-Fish-Straw-Lifeguard-Sun-Hat-with-Adjustable-Chin-Strap-Blue-Tropics-by-Way-To-Celebrate/5144555422  for the sun protection and the price.  Keep the strap on so you don't lose it in the wind.  It's not super fashionable but it will keep you from cooking in the sun.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "catgurl_poobutt",
            "body": "[New West Hats](https://www.newwesthats.com/) are gorgeous and handmade. I invested in one in 2019 and it’s my go to year round.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "These are so pretty! They’re doing some creative color combos and patterns. Ode to the Cosmos is my favorite; wouldn’t match a lot but what a piece. \n\nOut of my budget for my new hat wardrobe but if I get used to hats and successfully integrate them into my day to day, a New West hat would be a beautiful treat.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "InSeine4Paris",
            "body": "https://preview.redd.it/2kai5dnex71d1.jpeg?width=4316&format=pjpg&auto=webp&s=003cf73aeef89796fce8d5e8afd94e036163fe46\n\nFrom the Etsy shop store.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "fleaspan",
            "body": "Don't have a pic but bought a terrific white panama hat last summer from Borges & Scott and loved it: https://borgesandscott.com/en-us/collections/ladies-panamas-new. Works for casual, garden parties, summer soirees, etc.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Polishment",
                    "body": "Never heard of this brand before, thanks for getting them on my radar!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "uniquelyruth",
            "body": "I love hats, and I love bright colors.  I have a purple hat, a green one with bright multicolor ribbon around the brim, red ones, etc.  I just bought 2 crochet sun hats from San Diego hat company.  Currently they are white.  I will use fabric dye to paint them.  One will be bright yellow, not sure on the other one yet.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "LavenderWatermelon02",
            "body": "Adidas bucket hats are always trendy! I usually find them in Marshalls in cute pastel colors",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Virimuus",
            "body": "i js LOVE LOVE LOVE bucket hats 😭 i never wear them personally cud i only have one + it goes w solely one outfit but they are the best things in the history of ever",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PaulaLoomisArt",
            "body": "Years ago I got a floral satin baseball cap and I find that one suits quite nicely and doesn’t feel like a costume. A baseball cap doesn’t have as much coverage as an actual sun hat though.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "lucky7355",
            "body": "I get compliments on this a lot and love the wider brim: Women Straw Sun Visor Hat Wide... https://www.amazon.com/dp/B08VGM241R?ref=ppx_pop_mob_ap_share",
            "score": 1
        },
        {
            "depth": 0,
            "author": "imissmaplestory",
            "body": "A bit pricey, but I am in love w the Lack of Color Inca hat. A slightly more modern silhouette than the traditional straw hats! [link](https://www.bloomingdales.com/shop/product/lack-of-color-inca-bucket-hat?ID=5045607&pla_country=US&cm_mmc=Google-PLA-ADC-_-GS_Local+Only-_-All+Products-_-889791241874-_-go_cmp-325403191_adg-23120909431_ad-80153669791_aud-359644286302:pla-296731747429_dev-m_ext-_prd-889791241874&gad_source=1&gbraid=0AAAAAD0PCJTtXTnAP0Ss0eyIZPm6ShvF7&gclid=Cj0KCQjwxqayBhDFARIsAANWRnQ4KwW1bHg7Z6XokCtZuXxc6Z-XmZc1NiqBSgHNHTGrF4iop6ao5d4aAnHrEALw_wcB)",
            "score": 1
        }
    ]
}