{
    "title": "Favorite Office Clothes for Hellishly Hot Weather?",
    "comments": [
        {
            "depth": 0,
            "author": "forvanityssake",
            "body": "My go-to is a breezy short-sleeved midi dress, preferably in cotton or linen, worn with D’Orsay style flats. My office is usually freezing year round, so I’ll also bring a light sweater (or just use my space heater lol)",
            "score": 288,
            "replies": [
                {
                    "depth": 1,
                    "author": "rara1992",
                    "body": "Where do you find midi dresses with short sleeves that are somewhat professional? All I can find are sleeveless ones or if they have sleeves they’re super flowery and patterned",
                    "score": 89,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "forvanityssake",
                            "body": "I have a pinstriped light blue and white one from J Crew Factory that I really like. Otherwise, I shop around in a bunch of places, usually J Crew, Few Moda, or Target. I like small floral prints so that doesn’t usually bother me",
                            "score": 36
                        },
                        {
                            "depth": 2,
                            "author": "Elisa_LaViudaNegra",
                            "body": "Target has some linen-blend ones still in stock, I think. Mostly solid colors, one is an off-white with black vertical stripes.",
                            "score": 22
                        },
                        {
                            "depth": 2,
                            "author": "ltmp",
                            "body": "Quince has linen short sleeved midi dresses with collars",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Wrong-Shoe2918",
                                    "body": "Linen will wrinkle so badly and look unprofessional if she has a job that involves a lot of sitting",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ltmp",
                                            "body": "She said semi-professional, so I’m assuming business casual which lends itself to more casual fabrics. I also own a few of their linen pieces and it does not wrinkle as much as you’d think.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Wrong-Shoe2918",
                                                    "body": "As do I, we must own different pieces. My jumpsuit doesn’t wrinkle much but my shirts and shirt do pretty badly. I’ve had all for a year so they’ve had plenty of washes and steams. There’s some improvement over time but might have to do with the color. The lighter the color the more wrinkles in my case. And the longer I sit the bigger the crease lol so I don’t wear them on long drives",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "rara1992",
                                    "body": "Oh I actually do have the Quince one and really like it! I have navy blue, it’s not too bad at the end of the day if I start the day by actually ironing/steaming it lol",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "herefromthere",
                            "body": "I have a couple of solid coloured linen wrap dresses with short sleeves from Son de Flor. I always get compliments in Summer. That and a sun hat and closed toe shoes is my hot weather staple no.1. \n\nno.2 is a linen midi skirt from a shop on Etsy called Laurel Lodge in Ireland. They're amazing, barely crease at all. Only criticism is that the zips are a bit rubbish because they're invisible and always go at the waistband. That and a recycled sari silk wrap top of a plainer design (nearly solid or uniform small ditzy print) of the type you can buy online with dramatic sleeves, only I get the sleeves altered so they are more sensible.\n\nI've had some odd looks carrying a parasol in the UK, but it really is a very good practical way of keeping the sun off and staying cool.",
                            "score": 38
                        },
                        {
                            "depth": 2,
                            "author": "thymeisfleeting",
                            "body": "Have you tried Boden?",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rara1992",
                                    "body": "Is Boden US sizing? I’m never sure what size to get there, I’m a size 12 in other brands (BR, for example)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thymeisfleeting",
                                            "body": "I don’t know, sorry, I’m in the UK so it’s just UK sizing here, not sure if they shift it across. \n\nI have the same problem with ordering from J Crew over here.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "queenatstormsend",
                                            "body": "If you shop on the US Boden storefront, the sizing is American.  I find it runs smaller than US brands, though (more TTS).",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "serenephoton",
                            "body": "You can also try ThredUp (online thrift) which you can filter in and out any cuts/styles/patterns!",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "the_pleiades",
                            "body": "Try Uniqlo (tho they don’t always have them!).",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "lalafish",
                            "body": "I love Muji for this kind of dress!",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rara1992",
                                    "body": "Ah! Love muji but have not tried out their clothes yet, thanks!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Tacos-and-Wine",
                    "body": "I love d’orsay style sandals 👌",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "3littlekittens",
            "body": "J. Crew factory has been having great all cotton or linen pants, dresses & skirts.  Lighter weight fabrics make a huge difference, with a cardigan or cute jacket for the AC.",
            "score": 147,
            "replies": [
                {
                    "depth": 1,
                    "author": "livthelove",
                    "body": "Ooo I will have to check that out! I’m more of a pants person, but traditional work pants can be so hot!",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "3littlekittens",
                            "body": "I got some black linen pants there last year that I lived in all summer- hoping for more colors this year. Also want to mention mesh material flats- I don’t know what you call them.  Sketchers and other brands make plain, ballet flats that are really cooler to wear, even with nylon no show liner socks.  I have some by Fitflop that have great arch support and are good for walking.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cafrann94",
                                    "body": "What kind of top do you usually wear with your linen pants to work?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "3littlekittens",
                                            "body": "Linen tops look too messy on me after they wrinkle.  I need petite length and have several Lands End button up cotton shirts in fun prints. Also uniqlo t shirts or tanks-  they are plain and good with a jacket.  I also wear split neck tops in different brands from Macys or Amazon or anywhere I can get petite length.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Blossom73",
                                                    "body": "I love Lands' End. Loft and Talbots also have good work appropriate petite tops.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rkgk13",
                    "body": "I own many of their cotton gauze items. They do not wrinkle as fast as linen and they feel nice. Big fan.",
                    "score": 13
                }
            ]
        },
        {
            "depth": 0,
            "author": "chiono_graphis",
            "body": "Oversized cotton poplin shirt dresses. Stiffer fabric in boxy styles keep as little fabric as possible from touching the bod= better air circulation. Less beachy looking than linen. When walking outside use a parasol, seriously it makes such a difference. \n\nWhere I live people don't use much AC generally, to the point indoor spaces are also sticky. But you could carry a light cardigan if you need. \n\nJust gotta do what you can for the dread, it will look different for everyone. One thing I've done is quit use of a clothes dryer, been five years now without one and never looked back! Clothes stay looking nice longer and it's better for the environment.",
            "score": 51
        },
        {
            "depth": 0,
            "author": "Amagciannamedgob",
            "body": "Snag some linen blend suit sets from UNIQLO! I got an adorable minty green suit, Im hoping the linen blend is cooling like linen is supposed to be. Its held up for the warmer spring weather, I guess time will tell when it gets to 100",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "livthelove",
                    "body": "Oh i hadn’t thought to check out Uniqlo - good call on the linen blend suits!",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "mjk25741",
                    "body": "Do you know what the name of it is called? I'm trying to find a set but don't see any, unless they are listed separately? I've never ordered from here before!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Amagciannamedgob",
                            "body": "For sure!! Idk why they sell them as separates, but see the links below:\n\nLinen-Blend Pleated Tapered Pants https://www.uniqlo.com/us/en/products/E470937-000/00?colorDisplayCode=09&sizeDisplayCode=003&pldDisplayCode=000&utm_medium=social&utm_source=appshare\n\nLinen-Blend Jacket https://www.uniqlo.com/us/en/products/E471028-000/00?colorDisplayCode=51&sizeDisplayCode=004&pldDisplayCode=000&utm_medium=social&utm_source=appshare",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mjk25741",
                                    "body": "Thank you 😊",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Amagciannamedgob",
                                            "body": "Update; I wore my suit today, with bike-shorts style underwear from Aerie and a linen blend tshirt from Gap Factory. 83 degrees in NYC and I felt nice and breezy, very little sweat so far",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "argunaw",
            "body": "Banana Republic Factory is having a pretty big sale right now and they have a ton of linen work wear. LOFT also has some nice work dresses and outfits that I wear in the summer. I also always keep a cardigan at my desk to put over my legs if I feel cold in the office.\n\nI second the other comments about cotton dresses; my polyester dresses get awful and gross in the heat but my cotton ones eventually dried.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "Victra_B",
                    "body": "I second banana republic factory - most of my recent work clothing purchases are from them.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "local_fartist",
            "body": "Linen forever. Lots of used linen on ebay that looks nice. Linen shift dresses for the worst days. Sweat wicking underwear. (my favorite brand is Boody).\n\nIf I have to be outside for an extended period of time outside of work I wear a long sleeve fishing shirt, hat and sweat-wicking shorts. \n\nre: existential dread, I try to do one thing to help as either a job or volunteer work and be generally green/minimalist and beyond that I try not to think about it because the scope of the problem is beyond my comprehension or control.\n\nedit: we’ve been having a warm spring in SC so I’ve been wearing linen pants with a tank top and bringing a button down for chilly offices. I like wearing sneakers over sandals personally. I still feel cozy in the office wearing the long pants and button down. \n\nMy go-to summer work outfit would be a sleeveless, v-neck linen dress from Madewell, a chambray long sleeve button down, and a pair of nice sneakers. However the last thing I bought by Madewell I saw a significant drop in quality, which is a bummer.",
            "score": 66,
            "replies": [
                {
                    "depth": 1,
                    "author": "livthelove",
                    "body": "Linen shift dresses sound like a great idea! Definitely need to invest in more linen this year",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "local_fartist",
                            "body": "Someone else mentioned Banana Republic and I really like this season for linen. I’m trying to shop secondhand and that’s difficult because I’m pretty tall but there is already BR tall on ebay and I have a pair of olive pleated linen pants on the way 🤞🏻 hoping they fit.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "paxenb",
            "body": "I've never worked in an office that was freezing like everyone says it is, so it's definitely a me thing. That said, single layer cotton dresses and sandals are my uniform. T-shirt dresses are great too because essentially you're wearing a nightshirt, but you can make it professional with a bunch of accessories.",
            "score": 18
        },
        {
            "depth": 0,
            "author": "sawdust-arrangement",
            "body": "Before switching to WFH, I handled this by wearing a tshirt to the office and then putting on a winter sweater over it as soon as I got inside, or within a few minutes once I had cooled down and started freezing. I run COLD and am shocked by how much use I've gotten out of my sweaters in Texas.  \n\n\n When I took the bus, I would wear a UPF button-up over my shirt and swap it for the sweater at the office. I just accepted the sweat on the walk to and from the bus, plus the UPF shirt also helped reduce the intensity of the bus air conditioning. 🫠 \n\n\n I think it's important to know how you respond to different temperatures personally and also whether your climate is hot and humid or just hot. For me the main issue on my commute was the intensity of the sun, especially since I burn very easily, which is why the UPF shirt worked. If it had also been humid, I would have needed much breezier/looser clothes to not drown in sweat.\n\n\nI don't understand how people can wear summer dresses to the office here! I would be so cold and miserable with nothing on my legs. Some people do it though. Outside of the office, my trick for not freezing inside when I wear shorts is to wear shoes with socks, not sandals, so maybe that could help make dresses tolerable indoors too. ",
            "score": 55,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gypsybootz",
                    "body": "Always keep a big thick oversized cardigan in my office. (My fugly sweater) also I sneaked a little portable heater under my desk for those extra hot days when the A/C is turned down to 50 (or so it seems)",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "whatinthewhattttt",
                    "body": "Am i the only one who doesn’t know what UPF means",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sawdust-arrangement",
                            "body": "UPF means Ultraviolet Protection Factor. It means the fabric has extra sun protection. \n\n[https://www.skincancer.org/skin-cancer-prevention/sun-protection/sun-protective-clothing](https://www.skincancer.org/skin-cancer-prevention/sun-protection/sun-protective-clothing)",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pjrnoc",
                    "body": "Upf",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BelleRose2542",
            "body": "Maxi dress! In office I can wrap the skirt around my legs if cold (plus I have my desk cardigan and blanket). My office is right above the warehouse where forklifts are entering/exiting the freezer all day, so it stays a pretty constant <60 degrees year-round.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "maryplethora",
            "body": "The summer I had this problem the most, I straight up started wearing workout gear to walk to work and brought something to change into in the bathroom when I arrived. I did it all the time with shoes anyway, but extending it to the rest of my outfit was life changing!",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Smart-Stop4074",
                    "body": "Did you feel weird walking by your coworkers to the bathroom in your gym clothes when you first got there?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "maryplethora",
                            "body": "We had a bathroom in the lobby of our building, so I just used that one and changed before actually going into the office ",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bad_Wolf212227",
            "body": "I am all about layers, I am an HR Supervisor and usually wear pants, blouse and blazer. I lost some weight recently and got rid of all my polyster blouses. Most of my tops now are some type of cotton/linen mix.  I also keep a sweatshirt when it's -10 and the blazer isn't cutting it (but I can only wear in my office, I take it off when I have to step out).\n\nI also like these gauze long sleeve shirts at J.Crew Factory , which I can't currently link for some reason, but they are easy to find on their website.\n\nYou can roll up the sleeves or wear a t-shirt underneath so it's also good for layering. I am wearing one right now and it's keeping me somewhat warm in my office, which is (feels like temp) 20 degrees.\n\nI've noticed Old Navy has shirts and pants in the same material, along with Gap and Banana Republic. I want to get a short sleeve shirt in this just to try.\n\nFor shoes I wear white sneakers on Fridays with jeans and business casul blouse and blazer or cardigan. Other days of the week I wear sandals mostly, and I just got some Vionic black wedges which go with my black pants and look somewhat professional.\n\nI keep deodrant and body wipes in my desk if I have to go out for lunch or a meeting so I am not all gross smelling when I come back.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "kgcatlin",
                    "body": "I LOVE those gauze shirts from J. Crew Factory. I have 2 already and am thinking of getting at least one other color.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "whysweetpea",
            "body": "I have a bunch of dresses that are basically 2 wide rectangles sewn together. With Birkenstocks or ballet flats.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "WishIWasThatClever",
            "body": "If I had to walk to work, I’d hang one of those personal fans that look like headphones around my neck.  <$30 on Amazon and rechargeable. It’s not much but even a little bit of warm air movement helps keep the face and neck dry so makeup won’t run and hair will melt less.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "ikbentwee",
            "body": "Ugh all the linen or cotton dresses I'm finding are always beige or olive green and look like some crunchy hippies used a potato sack pattern.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "stolen-kisses",
                    "body": "I'm not sure if [this brand](https://www.sans-sans.com.sg/product-category/women/dress-one-piece/) ships to where to you live, but I love the cuts and colours of their dresses.",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "HalpWithMyPaper",
            "body": "A sweater and warm pants, because the AC is set to 60!",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "floracalendula",
                    "body": "this is the way [weeps in \"has to wear cashmere in 88-deg weather because it's that or freeze\"]",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "muffingr1",
            "body": "I do wide leg trousers or culottes in a linen blend, short sleeved poplin button up, a light cardigan or crepe blazer, and sneakers.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "graeceless",
            "body": "Good timing, I just dug out my linen pants yesterday. They're from Old Navy and slightly cropped and wide legged, but have a real waistband and belt so they still look presentable. Old Navy has a Linen section on their website right now that I recommend checking out. \n\nI'm also experimenting with more \"formal\" athleisure pants, if that makes sense (i.e. not joggers or leggings but still in that stretchy sweat-wicking material.) Old Navy and Athleta have some good options here. Good luck and stay cool out there!",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Tacos-and-Wine",
            "body": "I am 100% filled with that existential dread and fret over my garden 😅 \n\nI wear breathable clothes and fabrics that don’t show sweat (yes that’s often black, but with the right material it’s ok for me) or wrinkle easily. Today it’s over 100 heat index and I wore black stretch capri pants and a sleeveless black mock turtleneck that’s super thin fabric and I have a jacket in case I need to look more professional/it’s freezing in the office/ or someone’s coming in and I need to hide my tats. Heeled sandals, nice accessories, loose bun or ponytail.\n\nI’ll wear long loose dresses that I can accessorize with a belt and light jacket but the minute I’m out of the office I can shed some shit and be even more comfortable",
            "score": 11
        },
        {
            "depth": 0,
            "author": "jesusismyhomeboy77",
            "body": "Smock dresses. Wore one today. They are breezy but professional",
            "score": 6
        },
        {
            "depth": 0,
            "author": "ttururu",
            "body": "I'm in TX and had to go back to the office half time starting this January. I've been dreading the summer months haha  \n  \nI don't really wear pants, so I'm sticking mostly to a-line skirts/dresses, primarily cotton, for maximum air flow. Pinafore dresses are a current fave of mine since I can pair with a bunch of different blouses and create lots of outfits easily. I opt for blouses with loose sleeves, fabric is cotton, linen, or silk. The office can get chilly though, so depending on the outfit, I sometimes layer a thin sleeveless cotton turtleneck underneath my blouse/dress. The cotton layer provides a bit of warmth indoors, but also acts as a protective layer for my outer blouse if I have to go outside and sweat a bit.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "cassismure",
                    "body": "Where do you find your pinafore dresses?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ttururu",
                            "body": "I got most of mine on eBay tbh! Pinafore dresses are kinda hard to find, so I scour eBay/ooshmark/depop for past season or vintage ones. A bit of a risk with measurements, but the ones I look for aren’t really fitted, so there’s some wiggle room.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "seekyapus",
                    "body": "Do you wear hosiery with your skirts and dresses when its hotter, and what kind if so to keep you comfortable?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ttururu",
                            "body": "I do wear tights pretty regularly! My staple color is brown, sometimes beige. At the very least, probably stay away from black as it’ll feel hotter. \n\nMy most used tights are actually a pair from targets brand (new day or something?). They’re standard nylon/spandex, but I find them very comfortable! I usually wear 50 denier all year round, thick enough for winter, thin enough for summer, and durable enough that I don’t have to be careful with it. I do wear 20 denier sometimes when it’s super hot, but I somehow always tear these so they never last more than one summer 😂 but my 50D pair has lasted 3 years so far",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Puzzleheaded-Sun3107",
            "body": "Tank dresses for me but high neck (not a mock neck), shirt dresses, picnic dresses, button up shirt and skirts, t shirts and skirts. On 🦈  days palazzo pants (those skirt looking trousers)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "ladyjaina0000",
            "body": "Silk modest-neckline tops and linen wrap skirts.\nLinen button down dresses with a silk slip\n\nAnd this may not fly at every place but I've been living in birks and sandals bc I can't stand if my feet are hot.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "leaves-green",
            "body": "A shift dress or swing dress with sandals and a long cardigan for the office.  The dress/long cardigan combo is so cute!  I usually like a dress that's just a bit longer than the cardigan.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "jwash1894",
            "body": "Flowy linen dresses or other  breathable fabric clothing like cotton. Dresses or flowy skirts are your besties for weather like that.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "matatora",
            "body": "Seersucker is brilliant for hot and humid environments, and as bonus if someone decides to freeze you at work it does well there too. Linen is also nice, but it wrinkles.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "PuzzledPaint8915",
            "body": "Any sensory friendly recommendations? I want to love linen but it’s so itchy my ADHD brain can’t handle it.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "stolen-kisses",
                    "body": "I live in the tropics and I have sensory issues with linen, 100% polyester, and tight-fitting clothes. My to-go fabrics are 100% cotton, soft cotton-silk blends, or knitted fabrics in a loose, kaftan cut.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "livthelove",
                    "body": "Soft cotton or some linen blends can be a lot better feeling! I’m with you that linen can be tough to wear. I also don’t like how wrinkly it can get",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "StolenPens",
            "body": "Capris or high ankle pants and ballet flats with an insole to absorb excess sweat. Wear a nice sleeveless top and carry a cardigan to cover once inside. \nKeep an emergency poncho on your chair at your desk, if that's an option, choose a nice neutral gray. It can double as a lap blanket or turn into a full-on poncho.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "chacheeliya",
            "body": "I walk a mile to and from work, and I like to walk a mile during my lunch break to break up my day and get out of the office. I live in the southern US, where it's not only murderous hot but humid as all hell in the summer. \n\nMy dress code is business casual, more to the side of casual. I wear linen or cotton/linen blend pants from Abercrombie and a sleeveless cotton shirt from Gap tucked in. I use a leather belt to bring it all together. It's presentable, cheap (I refuse to allocate much of my fashion budget for work clothes), and I can switch out the top for something else for a cute after work look.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "SpiceGirls4Everr",
                    "body": "having lived in the south - I commend you for walking to and from work and during the day. that is intense!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sugarsesame",
            "body": "My office is pretty casual so this may not be for everyone but I have several Athleta skorts that I pair with nicer, flowy tank. The tanks are mostly from Banana Republic Factory and Eddie Bauer. I throw a cardigan in my backpack for the inevitable air conditioning in my building.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "AmexNomad",
            "body": "Linen is your friend- Loosely fitting",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Khayeth",
            "body": "I enjoy riding my bike to work and changing once I get there. If I leave early enough I can nip into the locker room and shower. But on car commuting days, trousers that look nice when rolled up to the knee (long trousers only at my work for safety requirements) and a tank under a collared shirt to convert to sleeveless mode easily. Or just commute in shorts and change onsite.\n\nFor warmth if needed I keep a sweater at work. In an emergency I could use a PPE shirt or jacket for warmth, but our AC isn't efficient enough to require that, I'm usually roasting not freezing.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "beckalm",
            "body": "I lived in a place where it was 60-70°F on my walk to work and peaked at 115°. It was usually around 90° when I walked home. I wore skirts and shell tops. I’m of the opinion that shoulders are perfectly acceptable. I took light cardigans (RIP JP Crew Factory Clare) in case the AC was cold. At my last office job, it was hot all day in the summer and FREEZING inside. I’d usually wear a lightweight blouse and pants, and I’d have a thick sweater and space heater at my desk.\n\nDepending on your office, you may be able to get away with wearing something casual but polished for your commute and changing once you arrive. A linen coord set, for example.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "iamcrazynuts",
            "body": "Light layers, ftw. I’m not a fan of dresses so I wear cropped dress pants or loose pants with a tank or super light tee with my hair up for my commute and bring a light cardigan or blazer to go on once I get in the building. Lately I’ve been wearing a lot of those long kimono-like gauzy wraps that are just enough to mask that I may or may not be wearing a tank top. \nNordstrom Rack clear-the-racks sales are my go-to, along with the factory stores for J.Crew, Banana Republic, and Gap.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "pokerplayingdogs",
            "body": "i bought a bunch of “t-shirt” sleeveless dresses (with pockets!) from walmart, and pair them with any of my baggy cardigans to cover my shoulders. i also just bought some rolled-cuff high-rise jean lauren conrad shorts from kohl’s, though i’m younger so they show a lot of thigh (though much less than my college-era shorts do!)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "MollyTuck77",
            "body": "Mainly linen or some cotton-linen blends, though my Athleta Presidio dress (under a light cardigan) is really cute and feels great. I have a few J.Crew linen shirt dresses. A few pairs of Athlete linen pants. I've found cute linen tees at Banana Republic, Gap, Ann Taylor. I need proportionally petite sizes, so I don't have many places I can shop...there are tons more options for the average-weighted!! I keep a few light wool sweaters at my desk, and a warming blanket for my legs since we can't have space heaters, haha...I completely know how you feel.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "UtubeNoodle",
            "body": "Check athletic brands for performance style fabrics. Athleta has a lot of staple dressier slacks and button downs in favrics that are meant to be performance style (aka hot swamp ass weather friendly)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Beneficial_Exchange6",
            "body": "Love some wide leg trousers in a breathable material",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Truant_Muse",
            "body": "I have a lot of pants/trousers from Atheleta, which are made from lighter weight breathable materials. Then I usually wear a sleeveless top in a breathable fabric and bring a sweater or blazer to handle the cold in my office.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Littlewing1307",
            "body": "Silk and linen! Choosing your fabrics very wisely will help a lot. Plus looser clothes for breathing room.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "daddy_tywin",
            "body": "I keep a Chair Shirt always, which is an oversized washed cotton button down that I can keep on in the parts of the office where it’s cold. I think mine is the Everlane silky cotton shirt. \n\nOtherwise I am pretty heatproof and wear pants a lot in the summer even though it’s broiling here in the south, but I stick to lightweight natural fabrics: cotton knit, cotton weave, silk, silk jersey, poplin, linen, tencel. I get a lot of my clothes for work at Ozma, Doen, Apiece Apart, Cuyana, and Reformation.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Santiklopopop",
            "body": "# Option 1: Light and Breezy Dress\n\n* **Dress**: Choose a sleeveless or short-sleeve midi dress made from breathable fabrics like linen or cotton. Look for light colors or subtle patterns.\n* **Layer**: Bring a lightweight cardigan or blazer to combat the office air conditioning.\n* **Shoes**: Opt for open-toe sandals or low-heeled mules for comfort and ventilation.\n\n# Option 2: Chic Blouse and Skirt\n\n* **Top**: A sleeveless or short-sleeve blouse made from silk or lightweight cotton. A loose fit allows for better air circulation.\n* **Bottom**: Pair it with a high-waisted, knee-length skirt in a breathable fabric.\n* **Shoes**: Comfortable loafers or ballet flats work well for walking to work.\n\n# Option 3: Casual Elegance with Pants\n\n* **Top**: A lightweight, short-sleeve blouse or a sleeveless top in a breathable material.\n* **Bottom**: Wide-leg trousers in linen or a linen blend to keep cool while looking professional.\n* **Shoes**: Open-toe block heels or comfortable flats.\n\nhttps://preview.redd.it/v1vht34gh52d1.png?width=1024&format=png&auto=webp&s=4e23286bd7106c9b4596666cf1d72203d279271b\n\n# Outfit Details:\n\n* **Dress**: Light pastel-colored sleeveless linen midi dress, A-line cut.\n* **Layer**: Lightweight cardigan for the office.\n* **Shoes**: Comfortable open-toe sandals.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Santiklopopop",
                    "body": "# Budget: $100 - $500\n\n1. **Linen Midi Dress**: $120\n   * [Amazon Linen Dress](https://amzn.to/3KgysmF)\n2. **Silk Blouse**: $80\n   * [Amazon Silk Blouse](https://amzn.to/3KgysmF)\n3. **Wide-Leg Linen Pants**: $150\n   * [Amazon Linen Pants](https://amzn.to/3KgysmF)\n4. **Open-Toe Sandals**: $50\n   * [Amazon Sandals](https://amzn.to/3KgysmF)\n\n# Budget: $500 - $1000\n\n1. **Designer Linen Dress**: $450\n   * [Amazon Designer Dress](https://amzn.to/3KgysmF)\n2. **Luxury Silk Blouse**: $250\n   * [Amazon Luxury Blouse](https://amzn.to/3KgysmF)\n3. **Tailored Linen Pants**: $300\n   * [Amazon Tailored Pants](https://amzn.to/3KgysmF)\n4. **Designer Sandals**: $200\n   * [Amazon Designer Sandals](https://amzn.to/3KgysmF)",
                    "score": 2
                }
            ]
        }
    ]
}