{
    "title": "Daily Questions Thread May 20, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "Eastern_Grocery2907",
            "body": "https://preview.redd.it/ijbc3w40dl1d1.jpeg?width=1039&format=pjpg&auto=webp&s=5a217f53c1a24f74aed630c55c7cccbb59d9c1b8\n\nHow do I dress for hot weather as an overweight 50 year old? I'm 5'5\" and 185 lbs. I hate being hot, but like to travel. I just cannot figure out how to dress in a way that is temperature, age, and weight appropriate. Here's my latest attempt in Mexico. Bad, right? I have trip to southern California coming up and I just want to not hate every picture of myself afterwards. Any ideas?",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "While the colours are good for you, what you've done there is to cut yourself in half, visually, right at the widest part of the body. And the vertical division is so low, it makes you look shorter. For more flattery, you could try tucking the t shirt and letting it blouse a little over the waist. But whatever you do with this outfit, you are left with jersey fabric and two layers around the torso. Neither is conducive to comfort in hot weather.\n\nMy own gold standard for summer comfort is a loose fitting woven cotton dress. A [sleeveless shift](https://i.etsystatic.com/18318244/r/il/9f05ff/4464579736/il_570xN.4464579736_2n04.jpg) would work well for you. Many outdoors companies make a similar style of easy-care travel dress. If you want to cover your arms, [a shirtdress](https://www.gowholesale.co.uk/images/thumbnails/310/310/detailed/43151/IMG_7253.jpg) in a fine woven fabric would work well - just make sure the fit is loose and the fabric is thin for maximum comfort in the heat. Both of these styles visually de-emphasise the waist area and keep it cool.\n\nFor a practical outdoors activities outfit, I would pick [baggy shorts and a coordinated camp shirt](https://www.toa.st/cdn/shop/files/LTRUS15_2_720x.jpg).  This is a silhouette that prioritises comfort and looks good on nearly any size. To make these shapes more sophisticated, go for linen in neutral shades.",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Eastern_Grocery2907",
                            "body": "Thank you for this well-thought out reply. I really appreciate it. ",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "There is nothing per se wrong with your outfit, it's perfectly adequate but plain. If your shirt had a pattern or detail, it would come across better.\n\nLinen and tencel/lyocell/rayon are going to be your friends here. I live in a very hot country and the trick to surviving the heat is to wear loose-fitting, breathable clothing. Avoid petro synthetics (tencel/lyocel/rayon are cellulose semi-synthetics, not plastic) as they will make you sweat terribly. Try billowy long skirts, dresses, or wide-leg pants—keep the sun off and keep the breeze moving. Look at what people wear in hot parts of the world. Muumuus and kaftans get a bad rap, but look up traditional Hawaiian muumuus and you might change your mind. Or, go the other way and lean into the Eileen Fisher vibe with light, flowing neutrals.",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "KarateDimension",
                    "body": "Personally, I think that material counts a lot more than overall body coverage. In many of the hottest places in the world, people are covered head to toe to protect from the sun, but they use natural, breathable materials like cotton and linen to keep cool in the heat.\n\nSo if you're feeling like you want to cover up more in this stage of life but you're worried about getting too hot, look into clothes made out of cotton and linen!",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "jdijks",
                    "body": "I actually really like this outfit. But also safari shorts or Bermudas are a great option. Bermuda/capris are back in style as well as jorts I really like the patagonia baggies in a longer length as well",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "eva_paula",
            "body": "I am looking for ideas for this pleated skirt:\nWhat is the best way to wear this fairytale-inspired [pleated skirt](https://imgur.com/a/QxXMF0g)? It is handmade (not by me) and I really love the pattern and style. I tried it with a mint-greyish silk-like blouse and I didn’t like it. I tried it with a cotton tshirt and it didn’t work neither.  I found a blazer in this purple/lilac but it was too much of the same color. Any ideas considering material and colors and pattern style? I normally wear size 40/ US12, I am 51y old. Thank you!",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "jdijks",
                    "body": "This skirt is so miss frizzle coded I'd look into mod styling. I just can't see how this skirt would work with the fairytale look though.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "KarateDimension",
                    "body": "I would use the yellow from the skirt for the top. Yellow and purple are opposites on the color wheel, so they complement each other really well! If you're worried that you don't look good in yellow, you could pair with a cardigan that uses one of the other colors like green or red. Sometimes the same color in a smaller quantity or used in a different way will look better.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "fishfreeoboe",
                    "body": "Definitely go with stronger colors (including black); pastels aren't going to balance the skirt well. Red or green are my preference with this. The fabric looks silky so the idea of a blazer is a good one. Maybe a black blazer over a green or red top. I agree that it's a lot more Miss Frizzle than Fairytale.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "bubblegumdavid",
                    "body": "I totally agree with u/jdijks to lean miss frizzle and mod with this one! Look into those bright vintage styles. It is always going to seem bold and “a lot” though!\n\nI’d pick the yellow and run with that personally, but you could totally go for that pinkish color or the green (though this could read Riddler so fast lol)",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "eva_paula",
                    "body": "Sorry, I am not familiar with miss frizzle, I am from Europe, I just googled it, and yes, maybe that is a much better style description than fairytale. Mod style of the 60ies? Hmh, what kind of top pattern would match with it? \nThanks for the color suggestions, I will go for the stronger colors.  Any idea on the material? Light wool blend? The fabric of the skirt is shiny ✨. Thank you",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ulchachan",
            "body": "What short styles look flattering on short legs? I'm tall-ish (172cm) and a UK size 10-12. I feel like skirts can be flattering but shorts always seem to make my legs look so so stumpy",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": " A wide, flowing style in whatever skirt length suits you. Wear low-cut sandals rather than shoes to lengthen the leg a little.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "ClassicEssay1379",
                    "body": "I have pretty short legs (and I’m just short overall) and I think that short shorts or medium length shorts look best on me based on the mirror and pictures of myself. So, like a cross between longer bike shorts, and really short shorts.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "piedraazul",
            "body": "Hey ladies! I’m looking for a dress that checks a few different boxes, and I was hoping that the hive mind could help me. 🤗\n\nI’m (mid-30’s F) going to a wedding in the mountains of Mexico. It’s going to be hot, and it’s going to be a black tie affair. This is my “fancy“ side of the family and everyone will be dressed to the nines. \n\nKeeping in mind the hot and slightly humid weather, I also need a dress that will cover my left upper arm to my elbow. The shoulders can be exposed, but my left bicep needs to be covered. So either a one sleeve dress (that covers MY left) or something that will just hide that particular area on both sides.\n\nMoreover, I am only 5’3, about 130 pounds and busty (34 DDD). I found some off shoulder dresses that could work, but they have a ton of cleavage and that’s not going to fly around my Mexican family who I haven’t seen in 10 years. Ha ha. *Some* cleavage is totally fine. \n\nAny ideas/links appreciated!! I have dark hair and a tan complexion in the summer so I can get away with a variety of colors. I have a bunch of fun/neutral heel options between my mom and I’s shoe stashes, so no problem there. Thank you!",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "KarateDimension",
                    "body": "I'm also busty and I've had a lot of luck with BHLDN dresses. They're also pretty easy to find on the resale market. Maybe something like [this](https://www.anthropologie.com/shop/bhldn-iris-one-shoulder-cut-out-printed-chiffon-gown?category=SHOPBYBRAND&color=015&type=STANDARD&quantity=1) or [this](https://poshmark.com/listing/BHLDN-Yumi-Kim-Calypso-Dress-in-Cameo-Size-S-EUC-661c65fa0a60d5fe1be3e455) could work?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "b_xf",
                    "body": "I went to a wedding that exactly fit this description last month! Mountainous wedding in Mexico with a formal dress code, and I had tattoos to cover on my arms. I was a family member of the groom and I've never been to a formal wedding, so I was stressing. I still haven't gotten any actual photos from the wedding (🥲) but I wore [this dress and chiffon bolero thing](https://imgur.com/a/74CgBCC) and felt perfectly acceptably dressed! Both were in-store consignment finds so no brands unfortunately but it might be a silhouette that works - I had to get the dress tailored even though I'm taller than average so that might be the case for any dress you buy! ",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "hotgirlshit97",
                    "body": "[https://www.revolve.com/michael-costello-x-revolve-colette-mini-dress-in-dusty-teal/dp/MELR-WD532/?d=Womens&page=1&lc=1&vn=true&vnclk=true](https://www.revolve.com/michael-costello-x-revolve-colette-mini-dress-in-dusty-teal/dp/MELR-WD532/?d=Womens&page=1&lc=1&vn=true&vnclk=true)\n\nI feel like this would look absolutely GORGEOUS on you, albeit not sure about the cleavage part since it's a bit deep",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "piedraazul",
                            "body": "Ooh I love this! I think it’s definitely too much leg and cleavage for this particular event, but I may just order it for any other event!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "At your height and weight, I doubt that you actually have a 34\" band size... If you have a measuring tape, measure around your body under your bust to see! A properly fitting bra is probably going to make any dress fit and look better (/r/abrathatfits)",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "piedraazul",
                            "body": "Thanks, I appreciate it but I’m familiar with the subreddit and I’ve been professionally sized as well. 👍",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hvvjvk",
            "body": "I need help styling this for pride! I can't figure it out because 1. I have yellow hair 2. it's BRIGHT 3. it'll be hot where I'm at! I really wanna wear it but have no idea how lol\n*",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hvvjvk",
                    "body": "https://preview.redd.it/aaqcuo6a4l1d1.jpeg?width=2520&format=pjpg&auto=webp&s=6e9791248ae75cb04e09738192cfa7b30c2f5437",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nomarmite",
                            "body": "That is amazing! I would pair with pieces that don't compete for attention, such as jorts and tan cowboy boots. It would look great with a contrast bandana (maybe red or orange) at the neck.",
                            "score": 9
                        },
                        {
                            "depth": 2,
                            "author": "jdijks",
                            "body": "Some sort of fringed brown or red suede shorts with a bright red cowboy boot would be so fire. Lean into the cowgirl look",
                            "score": 5
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Low-Cartographer9326",
            "body": "Posted on r/findfashion already with no success so I'm hoping this sub can help:\n\n\nLooking for a sweetheart neckline mini dress I saw on a woman a while ago, but didnt get to ask her where she got it. It was in a muted teal color (like the hexadecimal color 347F77), and looked to be made of athletic material (or just a smooth and stretchy artificial fabric). No frills on the sleeves, and the skirt was NOT bodycon and draped loosely. It looked similar to this (https://www.amazon.com/Women-Sleeve-Sweetheart-Dress-Stretch/dp/B0CMQQL8T6) but without the slit in the skirt and a looser drape in the skirt. Thinking it might be from one of the athletic brands but I'm not sure.\n\n\n\nI've searched about every search term I can think of, dress cuts (skater, fit and flare, and A-line all qualify I guess), looked on Lululemon/Halara/Alo/Athleta and even Shein/Aliexpress but I can't find this dress. I've found a few similar ones but they're not sold anymore or sold by Shein. I'm hoping to not order from a dropshipper so please let me know if you know what I'm talking about.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "Aritizia novella dress? It used to have a small slit but the newer version doesn’t and it used to come in teal. The only thing I don’t think really matches is the sleeves are a bit loose and flowy.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Low-Cartographer9326",
                            "body": "Nah, the sleeves were tight. If anything it looked like the Wilfred Tuscany dress but with a loose drapey skirt.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "electric_marshmallow",
            "body": "Does anybody own Agolde Rileys (100% cotton) and can tell me whether they stretch out over time? I am between 26 and 27 and ordered them in 26, but not sure if I should size up if they are a bit snug now or not. TIA!",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "Mine stretch out massively even though they're a bit loose to begin with. They recover shape in the wash. Unless you wash them daily, I'd go with the smaller size.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "electric_marshmallow",
                            "body": "Thank you!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bubblegumdavid",
                    "body": "I find mine stretch out between washes when worn more than once, but not much over time in total, which is pretty typical for my denim 100% cotton experience.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "electric_marshmallow",
                            "body": "Thank you!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SnooHesitations4953",
            "body": "Hi all! Question, how do we stay warm at professional conferences venues while in pencil skirts and such professional wear? I'd like to break out of pants and experiment with skirts/dresses with blazers for an upcoming conference but it will be in summer and I assume the hotel it's at will be cold. Do y'all just wear tights? Suffer through the AC? Fwiw I think I could handle cold legs if I kept my upper half warm enough. ",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Tights! My little leather boots are fleece lined. My cardigan is merino wool. I tuck my shirt in. You can wear a few under layers if they're thin. Choose a warm/thick skirt material",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "thenfacetoface",
                    "body": "The blazer should help. \n\nI do to some extent suffer through the A/C and then I put on a coat I brought like a trench. People get cold and I don’t think it’s weird to put on some layers. \n\nDrinking hot beverages also helps. Could keep an insulated container of hot tea or coffee with you. \n\nDuring breaks in the conference, go outside and walk around in the sun.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Tights! My little leather boots are fleece lined. My cardigan is merino wool. I tuck my shirt in. You can wear a few under layers if they're thin. Choose a warm/thick skirt material",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Godesschocolate",
            "body": "Need help with wardrobe \n\nI’m trying to get back organized with my clothes. I have been fluctuating my weight up and down over the last couple years in college and now I kind of find myself in a minimalist space repeating blacks and tans in my clothing. However, now I’m trying to be on my grown and sexy and I want to revamp my clothes, however I live in a studio apartment, and most of my clothes are thrown in bins, and I would like to rearrange my room in a manner where I could shoot content or have racks in my room. I wish there was an app to rearrange my whole room or a cleaning service that could assist me with organizing and decluttering my clothes any hints on how do I go about doing that?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "There absolutely are professional organizers that can help you with that! If you are in the USA, search for a local member of the [professional organizers' association](https://www.napo.net/). Also, there are [online stylists](https://www.lakyn.style/book-online) that can help you sort and declutter your clothes from anywhere in the world.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "im_avoiding_work",
            "body": "Does anyone have a recommendation for 100% silk wrap dresses (not of the faux wrap or silk blend varieties)? Years ago Yumi Kim was a great source for them, but now it looks like they aren't doing much silk anymore. I'm fine going relatively high on price, but even expensive brands all seem to do faux wrap and synthetic blends or synthetic linings right now",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "Just bought a 100% silk vintage DVF wrap dress on ebay. If you're willing to go as high as $300, you'll have your pick.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "DVF! Idk if they make them now, but I’ve seen silk ones on resale",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "im_avoiding_work",
                            "body": "thanks for the advice. Sadly DVF doesn't do natural materials anymore, but I'll definitely check out resale",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "unpaidbabysitter0919",
                                    "body": "What a shame! It’s disappointing that a lot of brands are like that. I see vintage mall brands that used to make silk clothing but not anymore",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "im_avoiding_work",
                                            "body": "yeah, I really wish more brands still emphasized natural materials. I just can't justify the prices so many legacy brands now charge for polyester dresses",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Comprehensive-Fun47",
            "body": "What are my options to wear over not very fitted graphic t-shirts?\n\nI have some band t shirts that I would like to wear more, but I want a sweater or some kind of long sleeved layer to wear over them. Nothing I have looks good.\n\nIf the t-shirts were fitted, I'd feel like I had more options, but being loose unisex tees with crew necks, I feel like nothing looks good. How can I turn a band t-shirt into an outfit? (I'm pretty much always going to be wearing then with jeans.)\n\nEdit: I'm getting a lot of good answers, but I think I'm looking for suggestions on what type of sweater looks good over a unisex tee. What length, style, should I tuck the t-shirt, could it be tailored in a way that actually looks good, etc. What do you all do? Example pics would help.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "I usually wear a crew or turtleneck under them like a 12 year old boy in 2004 tbh",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Comprehensive-Fun47",
                            "body": "Lmao! That's never been a good look on me.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "I think any statement coat or jacket would work. Maybe you can tie the shirt at the bottom so it’s not long? I wore that look recently. It was a graphic tee that was too long. So I tied it at the bottom on the back and wore a statement Penny Lane fur coat",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "floracalendula",
                    "body": "Have you considered the classic leather jacket?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Comprehensive-Fun47",
                            "body": "Hmm, I don't have one, but that is a good thought.\n\nWas kind of thinking of a non-jacket layer because I'd likely be needing a real jacket as well, depending on the time of year.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "floracalendula",
                                    "body": "I mean. Any coat would make an acceptable third piece. I've done cardigans, too, in that situation.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "Would you be interested in having them tailored to be more fitted? I used to do that in highschool and found tons of patterns online for cutting/sewing/shaping band tees",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Comprehensive-Fun47",
                            "body": "I have sort of tried that in the past but the sleeves never look right.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ElegantIllumination",
            "body": "\nHow can I feel more put-together without make up or much jewellery? \n\nI’m not particularly feminine and do not like things like make up and jewellery, but struggle feeling like my outfit is “finished” or like I’ve put effort into it if I don’t accessorise. I want to feel more put-together, so are there types of clothes or anything else I can do to make myself feel that way? I’m open to any suggestions :)\n\n(Not sure if this belongs here or if it’s better as its own independent post tbh.)",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "livthelove",
                    "body": "I think there are some non-feminine accessories you could try - maybe a watch or belt? You could also have fun with shoes. I think incorporating things like blazers could also work well. \n\nAlso, I find making sure clothes are ironed/steamed and well-fitting go / long way in making me feel put together.",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ElegantIllumination",
                            "body": "A watch is actually not a bad idea 🤔",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Hvvjvk",
                    "body": "I feel like statement pieces might help, like a bold color or print. Also staying well-groomed makes me feel better",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "KarateDimension",
                    "body": "I don't wear makeup either, but a little bit of jewelry. Personally, I think details like neatly combed hair and fitted clothes go a lot further in making you look put together than makeup. After all, most men don't wear makeup or jewelry and no one is calling them frumpy about it! \n\nAlso, I don't mean to imply that you need to wear elaborate hairstyles, but it's like the difference between a man with a well cared for beard and a man who hasn't had a trim in 6 months. Keeping up with hair trims and washing your hair with a shampoo/conditioner that matches your texture can go a LONG way.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ElegantIllumination",
                            "body": "I still think tinting anything would feel too close to make up for me (it’s not about how it “reads,” but about how it personally feels for me), but I do think hats and glasses are a good call. Thanks!!",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aaanaab",
                    "body": "I don’t think makeup and jewelry are defining characteristics in looking put together..\n\nMake sure your clothes are well fitted (not oversized or too small), ironed, no clashing patterns or textures - safest way would be to just have outfits made up of neutral colors. Everything should be clean, good hygiene, and neat hair will go a long way.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "womanphd",
            "body": "Does anyone know where I could find a more affordable dress like this? \n\n[https://www.urbanoutfitters.com/en-ca/shop/love-shack-fancy-chessie-floral-maxi-dress?category=SEARCHRESULTS&color=053&searchparams=q%3Dfloral%2520dress&type=REGULAR&quantity=1](https://www.urbanoutfitters.com/en-ca/shop/love-shack-fancy-chessie-floral-maxi-dress?category=SEARCHRESULTS&color=053&searchparams=q%3Dfloral%2520dress&type=REGULAR&quantity=1)",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "hennipotamus",
                    "body": "I’m not sure which exact features you’re interested in, but here is something similar from [Abercrombie](https://www.abercrombie.com/shop/us/p/emerson-linen-blend-puff-sleeve-midi-dress-55102328) and solid colors from [Quince](https://www.quince.com/women/100-organic-cotton-smocked-midi-dress). Try search terms like: tiered, smocked, midi",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "womanphd",
                            "body": "Thank you!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Runnergirl4382",
                    "body": "Loft has some soft florals, if that’s what you are looking for—here is one example: \n\nhttps://www.loft.com/clothing/dresses/catl000013/767226.html?priceSort=DES",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "jdijks",
            "body": "Can you guys get me some dupes for \nhttps://www.aritzia.com/us/en/product/necessary-silk-scarf\n\nI love the scarf. Love the shape as it's not so bulky but the aritzia logo??? Why would I want that branding on my neck???????? \n\nI prefer rich bold colors. Midrange pricing. I've been looking at the thrift stores in my area and have had no luck so I'm really resorting to online shopping as my area doesn't even really have a mall",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Due-Secret-3091",
            "body": "Hello! I have a wedding to go to this weekend. It’s a formal evening wedding and I plan to wear this dress (with shoes like these pictured below.) Im trying to elevate the look and wanted to wear my pearls with it? I’m unsure. What color clutch should I go with? Is it going to be too much black? Thanks in advance.\n\nhttps://preview.redd.it/tvbs01vlem1d1.jpeg?width=677&format=pjpg&auto=webp&s=2553f07596e108da835505e595e1d05347bf4763",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Acme_Co",
                    "body": "Definitely wear jewelry that stands out color-wise from the black dress.  Pearls would be super cute.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Due-Secret-3091",
                    "body": "https://preview.redd.it/j718t1jpem1d1.png?width=828&format=png&auto=webp&s=4fe3b691379b2c6fccf53164a85a341c469662d0",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "If you have long hair, a really elaborate updo would add some formality too!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Eastern_Drawer4997",
            "body": "Sandals for Extensor Tendonitis?\n\nHave been diagnosed with extensor tendonitis, and every shoe my doc recommended is a running/tennis shoe. I hate, hate enclosed shoes!  Are there sandals out there with stiff soles and good arch support?  My vionic sandals were too flexible for him. Thinking even birks may not be enough. Please help me find something that doesn't make me feel overheated just to look at!",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I have [these SAS sandals](https://www.sasshoes.com/womens-relaxed-heel-strap-sandal/1760.html?dwvar_1760_color=037&cgid=womens-sandals#start=1) which have similar arch support to birkenstocks, but they still might flex too much, I’m not sure. (I did wear them with an ankle brace after spraining my ankle, but the brace was keeping my foot from flexing too much, not the sandal.)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "oysterthrifter",
            "body": "I'm looking for a specific black midi dress that I spotted on someone while out for dinner in Montreal!\n\nIt's so basic yet seems impossible to find.\n\nThis Babaton dress is most of the dress but with some differences in construction:\n\n* the top bust was seamed like along the orange dots\n* the material seems like cotton or poplin based on the volume and structure\n* the dress was tiered appropriately where my red lines are drawn\n* the back of the dress had a smocked portion to the top\n* I don't thiiiiink it had pockets\n\nFingers crossed someone knows where I could procure this dress!\n\nhttps://preview.redd.it/xoq9m0h6nn1d1.png?width=1080&format=pjpg&auto=webp&s=c4996357e58053b4717a9d30d66f0c5dd714f700",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "[This one](https://us.princesspolly.com/products/chelsea-maxi-dress-black?currency=USD) doesn’t have smocking but it seems close on the construction otherwise.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "False_Sir_7296",
            "body": "Does anyone have an Ed Hardy Forever bikini? They have a no returns policy and I'm wondering how they fit. Would hate to spend $100 on something that doesn't fit and I can't return.\n\nIn case anyone is not aware, Ed Hardy Forever is a relaunch, I don't know if sizing from when Ed Hardy sold bikinis would apply.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "OstebanEccon",
            "body": "I (male) often wear compression [HeatGear](https://www.amazon.de/Under-Armour-Heatgear-Leggings-Medium/dp/B0874X381F/ref=sr_1_6?__mk_de_DE=%C3%85M%C3%85%C5%BD%C3%95%C3%91&crid=1HF8MEYHGN2M2&dib=eyJ2IjoiMSJ9.lknGNeb2F_3dOMmXTSvmXFCROlNUOyMvEGMajdnjmfkCoomNeLe1KxnsOxybUhi0mSjkNWiMd_dTDl1cHM8K660rpZjCzl-SPjul6-_U3akh_cLYb-XbpHiI4ArH28VsaL7RLimhAigDkFazx7mRO--UPQ_I5kKlpXsqN4lbpREhqLwAul9aR4DedxGz2TnYKbYgyHD1_LAXMkrx4EKgezA3pFfuK472vUMIedGkmhfm6kBG4qyMEvocZakCujixY0paeg4Z9NBj4Msvz4H3AzEY8SKqWzViJDH3aXUrhP8.pMRpyRO22gF-KvhBDMx9RF01yjo0Acirobq8b1JhNx4&dib_tag=se&keywords=under+armour+heatgear&qid=1716280799&s=sports&sprefix=under+armour+heat+gear%2Csports%2C100&sr=1-6&language=en_GB) by UnderArmour. It's a REALLY thin fabric that is almost see through, completely skin tight and not meant to be worn on it's one but as a base layer.\n\nI want to buy something like that for my wife and I can't really find anything. Stuff like [this](https://www.amazon.de/Leggings-Pockets-Trousers-Streetwear-turquoise/dp/B07VLM62KB/ref=sr_1_1_sspa?__mk_de_DE=%C3%85M%C3%85%C5%BD%C3%95%C3%91&crid=2YZUKQ3N4WONZ&dib=eyJ2IjoiMSJ9.kUskPxre8AL4iv4c_IaVa_vb3STsldnGHLqaqbEsD53O6crvlNujdv-8Sxns4l_YgdhAYFWZZ0NokKZBKNzcn9JrxSrnqLRLlbd7r0JNGimXYvIe_HqXCtiNj-iptGM00rjXo2tnqsHedQSqdMl5-TmzztjhlCMgQakiCG6AEznWCXw4NG8S_a09aNNCuGevopiptmKUv6nOFpb-uRNoF8TmR9qelWTfWs3Ze-8wxC6OPGH9xxIfH60qFQkVepOMZmFj5mAfzBhAgPb4RQXIX4TDuL_1YG2ZcH2F-SFoBc0.YCfhXU72qA-KwP-0KKGG-nzs8TPwXywanJ0RlA6vLF4&dib_tag=se&keywords=compression+leggins+women&qid=1716281145&s=sports&sprefix=compression+leggins+women%2Csports%2C103&sr=1-1-spons&sp_csd=d2lkZ2V0TmFtZT1zcF9hdGY&psc=1) is way thicker and the point is that it should add almost no volume when worn underneath other pants.\n\nSince my wife is pretty short and chubby I know the options for men won't fit her. They are either too tight or way too long.\n\nDoes anyone have recommendations?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "UnderArmor has [HeatGear for women](https://www.underarmour.com/en-us/c/technology/heatgear/womens-clothing/). Uniqlo has HeatTech for the winter and Airism for the summer. REI has loads of base layers from better outdoors brands, like Ark'teryx, Colombia, and Patagonia.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "OstebanEccon",
                            "body": "Yeah but the stuff from under armour for women is all multi-layer fabric that is way thicker than what i was describing. at least i cant find anything thinner.\n\n\ni will check the other brands out though, thanks",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "You can also look into merino wool base layers if your wife isn’t sensitive to wool (it’s pretty soft/smooth to most people, but people with especially sensitive skin or a wool allergy can be bothered). I have leggings from Smartwool that are very thin and warm.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "OstebanEccon",
                            "body": "thanks for the suggestion but one of the points is that it's NOT warm :D",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fir6987",
                                    "body": "Whoops, sorry, I missed that!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "red_runner_23",
            "body": "# Where to find bright, bold, patchwork clothes (Bhutanese-inspired)\n\nhttps://preview.redd.it/kk46caxbtm1d1.png?width=302&format=png&auto=webp&s=2339274496ed6df9ebcf0b601e104784f193e019\n\nAny brands or clothes that produce Bright, bold colors juxtaposed/patchwork, such as in Bhutanese dresses? The bohemian style available in the US is often very worn/washed out, or is just a \"printed\" colorful pattern (which doesn't retain the dimension of having separate fabrics conjoined). Bonus points if these colors are incorporated into everyday workwear or western-silhouettes!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "kkw01",
            "body": "I'm going to eras tour in Lyon France and I have decision fatigue 😩 someone please help me decide which outfit would suit best. I am planning to wear a corresponding flower crown with whatever outfit but I love them all. It was way easier last year when I bought last minute tickets and I didn't have all this time to worry about the perfect outfit. *",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "kkw01",
                    "body": "https://preview.redd.it/7ift8gzfwq1d1.jpeg?width=3000&format=pjpg&auto=webp&s=53f2abf01842a9224379329106dc38e5ea2e8841",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kkw01",
                            "body": "https://preview.redd.it/ab191muhwq1d1.jpeg?width=3000&format=pjpg&auto=webp&s=3d794ad8a9e8baca2c281ce94a12f22349bda65f",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kkw01",
                                    "body": "https://preview.redd.it/ulzc817kwq1d1.jpeg?width=3000&format=pjpg&auto=webp&s=cb79c0cc8d459992ae39b43d9bfbb26ca5139b02",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "oat-beatle",
                                    "body": "This one will be most fun under the varied stadium lights imo",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "fir6987",
                                    "body": "I love this one!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Expensive-Emphasis78",
            "body": "Can anyone tell me the **Style Names** of these 2 things?\n\n1. This ring:\n\n(Just the double gemstone style)\n\nhttps://preview.redd.it/g82ugija9m1d1.jpeg?width=831&format=pjpg&auto=webp&s=8271d8b11b61895c1bb3a25fa941b04e136acbf7\n\n(See 2nd pic in next comment!!)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "thescaryitalian",
                    "body": "The ring is a “toi et moi” style",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Expensive-Emphasis78",
                            "body": "Thank you !!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Expensive-Emphasis78",
                    "body": "And 2. The style of sleeves on this dress:\n\nhttps://preview.redd.it/rt9g4ovh9m1d1.jpeg?width=571&format=pjpg&auto=webp&s=f7a797bd75e7bae9eec2e4a6ea44dfbdbf56d80b\n\nThank you in advance!!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nomarmite",
                            "body": "Double gemstone ring and tulip sleeves.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Expensive-Emphasis78",
                                    "body": "Thank you!!!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aaanaab",
                    "body": "I just have to comment this is crazy because I saw your post earlier today in passing, was just scrolling TikTok and I see the video of the girl with this ring - Dina Khalil. Thought it looked familiar so I came back to check and yup. Screenshot matches.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Expensive-Emphasis78",
                            "body": "LOL I was also the one who asked her where her ring was from😭😭😅😅\n\n(Shein btw, for anyone wondering..hehe)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "aaanaab",
            "body": "Has anyone tried the brand double standard nyc? For shoes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "detective-carrot",
            "body": "Anyone have experience with the brand Studio Tomboy? I believe it’s Korean. I can’t seem to find any reviews anywhere online. I am specifically curious about the quality of their wool outerwear but also in quality overall. Thanks!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "UhOhAbbo",
            "body": "https://preview.redd.it/dlcjdrmvim1d1.jpeg?width=1093&format=pjpg&auto=webp&s=4add5b6d0c2fdb77cf00e24a5ecf839b119d43f1\n\nFor just a casual every day errand running summer outfit, I’ve done this. Just a gray tank, high rise denim shorts, and some accessories. However, I can’t help but feel like the belt buckle sticks out way too far and I look goofy from the side. If I tie it any tighter it feels uncomfortable. Is this just like, normal, or am I right in saying it looks goofy?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "KingPrincessNova",
                    "body": "honestly I think that's just what belts do sometimes. I prefer braided belts cause then I'm not stuck with whatever arbitrary holes the manufacturer punched.\n\nfwiw I wouldn't have noticed it if you hadn't pointed it out",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "The outfit is perfectly fine for running errands and no one is going to look twice.\n\nBut, from a sewing perspective, your waist line is lower in the front than in the back, so it makes the shorts angle forward, which makes the belt buckle stick out more.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "UhOhAbbo",
                            "body": "Yeah, the shape of my body is kind of weird tbh LOL. I’ve got a really deep lumbar curve and that’s just the way most pants fit me unfortunately. But! Thanks for the comment anyways 😂!!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "smkscrn",
                    "body": "I think it looks normal, probably even more so when you're not twisting to the side to take a photo 🙂",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "That looks totally normal!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "I think the outfit looks totally fine but I find that “tight - tight” silhouettes aren’t very common right now, which might make it look a little dated. If you want to make it a bit more modern consider a looser crop top or a pair of looser shorts!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "UhOhAbbo",
                            "body": "As much as I wish the baggy look looked good on me, it really widens my already stout figure. Seriously, I look like a tent from the side 😂. I find that tighter shirts around my chest and waist narrow me down, and same for high rise shorts. so that’s the only reason I stick to them. I don’t care to be “in” that much anyways. Just as long as I don’t look… like, actually insane or un put together LOL! Thanks for your comment!",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "District98",
                                    "body": "Sure thing! We have pretty similar body types, I always need high waisted too!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "UhOhAbbo",
                                            "body": "Peplum tops too for the win 😂😂!!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "thecrisco_",
            "body": "https://preview.redd.it/h2n40vpnlm1d1.png?width=245&format=png&auto=webp&s=5e659cac29554d912d2c0d2be4f34cec9933177c\n\n# What's a more slimming version of this tank top + pants summer outfit?\n\nMy classic summer outfit is pull-on wide leg pants and a tank top. But seeing this picture of me, it's just not flattering and slimming. What's a better version/silhouette of a summer pant/top combo for everyday casual wear?\n\nMore details: I'm 39 and have a smaller chest w/ wider hips. I would say I shop most often from Madewell and Everlane if that helps give a sense of my style.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "smkscrn",
                    "body": "I think you look great FWIW, but if you want longer lines I would go with full length pants in a less stiff fabric that will drape more - I like a smooth rayon for summer. Wearing shoes in the same color will also help your lower half look longer.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "hennipotamus",
                    "body": "I agree with the other commenter that you look great! But some other options:\nWear a more fitted tank or a body suit; wear pants that don’t have pleats; wear sandals.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "womanphd",
                    "body": "I think you look good in this outfit and if I saw the photo without your question I would think that's exactly how those pieces are \"supposed\" to look",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "unpaidbabysitter0919",
                    "body": "I think you look great in the photo. If you want something slimmer, you could wear one of those linen pants and vests sets",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "Imo unless you're tiny, wide leg pants just add so much volume hanging from the widest point of a person's body. I know they're \"in\" but personally I'd pair a slim or skinny pant with those shoes and top, or a small/tight top with wide leg pants.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jolly-Ad-1900",
            "body": "Cool walking shoes like these? [Miu Miu flats](https://pin.it/4NxLjxGUT)\n\nBut more functional while stylish— Salomon/Asics type brands…",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "Mephisto Allrounder Niro or Sorel Kinetic Impact MJ Strap",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jolly-Ad-1900",
                            "body": "Bless u…. Just bought the Mephistos <3",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MostCreativeYogurt",
            "body": "Hi, I ordered a pair of Birdies Starlings in leather after seeing a thread on this subreddit. They feel comfy enough so far on my feet, but they're immediately poking me on that back heel area. Does that go away over time or did I get a bad pair? Since so many people like it, I imagine this can't be a lasting issue... Should I try to break them in or just return now?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lady_guard",
            "body": "Does anyone recall seeing matcha or a saturated bamboo green in any colorways lately? Looking for cotton or linen basics.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "osally",
                    "body": "Just bought a Vince Pima cotton shirt on sale from Nordstrom in the shade Basil which might be close to what you’re looking for.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "gm_piodis_i7",
            "body": "Where can I get tailored silk (or silk blend with natural fibres) dresses? Max $300. Most silk dresses I come across tend to be just rectangle slip dresses with no darts, gathering or any thing else to make the draping EXTREMELY flattering. Bonus if it's not floral print.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Acme_Co",
                    "body": "I have a silk maxi dress from Lilysilk, love it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "criticiseverything",
            "body": "How can style [this vest](https://www.ravelry.com/patterns/library/september-slipover) more feminine?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "hotgirlshit97",
                    "body": "Ooh maybe by tucking it into a skirt or with trousers! I think accessories (necklace, earrings) would definitely add to the outfit as well",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Runnergirl4382",
            "body": "Denim skirts—are mini/knee lengths considered on trend? Or just midi/maxi?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "symphonypathetique",
                    "body": "Mini yes (specifically low rise and pleated I feel), knee length no",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "mmmiu85",
            "body": "I'm looking for some recommendations on a white or light blue button shirt with a thicker fabric, something that's quick-dry and not flimsy/thin feeling. I don't like when I sweat on thinner cheap fabric because it feels like I'm wearing a wet t-shirt and the fabric seems to emphasize my sweat marks. I have sweat absorbing pads to stick in the underarm area of my clothing but I find it doesn't blend in with white shirts (it's like wearing a white bra under a white shirt and hoping it won't be visible). I'm in Canada :) Thanks!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "If they ship to Canada, I recommend Athleta!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "What size are you? I may have an idea, depending ",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "What size are you? I may have an idea, depending ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mmmiu85",
                            "body": "usually small or 4, but depends on the brand. some companies fit smaller than expected",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blackberrycat",
                                    "body": "You may be able to fit the largest sizes of Old Navy boys wear. I have found a couple light blue button up quick dry shirts made from thick soft fabric there.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mmmiu85",
                                            "body": "Thank you! I'll check it out",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "broccoliandbeans",
            "body": "Looking for recommendations for GOOD underwear. Not thin cotton that stretches out after a few hours of wear.’ I’m in then USA. I want some thicker material.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "It’s $ but I like Patagonia undies!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ClassicEssay1379",
                    "body": "Thunderpants?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "+1 to Patagonia. Also TomboyX has great stuff.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Second Thunderpants, I’m slowly replacing all my underwear with them.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Weak-Classic7161",
            "body": "https://preview.redd.it/o7z6kpuhtl1d1.jpeg?width=1170&format=pjpg&auto=webp&s=9cfe68c2c765cae99703ff4d63287c962e60539f\n\nWhich do you like better? Black or beige?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "bubblegumdavid",
                    "body": "I prefer the beige! It’s a lot less contrast, so it’s making you look taller a bit and you can see the pleat detail better. Plus it’s very spring-y",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "Weak-Classic7161",
                    "body": "https://preview.redd.it/3bqajk5ktl1d1.jpeg?width=1170&format=pjpg&auto=webp&s=8bbc4b1b64fdae877518dbdafe1fdded667d63cb",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KingPrincessNova",
                            "body": "seconding the beige. totally not my style but it's really cohesive on you",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "prpldolphin",
            "body": "How could I style longer tank tops for the summer? I have a few nice quality silk tanks from my mom but they are a long/loose style that looks dated. They either cut me in half untucked or are billowy and pirate-y tucked in.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "symphonypathetique",
                    "body": "You could try using a hair tie to tie it at your waist and then flip it upwards underneath to hide the \"tail\" (you could tuck it under a bra if needed to help keep it down)",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zealousideal_Rule526",
            "body": "Looking for an inexpensive white tshirt that’s not see-through. Ideas?",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "hotgirlshit97",
                    "body": "I LOVE everlane's 100% cotton tshirts they're just a bit pricier ($30 or $20 if you buy 3) but uniqlo is having a sale right now for $10 for their cotton tshirts if you wanna check it out!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Zealousideal_Rule526",
                            "body": "Thank you!!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "Does she like jewelry like that? You may have already figured that out, but since earrings are a piercing, a lot of people can only tolerate specific metals so make sure they're made from a material that doesn't bother her ears",
                    "score": 1
                }
            ]
        }
    ]
}