{
    "title": "Random Fashion Thoughts - May 22, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "fir6987",
            "body": "Anyone else remember when people would regularly post visual wardrobes (specifically where they’re wearing each garment, not just product photos) to this sub? I miss that… it was more possible to give actual helpful feedback, and also I’m just nosy and like to see what other people have in their closets.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "NewWorth7945",
                    "body": "I’d also love to see more of this. I’m also into seeing how people organize their clothing closets or clothing space, though that’s probably a different subreddit.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fir6987",
                            "body": "Ooh I love watching closet tours on youtube for this reason. Also, the closet clean out/organising videos. All while procrastinating sorting through my own closet…",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NewWorth7945",
                                    "body": "Me too, I also love full closet try on videos as well!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sadboipri",
            "body": "i wish i knew how to mend and make alterations to my own clothes so i think im going to take a sewing class this summer! with the ultimate goal being to be able to do upcycle thrift flips",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Princess_seam",
                    "body": "Sewing is super rewarding. I hope you enjoy your class and post some of your finished projects.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "PlantedinCA",
            "body": "I saw a fashion influencer / former editor post a GRWM video. And her outfit was more like 😱 than 😍.  \n\nIt was supposed to be an outfit for a business meeting, and the skirt she chose was a hole-y knit skirt. A pattern clashing top rolled up to be cropped so the distressing on the skirt would be more visible. I was very confused. And they were like “I am a creative. All of my outfits must showcase my sense of style.”\n\nI was so confused by this outfit. Didn’t feel like it was making a statement in a good way.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "What’s stylish for people in the fashion industry is likely different than what the average person would find stylish. Unless you’re on the cutting edge of trends, when you look at people who are, their outfits are going to look weird. There’s always a backlash of “that’s so weird/ugly/awful” every time a new trend pops up, until it saturates and becomes popular and then people start liking it more than hating it. \n\nAlso a business meeting for her is going be different than a business meeting in a traditional corporate environment, def not the place to get office wear inspo from.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PlantedinCA",
                            "body": "This outfit in particular was in disrepair and had visible holes. I think she was phoning it in.   I have seen much better outfits on here. This one didn’t have much cohesion.  And to be honest she was also commenting that it may not have been appropriate for the occasion, but she didn’t care.  This wasn’t a matter of not being hip to the trends. Here commentary reflected similar sentiments as she was putting it together.",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}