{
    "title": "Daily Questions Thread May 21, 2024",
    "comments": [
        {
            "depth": 0,
            "author": "Luna_182",
            "body": "\\*Socks\\*\n\nI recently discovered what was missing in my outfits: socks! and I have realized I have no idea where to start, so I thought about asking here\n\nFirst, which types do you think are a must have?\n\nAlso, which outfits looks best and more important which outfits dont require them? I know this is a weird question, but It has been so long that I have realized that when I think of using socks I think they look akward on me but I think it is just in my head.\n\nMy everyday casual/dont want to think go-to outfits are an example that I cant picture with socks, this is a croped pant/jean or mini skirt with a tshirt tucked in + sneakers, do you think this looks good with socks? and if they do, which kind?\n\nthanks in advance!\n\nhttps://preview.redd.it/pantg7rgdr1d1.jpeg?width=1920&format=pjpg&auto=webp&s=436099bb2ac39173ade56d78886d4c84f62bb0ac",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "I wear the Madewell cloudlift crew socks in white or tan with outfits like this!",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Luna_182",
                            "body": "thanks for the suggestion!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "District98",
                                    "body": "For sure!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "With cropped pants or skirt, I’d do a no-show sock or a crew sock in a statement colour. Or you could do a sheer trouser sock with a fun pattern.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Adventurous-Baby-840",
            "body": "What are we wearing over our summery maxi dresses when it gets cooler at night? I’m petite so oversized button ups tend to swallow me, and denim jackets never hit right at the waist. Recommendations for summery options/cropped cardigans or overshirts please!",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Uniqlo has some summer cardigans. ",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I have a leather jacket that I spent way too much money on, so I use that!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "blackberrycat",
                    "body": "Uniqlo has some summer cardigans. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "buddy_cheeks2",
            "body": "Hi all! I'm a bit torn between which length I should go for on a pair of black jeans (same pair, just folded up or showing full length). I've consistently been an ankle-length jean kinda girl (5'3\"), but lately, I've been really digging the longer length pants on me. Makes me feel a bit \"city-girl,\" if that makes sense?\n\nWould really appreciate some objective perspectives! Thanks all!\n\nhttps://preview.redd.it/c24k84sgds1d1.png?width=1472&format=png&auto=webp&s=339aac780fd0f61287680ab77d3b0e0323a81b32",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "KPMWrites",
                    "body": "I think the longer length looks great!",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "buddy_cheeks2",
                            "body": "Thank you!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "I much prefer the shorter length on you. It looks fresher and more in proportion. The longer length is a little dowdy in comparison. One small thing - I think they would be better if they were a tiny bit shorter, just half an inch or so. At the moment they are slightly longer than a classic ankle length. I do think you're right to be concerned about pant length when you're on the shorter side, as overlong pants can make you look even shorter. If you want to try out a longer style, I'd go for a slightly looser and wider classic trouser cut.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "I like the length, but I agree that a slightly wider leg would look great on you!\n\nWith this particular pair, I think they would look great/more polished with just a slight hem (so the hem is just skimming the top of your foot) but I know that’s a pain to do.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "They both look good, but if it is heading into hot weather season where you live, the ankle would be more practical for the next few months, especially in such a dark colour. Also, the proportion on these particular full-length trousers might not be the best; the cropped flare balances your hips a little better. Perhaps a wider (not “wide,” just wider) leg in a full-length option?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "buddy_cheeks2",
                            "body": "Thank you! I do want to point out that they are the same pair of black jeans. I did consider trying on a 1 size larger. It'd give me more breathing room in the waist/hips, but will be a big baggier in the legs.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "arbitrosse",
                                    "body": "I understand they are the same pair. Everything I said reflects that. I did not suggest sizing up.\n\nYou do not need more “breathing room in the hips” (ew). In fact, if you can roll over the waistband, the pair you are wearing is too large.\n\nYou need more volume from the knee down to balance the hips. The ankle length gives you that. The full length does not.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "buddy_cheeks2",
                                            "body": "They're pretty body hugging. But why ew at \"breathing room in the hips\"? I was talking about maybe more space because it is body hugging.",
                                            "score": 7
                                        },
                                        {
                                            "depth": 4,
                                            "author": "oat-beatle",
                                            "body": "Needing \"breathing room in the hips\" means the pants currently feel slightly tight for OP. It's not a value judgement, it's a way to say something feels tight.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I feel like long looks better with more types of shoes, while wide ankle pants look really weird with pretty much anything except ballet flats or pumps.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "whereisyourtowel42",
            "body": "Hello, I have been on the hunt for some nice black leather loafers but always feel discouraged after looking at reviews. I would love some nice black stylish loafers I can wear to the office but also wear out. I am willing to splurge a little given I want them as a wardobe staple, any suggestions? Extra points for comfort of course!\n\n\nI had some Madewell ones that ripped my heels to pieces and was never able to break in.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "P1cea",
                    "body": "I have a Stuart Weitzman pair I like.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "The_Sp0iler",
            "body": "Similar to Michelle Wie West Collection? (Diamond Friendship Bracelet)\n\nHi all, I saw [this](https://wovemade.com/shop/michelle-wie-west-jewelry/custom-diamond-friendship-bracelet-yellow-gold-bracelet) and fell in love. Then I saw the three months rent price tag and died a little inside\n\nI am looking for something with **beads,** not hanging charms\n\nI found this on [Etsy](https://www.etsy.com/listing/1656110694/tnt-diamond-bracelet-in-gold-and?click_key=665fb7818f2897736a96eea7371398dff3a73188%3A1656110694&click_sum=0b12c0c0&ref=user_profile&frs=1&sts=1), and it's close, but I really liked the jewels on the letters of the MWW collection. \n\nI started looking at charm/Pandora-like bracelets, but most have dangle letter charms, and I didn't see very good reviews of Pandora\n\n  \nAnything in the direction of something similar for under $250 would be lovely",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Charming-Target6617",
            "body": "Hi all! i'm looking to revamp my wardrobe and would love some advice. What are some absolutely essential fashion items you'd recommend I invest in? Thanks in advance!",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "QuesoRaro",
                    "body": "That depends entirely on your culture and lifestyle. I've never seen anything on a \"must have\" list that has any place in my life. White button-down shirt, camel trench, and black pumps? LOL. Absolutely never going to be in my closet.\n\nThink about what kinds of activities you do in an average day, week, month. What clothes do you need for those things? Think at home, social events, work, exercise, sports, hobbies, etc.. What kinds of weather do you need to deal with? What levels of formality?\n\nYour essentials will be different if you, for example need to wear court formal for work, live somewhere with dramatically hot summers and cold winters, and ride horses for a hobby, vs if you live somewhere year-round tropical, work from home, and lift weights five times a week, etc. ...",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "If you’re not sure what kind of style you want, start making a pinterest board of everything you like. Then curate it down to what would be practical for your lifestyle/works on your body/fits your favourite colours/etc. \n\nIf you have a pretty good idea of what your style is already, make a pinterest board anyway! It’s good to have visual examples on hand.\n\nThen go through all of your existing clothes - what fits/doesn’t fit into the style you want? (Also this is a great opportunity to get rid of clothes that you never wear.) Then identify the gaps - what are you missing that would help you make multiple outfits in combination with clothes you already have? Those would be your essential items.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "For me: waterproof boots (blundstones), a solid REI raincoat, a puffy (mountain hardware), high waisted slim/skinny jeans (American Eagle), a pair of black denim shorts and a pair of jean shorts (Abercrombie), workout leggings (90 degrees by reflex) and cropped tops (Athleta and others), a pair of comfortable walking sandals (chacos), a ton of short sleeve button ups for work or casual work (gap, Anthropologie, banana republic, etc). Those are \"essential\" for me!",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "arbitrosse",
                    "body": "Bodysuit\n\nShirt garters",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "Tuck your shirt into your underwear.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "sexysmoothfig",
                    "body": "belt? you could alternatively wear leggings or shorts and stuff the shirt into that with a military tuck",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheStartingLine-",
            "body": "https://preview.redd.it/shv9n5uz8r1d1.png?width=423&format=png&auto=webp&s=5da1e595b0966c27709e90a10b89f5fcb342bca3\n\nHey y'all, does anyone know what I'd type into Google to find these (or very similar) shoes? Note the low ankle, the thick, low heel, the strap, etc. Thanks :)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nomarmite",
                    "body": "Open side or cut out ankle boots. The ones in your photo look to be from about ten years ago, when the [Balenciaga Ceinture boot](https://www.selfridges.com/GB/en/product/balenciaga-ceinture-ankle-boots_926-10004-4393900109/#colour=BLACK) inspired many imitations. You might be pushed to find something similar now - [this](https://www.zalando.co.uk/evenandodd-platform-ankle-boots-black-ev411n0k2-q11.html) was the closest I could find - but the cut out style is coming back in a slightly different way. [This](https://www.ganni.com/en-gb/black-chunky-buckle-open-cut-boots-black-S222409935.html) is the modern iteration.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Logical-Layer9518",
                            "body": "Those Ganni boots are 🔥.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "piedraazul",
            "body": "Hey ladies! I’m looking for a dress that checks a few different boxes, and I was hoping that the hive mind could help me. 🤗\n\nI’m (mid-30’s F) going to a wedding in the mountains of Mexico. It’s going to be hot, and it’s going to be a black tie affair. This is my “fancy“ side of the family and everyone will be dressed to the nines.\n\nKeeping in mind the hot and slightly humid weather, I also need a dress that will cover my left upper arm to my elbow. The shoulders can be exposed, but my left bicep needs to be covered. So either a one sleeve dress (that covers MY left) or something that will just hide that particular area on both sides.\n\nMoreover, I am only 5’3, about 130 pounds and busty (34 DDD). I found some off shoulder dresses that could work, but they have a ton of cleavage and that’s not going to fly around my Mexican family who I haven’t seen in 10 years. Ha ha. Some cleavage is totally fine.\n\nAny ideas/links appreciated!! I have dark hair and a tan complexion in the summer so I can get away with a variety of colors. I have a bunch of fun/neutral heel options between my mom and I’s shoe stashes, so no problem there. Thank you!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "im_avoiding_work",
                    "body": "Jenny Yoo has some dresses that I think would fit this, including a couple with one left sleeve, like [this one](https://www.jennyyoo.com/products/wedding-guest-dress/carrera?type=available&color=EMD) and [this one](https://www.jennyyoo.com/products/bridesmaids-dress/lyric?type=available&color=CMB). Anthropologie also has this summery [one sleeved option](https://www.anthropologie.com/shop/bhldn-iris-one-shoulder-cut-out-printed-chiffon-gown?category=bhldn-shop-all-bridesmaid-dresses&color=068&type=STANDARD&quantity=1). Or you might like [this](https://www.thereformation.com/products/winslow-dress/0503333LCU.html?dwvar_0503333LCU_color=TEA&quantity=1) Reformation dress",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "piedraazul",
                            "body": "Nice finds, thank you!!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "buddy_cheeks2",
                    "body": "Do you have a budget in mind?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "piedraazul",
                            "body": "I would love to stay under $250 if possible. I hoped to find something through Lulu’s as their dresses tend to fit me great and they are very budget friendly, but no luck!",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "buddy_cheeks2",
                                    "body": "You should check out Rent the Runway and see what might work for you! Lots of options if you don't mind renting.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "piedraazul",
                                            "body": "I hunted around there with limited luck, but I’ll dig deeper tonight!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "oat-beatle",
                    "body": "I'd go for something with two sleeves. I sometimes want to cover my left shoulder and for some reason the *vast* majority of asymmetrical dresses cover the right shoulder/arm.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "piedraazul",
                            "body": "Thanks! I noticed that too. I should have gotten my tatt on the right side. 😂",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "zurriola27",
            "body": "Visiting NYC for memorial weekend (first time as a tourist, only been one other time for work). What is the level of formality for:\n\n7 PM Broadway show (Book of Mormon)? \n\n10 PM jazz club (Village Vanguard)? \n\n(These are on separate days!) Not sure if both of these are like a jeans and going-out top type places or should I dress up a bit more?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "symphonypathetique",
                    "body": "People wear all sorts of levels of formality to Broadway shows, so IMO jeans + going-out top would be appropriate.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "75footubi",
                    "body": "Broadway is very much \"come as you are\" except for gala performances.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "According to trip advisor, Village Vanguard is casual/no dress code, so jeans and a nice top sounds perfectly fine!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Spiritual-Chicken-44",
            "body": "I am 5'6\" with a somewhat exaggerated hourglass figure that I've been hiding for the past 15 years or so because of body shame, fear, insecurities, etc. I'm trying to take back some of my agency and try new things with my style for the first time in my life and have a major question: with my body being how it is (very curvy, but also kind of tall), is it acceptable or appropriate to wear shirts completely tucked into my pants, accentuating my curves, in a business-casual work setting? Is it distracting or off-putting? I just literally don't know and feel scared to try anything with how my body actually is. I typically wear very baggy clothes atm. When I tuck shirts in, I notice that this actually accentuates my waist a lot and looks nice, but... save it for outside occasions? Okay for work? Too much? Please help lol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "symphonypathetique",
                    "body": "As long as it's not skin-tight or showing lots of cleavage, you should be fine!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I think as long as bare skin isn't showing and underwear lines aren't visible, it's okay.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "District98",
                    "body": "I wear shirts tucked in! If they’re on the tight side I’ll typically put another layer on top like a cardigan or blazer.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Federal_Yogurt2706",
            "body": "https://preview.redd.it/4f63xjaz8v1d1.jpeg?width=3024&format=pjpg&auto=webp&s=608964bcaac292ce8fad580993730400dfd1c8dd\n\nI need help choosing an outfit for my son’s first birthday.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Federal_Yogurt2706",
                    "body": "https://preview.redd.it/oz7t9d859v1d1.jpeg?width=3024&format=pjpg&auto=webp&s=1e1ee82860aa5231ed78b6c1da828bcc6b28ef20\n\nAlso how do i style them?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fir6987",
                            "body": "I love the dress! The blouse/pants are fine too although I think if you had lighter pants it’d look better. Black on white is very high contrast and makes me think more of office wear. \n\nFor styling - do you have fun shoes/sandals? If you can add a pop of colour that way that’d be great. The dress has a keyhole detail already, so I wouldn’t add a necklace, but you could do bangles or dangly earrings.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Federal_Yogurt2706",
                                    "body": "Thanks, great suggestion with the pants. I’ll wear the dress! I was thinking a gold open toe heels with gold hoops or pale pink platform sandals. Wdyt?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Olander-e",
                                            "body": "Love the dress on you- a perfect fit! \nTry out the gold combo and give us a shout?",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "fir6987",
                                            "body": "Yes, gold would be snazzy!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CultivatingBitchery",
            "body": "Office/ business casual \n\nLooking for help sourcing ideas for business casual clothing that still fits in my style that I normally wear. I’m usually dressed in alt/gothic or 2000s core club fashion type stuff. clothes and while I love my corporate goth clothes weather out here gets to be around 110F on the daily and most business don’t have AC just fans. \n\nIf I had to use celebrities to explain think Kesha, Vanessa Hudgens, Taylor Momsen, and Bridget Mendler all in the Mid 2000s. \n\n\nI have a very limited budget so outfit ideas are my key point just so I can find prices at lower cost places or goodwill. Basically inspiration ideas on how to make this fit an office setting. Please help!!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "woodsywoods4",
                    "body": "Hey fashion twin! This year I've also tried to marry my personal fashion with my office wear and Vanessa Hudgens is my Pinterest queen for outfits. I haven't found one store in particular that marries both well but i love whimsy & row mixed with disturbia clothing. Ive also made sure I'm only sourcing linen and cotton so I'm not dripping in sweat. I'll see if I can link some previous reddit threads that helped me find more alt stores to blend with my fav bohemian stores\n\nAs promised: \nhttps://www.reddit.com/r/femalefashionadvice/s/ZErmBxIuSO\n\nhttps://www.reddit.com/r/ethicalfashion/s/pdiGRmiZPn\n\nhttps://www.reddit.com/r/femalefashionadvice/s/7tiP7ASTlt\n\nhttps://www.reddit.com/r/ethicalfashion/s/pmlOFVT4Wz\n\nhttps://www.reddit.com/r/femalefashionadvice/s/OG9UYpKvgP",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CultivatingBitchery",
                            "body": "Thank you so much!!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "otterperson22",
            "body": "Hi all! Does anyone know of tank tops similar  to the Bernie Tank from Resa? I love that it’s cropped but flares out a little so it’s not form fitting all the way down. I just don’t want to spend $68 on a tank top!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AmazingGene7755",
            "body": "\n\nHi all,\n\n\nI really want to find out what kind of aesthetic in clothes would suit me, but I can't figure it out. If anyone could help me, I'd really appreciate it!\n\n\nAge: Early 20s\nHeight: 5'4\"\nBuild: Average (not skinny, not curvy, but with thicker thighs and a bit of a belly)\nSkin tone: A bit dark\n\n\nI generally prefer wearing jeans, skinny jeans, and pants with tops. I don't like showing too much skin—a little is okay, but not too much.\n\n\nAny advice on what styles or aesthetics might work well for me would be great!\n\n\nThanks in advance!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCherryMagic001",
                    "body": "Nearly every style can work for you, it mostly depends on how you style it.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Make a pinterest board of outfits you like and could see yourself wearing (don’t pin outfits with crop tops if you don’t want to wear those).\n\nOnce you have a bunch of pins, if there are several distinct styles in there, sort them so everything in the same/similar style is grouped. \n\nTry making outfits in the different styles you’ve identified. Use clothes you already have, or you can go on a “research” outing to shops to try on clothes/make different outfits. The aim isn’t to buy anything yet, just try on clothes that fit with the style you’re trying out and take lots of photos. \n\nRepeat for all the styles you’re interested in! If you take photos as you go along, you have an easy way to review everything - what do you like best after going through all this? And what would be most practical for your lifestyle as well? Once you have a pretty good idea of what you want, go through your closet and figure out what you have that fits with that before you shop for anything new.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Withering_Lily",
            "body": "I have a highly unusual fashion challenge to contend with. This August, I’m going to be spending three days camping, sword fighting and hiking in the Canadian wilderness all while cosplaying as a common foot soldier from a Middle Ages era mercenary company.\n\n\nThis means I need to put together a costume that not only looks convincingly on period but also is truly practical and comfortable for all of the outdoorsy activities and actual sword fighting I’ll be doing while wearing it. I also only can really afford to shop at thrift stores and resale sites such as Poshmark. So how do I go historically accurate-ish Middle Ages soldier utilizing modern made thrifted clothes and keeping my practicality constraints in mind? What types of garments and details should I be looking for to achieve the aesthetic in a way that meets my needs? Additionally, is there a way to slightly feminize the look without losing out on practicality or accuracy?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "Maybe bring this question to the Ren faire sub? Folks there are pros at putting together outfits for three days of walking around dusty/rocky places and sometimes performing sword fighting demos, horseback riding, etc.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "Idk if this is historically accurate, but a linen tunic, leggings, boots, and belt seem like things you could thrift.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "booksandwriting",
            "body": "My friend owns a lot of beautiful shoes and I want to order some for myself. I’m trying to decide what to get based off of what she has. I want 3 different pairs and I can customize them. \n\nHere is a [link to the album of shoe options](https://imgur.com/a/2Zvxgqv)(there are 24 different versions to choose from).",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "What kind of shoes do you want? Every day shoes? Fancy event shoes? Something in between? What goes with your existing style?",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "engshowcase",
                    "body": "I like options 6 (Black, gold, and gingham), 12 (red suede ankle straps), and 20 (tan lace up boots).  \nI think they could go with a lot of different outfits but are still unique.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Bella_HeroOfTheHorn",
                    "body": "I can't imagine wearing any of these shoes but if I had to pick one, the flat pair of pink and white oxford brogues would be most wearable to me! I can picture those with skinny jeans or work pants or frilly skirts.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "healinghobbit",
            "body": "Hello, I'm trying to decide between two miniskirts that I consider investment pieces. Ill put the links below. I am very skinny, tall and without hips ( a rectangle, basically). My season is between dark autumn and true autumn. I am a kibbe Pure Dramatic. I don't really know what my style is, I want to look my age (28) and put together but not strict but I want to keep wearing this mini as long as I can and wear it with both tshirts, blouses, shirts, jumpers in winter... Please, give me your opinion\n\n[https://img01.ztat.net/article/spp-media-p1/5fac598b3ba940cd8c9e043814b7fe7e/85025ff3562841b0b01743b032252204.jpg?imwidth=1800](https://img01.ztat.net/article/spp-media-p1/5fac598b3ba940cd8c9e043814b7fe7e/85025ff3562841b0b01743b032252204.jpg?imwidth=1800)\n\n[https://img01.ztat.net/article/spp-media-p1/5755b8cf89344507b4439933338a865f/bb3db69cca1244fea4cfab0eefbe8b1f.jpg?imwidth=1800](https://img01.ztat.net/article/spp-media-p1/5755b8cf89344507b4439933338a865f/bb3db69cca1244fea4cfab0eefbe8b1f.jpg?imwidth=1800)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fir6987",
                    "body": "1st one looks cheaper and trendier (cargo pockets). 2nd one looks like a better option if you want it as a mainstay in your wardrobe.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "healinghobbit",
                            "body": "Thank you. It's also the most expensive one :')",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "engshowcase",
                    "body": "I don't know much about Kibbe body types, but I think the cream mini skirt would be more versatile in your wardrobe if you are going for an investment piece.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "symphonypathetique",
                            "body": "I agree, I think it's more sophisticated.",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}