{
    "title": "Modern ways of styling a bandana?",
    "comments": [
        {
            "depth": 0,
            "author": "PeachyPants17",
            "body": "I wrap these around my ponytail to spice up my look on days when I don’t want to wash my hair :)",
            "score": 13
        },
        {
            "depth": 0,
            "author": "savvyjiuju",
            "body": "I like to twist, roll, or fold one along the diagonal to make the correct width for a headband and wear that on low-effort-hair days. Also a fan of tying one onto a bag handle.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "stellalunawitchbaby",
            "body": "I like wearing them around my neck, ties with either the ends out in front or tucked in entirely.\n\nI also like taking a ring and wearing a bandana around my neck sort of like a bolo tie. \n\nIn hair - I like to tie it to the elastic (or just tuck it into the elastic and let it join a braid or bun to add some interest, or tie it around a bun like it’s a big scrunchie.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "intessen",
            "body": "Most common: around a ponytail or bun, or as a kerchief hat\n\nFavourite: I love looping bandannas through the two front belt loops of my jeans on one side and using them to cinch in the waist. Keeps my pants up and gives a pop of colour at the waist line. \n\nI also have folded bandannas and tied them around my wrist as a bracelet. I've also seen it used as an anklet, although haven't used that before.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "SpiceGirls4Everr",
            "body": "I love layering and that's hard to do in the summer so a bandana around the neck is a summer staple for me. As a bonus it catches sweat and if you're super hot or doing stuff outside all day get the bandana wet and then tie it loosely around your neck. in the summer I don't like the knot being too close to my neck.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "chillaryyy",
            "body": "they’re cute to tie around the handle of a bag for some extra color to your outfit!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "mini-mal-ly",
            "body": "Favorites: folded lengthwise into a trapezoid and looped under a hair tie into a ponytail or bun, double knot around the neck, tied to a handbag\n\n\nUnique: around the wrist or ankle as a fabric accessory, looped through a necklace in various ways (could interlock them so it's 50/50 scarf and necklace, or twist them together so it becomes a multi strand), tied onto a belt loop, pocket square",
            "score": 1
        }
    ]
}