{
    "title": "Tips for a more “lived in” wardrobe? ",
    "comments": [
        {
            "depth": 0,
            "author": "beginswithanx",
            "body": "It sounds like you’re looking for high quality basics that aren’t too trendy? Natural fibers, higher quality brands, clothing that has linings, thoughtful details, etc. I’d find brands you like (but can’t afford new), figure out your size, and then look for them on Poshmark.\n\nThis also feels like you’re describing when the person “wears the clothes” instead of the clothes “wearing them.” That’s in part just figuring out your personal style and what works for you. Take a look in your closet and notice what you reach for again and again (pants? Dresses? Masculine tops?) then see if you can find “upgraded” versions of them new and then hunt for them used online. ",
            "score": 183
        },
        {
            "depth": 0,
            "author": "kimchi_paradise",
            "body": "Something to consider is that if you purchase pieces secondhand, they may already have this look that you are trying to achieve. \n\n\nYou can get really high quality clothing that gives that \"used\" look for a cheap price",
            "score": 80,
            "replies": [
                {
                    "depth": 1,
                    "author": "LittleMsSavoirFaire",
                    "body": "I prefer to buy used clothing for this reason. It's been laundered and worn some number of times, clearly held up well, and you can see the real shape and drape of the garment rather than whatever coatings or sizing were applied at the manufacturer. ",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CherryBeanCherry",
                            "body": "I never understood why my thrift store purchases work out better than things I buy new. Thank you for explaining it!",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "theagonyaunt",
                    "body": "This is how I get a lot of staple pieces for my wardrobe; I have a wool winter coat and a London Fog trench coat, both of which drape beautifully because they're probably 30+ years old and had at least one, if not multiple owners.",
                    "score": 12
                }
            ]
        },
        {
            "depth": 0,
            "author": "SapientSlut",
            "body": "I think tailoring is a huge part of this. If a new shirt is hanging off of you in weird ways, or if a purse strap is really stiff/laying weirdly, it’s not going to look lived in. \n\nGood fit/tailoring is half the battle IMO - if something fits you perfectly, it’s going to look like *yours*.",
            "score": 54
        },
        {
            "depth": 0,
            "author": "thumbtackswordsman",
            "body": "Lived-in would mean worn, rough-around-the-edges as opposed to brand-new, starched and ironed. Maybe what you mean is when the wardrobe looks like it perfectly matches the owner like when the colours always make their skin and eyes glow, the shapes flatter, and the pieces are tailored to their body?",
            "score": 104,
            "replies": [
                {
                    "depth": 1,
                    "author": "DeepOringe",
                    "body": "I'm imagining Stanley Tucci walking around Italy... perfectly fitted and fabrics clothes that look perfectly cared for but not fresh off the rack!",
                    "score": 47
                },
                {
                    "depth": 1,
                    "author": "bojenny",
                    "body": "I think people underestimate how much of a difference it makes when your clothes fit well. I’m in my late 50’s and every very wealthy person I’ve known has a tailor. No matter what their style or body shape they look impeccable.",
                    "score": 21
                }
            ]
        },
        {
            "depth": 0,
            "author": "MsFlodo",
            "body": "Buy fewer things of great quality + wear them lots over time. If you truly want to cultivate an authentic “lived in” wardrobe and signature style, you can’t take shortcuts. Only welcome pieces that you really love and commit to them - wear them, care for them, mend them. Over time, they will look and feel like a second skin.\n\nSome tips: buy vintage/secondhand/small brands, look for materials that wear in and patina nicely (leather, wool, denim, etc.), cut out filler fast fashion purchases, only buy things you can see yourself still wearing in 5 years, limit your purchases to 5-10 great pieces each year, learn about mending and tailoring.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "EbbAdministrative983",
                    "body": "This is great advice! One way I try to achieve this is by only keeping pieces that are a 9 or a 10 to me, nothing below. If I don't feel 100% comfortable or \"myself\" in something, it's getting returned / going back on the rack.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Cheap_Intention_4936",
                    "body": "Great advice, thank you.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "District98",
            "body": " > I feel like in the age of fast fashion, for the average person this look is hard to achieve. \n\nI think it’s more about effort and intentionality with your clothes than price point. For example, well styled linen from Old Navy isn’t expensive and can have this vibe. Going another direction, Athleisure can be good for this and the REI secondhand page has lots of options. \n\nAside from fit and curation, taking care of details like steaming clothes, appearance on point, etc. are important.",
            "score": 42
        },
        {
            "depth": 0,
            "author": "abirdofthesky",
            "body": "I think I know what you mean - like every item is an old favorite but they all work so well and seem to elevate each other? Like a perfect pair of flowy trouser pants and an oversized shirt that together look architectural and high fashion not slobby. No idea how to get it outside of investing in good quality pieces and tailoring, but I’ve seen friends achieve it with lucky finds in thrift stores and even lucky fast fashion finds. ",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cheap_Intention_4936",
                    "body": "Yes, “like every item is an old favorite but they all work so well and seem to elevate each other” is exactly what I mean! Thank you for articulating it.",
                    "score": 12
                }
            ]
        },
        {
            "depth": 0,
            "author": "thenfacetoface",
            "body": "To me it sounds like you are aiming for a wardrobe where every piece makes the wearer comfortable and represents their style, so that they can almost reach in their closet and pick out anything and it’s so stylish that they can “disappear” into it. \n\nI get this feeling when I wear clothes I know look good and represent me, so that I don’t even think about what I’m wearing and go about my everyday stuff. \n\nI know that some clothes just feel like coming home to myself (not necessarily coming home after a long day if you know what I mean) \n\nMy tip is to ask yourself will I reach for this. Not just is this physically comfy but that and a je ne sais quoi representing your style. \n\nI ask myself (aside from worrying about it getting dirty) would I feel cute washing dishes and doing laundry in this . I can keep my nice clothes on if I wear an apron over it when I do such tasks. \n\nA lot of this is trial and error. Something that looks comfy and your style may just not work. Look for stores with excellent return policies.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cheap_Intention_4936",
                    "body": "Yes, that is definitely my overarching goal! To wear clothes that I KNOW look good and represent me, so I don’t even think about it - great way to put it.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "fir6987",
            "body": "1. Figure out what you look good in/what feels good to you. This can take a lot of time and effort. \n\n2. Buy high quality pieces. Go slow and only add a few things at a time, especially if you don’t have your style all the way figured out yet. Curate your wardrobe down so everything works well together, because if you have the perfect pieces + 100s of meh pieces, you’re going to get distracted and feel dissatisfied with your closet. \n\n3. Wear your clothes, frequently, over multiple years! Take good care of everything and repair things that need to be mended. Note: if you’re afraid of wearing your clothes because they’ll get messed up, it’s possible that your style and lifestyle are incompatible and you need to go back to the drawing board for a more functional style that fits your life.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "HostCharacter8232",
            "body": "Natural fabrics, minimal (imo none) trends, don’t constantly buy new clothes, take time deciding, at least 2 months is good I think unless you know you’ve needed the piece for a while, I think juxtaposition helps, mixing masc w fem elements like denim and lace. Are you looking for a r/capsulewardrobe ??",
            "score": 18
        },
        {
            "depth": 0,
            "author": "Confident_Yellow584",
            "body": "Do you already have any pieces that you love this much yourself? I think a lot of this is about commitment to your own wardrobe. Maybe wearing things you already like in different ways rather than buying new things? Do you ever repair clothing/shoes or have things repaired or altered? I think this attitude to maintaining what you love is one factor. \n\nI think you’re describing a style expression of someone that has a good fit between their personality and environments they exist in, so they can express themselves and also maintain relationships. Maybe some focus on actual activities throughout the day without a lot of extra time devoted to fashion. \n\nHave you looked at prep/ivy? Not necessarily from a purely aesthetic perspective but also values and history? There’s a good season of the podcast Articles of Interest on Ivy style. ",
            "score": 3
        },
        {
            "depth": 0,
            "author": "muffingr1",
            "body": "Invest in the best quality pieces you can afford. This means spending time to search for the perfect piece and saving up for it. I shop almost exclusively secondhand to be able to afford the clothes I want. Don’t settle for the dupe, you won’t wear it as much as the item you actually want. I have a list of clothing that I want to add to my wardrobe and periodically check The Real Real, Vestaire, and Poshmark for deals. For example, I’ve been searching for a leather blazer/duster for 2 years and still haven’t found one that meets all my criteria. I’ve had plenty of time to consider it now that the leather blazer isn’t as trendy as 2-3 years ago, but my desire to have one hasn’t decreased so it further affirms my future purchase. \n\nBe realistic about the level of care that is required to maintain quality clothing. Nice clothes require handwashing, dry cleaning, de-pilling and other maintenance. If you aren’t willing to do these things, your clothes will wear poorly even if they’re well made. There are workarounds to minimize the amount of work (steaming instead of dry cleaning, wearing an undershirt under sweaters) but you still have to do it. \n\nLife is short, wear your clothes. Don’t save things for special occasions. Train yourself to incorporate the nicer items in your wardrobe into your daily outfits. Mixing high and low gives the fashionable/functional vibe.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cheap_Intention_4936",
                    "body": "Wow, this is great advice, thank you. I especially like “life is short, don’t settle for the dupe.”",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "daddy_tywin",
            "body": "1. Pick good fabrics that are designed to be washed and improve over time, like silk jersey or linen. Nothing ever got “lived in” that spent a lot of time at the dry cleaner. \n2. Only wear Your Silhouettes. Separate the type of fits your aspirational self longs for from the ones that complement the body you have, and then buy only things in those cuts. That’s the easiest way to make sure your clothes are compatible vs competitive and don’t end up wearing you. \n3. List the categories of item you feel are essential to your style. I do this by pretending I’m describing a book character and thinking about how they’d be dressed every day for a week, only it’s me (I have main character syndrome everybody!!!). Pick your perfect thing in each category. Cherish that thing. Wear the shit out of it. Less selection in fewer categories = more wear = more iconic items. \n4. Pick a color palette and stick to it. Having clothes that go with all your other clothes means your entire wardrobe is more wearable on an everyday basis. \n5. Go have some adventures in your clothes. Book an impulse trip. Rent a convertible. Kiss someone exciting. Stay up too late with a friend. Get weird. Clothes that have memories in them feel more special than clothes that don’t, which is why I never “save” my good clothes. Always wear them on any day where something interesting might happen so that they can be imbued with the fire of your lived experience. In fact, I think wearing them often puts you in the right mindset to *make* something interesting happen for yourself, and then the outfit gets to carry that forever.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cheap_Intention_4936",
                    "body": "Wow, very helpful!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mfball",
            "body": "I don't know for certain that I'm grasping the vibe, but I think you could accomplish this by finding nicer pieces secondhand than you'd buy new, focusing on quality construction and natural fibers. In my experience, natural fibers and materials \"break in\" while synthetics \"wear out,\" so the sort of comfortable ease I think you're describing is easier to achieve with the drape of cotton, wool, linen, leather, etc.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "nenzshejensbsk",
            "body": "Just buy the highest quality pierces you can afford and which suit your shape and vibe - regardless of what's in fashion these will always look good on you",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bmcarson",
            "body": "One thought I’ve not seen mentioned here is to narrow your color palette a bit. A few years ago I created a capsule wardrobe and picked just a couple colors to focus on, even going so far as to exclude one or two colors I liked wearing. Now everything in my closet goes with just about everything else and gets worn all the more for it.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "No_Investment3205",
            "body": "I have stopped compromising on quality and I only buy natural fibers now. My wardrobe looks much more lived in and despite my style being on the casual side, there is an elegance to it that was lacking when I was letting my eye wander to trendy instant gratification pieces.\n\nAlso make sure you’re shopping by feel. You’re going to wear things that make you feel good, while everything else is going to sit in your closet taking up space.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "claire_at_ftrref",
            "body": "There are two fashion people who I think have really good advise around finding \"3 words\" that represent your style. One is stylist Alison Borenstein and the other is Amy Smilovic who started Tibi and has a great newsletter. they both have slightly different takes, but the idea is that you find 3 words that represent your style and 'vibe' and find clothes that you feel fit one or multiple of those 3 words. That way, when you put things together, they always feel like you. Of course those words can change over time, but thinking about them in the background helps you create personal style without buying the exact same item over and over.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Longjumping-Olive-56",
            "body": "I always love clothing that has a bit of visible wear - not tatty, but looks like it's been loved and worn. The way linen gets a certain patina when it's aged, worn denim, leather with creases, leather shoes that look really well worn in, handbags that have crumples and bulges, even a few rough/worn edges on shirt cuffs etc where the fabric has abraded. You can't fake these effects easily, and they give the appearance of an item that has been around for a long time and been loved well. Plastic never ages well!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "shitbloodnut",
            "body": "Theres actually an american eagle collection called lived in and i love it",
            "score": 2
        },
        {
            "depth": 0,
            "author": "CherryBeanCherry",
            "body": "Only.buy things that make you say, \"Hell yes,\" when you try them on, and only keep things you actually wear and like.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hennipotamus",
            "body": "Can you share some more specific examples? I feel like this could mean different things.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cheap_Intention_4936",
                    "body": "Hmm, ok an example off the top of my head. Leather jacket that you’ve had for a few years, wear it out on the weekend to a bar, to a wedding in case it gets chilly, or for a quick coffee run over a workout set.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "dancingmochi",
            "body": "I think working with a stylist can help speed up the process of identifying your style and what to look for when shopping. You can also read books and look for resources to learn more about fashion (ie, what good construction looks like, how are clothes supposed to fit and drape, how quality has changed over time and therefore what details to look for and why, how to mix colors, how to build different silhouettes, how to make closet staples more versatile). Other than that, just keep pinning looks that you like and keep trying on clothes in store to identify what shapes and colors you like on you.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "bigbird2003",
                    "body": "This. Best money I spent was working with an image coach who eased the way for me.  We did an in-person consultation around color, style, image, tonality, draping; garment details,  shapes and ultimately my style north star.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ArdenM",
            "body": "Sounds like you are looking for linen, cashmere, and natural fabrics with flow made with care  - Eileen Fisher kinda vibe. If you are looking for deals, look for items on eBay, Thred Up, Poshmark etc.",
            "score": 0
        }
    ]
}