{
    "title": "Outfit repeating",
    "comments": [
        {
            "depth": 0,
            "author": "clarifythepulse",
            "body": "I definitely wear the same pants for multiple days all the time, I don’t even think about it. Same for jackets or layering pieces. But the most I typically repeat a more distinctive item, like a top or a dress/skirt or the exact same outfit head to toe, is maybe once a week, and even then I give it a rest after a while",
            "score": 248,
            "replies": [
                {
                    "depth": 1,
                    "author": "AnnieAnnie666",
                    "body": "I tend to wear clothes that make me feel comfortable. I wear the same clothes and pants again and again, but I change the style and color combination.",
                    "score": 36
                },
                {
                    "depth": 1,
                    "author": "No-Group6701",
                    "body": "Ok. I have 2 pairs of pants that aren't leggings that I really like, so that's mainly why I was wondering if it was OK.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "georgethebarbarian",
                            "body": "I have three pairs of the exact same pants. They’re all I wear 🤣 nobody cares",
                            "score": 52,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nikki908",
                                    "body": "Literally will be going out of my way soon to buy the same pair of jeans I've been wearing all the time because they fit and feel so perfect. Also, the whole point of clothes for me is the fact that I can repeatedly wear things!!!",
                                    "score": 7
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "apri08101989",
                                    "body": "This... Seems like the absolute wrong sub to be giving this advice or be coming to if you want to ignore the fashion girlies...",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "estimatingoctopus",
                                            "body": "Right. Like don't we all live by Kate telling Lizzie that she's an outfit repeater.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PoppyHamentaschen",
            "body": "It's okay to wear the same pants or skirt with a different top. Men wear business suits and only change their shirt and tie.  I do seasonal capsule wardrobes: I have four skirts I wear during a season, and I pair them with different tops, so obviously, I'll wear the same skirt more than once in a week. What is important is cleanliness: If your top is whiffy, if your clothes have a stain, it's not okay to rewear.",
            "score": 77
        },
        {
            "depth": 0,
            "author": "Most_Ordinary_219",
            "body": "When I find clothing that fits well, comfortable, and looks pulled together, I usually try to buy it in all colors. I have the same exact style linen top in 6 colors and 4 prints! I wonder what people think about that. Lol 😂",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "Structure-Impossible",
                    "body": "Does this truly work for you? I always end up regretting this, because one always ends up being my actual favorite (usually the first one I got, that made me love the garment in the first place) and then I feel “sad” that I “have to” wear the others! \n(Genuinely asking by the way, not judging! I’ve taken to buying multiples of the same thing in the same color, so if anything I’m “worse” lol)",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ItsAndieHere",
                            "body": "I’ve actually solved this problem by picking a few staple colors to stick to — I wear a lot of white, black, warm beige neutrals, and my “pop of color” is usually pink or red. So if I really like a top, for example, I’ll pick it up in black and white; and if I find that I *love* it, I might go back a week later and find it in brown and red. But if it’s available in, say, lime green? No. Orange? No. Loud print? Also no. I know I’ll regret those colors that are harder to match, even if I love the garment itself, so it’s not actually helpful to building outfits for me to have that top in those colors.\n\nSticking to a color palette also means the colors I have for tops match most of my bottoms. Whole wardrobe becomes more mix-and-match when that top in black or pink goes well with both jeans and a black skirt, and I also have the top in white to go with the jeans for a clean look, etc etc..",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SassCupcakes",
                                    "body": "Yes! A color palette has been huge for me. I’ve streamlined my wardrobe so much, and I wear so much more of my clothing now.",
                                    "score": 7
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Most_Ordinary_219",
                            "body": "I know what you are saying. Definitely some colors look better on me than others. I probably wear my favorites the most and then when they are dirty, I will wear the others. 😂",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cyborgfeminist",
                    "body": "I love this. I finally found a flattering t-shirt for me and got 4 in white (I know they won't stay white long) and 1 in black. I like to pair them with a pair of linen pants (3 pairs in all 3 practical colors, not white!) or a pair of black cotton pants that fit just like the linen pants. This has been my go to for the last month as the weather has gotten nice!\n\n  \nI've been wearing 1 linen shirt with this combo almost every day. I just ordered that in another color, too. Summer dressing is now all figured out for me.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Most_Ordinary_219",
                            "body": "Sounds great!!",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Redivy66",
                    "body": "I do this as well since I have broad shoulders and sleeveless tops can be tricky. Can you tell me the brand of the linen tops please?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Most_Ordinary_219",
                            "body": "Do you mind if I message you?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Redivy66",
                                    "body": "Nope please message away",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "anonymous042024",
            "body": "I think same pants with a different shirt works. We have shirts provided by my employer for work, black only. So everyday of the week, I look like I’m wearing the exact same outfit and never change ;)",
            "score": 18
        },
        {
            "depth": 0,
            "author": "SassCupcakes",
            "body": "One of the best pieces of advice I’ve ever gotten: people don’t think about you *that* much. Not that they don’t like you or care about you, they’ve just probably got enough of their own stuff going on to not notice that you wore that outfit the other day.\n\nI usually give my clothes a couple days in between, but apart from socks and undies, I wear everything 2-3 times before washing (save for the next few months because it’s officially “too hot to rewear anything” season in Arizona). Over washing is probably worse for your clothes than wearing them again.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "lazy_berry",
            "body": "for the most part people aren’t paying that much attention to you. there’s definitely nothing wrong with wearing the same pants or jacket multiple days in a row. i wouldn’t wear the same shirt for more than one day for smell reasons, and people will likely notice if you were the same outfit head to toe for several days straight.",
            "score": 24
        },
        {
            "depth": 0,
            "author": "Merilynelle",
            "body": "I sometimes wear bottoms multiple times, but change my top everyday. When I wear a dress, I also change it the next day. Not necessarily because it needs to be washed but because I enjoy choosing a new outfit everyday. In summer though I wash all tops after one wear.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "daddy_tywin",
            "body": "I have a max 1 wear per week policy so I look like I put effort in. I notice all the time when people repeat, but it’s not like I care.",
            "score": 43,
            "replies": [
                {
                    "depth": 1,
                    "author": "symphonypathetique",
                    "body": "Same, as a Fashion GirlieTM, I notice people's clothes, including when they outfit repeat, but as long as it's not dirty/torn/etc. it's not a positive/negative judgment -- just an observation.",
                    "score": 25
                },
                {
                    "depth": 1,
                    "author": "randomwordfromabook",
                    "body": "Same.\nIf you re-wear an entire outfit often enough to worry whether people are noticing, they likely are.\n\nNow if you repeat a piece or two, like a sweater or pants, that's fine. \n\nAlso imo some outfits are more forgiving, in the sense that say a crisp white top is obviously higher maintenance to keep clean looking, so you must have washed it in between wears. If that makes sense.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "little__boxes",
            "body": "In my last position as a maitre'd I bought 2 of the same suits and 6 blouses. That was my self mandated uniform 5 days a week. Nobody cared.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "hizuhh",
            "body": "I am a chronic outfit repeater, but not with the same outfit multiple days in a row. Apart from denim and wool I need to wash everything after I wear it once. Sometimes I notice when other people repeat outfits but it's never a negative thing, more of just an observation, so I'm not really worried people will think negatively about me either. I also don't like to have a billion prices of clothing (trying to be sustainable lol) so outfit repeating is bound to happen anyways, and re-wearing outfits that I know look good on me can really speed up my mornings",
            "score": 6
        },
        {
            "depth": 0,
            "author": "cookievannie",
            "body": "i have this reaaaally long black skirt and cropped black tank top that I wear ALL THE TIME like consecutive parties, dinners, meetings, errands. same combination, same bag, sometimes different shoes depends on how long the drive is. i just can’t stop wearing it cuz the skirt really makes my ass really good and it’s got good curves and very soft for the skin. when I wear it multiple days in a row, i make sure that it’s with different people (except family). you’ll be good.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "mrskmh08",
            "body": "Just get it in another color",
            "score": 6
        },
        {
            "depth": 0,
            "author": "AptCasaNova",
            "body": "I wear pants and shorts consecutively all the time. Last summer I found a magical pair of jean shorts with 4 functional pockets and pretty much wore them all summer with different tops.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "gnyaa",
            "body": "Just say you’re channeling Steve Jobs.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "europahasicenotmice",
            "body": "I tried to do this this as a kid and my mom wouldn't let me. I'd find a skirt I loved and wanted to get it in two colors, and she would make me pick one color and find a different second skirt. I'd wind up with some things I loved and some things I never wore. \n\nNow if I find something that works for me, I am buying multiple versions. It makes coordinating outfits so much easier. Silhouette is one of the hardest things for me to get right, so if I find a top that works with pants I know I want to wear all the time, why wouldn't I make it easy on myself? \n\nSo long as your clothes are clean, I can't imagine caring about the opinions of anyone who would insist that you change it up more. That sounds like fast fashion for consumerism's sake.\n\nI think the only thing that you should worry about is whether your clothes are clean and whether YOU are bored with your style.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "corianderisthedevil",
            "body": "What do you mean is it OK? Many people wear the same 3 suits to work for years.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "pwnkage",
            "body": "I always wear the same outfit over and over, nobody cares, unless you have judgmental people in your life. Like I had a so-called best friend during high school who was very critical of my clothing choices. But aside from that it’s socially acceptable and should be made more acceptable, because honestly who needs that much clothes.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "Next_Yam_4592",
            "body": "If you wear the same outfit for multiple days in the row, people will think you don’t care about cleanliness, or don’t care at all. It gives off depression vibes. Black jeans can get a pass. If you’re a male, you can get away with a less diverse wardrobe.",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "georgethebarbarian",
                            "body": "Multiple days in a row at work or school in the exact same fit is definitely questionable. I know my clothes get smelly after two wears.",
                            "score": 23
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "80aprocryphal",
            "body": "Someone asked something similar years back & I'd say rule of thumb is put enough space between wearing things that you could have arguably washed ot in between wears.  For something like pants, if someone says anything you can just say you have multiple pairs. \nIf you try thinking about what last few outfits the people in your life wear, you can get the sense of how little brain space people use for that- personally, I only notice if a peice is particularly interesting or flattering. The important thing is to be thought of as residing within the normal standards of hygiene, since that really can impact how people think of you.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Nikki908",
            "body": "I wear the same 2-3 pair of pants all the time, and rotate between 2-3 pairs of shorts for the summer too. And that doesn't mean I'm rotating between the 3 every day. We're talking the same jeans days in a row, or whenever I feel like a different outfit. I often rotate shirts/tops though.\n\nI wash my clothes and keep myself clean. If you're a full grown adult in the adult world, no one who matters will care (unless you're stinky lol)",
            "score": 3
        },
        {
            "depth": 0,
            "author": "d4n4scu11y__",
            "body": "I wouldn't wear literally the same entire outfit multiple days in a row, but wearing an outfit again with a couple days in between is extremely normal. I also definitely wear the same pair of pants multiple days in a row.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "TeresaSoto99",
            "body": "is it ok, sure. will folks care, no. Will they notice, some will, some won't. I def would, but i'm not ur average person, i love fashion...but if ur wearing the same thing daily or close to it, i would just take u off my \"fashion radar\".",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Saturday-Sunshine",
            "body": "If it’s a really distinctive item like this has station attendant looking jumpsuit I have then I only wear once a week. Otherwise I repeat.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Schusserfloof",
            "body": "I think that most people don't even notice what other people wear. I work as a clothing designer, one summer I wore the same three pairs of shorts every day at the office. No one said anything, not sure if they even noticed. And this is at a company that makes clothing (not high fashion clothing, sports clothing).",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Structure-Impossible",
            "body": "I have no idea if people care. In my opinion, if it’s clean (which unfortunately isn’t always super easy to tell before wearing for an hour or so), it’s absolutely fine. \n\nI don’t usually see the same people multiple days in a row though, and also I wear mostly basics. I have multiples of my favorite black tee (COS clean cut) and my favorite white button down (Uniqlo rayon blend, but sadly an older version with a different composition than the current ones). \n\nThe few statement pieces I have barely get worn for that reason. Specifically I have 3 dresses that are bright and patterned, and I feel like I can only wear them maybe twice per season around the same people. That’s a me-issue though and I don’t think that’s what you’re talking about!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "saxicide",
            "body": "I'll often wear the same pants or jacket multiple days in a row, but I switch up other items so it's not the same outfit. I try not to wear the exact same outfit more than once a week.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "RockieK",
            "body": "I work with a girl who does that and was just thinking thats \"so great\". Its like her uniform.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DiagonEllie",
            "body": "I've worn the same full outfit in close succession (e.g. I go to a weekend conference and wear the exact same outfit Friday and Sunday-clean of course) and nobody has ever said anything. And I'm not talking about a plain black outfit either, I've done this with bright colors and florals. People assume you clean your clothes appropriately, and anyone who is worried about you wearing the same look too often is weird.\n\nI have a diverse wardrobe now, but there was a time 6 or 7 years ago when I dressed like a cartoon character, in that I had copies of the same outfit (one summer outfit, one winter outfit) and the only comment I got was that if someone saw me wear something else outside of work, they'd be like, \"where's your outfit\" lol.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ttururu",
            "body": "Absolutely!! Clothes are made to be worn, and if there are particular pieces you really love, it’s fun to see how many outfits you can put together with those pieces. If I really like an outfit combo, I wear it every chance I get. Sometimes multiple times a week (as long as I’m not with the same people). Only downside to wearing the same thing often is having to wash it more regularly 😂 \n\nPersonally, it’s a lot easier to wear the same bottoms paired with different shirts, than the same shirt with different bottoms. I don’t know about other people, but I would definitely remember tops worn vs bottoms. But overall, I doubt most people are paying that much attention to what anyone is wearing.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Barely_Liv_in",
            "body": "My coworker wears the same outfit all week. She says as soon as she gets home she throws it in the wash and then takes it out of the dryer in the morning. I didn’t even realize she was repeating every day until she brought it up. \n\nI also wear the same black skinny jeans to work all week because they are the only “dress pants” I feel good in and can get away with wearing.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Fearless-Cookie-8999",
            "body": " Change everyday",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rae1114",
            "body": "i’m a proud outfit repeater. i especially rewear pants multiple times a week. \n\nas long as it’s not smelly, i don’t see an issue. i don’t think anyone really notices if you rewear pants. even if someone notices and points it out, that’s just kinda a weird thing for someone to do.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Good-Jello-1105",
            "body": "Yes it’s more than ok. It’s cool. It means you like your clothes and wear them a lot. And if anyone makes a nasty comment about you ‘having the audacity’ of repeating outfits, it’s because they’re insecure. 💁🏻‍♀️💅",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BulbasaurBoo123",
            "body": "I'd say in most situations it probably doesn't matter, but in certain workplaces and social circles (especially those where status and appearances are viewed as important) outfit repeating may be considered a faux pas. It really depends on your lifestyle and goals. Unfortunately society in general is much harsher towards women than men in this regard.\n\nIt's easier to get away with outfit repeating if a. you're not interacting with the same people day to day, and b. if you wear clothes that are neutral/block colours.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Comprehensive-War743",
            "body": "I think people would notice if you wore exactly the same thing every day. My thinking on that is that they would start to wonder about your hygiene. Like when do you get it cleaned?? \nOtherwise if you have a few pieces that you can rotate in, I doubt anyone would care.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "immew1996",
            "body": "I do this all the time when traveling!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ssn81",
            "body": "No one will arrest you for wearing an outfit multiple days in a row",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dapplegray",
            "body": "No it's not okay. The fashion police will arrest you.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zee-bra",
            "body": "I really don’t care what others wear but wouldn’t you feel gross wearing the same thing several days in a row? For sanitary purposes maybe would consider not doing this..",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cheshire_Cat8888",
            "body": "Lol if I like it I’m going to wear it multiple times. If anybody says anything about it I think they’re odd for commenting on it most of the time.\n\nSome people “villainizing” (extreme word but I can’t think of another one right now) outfit repeating ,which is especially prevalent in social media and other forms of media, is just a symptom of consumerism and the plague of overconsumption in our society. In the majority of human history, people only had a select few number of outfits ,unless they were insanely rich. People passed down clothes through inheritance even. So most of the time people just repeated outfits, had one maybe two “Sunday best” kind of outfit. \n\n\nTdlr: I repeat outfits and the whole thing with “outfit repeating” is just overconsumption in my eyes. Just wear what makes you feel good no matter how many times you’ve worn it :)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OB4L",
            "body": "I’ll wear an exact complete outfit I like multiple times but only to different places. Like I wouldn’t wear the same exact outfit to work day after day, although I might repeat pants multiple times a week, especially if they’re nondescript like black pants.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Historical_Tea_8164",
            "body": ".",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TalynL",
            "body": "Uniform dressing rocks. Save your creativity for the things that matter. Many designers & creatives just wear black pants and tee for this reason.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bkhalfpint",
            "body": "I don't see anything wrong with it! Takes the guesswork out of dressing.\n\nhttps://www.wnyc.org/story/why-you-should-wear-same-thing-work-every-day/",
            "score": 1
        },
        {
            "depth": 0,
            "author": "badscandal",
            "body": "Same bottoms yes, same shirt is more noticeable. I do notice when people wear the same top days in a row. Maybe its just me haha. But also in the summer, i only wear tops one time because of the heat",
            "score": 1
        },
        {
            "depth": 0,
            "author": "occasionallystabby",
            "body": "I have these pants that I like to wear to work. I have 6 pair total, 2 each of 3 different colors. I wear one set (3 colors) for a set amount of time (usually in line with my house scrubbing schedule), then throw those in the wash and switch to the other set for the next set amount of time. I decide which color I wear based on the shirt I'm wearing. Shirts get worn twice between washings, but I also have a system for that, so they're not on back to back days. \n\nSometimes mental illness has an up side. 😆",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jwash1894",
            "body": "OP, you are doing fashion right! You have clothing that your enjoy wearing and you like to wear it as much as possible. There is nothing wrong with that!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Embarrassed_Maybe342",
            "body": "As far as I’m concerned… different people see me on different days. If it doesn’t smell weird go for it. Clothes aren’t meant to be used once washed. Make it work 😂😊",
            "score": 1
        },
        {
            "depth": 0,
            "author": "JYQE",
            "body": "You can Google it but that was a woman who wore the same dress every single day of the year. I mean she did some adjustments like adding extra layers or something for when it was colder but in any case, I don't think it made any difference to anyone that she was wearing the same dress every single day.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Strong-ant000",
            "body": "If you wear it to work, trust me, no one cares what you wear every day.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Opening-Friend-3963",
            "body": "Yes it's acceptable but apparently not when you are a teen in high school. Lol per my teenager",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dracoon89",
            "body": "Absolutely, it's totally fine to wear the same outfit for multiple days in a row, especially if it's comfortable and you like it. Most people don't pay as much attention to what others are wearing as we might think.",
            "score": 1
        }
    ]
}