{
    "title": "All Crimes To Possibly Commit In Minecraft.",
    "comments": [
        {
            "depth": 0,
            "author": "MinecraftModBot",
            "body": "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## Mean_Air4486|1cyi4w6)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Training-Bee-8209",
            "body": "I mean minecraft is full of wild land that does not have owners. But the end rod sheep machine is animal abuse",
            "score": 61,
            "replies": [
                {
                    "depth": 1,
                    "author": "lickytytheslit",
                    "body": "Stealing? I've plundered many villages",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MaleficentActive5284",
                            "body": "its okay to steal in your early days but once u have everything u want and need its a crime",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Training-Bee-8209",
                                    "body": "It’s not stealing if no one owns the land in a primitive environment",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dapper_lad777",
            "body": "What’s the maximum sentence that Steve could get? (Assuming no death penalty)",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "SteveNotComplex",
                    "body": "Good luck trying to even give Steve a death sentence.. He'd just slice them all in half in a single swing.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Gun_Type_Device",
                            "body": "What about bedrock edition tho",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wyikii",
            "body": "i would say that\n\n* necromancy is not a crime, neither is magic, as it simply don't exist in our world there are no laws agansit it, and we don't have reasons to assume that in a world where such things exist, it would be illegal, it would depend on harm caused by it, if necromancy/magic is only used to save/help your own life, without actual harm caused by anybody else, there is no reason why it would be illegal.\n* Illegal wiring/illegal technology creation(red stone) same would apply here, there are no reasons to assume any kind of tinkering would be illegal\n\ni mean irl it's not illegal to build electrical stuff, you can buy electric components and start making your own inventions in your backyard if you want (if it was illegal, we could not homebuild PCs)\n\nthere are usually laws regulating such practices, but it's not that tinkering/making machines is illegal, but that doing so in a way that could cause harm is (like let's say if you endanger others with your stuff, or cause pollution, or you try to make something that could be weaponized (like let's say, explosives or kinetic launchers) but that would fall under the \"no unlicenced weapon owning or manufacturing\" law that was mentioned above (about bows and swords) and the \"no unlicenced detention of explosives\"\n\nthis mean that, beside any redstone machine that actually use explosives (tnt dupers, tnt minecarts, tnt cannons, excavators and tunnel bores, etc) or launch projectiles (droppers equiped with arrows or fire charge) you are probably fine  \nthere is no reason to assume using redstone to make, let's say, an automatic furnace or an electric door would be illegal",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wyikii",
                    "body": "i  would also add that you didn't mention \n\n- forced detention (imprisoning villagers)\n\n- forced deportation (taking villagers out of their villages)\n\n- slavery (using villagers in iron or wheat farms)\n\n- racket (forcing a villager to sell at a lower price using zombie poisoning/healing in a trading hall)\n\nalso, war crimes :\n\n- razing villages with TNT (mass bombings)\n\n- using splash or lingering potions aganist civilians (villagers) or military personnel (illagers or iron golems)\n\n- use of incendiary weapons in civilian aeras\n\nand many others\n\n  \ni would even add that... if you do enough \"trolling\" with villagers, you could technically qualify as crime aganist humanity\n\n  \n- slavery (large scale)\n\n- mass deporations\n\n- genocide\n\n- human experiments\n\netc",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheoryTested-MC",
                            "body": "You forgot sex trafficking.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DeluxeMinecraft",
            "body": "Slavery (villagers)",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Manos_Of_Fate",
            "body": "A lot of those are a *huge* stretch at best. Also, you can’t decide real laws based on location just happen to be illegal but also decide that there would be laws against magic use. Oh, and owning the means to start a fire isn’t arson.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "RevolverRevenant",
                    "body": "He's not saying that having Flint and Steel is arson, he's saying that Flint and Steel is the source of the arson, aka using it to start fires",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheUnfunnyClown11",
                            "body": "or anything else with fire producing abilities",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tliggz",
            "body": "How are these illegal? There's no law in minecraft. Not even the laws of physics!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Training-Bee-8209",
            "body": "You forget one thing: too much rizz",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "SteveNotComplex",
                    "body": "Damn right",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "XenoDragomorph",
            "body": "How many days or years in life sentences would we get from this?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bc650736",
            "body": "a war crime to the list\n\nuse of cruel and unusual weapon: Fire Aspect and the enchanted arrows",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ilmis_11",
            "body": "There must to be more ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Distinct-Entity_2231",
            "body": "9: \\*railWAY! Not a road, a way!  \nI didn't do 11 and 12. But I did a lot of 17 and 18.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mintyyungpoo",
            "body": "I’ve been evading taxes for a decade now In Minecraft",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Darryel",
            "body": "Imagen you're a cave man and you need licence for use fire... I know, it just interpretation, but Steve only who survive this world, if you playing singleplayer mode",
            "score": 1
        },
        {
            "depth": 0,
            "author": "oncipt",
            "body": "How could you not include slavery? Ppl have frick farms that would put the Roman Empire to shame",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thE_29",
            "body": "Many points you listed are mostly based on your countries laws..\n\nAlso why should there be a law against magic? What :D",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ur_prob_a_karen",
            "body": "that book doesnt work, the angles are weird",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RevolverRevenant",
            "body": "Now somebody needs to do a challenge run where they try to beat Minecraft without breaking any laws",
            "score": 1
        },
        {
            "depth": 0,
            "author": "JustIta_FranciNEO",
            "body": "isn't a mob farm just mass genocide?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mean_Air4486",
            "body": "Alrighty, I’ve got some comments back and I realized in my post sleep deprivation that I was definitely not clear on some points of it and definitely missed some stuff, so here’s a few extras I’ve thrown in that I’ve saw in the comments\n\n29. Slavery/forced detention/forced deportation/racketeering/human experimentation (imprisoning villagers, taking villagers from homes, villager farms for wheat,iron, etc, forcing villagers to sell lower by turning them to zombies then healing em) -Credit: Wyikii-\n\n30. Assault and battery (beating a villager)\n\n31. Torture (harming a mob or villager to near death then healing them and doing it over again and again)\n\n32. Too much Rizz? -Credit: Training-Bee-8209-\n \n33. Human/sex trafficking (trapping villagers into forced labor or forced sex for babies)\n\nThat’s all the new ones I can think of, and to clear up a few things, 1. I’m charging Steve based off USA law, shoulda clarified that before but I just straight up forgot different countries have different laws 2. Yea technically starting fires ain’t technically illegal in some instances but start a big enough one and it is so interpret how ya wanna, 3. I know technically speaking the redstone one ain’t a crime unless used specifically but I was trying to just expand out with everything I could possibly think of, my b 4. Yea I know I threw a few magic things in their but I honest to god just couldn’t think of anything trying to tie in the nether and end, so I just decided to focus on the overworld, so ima leave it up to y’all to interpret how you want to with how illegal it is for Steve to inavade on literal different worlds xD\n\nLove ya pookie bears <3",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ShaneDahLin",
            "body": "I think you're forgetting human trafficking and slavery (villagers).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "1nfiniteSpace",
            "body": "That’s crazy, I never thought of that.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheUnfunnyClown11",
            "body": "You missed a lot.\n\n* Criminal Misdemeanor (Killing the Ender Dragon, since it is the only one of the species and the egg is likely infertile, or killing any other rare species like Axolotls)\n* Human(???) Trafficking (Breeding Villagers in a farm)\n* Unlawful Imprisonment (Trapping Villagers)\n* Assault and Battery (Attacking anything)\n* Torture Murder (using that one method to kill the Wither, or zombifying villagers before inevitably killing them)\n* Administering a toxic substance (feeding animals rotten flesh, poisonous potatoes, suspicious stew, or chorus fruits)\n* Incitement (forcing Iron Golems, Snow Golems, wolves, or other players to hurt others)\n* Assault on an Officer (killing iron golems)\n* Reckless Endangerment (Putting a pet, player, mob, etc in danger)\n* Cannibalism (It is likely that the Zombies used to be human at some point, making eating their flesh a crime)\n* Aggravated Assault with a Deadly Weapon (obvious)\n* Grand Larceny (stealing an entire village, end city, etc)\n\nI probably missed a lot, this is just what I could think of.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Green-Asparagus2488",
            "body": "Well Steve is the only human existing in a world without law or government so crime doesn't really exist, he can do whatever he wants.",
            "score": 1
        }
    ]
}