{
    "title": "Looking for Harmless traps/pranks for a SMP with light RP",
    "comments": [
        {
            "depth": 0,
            "author": "MinecraftModBot",
            "body": "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## buw_185|1cyof7n)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TaylorGlitch",
            "body": "if anybody has a redstone door, you can add a hopper/dropper randomizer to make the input button only work 80% of the time\n\nwatch them slowly go mad as they think lag keeps eating their input",
            "score": 231,
            "replies": [
                {
                    "depth": 1,
                    "author": "ilprofs07205",
                    "body": "Oh you monster",
                    "score": 55
                },
                {
                    "depth": 1,
                    "author": "SirPug_theLast",
                    "body": "Can you make it 50%? And any source to instruction?",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AverageMan282",
                            "body": ">hopper/dropper randomiser",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "TaylorGlitch",
                            "body": "Yes, you can adjust the probabilities pretty easily! \\[Here\\](https://imgur.com/lYsJfLt) is the design I use. Just wire it in between their input button and whatever device it turns on. Happy pranking!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Impossible_Ad1757",
            "body": "One very annoying prank you can do to someone’s base is to fill a bunch of 1x1 holes in their walls with chickens, so that they have no clue how many there are, and are forced to tear apart their base to de-chicken themselves",
            "score": 267,
            "replies": [
                {
                    "depth": 1,
                    "author": "GreenIkea",
                    "body": "Bonus points if you name the chickens Chicken 1, Chicken 2, Chicken 4, Chicken 5, etc. occasionally skip a number, so they keep looking for it thinking it must be hidden somewhere right out of hearing range",
                    "score": 187,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lzinger",
                            "body": "Everyone knows that trick though",
                            "score": 38,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "omghooker",
                                    "body": "That's why you do 1-5 with no skip, so it throws them off higher up",
                                    "score": 56
                                },
                                {
                                    "depth": 3,
                                    "author": "Dry-Smoke6528",
                                    "body": "Also, I find a hole with chickens I'm inserting lava",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lzinger",
                                            "body": "Or just use your sword. There's only 1 chicken in each hole.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Dry-Smoke6528",
                                                    "body": "i was assuming multiple, and im on bedrock so no sweeping.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Lzinger",
                                                            "body": "1 chicken per hole but hide multiple holes around the base. You could put multiple in each hole but the inconvenience is finding the holes",
                                                            "score": 5
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Trexton1",
            "body": "Get your hands on a creeper head and place it on a noteblock connected to their door.",
            "score": 142,
            "replies": [
                {
                    "depth": 1,
                    "author": "BillyWhizz09",
                    "body": "Or even better: attach it to a waterlogged sculk sensor and hide it near their chest room\n\nYou can even use comparators to have it only detect chest openings",
                    "score": 71,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SamsamGaming",
                            "body": "Calibrated skulk sensor with redstone strength 10 going into the side will go off when doors or chests open, take that output and feed it into a note block with a creeper head on it.\nWaterlog the sensor to mute the sensor sounds.\n\nHave fun! hehehe",
                            "score": 28,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BillyWhizz09",
                                    "body": "I didn’t know calibrated sculk sensors could do that. I need to experiment with them more",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AverageMan282",
                                            "body": "That's their whole schtik",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "magitech_caveman",
                    "body": "Oh that's EVIL",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "Aarolin",
                    "body": "Bonus points, since this one fits the crime.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "GreenIkea",
            "body": "If their base is surrounded by dirt/grass, fill the entire area with bamboo. Afk for half an hour or soand voila, an annoying forest of bamboo that you can barely traverse.\n\nIn case their base is more detailed or has less dirt overall, you could kidnap their pets and hide them somewhere relatively close by and make them a stupid goose chase around the entire server, only to end 100 blocks away from their base location and starting location.\n\nButtons also work, placing buttons on every possible surface.\n\nAn auto jukebox setup that randomly activates by a chicken and pressure plate. Place it very deep underground, so their base is just inside the range, so very occasionally and randomly they might here the slightest sound of music coming from underneath them.",
            "score": 63
        },
        {
            "depth": 0,
            "author": "PaDre35",
            "body": "Trap a zombie beneath someone's bed. Name the zombie so it doesn't respawn. Seal it up so it isn't visible. Now your buddy can't sleep in his bed because there are monsters nearby. And he gets to listen to zombie moaning 24/7.",
            "score": 97,
            "replies": [
                {
                    "depth": 1,
                    "author": "The_Banana_Monk",
                    "body": "Zombie is easy to find. Creepers are quieter. Just place it in water if you don't want to dmg the base when it's found.",
                    "score": 79
                },
                {
                    "depth": 1,
                    "author": "BillyWhizz09",
                    "body": "You can also put one in a boat if you don’t want to use up a name tag",
                    "score": 24
                }
            ]
        },
        {
            "depth": 0,
            "author": "One_Economist_3761",
            "body": "Some of my favorites:\n\n1. Go into their storage and either all their stone with light grey wool, and rename it on an anvil\n\n2. Light Grey stained glass panes are hard to see in an inventory, so put a dispenser in their base with a skulk sensor that dispense light grey stained glass panes when they're in their inventory, and they won't notice, but suddenly can't put stuff in their inventory. Its also funny if you rename the stained glass panes as \"Nope\" so when they hover over the inventory space to see why they can't put stuff there, it just says \"Nope\"\n\n3. Places where they might want to jump, put carpets on top of honey blocks. They can't jump but cant see why.",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "Psychological_Ad2094",
                    "body": "Make sure to name the glass differently so it doesn’t stack, otherwise the numbers would give it away.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dizrak_",
            "body": "Curse of binding pumpkin",
            "score": 32
        },
        {
            "depth": 0,
            "author": "BillyWhizz09",
            "body": "If you’re able to get the world seed, or even better a copy of the world, get a copy and blow up everything with tnt and send a screenshot to your group chat to make everyone think the world got griefed",
            "score": 43,
            "replies": [
                {
                    "depth": 1,
                    "author": "Chillie43",
                    "body": "Not gonna lie, it took me a moment to realize you meant blow up the copy",
                    "score": 16
                }
            ]
        },
        {
            "depth": 0,
            "author": "u53rn4m3_74k3n",
            "body": "Color all sheep pink",
            "score": 19
        },
        {
            "depth": 0,
            "author": "CoruscareGames",
            "body": "Put a bunch of chickens in a 1 block space with a hopper beneath them. Hopper into dispenser facing into their base. Comparator setup that shoots every egg that gets laid.\n\nOh and if they have any mob farms, put torches in them.",
            "score": 18
        },
        {
            "depth": 0,
            "author": "_Throwaway__acc",
            "body": "Place lecterns outside the house. \nBee movie script in the books.\nHigh effort, no reward, apart from the dawning realisation its the entire script in there tone of voice when they find it.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "dralcax",
            "body": "* Bury Elder Guardians in scattered locations under their base and watch them struggle to find them. Also kill all their cows. \n\n* Fill their entire base with obsidian. Don’t leave any air blocks, just make it a giant solid mass they now have to mine out.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "CharlesP_1232",
                    "body": ">Also kill all their cows\n\nNo, not all of them, leave just one cow, so they can't breed it, but it is still there to annoy them. \n\nOr\n\nKill all their farm animals, and remove any trace of where they kept the animals, and tell everyone else on the server to gaslight them by claiming they never had an animal farm. Repeat everytime they start another one.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Nullody",
                            "body": "The killing cows is to make it harder for them to get milk, so they can't just get rid of the mining fatigue",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CharlesP_1232",
                                    "body": "Ohhh, true. I wasn't thinking about that. I was just thinking the torture of him then having to find another cow so he could breed them for food again",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tatasz",
            "body": "Rebuild stuff but upside down.",
            "score": 32
        },
        {
            "depth": 0,
            "author": "Mr-Uch",
            "body": "the classic \"pressure plate surrounded by iron doors\" trick",
            "score": 21
        },
        {
            "depth": 0,
            "author": "Phlegmsicle",
            "body": "Piston drop traps with a hole underneath are a timeless classic, you can add water at the bottom if you just want to give them a heart attack lol",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Dry-Smoke6528",
            "body": "Leave 1000 boats outside their base, but use a redstone clock and a downward facing dispenser so they all stack as one boat.\n\nWhen they get in or bump the stack they will all spread out.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Labra_Doodles",
                    "body": "Classic. Saw this one on yt shorts",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dry-Smoke6528",
                            "body": "i think i saw it on hermitcraft. ive never been in to mc youtube before this year besides the dream man hunts, but my desire to build better has lead me down a very enjoyable rabbit hole. might watch empires after i catch up on all the hermit craft seasons",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Labra_Doodles",
                                    "body": "The last season i really kept up on was season 6 when grian joined. That hermit war and them temporarily moving to updated chunks was pretty fun",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dry-Smoke6528",
                                            "body": "Ive kinda been watching in reverse and funnily enough grian was the person i started watching it through. saw some youtube short animations of him and scar with the boat em hole, then watched all those animations and i think i just liked him the most out of what i saw",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Blue_M4ge",
            "body": "Leave a sign in their house saying that there are 4 chests buried in their yard with diamonds in them. But only Bury 3 chests.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Lehk",
            "body": "• Sand pit trap using piston and torches, trigger of your choice\n\n• hidden chicken generator that outputs to a nearby body of water\n\n• put water blocks behind ores in their mine",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Demonwolfmaster",
            "body": "Bells attached to red stone loop.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "The_Banana_Monk",
            "body": "OK so imagine a small hill.\n\nInside the hill are a bunch of skeletons in minecarts on one block/rail.\n\nWhen a person approaches the hill skulk sensors pull away blocks from the hill to give the skeletons line of sight. (Use whatever redstone you want. Even just sand on signs).\n\nBut wait there's more.\n\nThe skeletons are surrounded by walls of lava.\n\nAutomatic fire arrow turrets.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "darknightingale69",
            "body": "Door bomb pressure pad and iron doors to lock them in then get an elder guardian underneath them so they get mining fatigue. Or respawn anchor lock them in the nether in a constant cycle.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PunMatster",
            "body": "Put light grey glass panes scattered throughout their chests. When there’s only one in a stack, it looks like that slot is empty.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Grog180",
            "body": "Get multiple leads, find random farm/companion animals, and put them so they're hanging from posts. Nobody is harmed/destoryed, and everyone is confused/amused.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "KingJeff314",
            "body": "If they have a stone/cobblestone path, you can bury a stone generator 12 blocks beneath the path, and have a piston push up sporadically (e.g. from a random tick), so that a block seems to keep being placed. Even better if you set up multiple, so that where the block comes up is randomized",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Sapient_lampshade",
            "body": "[A selection](https://m.youtube.com/watch?v=BlkmrwqttJs)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Rightsideup23",
            "body": "Hide a bunch of foxes in an area. A lot of foxes together make a really horrible noise. I know this because I once accidentally pranked myself this way, though I've never tried it out on a server.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DasJuden63",
            "body": "Auto chicken farm, hidden way down to make it hard to hear, and pipe the eggs up to a dispenser or ten hidden around their base. Turn it on when they're away, and afk for a couple hours to let them work",
            "score": 2
        },
        {
            "depth": 0,
            "author": "hex_1101",
            "body": "I once set up dispensers connected to a chicken coup continuously making chickens in his base. Timed it with a few chicken randomized switches (chicken and a pressure plate)  with dispensers  in various locations.  (Half slabs  covering them). It filled his base with chickens and then kept filling it. He finally tracked it them down. \n\nHe put a bunch of cows under my base just under the floor. Then, penned a bunch outside as a cover. \n\nI had dug out a slime farm, and he used a water slide to launch Chickens out of a 1 x 1 hole halfway up the cliff face. \n\nI then found the spider spawner under his base. It's not easy to name spiders, but after a dozen with some invisibility pots, it went from chickens to invisible spiders.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ghozgul",
            "body": "Sapling with a block above, observer checking the sapling and a noteblock with a head/skull on it (skeleton works best)\n\nThe sapling with try to grow with random ticks, but can't and every tries trigger the observer, which will make a skeleton sound. With the saplings grow rate it's actually pretty slow, would happened like once or twice per minutes",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sumtinfunny",
            "body": "Hopper enderchest combo",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheBurnedMutt45",
            "body": "A pit in the middle of a rail line, filled with cobwebs down to bedrock",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Burt_Sprenolds",
            "body": "Surround their house with bamboo next time they’re on a long trip",
            "score": 1
        },
        {
            "depth": 0,
            "author": "QL_lynx",
            "body": "Summon dozen of snow golems and watch their base become a christmas movie",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Coolrock13",
            "body": "DROWN EVERYTHING IN LAVA AND POUR WATER.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "UnusedParadox",
            "body": "Turn his house upside down.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ThisIsGoodSoup",
            "body": "Build the sheep machine right in front of your friend's house. THEN switch it on while he is inside. Lil tomfoolery.",
            "score": 1
        }
    ]
}