{
    "title": "Low effort posts - Results & New Rules",
    "comments": [
        {
            "depth": 0,
            "author": "TriangularHexagon",
            "body": "I was hoping that those \"is this rArE?!?!\" posts would get banned but I do like that two subjects passed the threshold ",
            "score": 215,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mlakuss",
                    "body": "There's now a small disclaimer when creating a post with \"is this rare?\" in the title.\n\nIt doesn't prevent from posting but may help a bit.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "Goldogemania",
            "body": "i agree with every single one of these results except 'what should i build here?' i think these posts are just not constructive to anything and will always recieve a small engagement and frankly if you can't think of anything to build, go do something else? i really like this style of rule altering though :)",
            "score": 315,
            "replies": [
                {
                    "depth": 1,
                    "author": "BrianTheSecond",
                    "body": ">'what should i build here?'\n\nThat one really surprised me. I thought that everybody was tired of those.",
                    "score": 160,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "himawari6638",
                            "body": "It actually depends on the post for me. I only specifically despise the \"plain/cherry biome completely surrounded by big snowy mountains\" ones that keep getting posted (with \"walmart\" and \"highways\" among the top comments in every thread). \n\nWhich is why I kind of agree with the results to keep these kinds of posts allowed overall; I can still downvote those damned mountain donuts without barring other interesting places from getting posted.",
                            "score": 71,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BrianTheSecond",
                                    "body": "I am genuinely curious what kind of \"what should I build here\" posts you think are interesting..?",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "himawari6638",
                                            "body": "For me, it's anything but the over-posted mountain donuts. I remember seeing a nice looking cave being posted and actually got ideas for my own building (coincidentally lived in a cave at the time) from the comments, so it was pretty nice.",
                                            "score": 19
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CIearMind",
                            "body": "Probably serial reposters supporting one another.",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SoupMarten",
                                    "body": "Yep, I'm betting a lot of people that want to keep all these things are under 16 and voting for what they want to post, not what they actually look at. That's a major problem with having a subreddit for a game that's targeted mainly towards children and having no mature user version of that subreddit. Quarter of the posts, I could go to r/teenagers and find the same thing 😑",
                                    "score": 10
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Woshuojidan785",
                            "body": "idk, i like the scenery that pops up every once in a while",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "literatemax",
                            "body": "I guess like the ender dragon one it is a broad category",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lointhwor",
                    "body": "most of those posts just the \"haha big factory\" joke top comment i really wanted them gone",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "Modus-Tonens",
                    "body": "I think it's notable that they're banned from the Minecraft builds sub.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "Risk_Runner",
                    "body": ">I agree with every single one of these results excepts ‘what should I build here?’ \n\nYeah, a compromise could even be something like “I wanna build a house/barn/town, what theme should I go for” or something like that, because an outside perspective is helpful when deciding a build",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Oscyle",
            "body": "Wish the build one got a higher percentage",
            "score": 24
        },
        {
            "depth": 0,
            "author": "brassplushie",
            "body": "Mods, I'm begging you. Ban the \"what should I build here?\" posts. They're all exactly 0 effort. It's ALWAYS a literal blank landscape with zero imagination put into it. Please. They're clogging up the sub.",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jellie_the_Cat",
                    "body": "Yes, and when people comment it usually is this...  \n\n\n>\"A Walmart with parking space and a highway\"\n\nCan people at least get a bit more creative?",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "RegalKillager",
                    "body": ">democracy happens\n\n>people demonstrate they disagree with you\n\n>\"mods do it anyway i'm begging you\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "brassplushie",
                            "body": "The people voting for it to stay are the same annoying people doing it in the first place",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LexiTehGallade",
            "body": "As a personal note, speaking as an individual and not for the team, please let me know what you thought of this style of moderation where we collect the opinions of the sub to try and keep as in touch as possible with the wants of the community. I pitched it to the rest of the team and ran it through with them, this is my first attempt with this idea. Do you like it? Do you hate it? Please let me know, I would like some feedback!",
            "score": 79,
            "replies": [
                {
                    "depth": 1,
                    "author": "step_on_me_mommy_vi",
                    "body": "I think it's a really balanced and thoughtful way of allowing users to help guide the direction of the subreddit, while making sure that things aren't just influenced by a vocal minority in the comments.  Well-done, it's clear that you care and are trying to make this a good space.",
                    "score": 41
                },
                {
                    "depth": 1,
                    "author": "heidismiles",
                    "body": "I love that you got feedback on this. I think it would also be worth reconsidering some rules (and proposed rules) every year or so.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "Domilego4",
                    "body": "I'm a huge fan of it! Listening to community feedback (and asking specific questions to the community as well!) is what any good moderation team should do.",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "DefinitelyTinta",
                    "body": "I really appreciate it! If anyone challenges a rule, you can point to this post and show that it was decided by a large majority, so things are hard to argue with. \n\nSome people have said that the ban threshold was a bit high, and though I'm inclined to agree, ultimately it's always going to be an arbitrary number, so 65-70% is a fair bar to reach",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "Goldogemania",
                    "body": "i think its really positive",
                    "score": 40
                },
                {
                    "depth": 1,
                    "author": "ASHill11",
                    "body": "\nI appreciate the desire to lean towards a light touch rather than being heavy handed. That said, I do think the ban threshold should be lowered a tad. 65% or 60% I think would be better.\n\nAt least, I do think that any one proposed rule that reached a 60+% support threshold should be reviewed at least once a year to see if the attitude persists or is merely a flash in the pan.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "brassplushie",
                    "body": "If there's any chance I can sway the mod teams decision, I'd love to try: please ban \"what should I build here?\" posts. Every single one of those is a blank canvas. The top comments are always \"Walmart/highway\" and it's just clogging up the sub. People just go into creative, take a screenshot of a random place, and post it here. \n\nPlease. Ban those posts.",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "RalphTheDog",
                    "body": "I didn't see the poll announcement when it came out; a shame, I would have loved to vote.  But I think you did an excellent job with this results post.  It was well written and you struck the right tone.\n\n(and, like so many others, I hate the \"what should I build here\" posts.)",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Vrail_Nightviper",
                    "body": "I think you did really well with the idea behind having a light touch, and having the community back it. As someone else said - if someone has an issue with it, they can be pointed right to here, where it shows the vote percentile - they're arguing with all the people who voted the options in too.  \n \nWill \"everyone\" be happy? No, but that's normal, and this aims for the majority, which I think you did great. Thanks Lexi \\^_\\^",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "__Blackrobe__",
                    "body": "it is definitely something you guys should keep doing, and it goes toward the win-win outcome.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "TheBiggestNose",
                    "body": "You did great",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "AnOnlineHandle",
                    "body": "Why did you ignore my post on the original poll pointing out that reddit already has votes built in per post, and a quiet little google login poll in a non-upvoted post which hardly anybody would see is a magnitudes worse way of considering the community as having voted on it?\n\nLike 15 years on reddit now, including some time moderating, and I'll never understand people who moderate this way. These polls have always been flawed and pointless. If it's spam, doxxing, harassment, etc, remove it. Otherwise, you don't own Minecraft, and just happened to land the moderating role on an IP name. Let the community decide with the actual voting tools built into the site for each post.\n\nI still miss the don't dig straight down clips, some of the only stuff I've ever found fun on this sub, which were getting upvoted by the community, and then banned.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mlakuss",
                            "body": "The reddit built in polls are limited to one per post, this would have led to multiple posts just for those questions.\n\nSide Effect: the first question would got some participation while the next ones will have less and less answers, making the overall results biased.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AnOnlineHandle",
                                    "body": "Every post has a voting option on it. Every comment too. It's the entire way reddit is designed, every post has an in-built poll for whether people want to see it. A way better polling system of what people want to see here than some obscure google poll seen by almost nobody.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cherry_Skies",
                    "body": "I really enjoy the use of such a high threshold as opposed to simple majority. And it really does feel as if a silent portion, the scroll-not-type (as I was!), can express themselves in this way. \n\nOverall, good stuff.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jellie_the_Cat",
            "body": "Low effort builds should have been banned, the vote was only 4% away from 70%.\n\nThis subreddit should contain high quality creations rather than a terrible dirt house that no one cares about.\n\nI hope the Mod team considers this one again.",
            "score": 110,
            "replies": [
                {
                    "depth": 1,
                    "author": "lointhwor",
                    "body": "⅔ to me is a sufficient majority. but that threshold exists, there's gonna be stuff just under it and just over it, nothing you can do. i do wish those were banned though",
                    "score": 70
                },
                {
                    "depth": 1,
                    "author": "FUEGO40",
                    "body": "My question is, why? This is not r/MinecraftBuilds , it’s not a sub for experienced builders",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jellie_the_Cat",
                            "body": "I'm not asking for Legendary builds or anything.\n\nBut I don't think posting a picture of a dirt house is impressive at all unless there is some background/context, like for example \"My first day in Hardcore or something\". \n\nWhile I believe anyone can play Minecraft however they want, I feel like we can limit low quality stuff.\n\nThis is a bit unrelated, but I think posts with just a \"Bad title\", no info, and just a picture should be removed.",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SoupMarten",
                                    "body": "It seems like nowadays, people seem to think everyone owes them validation and attention. No, people don't want to look at the same thing over and over again. Yes, you can be mad that we're not your mom giving you whatever you want, but that doesn't mean everyone needs or wants to see that one thing you did today.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Jellie_the_Cat",
                                            "body": "I don't know why you think I'm mad, I personally don't actually care about reddit anyway.\n\nI don't care about what people post, but that doesn't mean I want to see spam.\n\n(Yes, I can also NOT see it, but good posts should have more attention than mid posts)",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Tvdinner4me2",
                                            "body": "Ok I don't get how you're getting that from someone wanting to post Minecraft content to the Minecraft sub",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Matynns",
                            "body": "yeah, people should get to share their builds here regardless of their experience with the game. some guy who picks up and loves minecraft for the first time is going to be super proud of his first house that isn’t just a hole in the side of a mountain or a dirt hut.\n\nlet’s not gatekeep that kind of stuff and just use the voting system if you don’t want to see it. you shouldn’t have to be grian to post here",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SoupMarten",
                                    "body": "Nobody is saying little Timmy down the street can't post his shoebox house made of cobblestone and oak. There's meme subreddits if somebody wants to go \"lol is my house good\" and knows its just a dirt hut.\n\nBut also this is a large subreddit. There is going to be a lot of garbage because kids google minecraft and press the first button they see. There *shouldn't* be, as this is the main subreddit for minecraft and and if the first thing I see is 2000 upvotes on \"what do I build here\" and it's a picture of a hole, I'm probably not going to come back or interact with the community as a whole.",
                                    "score": 12
                                },
                                {
                                    "depth": 3,
                                    "author": "Jellie_the_Cat",
                                    "body": "No one in this subreddit needs to be a pro builder, I'm just saying that posts with no context and just saying \"Look at my dirt house\" or something should probably be removed. \n\nIt is kind of like a \"Quality over Quantity thing\", If there is going to be a lot of posts, let's at least make them decent. But, this is just my overall opinion.",
                                    "score": 9
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Tvdinner4me2",
                    "body": "It failed, too bad\n\nDown vote if you don't like",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jellie_the_Cat",
                            "body": "Who cares, I guess you cared enough to respond didn't you?",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Honey_Enjoyer",
            "body": "Wow, I think most of these did not go the way I expected. Things survived I expected to die and things died I expected to live. Some were pleasant surprises, others not so much, but that’s how it goes. The Community has spoken.\n\nAny potential for a ban/vote on bedrock desync deaths specifically? I wanted to keep unusual deaths but those are annoying.",
            "score": 51,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jellie_the_Cat",
                    "body": "I hate the \"Bugrock\" posts, they are annoying.\n\nIf it's not related to a bug it should be fine, but if it is, it should be banned.\n\nI'd rather see someone post an epic death rather than a bug.",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MarcyWuFemdomOfficia",
                            "body": "Bugrock bad, Java good, give upvotes",
                            "score": -27,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lightbulb2854",
                                    "body": "No.  Don't ask for upvotes",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "1laik1hornytoaster",
                                            "body": "But he said it! He said the thing!",
                                            "score": -3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "MarcyWuFemdomOfficia",
                                            "body": "upvote me or this dog gets it 🐶🔫",
                                            "score": -16
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Jellie_the_Cat",
                                    "body": "What? \n\nWhy should I upvote a comment that is average and questionable at most?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MarcyWuFemdomOfficia",
                                            "body": "r/woooosh",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Tallywort",
                                                    "body": "Making a joke that doesn't land, is not the same thing as a joke that went over their heads...",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MarcyWuFemdomOfficia",
                                                            "body": "------ THE POINT ------>\n\nyou",
                                                            "score": -3
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SoupMarten",
                    "body": "Ehh, I like desync deaths. I play bedrock and I'd like to avoid thise things happening to me, so I watch to figure out what not to do. 😆",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jellie_the_Cat",
                            "body": "That should belong on another subreddit though",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "maddymakesgames",
            "body": "This is a really nice approach towards rule adjustments! Personally I think a 2/3s makority wouldve been better.\n\nOpinions: \nIt was long since time for 'is this cheating' that shit is stupid and annoying, glad to see a lot of people agree. \nReally surprised 'what should I build here' isnt banned. Personally I think especially when the post is about a larger area it just becomes spam with how many posts there are with similar terrain. I think people asking that about like, a corner of their house would make sense to keep but I really dont like them most of the time.\nUnusual deaths are Fine™️ but I wish the bedrock desync deaths specifically were banned.\nAlso surprised about splash screens, I could understand custom ones or the new ones after an update but overall I think theres not tons to talk about with them besides just pointing at the wiki.\n Low effort builds also sorta add nothing to the sub imo, but its whatever. imo should be banned off of the threshold being too high but its whatever they dont really bother me.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "CCPOwnsReddit_",
            "body": "I guess it's better than nothing. I think the sub would be better off without any of these kinds of posts, personally.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "easternhobo",
            "body": "70% is way too high.",
            "score": 44,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jellie_the_Cat",
                    "body": "Just look at the category for low effort joke builds, It had **66%** of votes for removing\n\nIt just should've been removed anyway, I doubt much people would miss them.",
                    "score": 34
                },
                {
                    "depth": 1,
                    "author": "Tvdinner4me2",
                    "body": "Why? \n\nIf something is to be banned I agree that it should be a large majority that agrees \n\nOtherwise you're just upsetting too many people",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "easternhobo",
                            "body": "You're upsetting 65% of people to appease 35%. That's dumb.\n\nTwo thirds is a large majority.",
                            "score": 12
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Express-Preference-6",
            "body": "There’s no way the absolute low effort “What should I build here?” posts aren’t removed.",
            "score": 21
        },
        {
            "depth": 0,
            "author": "Captain_Thrax",
            "body": "I can’t believe Herobrine posts got removed and not “what should I build here”",
            "score": 22
        },
        {
            "depth": 0,
            "author": "_Red_Knight_",
            "body": "> This poll has cleared up ambiguity however, the community wants to see and discuss Minecraft YouTube content from popular Minecraft creators\n\nThis is the most disastrous one of them all. I've seen plenty of subreddits get ruined by endless spamming of YouTube videos, TikToks, Twitch clips, etc. I sincerely hope that that will not happen here.\n\n> We wanted to be absolutely, positively, crystal clear that the absolute majority of you wanted something gone before we step in.\n\nThis is fine in principle but you run the risk of going too much in the other direction, in the sense of allowing a minority of the community to dictate its policy. I don't think it's really in the spirit of your stated goals to value the opinions of three hundred people over those of seven hundred. For example, a large majority of the community clearly wants menu screen posts to be banned but they have been retained because a small minority wants it. I think a threshold of around 55/60% is more than enough to determine a clear majority.",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "LexiTehGallade",
                    "body": "Our rules on self-promotion are still in place, so if people are posting videos simply for the goal of promoting themselves they won't get very far.",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stalin_be_Wallin",
            "body": "I agree with the supermajority rule (2/3 of votes)",
            "score": 19
        },
        {
            "depth": 0,
            "author": "throwaway11486",
            "body": "I think some of these shouldn't have been either outright forbidden or allowed but just limited instead. Like how some subs only allow certain kinds of posts on certain days or megathreads for certain content.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "Knowbody_Nose",
            "body": "I don’t really have feelings about any of the rest of the topics, but “unusual deaths” accounts for about 95% of the r/Minecraft posts that I actually click on",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Jenny_Wakeman9",
            "body": "I like these changes! My home feed's gonna be a lot cleaner now.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "DraconicDreamer3072",
            "body": "unusual deaths was too broad for me.  I am sick of posts showcasing a bedrock bug leading to death, but other ones are amusing and i enjoy",
            "score": 3
        },
        {
            "depth": 0,
            "author": "BrunoGoldbergFerro",
            "body": "Nostalgia posting is garbage",
            "score": 17
        },
        {
            "depth": 0,
            "author": "MarcyWuFemdomOfficia",
            "body": "Democracy has failed us once again",
            "score": 16
        },
        {
            "depth": 0,
            "author": "raritygamer",
            "body": "\"should we ban post related to fighting the end dragon\" \n\n//should we ban posts about Minecraft?//",
            "score": 2
        },
        {
            "depth": 0,
            "author": "FUEGO40",
            "body": "I’m so glad that the threshold was put that high. I’m personally ok with these “low effort” posts, I find them charming. I’m not so jaded that I would remove someone’s post just because they are new to the game, are inexperienced or thought something they encountered was particularly special.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "MissLauralot",
            "body": "As a browser of /new, I am disappointed that a couple of low effort post types that have been posted repetitively for years will not be removed. \n(splash texts, shipwrecks and \"rare\" mobs, in particular).\n\nHowever, I agree with the threshold and accept the result of the poll. This is a time of celebration for the community and I'm certainly not gonna be bitter about a few silly posts not being banned. Long live Minecraft.\n\nEdit: missed a word (weird that this would be downvoted)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Autop11lot",
            "body": "Just put everything in a megathread. Moderators seem to love that!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "adderthesnakegal",
            "body": "The threshold is stupid. The fuck is the point of voting if you need to meet a 70% threshold? falling just short lands the vote to the minority instead. Fucking dumb. Anything over 50% should win the result. That's what a vote is for.\n\nRegardless, glad the \"is this cheating\" posts have at least been banned.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Goldogemania",
                    "body": "the reason is, people are much more inclined to vote if they don't like something than if they're cool with something. there is a bias of people coming into the vote, so the threshold needs to reflect that. i agree that there were things that neared the threshold that should've been banned, but the mods were true to their word and that's how moderation teams should be.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jellie_the_Cat",
                            "body": "It should have been 2/3 or 66%\n\nThis would have ended up removing Low effort joke builds.",
                            "score": 8
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "eulop",
            "body": "If all of these had been removed I'd be a very happy person.\n\nThe pass threshold should've been 51%",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Koboistad56",
            "body": "I mostly lurk here but rare mobs are nice to see every once in a while they are rare after all",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Booty_Bumping",
            "body": "Why give in to the spam? None of these things should have carveouts.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ImAlfredoYT",
            "body": "ok but can we still talk about minecraft’s creepy atmosphere as a whole? or is that now banned and falls under “my game is haunted”?",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "LexiTehGallade",
                    "body": "You can have a discussion about the atmosphere of the game, the banning of haunted posts aims to tackle the many hoaxes people post.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ImAlfredoYT",
                            "body": "ohhhh makes more sense thanks",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Jellie_the_Cat",
                            "body": "So, this only bans fake creepypasta stuff, but does not include anything with a creepy nature in Minecraft, such as cave noises or the Warden?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Queen_Olivia80",
            "body": "*minecraft about building*\n\n*wants help deciding build*\n\nr/Minecraft : \"Nuh-Uh\"",
            "score": -9,
            "replies": [
                {
                    "depth": 1,
                    "author": "LexiTehGallade",
                    "body": "Just to clarify that posts asking \"What should I build?\" Are **not** banned because of the results of this poll. It didn't pass the percentage needed to be banned.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Queen_Olivia80",
                            "body": "Yeah, i know, im just saying a majority of people dont like it for some reason, and i still dunno what to build inplace of the abandoned villiage",
                            "score": -13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SoupMarten",
                                    "body": "At least bring something to the table, damn. \"Hey, can someone tell me what to build in this specific location I chose with literally no idea of anything to make in it\"\n\nLike if you just want to be around the atmosphere of the environment ok, just make a hole in a mountain or something. Why would you ask somebody else what to put in the world you are designing? Think about why you want to put your base there. Is it the beauty of the cherry trees? Then you don't want to build anything too colorful to detract from the natural beauty. Is it because you want to repopulate an abandoned village? Okay, think about what your dream village would have in it! Or get undead mobs and trap them in the damaged homes and up the spooky factor. Do something to highlight the attributes you value in the area. \n\nSometimes when I come to this sub I feel like creativity is dying. So much stuff here feels so samey and cliquey like junior highschool, I may as well be on tiktok. No wonder the build sub exists, people who are good at this game don't want to see this crap anymore.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Queen_Olivia80",
                                            "body": "Im only recently getting back into minecraft lmao, i needed a lil help, and i already had a base so i dunno what else to build",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Queen_Olivia80",
                            "body": "See, they're downvoting me, proving my point lmao",
                            "score": -7
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kynthiamarie",
            "body": "I like the \"is this cheating\" posts if they are referring to it turning off achievement in bedrock.",
            "score": -7
        },
        {
            "depth": 0,
            "author": "DianaDragonRoar",
            "body": "You ppl are so strange why do you care about what ppl post so much just scroll so sorry I didn’t put 2 hours of effort into my Reddit post 💀 freaks",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "dragonlord13443",
                    "body": "people want quality over quantity, simple as that",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ctmeb78",
            "body": "this is giving \"Smormu is here to stay!\" vibes lol",
            "score": -6
        },
        {
            "depth": 0,
            "author": "Darryel",
            "body": "Dear moderation, you should ban scare post from mods, like [https://www.reddit.com/r/Minecraft/comments/1cwc8h8/mans\\_best\\_friends/](https://www.reddit.com/r/Minecraft/comments/1cwc8h8/mans_best_friends/) (dont watch if you dont like horror, i not love horror too)",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Civil-Type7783",
            "body": "atleast u didnt ban the nastalgic minecraft posts cause im very nastalgic when it comes to minecraft",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Tvdinner4me2",
            "body": "Man there are some salty assholes in here let people see what they obviously want to see",
            "score": -6
        }
    ]
}