{
    "title": "My son lost his home.",
    "comments": [
        {
            "depth": 0,
            "author": "MinecraftModBot",
            "body": "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## Negative_Stranger227|1cy4w19)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "chesyorangejuice",
            "body": "His house is most likely near spawn, maybe try using a compass to go to spawn",
            "score": 1600,
            "replies": [
                {
                    "depth": 1,
                    "author": "heidismiles",
                    "body": "Spawn should be somewhat close to (0,0), right?",
                    "score": 533,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lawrensium",
                            "body": "Usually yes. Unless 0 0 isnt one of a selection of biomes.",
                            "score": 337
                        },
                        {
                            "depth": 2,
                            "author": "emzirek",
                            "body": "If 00 is in the ocean you will spawn as close as possible on land to 00",
                            "score": 76,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "modern_universe",
                                    "body": "Not true, in Bedrock you can spawn directly in the ocean. There are several seeds where there isn't land for hundreds of blocks from where you spawn.",
                                    "score": 70,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "emzirek",
                                            "body": "This has happened only once in Java and I totally forgot about it till you're comment",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dinohh64",
                                                    "body": "No it can happen in java too, it doesn't happen teally often but it isn't that rare either",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "homorob0tic",
                                                            "body": "They were saying it happened to them in Java.",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "chesyorangejuice",
                            "body": "Yes",
                            "score": 67
                        },
                        {
                            "depth": 2,
                            "author": "Droxden",
                            "body": "On ipad bedrock is the only option, and iirc, bedrock can spawn players really far out compared to Java",
                            "score": 27,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "INotZach",
                                    "body": "No, they fixed that several updates ago I believe.",
                                    "score": 20
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Taolan13",
                            "body": "usually, but its actual position can vary by a couple hundred blocks.\n\ncompass will still point to spawn.",
                            "score": 5
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Negative_Stranger227",
            "body": "Oh man, this has been confusing!\n\nMy son is 6 and not a fluent reader.  A friend of his has helped him set up a lot.  I don’t interact with or monitor his game play and I don’t play Minecraft.\n\nWe are going to try to kill him and see what happens!",
            "score": 1094,
            "replies": [
                {
                    "depth": 1,
                    "author": "Evening_Ad9961",
                    "body": "Last part of that could be taken so far out of context hahaha",
                    "score": 1047
                },
                {
                    "depth": 1,
                    "author": "IronLordSamus",
                    "body": "We are going to try to kill him and see what happens!\n\nA bit extreme but have you considered foster care?  In all seriousness my oldest is that way he just makes a new world and moves on, and it might be best to learn how t play minecraft we sometimes all play together for a family activity.",
                    "score": 418,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Negative_Stranger227",
                            "body": "100%\n\nI’m going to have to learn.  He has been playing with another kid for whom I provide care.  But I need to get on it myself.",
                            "score": 42,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BenRod79",
                                    "body": "You’ll probably have a blast. I started playing to help my kiddos learn how and now I’m the “Realm Dad” for all of their friends. I maintain the rules on the server and the enforcement so none of them have to, and also I end up gathering all kinds of supplies and I build materials farms for them to share, as well. \n\nIt makes it easier for them and their friends to have a fun time on the server without disputes.",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "GreenWingedLion",
                                    "body": "I'm a 45 year old woman who loves playing Minecraft even more than my 6 year old son! I have my own survival world and I created a realm. Go for it.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Chillypepper14",
                    "body": "Have you used a compass yet? If he built his house near his spawn then it'll be near where the compass points to",
                    "score": 60
                },
                {
                    "depth": 1,
                    "author": "DreadAngel1711",
                    "body": "YOU'RE GONNA WHAT",
                    "score": 51,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Charming-Tour5479",
                            "body": "Blud is not funny 😂🙏🏽",
                            "score": -6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JulietteKatze",
                    "body": "Abraham, no! God said it was a prank! leave Isaac alone!",
                    "score": 60,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Noble-Damask",
                            "body": "Moloch: However, if you *are* set on sacrificing your son, I might know somebody who's accepting new worshipers.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "borkmaster0",
                    "body": "A little too enthusiastic about murder",
                    "score": 61
                },
                {
                    "depth": 1,
                    "author": "Otherwise_Bike6636",
                    "body": "Police reading this like 👀",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "Estoniancitizen",
                    "body": "Well that could work if he had a bed he slept in at his house otherwise you'll just get back to where he spawned when he originally started playing. The minecraft world is absolutely gigantic, but for me the case most of the time when I get lost is that I'm not that far away from my house but I'll run around in circles trying to find it.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Negative_Stranger227",
                            "body": "I might need to take the game from him and do some looking on my own.  He gets frustrated real quick.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FireBone62",
                    "body": "If you have problems finding it from the spawn, try circling the spawn in progressively bigger circles.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "GodOfBowl",
                    "body": "Uf he has a bad he will respawn in the bed",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "armoiredu44",
                    "body": "Just my opinion, but I wouldn't let my son play at 6 years old if I had one, I started playing at 11 and it has been ruining my life, and my health, wasting my time and money, without giving any real progression in life. I hope you're monitoring your son well.",
                    "score": -20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ProbablyNotTheCocoa",
                            "body": "Valid points, but I gotta disagree at the time wasting, if you’re a 6 year old and you’re not wasting your time, something is wrong",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "armoiredu44",
                                    "body": "Yeah I guess you are right, if you are a normal person, it would be normal to waste your time at 6 years old.\nEdit: wrote messy things",
                                    "score": -7
                                },
                                {
                                    "depth": 3,
                                    "author": "armoiredu44",
                                    "body": "I'm just worried it become a bad habit. Most well organized and good students I know from my age do not play video games and I am not one of them.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MuffinPotatoChips",
                                            "body": "Well i'm a pretty good student and i've been playing videogames since i was 5/6 and i also play guitar and regularly go outside so yeah",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "armoiredu44",
                                                    "body": "It's only my opinion, I believe i'm not the only one in this situation.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MuffinPotatoChips",
                                                            "body": "I respect that, i understand your concern and i'm sorry that gaming has impacted you that way and you're certainly not the only one in that situation, but I think that playing videogames at 6 isn't an issue as long as the kid doesn't play videogames excessively and gaming doesn't impact them negatively.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "SoupMarten",
                                                            "body": "Ok dude. You play video games to escape your life or whatever. Some people actually play them because they enhance their life. Not everyone is you.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BendIllustrious5314",
                            "body": "\\*cough cough\\* troll",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Negative_Stranger227",
                            "body": "Good thing this isn’t a parenting thread and I don’t care about your opinion!",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "armoiredu44",
                                    "body": "Ok, take care 👍",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zackeezy116",
            "body": "I was worried until I saw what sub this was from",
            "score": 137,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChaosCorbin",
                    "body": "Not to mention OP's comment where the last line is \"We are going to try to kill him and see what happens!\"",
                    "score": 61
                },
                {
                    "depth": 1,
                    "author": "bamboozled_swag2",
                    "body": "Yeah, I thought I was in r/legaladvice or something",
                    "score": 39
                },
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "LMAO",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "No-Spinach-6485",
            "body": "Maybe walk around? Or fly around. Or if he has bed in the house dying may be an option. But save the coordinates before the death too. The house may be nearby the before coordinates. Hope it helped 🥹",
            "score": 305,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "He has been walking around for a couple of days and no luck.\n\nI didn’t set any of this up.\n\nSo if he dies, he won’t respawn in his home?\n\nHow do we kill him in creative mode?",
                    "score": 232,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GreenWingedLion",
                            "body": "You can change the game to survival, die, then change it back to creative. Hopefully the house is near spawn.",
                            "score": 202
                        },
                        {
                            "depth": 2,
                            "author": "KatTheKonqueror",
                            "body": "Have him fly high into the air and change it to survival real quick. He'll plummet to the ground, and then you can turn creative on. Unless he used a bed to set a spawn point, he likely won't spawn in his house, but he'll probably spawn near it, I think.",
                            "score": 102,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "He told me he has a bed.  So does that mean he set it as a spawn point?",
                                    "score": 90,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "blackhole_puncher",
                                            "body": "To set your spawn at the bed he would have had to click on it first but If he did then yes dying would respawn him at the bed",
                                            "score": 103
                                        },
                                        {
                                            "depth": 4,
                                            "author": "KatTheKonqueror",
                                            "body": "If he used the bed or tried to then it was saved as a spawn point, so suicide is worth a shot.",
                                            "score": 57,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "shiny_xnaut",
                                                    "body": ">so suicide is worth a shot\n\nr/nocontext",
                                                    "score": 99
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Dizzy_Respond_9824",
                                            "body": "Ye I he has cheats on he just has to do /kill and get back to spawn",
                                            "score": 7
                                        },
                                        {
                                            "depth": 4,
                                            "author": "KaNin1134",
                                            "body": "Try /spawn unsure if it works but it might be worth a try I just looked it up and it says \"/spawn:\nDefaults to teleporting the entity executing the command to their saved spawn point and dimension, or worldspawn if none found, same as running /spawn @s\"",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "InternetPractical657",
                                            "body": "Yes, as long as he slept in it once it clicked it.",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "kotenok2000",
                                    "body": "Why not dig straight down to void?",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "KatTheKonqueror",
                                            "body": "I find floating is less effort. The void won't kill you in creative mode, at least on bed rock.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "No-Spinach-6485",
                            "body": "For anyone to die in creative mode just fall off the world.\n\nand yes without a bed in his house he wont respawn in his home",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "We tried to dig to the void.  We ended up in stars.  He says he likes it there.  He is not dead.",
                                    "score": 309,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cutespacedragon",
                                            "body": "Honestly, out of context this comment goes hard as a little piece of poetry.",
                                            "score": 239,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Negative_Stranger227",
                                                    "body": "LMAO!!!!  Totally saving it!",
                                                    "score": 96
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "CookieArtzz",
                                            "body": "If you have cheats enabled, you can type /kill in chat, which should kill your son’s character. Fingers crossed he has set his spawnpoint",
                                            "score": 19
                                        },
                                        {
                                            "depth": 4,
                                            "author": "phan_times",
                                            "body": "This is moving",
                                            "score": 13
                                        },
                                        {
                                            "depth": 4,
                                            "author": "JustCallMeTheBeard",
                                            "body": "This is the best poem ever!",
                                            "score": 11
                                        },
                                        {
                                            "depth": 4,
                                            "author": "InternetPractical657",
                                            "body": "Blud is a poet 😭💀",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "brytewolf",
                                            "body": "I love this set of sentences so much",
                                            "score": 13
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ryangradsfu",
                                            "body": "This is beautiful….",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "666xm",
                                            "body": "I'm imagining a black and white comic of this comment like Adam Ellis' [take on Two-headed Calf](https://www.reddit.com/r/Frisson/comments/b1fnye/a_comic_by_adam_ellis/).",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Negative_Stranger227",
                                                    "body": "I guess I’ll be making a t-shirt! 😂",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Biivakki",
                                    "body": "This is bedrock so you can't die in the void.",
                                    "score": 18
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": -11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SeaworthinessOk5177",
                                            "body": "get off reddit",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Suns041",
                                                    "body": "Left the phone unlocked in my pocket, sorry",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "SeaworthinessOk5177",
                                                            "body": "oh my bad for assuming m8 (I know you speak Spanish or Portuguese)",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Suns041",
                                                                    "body": "Lmao, you are correct. Portuguese.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TIKYYYYYYYYYY",
                                            "body": "r/skamtebord",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Suns041",
                                                    "body": "Left my phone unlocked in my phone, sorry",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TIKYYYYYYYYYY",
                                                            "body": "Don't worry about it, you're good.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "InternetPractical657",
                            "body": "Open chat /kill @whateverhisusernameis",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "person1873",
                                    "body": "You can also do /kill @p which will kill the nearest player (the person typing the command)",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MulberryDeep",
                            "body": "Press T to open chat and type /kill @p",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Enby-Scientist",
            "body": "one option that might help is to type /seed into the chat box and copy that to the website [cunkbase](https://www.chunkbase.com/apps/seed-map) and see if your son can recognise the way the land is laid out. That would give you right coordinates to go to",
            "score": 182,
            "replies": [
                {
                    "depth": 1,
                    "author": "CookieArtzz",
                    "body": "Cunkbase",
                    "score": 131,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ishank_mahale",
                            "body": "\rPhilomenal",
                            "score": 57,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pesky_faerie",
                                    "body": "r/unexpectedcunk\n\nLove me some rare philomena\nEDIT; oh my god it’s an actual sub",
                                    "score": 12
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Enby-Scientist",
                            "body": "omg... in my defence i was exhausted when i wrote that",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CookieArtzz",
                                    "body": "Defence",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CantQuiteThink_",
                                            "body": "British.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Hlantian",
                    "body": "If he can just remember the biome you could probably find it like this",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Negative_Stranger227",
                            "body": "He keeps saying it is on Bridge Island I don’t know how to find that!",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Hlantian",
                                    "body": "He probably means Birch? If it's an island it could be pretty easy to narrow down on the chunkbase map.\n\nFind out the world seed, which on Bedrock edition can apparently be found if you view the world's Options menu. Enter that number to the Seed field on the site linked above, and make sure that the field below has the correct version (latest Bedrock version probably). Then use the highlight biomes function below the map and select all Birch biomes, then start checking for areas that could be considered islands that have Birch in them. Start looking from 0 0 and work outwards from there",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Hlantian",
                                    "body": "Alternatively if you just got the world seed and posted it, someone here could probably find it",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "heidismiles",
            "body": "If the home base is visible from overhead, he can probably spot it on a map. Have him go somewhere where he thinks he's close to home. Get a map from the creative inventory, and \"use\" the map to fill it in.\n\nThe default map size is 128x128 blocks, so it's pretty large. If the first map doesn't show it, then have him go systematically to the next map area and keep trying. \n\nNote: when you use a map, it'll show a white icon where your player is. If you go outside the map area, the icon changes to a little circle on the very edge, which indicates your direction. So for example if the white icon is at the bottom of the map, that means that you are south of the map area. Hope that makes sense. \n\nSo the point is, he can watch how the map icon changes in order to see where to start a new one. \n\nHe can also systematically place the maps in his inventory so he knows which is which. \n\nHe can also place them on a grid of Glowing Item Frames (on a floor or wall), to keep the maps together. \n\nOh, and keep the current map in your offhand while walking. It displays a little smaller that way so it doesn't take up the whole screen.",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "dryfire",
                    "body": ">The default map size is 128x128 blocks, so it's pretty large.\n\nI still remember the first time I played I spent a couple hours building a house, I was pretty happy with it.  Then I went into a cave, got lost forever taking trun after turn, going deeper, running from all kinds of baddies and couldnt find my way back out.  I finally decided to just dig straight up to the surface and start over.  I popped through the grass literally at the cornerstone of the house i built and thought \"oh wow, the map must not be as big as I thought\"...",
                    "score": 26
                }
            ]
        },
        {
            "depth": 0,
            "author": "aManEatingSalmon",
            "body": "If nothing else has helped so far:\n\nCreate a copy of the world. Make sure “show coordinates” is enabled.\n\nNow, load into the copy of the world in survival and intentionally die. If your spawn is set to a bed in the house, you should respawn at the house. If that doesn’t work, switch your game mode to creative and fly around - the house probably isn’t too far.\n\nOnce you find the house, take note of the coordinates. Go back into the original world, where you should spawn back where you were before. Ensure coordinates are shown on the original world, as you can then use those to find your way back home",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "He told me he put a bed in his house, so maybe it’s a spawn point?\n\nWe will try again to kill him and see what happens.",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "plumb-phone-official",
                            "body": "Jesus christ, I hope no one takes that last sentence out of context.",
                            "score": 42,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "LMAO!  This thread is becoming a mess and I still haven’t found his home!\n\nHe also doesn’t appreciate the work I’m putting in to finding his home!",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Cobnor2451",
                                            "body": "He will someday, I promise.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Nastybat",
                                                    "body": "The most heartwarming statement this far",
                                                    "score": 12
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "aManEatingSalmon",
                            "body": "As long as he has slept in the bed at some point (and it isn’t obstructed in some way), dying should be a fast way to get back home.\n\nJust make sure you do this in a copy of the world, unless he’s playing with Keep Inventory on",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "We killed him and he respawned in a bed in a village that is not his home.  I might’ve lost his inventory.  I guess I’ll find out soon if I fucked that all up!",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "aManEatingSalmon",
                                            "body": "Did you make a copy of the world beforehand? If so, you effectively have a “backup” that you can revert to if he loses his stuff",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "toddestan",
                                            "body": "If he breaks the bed he woke up in, the respawn point should change to the world spawn.  So break the bed in the village, then die again and he should end up at the world spawn.  With any luck, his house should be nearby.",
                                            "score": 5
                                        },
                                        {
                                            "depth": 4,
                                            "author": "e1is3",
                                            "body": "If your son remembers what biome the house was in, use /locate biome {biome name here} and search around there.",
                                            "score": 10
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Midwxy",
                                            "body": "Inventory doesn’t matter in creative",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "We managed to die.  We fell off world.  He spawned at a bed in a village that isn’t his home.\n\nHe said his friend built a home on “bridge island”.  His home is gold and it’s not in a village.\n\nHe’s afraid that if I fly too high, he’ll get lost.\n\nSo what should I do now?",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aManEatingSalmon",
                            "body": "Ahhhh, that’s an issue.\n\nAt this point, I would make a copy of the world and start looking around in the copy. You can always go back to the original to avoid getting lost there.\n\nMake sure “Show Coordinates” is enabled (you’ll be able to see three numbers in the upper left of the screen)",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "Now I have the coordinates turned on! \n\n This is quite the mystery.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FlyByPC",
                                            "body": "Try checking out the area around 0,0. Hopefully his home is somewhere near there.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Negative_Stranger227",
                                                    "body": "I’ll do that today?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "crispycrissy",
                            "body": "Are you on bedrock? Have an extra controller? \nLog in as second player and you will start at spawn, which will likely be close to his house hopefully. And get the coordinates from that or command teleport him to you",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Nytmare696",
                            "body": "Someone MUST have mentioned it by now, but I haven't seen it yet.  If you break the bed he woke up in, that'll reset his spawn to the original spawn point he started the game at.   If you die again, it'll send you back to the original spawn point. \n\nAlso, Bridge Island is probably the name he and his friend came up with for a place.  Minecraft doesn't have set locations and spatial geography that exist from game to game.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "Yes, I did see that.  So I am going to try to destroy that bed.\n\nThank you for mentioning it again.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "thischildslife",
                            "body": "on PC I would press F3, with the menu open look at the coordinates.",
                            "score": -2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Unaccounted_Idea",
            "body": "Or getting a player 2 to join the world, they might spawn in where is house was built?",
            "score": 19
        },
        {
            "depth": 0,
            "author": "RoundShot7975",
            "body": "1. Destroy the most resent respawn point (bed or respawn anchor)\n\n2. Turn on keep inventory\n\n3. Go into survival mode\n\n4. Get yourself killed, fall damage is probably easiest\n\n5. You will respawn at the original spawn point. Hopefully this is near his home or has some sort of path leading to it.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "stein_row",
            "body": "Godspeed. I remember fondly the months of searching for our original base that me and my daughters did back when they would play. Enjoy the time. They move on to stupider games eventually... until they're older and come back home.\n\nI really miss the three or four years I had with each of my daughter's playing. \n\nI am envious.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "TheDUDE1411",
            "body": "You’re a good parent",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "Thank you!  I appreciate this comment.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Unaccounted_Idea",
            "body": "What about typing seed number and game version into seed generator on Google, doesn't that have the spawn point shown ? Then could compare those co-ordinates to his current location in his world?",
            "score": 4
        },
        {
            "depth": 0,
            "author": "YouveBeanReported",
            "body": "Since it hasn't been mentioned yet, are you sure this is the same save file as before? At 6 I could see clicking the wrong save file.\n\n( Admittedly, doesn't sound like this and unsure if ipad has multiple save slots. )",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "He doesn’t have multiple files yet.  He does know how to navigate those, because all his friends have profiles on his Switch.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "biggafart",
            "body": "Maybe have a second device join the world and tell the spawn coordinates. It's possible once he goes back to spawn he could retrace his steps or recognize certain areas",
            "score": 5
        },
        {
            "depth": 0,
            "author": "w1691",
            "body": "it’s a canon event",
            "score": 5
        },
        {
            "depth": 0,
            "author": "wcoreyr",
            "body": "If this makes you feel any better…\n\nMy family still has the same computer I played Minecraft on 10 years ago. I built a world that, at the time, I was really proud of. Somehow I wandered off and was unable to find my way back, for literal years. I’d load up the world, search for a while, get discouraged, and go to another. Eventually, I did find it, years later.\n\nNow, looking back, I’m glad it took me so long to find it all. I was able to look around and see what I’d been able to build at a much younger age, and compare it to what I’d been able to do more recently. I never edited or added anything. I left it just as it was, and that world still exists.\n\nSometimes I still load it up just to see what it was like back then.\n\nI was older then than your son is now, but if this story meets a similar fate, don’t let him delete that world. He may find it one day.\n\nAll of that said, good luck!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "PeanutButterWarlord",
            "body": "This may be overkill, but I think it could help you find it:\n\n1. Transfer the world to a PC. I don't use iOS devices, so I don't know how hard this is to do. You may try following the instructions given in [this five years old Reddit answer](https://www.reddit.com/r/Minecraft/comments/bokqmz/comment/enhfwmg/) and, if that doesn't work or is no longer available, you can use the free trial for Minecraft Realms to do so as described [here](https://www.reddit.com/r/Minecraft/comments/132ut1r/comment/ji6uujw/) (you would need a Windows PC with Minecraft Bedrock Edition for this option to work).\n2. Open the world in a mapping program made for Bedrock Edition worlds (the one I've used is Unmined from https://unmined.net). These programs let you see a map of your world that not only shows biomes and geographical information but builds as well. The benefit from using a program like this one is that it would only show areas of the world where your kid has been already, so it would narrow down the search considerably.\n\nGood luck!",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "blargney",
                    "body": "If the house is made from distinctive blocks, it should be even easier to find this way.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "DardS8Br",
            "body": "Maybe use chunkbase and try to locate terrain that he remembers?\n\nA respawn compass would work if he last died at his base, if he ever turned the game to survival",
            "score": 4
        },
        {
            "depth": 0,
            "author": "TartanHopper",
            "body": "I’m not 100% sure this will work on an iPad but:\n\nThere is a Mojang supported website called chunker.app \n\nYou can upload a world from an exported file (.Mcworld) or (on a PC at least) the data directory.\n\nOn the website, if you select “advanced”, it will show you a map of the data saved in the world from above. \n\nYou can then zoom in and out and scroll around easily.\n\nI’m just not 100% sure about the file structure / exporting files in the iPad.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Sensitive_Wallaby",
            "body": "Does he recall finding anything like a structure or village? \n\nYou can use the /locate <category> <thing> prompts to help. \n\nAlso, you can visit settings and find his seed and use https://www.chunkbase.com to pull it up and if he remembers what sort of terrain was around his house and if there was villages or structures that can help him find it. \n\nI have used both methods to help. \n\nThe last I have is to turn game mode to Spectator and I skim around just below the ground looking upward. Seems to move faster and find things you built easier. Just kind of move around in ever widening circles",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Cupofteaanyone",
            "body": "Has your son been to the nether? If so then go to 0 0 0 in the nether, build a portal and you should come out in his portal if it is close to spawn.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Nastybat",
            "body": "This is the most wholesome thing I've seen related to MC ever!   Everyone trying to help this mom, that knows little about MC, fine her young son's home.  I love it",
            "score": 7
        },
        {
            "depth": 0,
            "author": "andrew6197",
            "body": "He was probably just flying/running around. Set to easy, die and go back to spawn. He more than likely built close to it or will have a better direction from there. His inventory won’t really matter since he was on creative and can just grab everything again.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Adorable-Growth-6551",
            "body": "If dying doesn't work, he can start making maps.  Make a map, make it 4×4 and add a compass.  This won't get him home quickly, but it will help him cover ground and not go in circles looking.  If not on that 4×4 map he will just have to make more until he finds it.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "AgreeableAd8687",
            "body": "use a compass to get back near spawn its probably near there",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Seamoth4546B",
            "body": "It’s probably near spawn, you could fly high up in the air and switch to survival mode to drop to your death and respawn, switch back to creative then",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Hamburgerundcola",
            "body": "If he ever slept in a bed, which is in his home, he will spawn there. You always spawn in the bed, in which you slept in last.\n\nI also once had a dramatic event as a maybe 10 year old, where I lost my base. I was so proud of this world, because I found my first 8 diamonds in this world.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "RealTimeflies",
            "body": "Download unmined. You need to know to copy the files to a computer and have set storage location to external in Minecraft",
            "score": 3
        },
        {
            "depth": 0,
            "author": "AstaHolmes",
            "body": "Get a bunch of maps and keep walking around using them until you see the house on one of them",
            "score": 3
        },
        {
            "depth": 0,
            "author": "timemachinedemo",
            "body": "If there’s a bed he’s already attached to and slept in, you can use a compass to direct back to that spawn point!!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ElderOakCustoms",
            "body": "When he finds it, since he is in creative mode, have him build a beacon and then when he is flying around he will be able to see the beam in the air and shouldn’t lose it again hopefully.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "AlgoRhythm-P",
            "body": "Does he have any Maps? Usually it will unveil the parts that you visited so if he flew in a straight line to set up his house, it could be in that direction.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "No-Mix7033",
            "body": "You could use MCA selector to view a map of chunks that have been generated. You can also filter those chunks by amount of time spent in them. Set the filter to something like an hour and bam. You've got where his house is. Jot down those coordinates and travel there. \n\nHope this helps.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "-Enzoi-",
            "body": "If your son is willing to, if he has set his spawn at base he could try unaliving himslelf (sorry for saying that) it would make him lose his items but it is the quickest way.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Even_Code5050",
            "body": "He might have built his near Spawn point where there would a lighted water source nearby",
            "score": 2
        },
        {
            "depth": 0,
            "author": "needhelp5231",
            "body": "Go to survival and die and you will be near the spawn and go to creative mode and look around for the house. Also you can increase render distance in settings to look faraway",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "I am going to increase render distance for a farther look.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "needhelp5231",
                            "body": "I hope you find your son's castle i know how much it means to him.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "FOUND IT!!",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "needhelp5231",
                                            "body": "Remember to take a screenshot of the coordinates and congratulations. I hope your son is happy now and remember to not make him an addict. Congrats again 😃",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Negative_Stranger227",
                                                    "body": "I did and he is and I will for sure not introduce crack or heroine until he is ten, at least. 🙃",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "needhelp5231",
                                                            "body": "Lmao I meant phone addict 😭😅. And who introduces their kid to crack and heroine at ten and who even introduces their kid to these things 😭. I hope you're happy now, now that your kid has gotten his castle back.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Negative_Stranger227",
                                                                    "body": "You think 9 is a more appropriate age for hard drugs?",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "needhelp5231",
                                                                            "body": "I mean depends upon if he can take it or not.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Negative_Stranger227",
                                                                                    "body": "LMAO\n\nMaybe we’ll stick to chocolate ice cream.",
                                                                                    "score": 3
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PotooSexer",
            "body": "You didn’t need to fall in the void, you could’ve just typed “/kill” into the chat",
            "score": 2
        },
        {
            "depth": 0,
            "author": "nermalstretch",
            "body": "Find some water. Collect lots of dirt and make a tower by continually jumping and dropping a block. When you get very high look for the house. Make the tower in the middle of water and then you can safely jump off.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Sw1fto",
            "body": "You can use this website https://unmined.net/  to create a 2d map of every chunk your son has loaded in his world. From there it should be pretty simple to zoom in on places he’s been to find his gold house",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Miaisfunladybuglover",
            "body": "Same thing happened to me when I was just a bit older then your son. But I was able to find my way back \n\nIf the world is a multiplayer world and if one of your son's friends has joined before I would recommend getting them to join and then seeing were they are then using your son's account teleport to them if they are near his base.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "We found it!!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Miaisfunladybuglover",
                            "body": "Glad to have helped!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "rns0722",
            "body": "Tf is that last part of the edit for? Lmao",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "So people can address me properly and not make assumptions.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "yodaddyshale",
            "body": "i hate when this happens, i usually just restore one of the backups.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Knautical_J",
            "body": "If it was on creative, I’d use an elytra to fly around the map near spawn to look for it. You could also check if he’s taken any screenshots of his game/house. When I play, I take screenshots of things to remember the coordinates for later. If he’s 6, I can’t imagine he built so far away from spawn. \n\nDie, respawn in the bed (a village you say?) and then break the bed, and die again. That will bring you to where he first spawned. He might then be able to find out where he went from spawn. \n\nThe best move would be to play with him. I pray for the day that my kid plays Minecraft, and they go “Dad, can you find me a Nether Star?”. I already play with my friends son, and now my friend has learned Minecraft and they play together. It’s an awesome bonding experience.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "Thank you.  I’m going to try these things!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Theimmortalboi",
            "body": "Lmao",
            "score": 1
        },
        {
            "depth": 0,
            "author": "13luken",
            "body": "Did you find it???",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "Not yet!  He gets really impatient when I want to sit down for two hours and find it for him.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "13luken",
                            "body": "This post blew up so much, I wonder if you uploaded the world file if someone would find it for you guys? I imagine with the right tools and tech knowhow it wouldn't be too hard to discover!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Negative_Stranger227",
                                    "body": "We found it!!!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "13luken",
                                            "body": "WOO!!! Congrats to you and your child. The thrill of finding an old base is one your son will hopefully remember forever. I know I remember re-finding my first base after getting lost for weeks in 2011 :)",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "KaNin1134",
            "body": "If you find it get a picture of the cords or make one of those lodestones and get a compass for it idk",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "Yes!  I learned that.  I’ll put a lodestone at his house if we find it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MisteryGates",
            "body": "Increase the render distance. I'm sure that would make it easier.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "Thank you!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "PussyProphet69420",
            "body": "Did you ever find it?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "Not yet.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "FishyBoi_i",
            "body": "If it’s creative then he might have cheats on. His home is probably near spawn. He could use the “/kill” command and he would go back to spawn.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ymxm",
            "body": "They them should be was and were",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MCShoveled",
            "body": "Step 1: Die & Respawn\n\nStep 2: BREAK THE BED\n\nStep 3: Die & Respawn \n\nStep 4: Fly around and look for the base, it’s going to be really close to where you spawned.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DM_Sensei",
            "body": "I'm not sure about what mods work for mobile/tablet versions, but on the PC version I'm a huge fan of xearo's mini map and xearo's world map mods. It adds your standard rpg mini map to the corner, waypoint system, navigation, etc. Extremely useful, especially for creative when you have a LOT of builds!\n\nAlso, no more need for manually writing coordinates! It will require a mod loader, so you'll have to do some research on that. \n\nhttps://www.curseforge.com/minecraft/mc-mods/xaeros-minimap",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hun77787",
            "body": "You \"people\" cant live a day without telling people you are \"they/them\", huh? Male or female. You cant decide which you want to be.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sea_Tie_6342",
            "body": "Very wierd last sentence in that update.  Why add that?",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "thE_29",
                    "body": "Better not scroll too much in the comments of OP.. Just ignore the thread and move on.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "I’m gonna assume you’re genuine, though it’s obviously self-explanatory.\n\nBecause I was misgendered in a reply and I wanted to make sure people knew how to properly address me.",
                    "score": -4
                }
            ]
        },
        {
            "depth": 0,
            "author": "grrEllaOwO",
            "body": "No way, cool enby parent! :3\nAlso i thought of something you can download universal minecraft tool on your pc and open the worldfile in there it has a pruner tool which is technically for deleting chuncks to reduce world size but it has a birds eye view of all chunks that have been generated so you can find any builds that way.\nYou could also send me the world file and i can do it if you don't have the time or knowledge to use the program efficiently.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "Thank you!\n\nI’m taking a screenshot of this so I can remember it all.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "gameryesyt",
            "body": "Enby parent? Please, how do(es) your child(ren) refer to you?",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lapis_Wolf",
                    "body": "How does that relate to finding the house?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Grady__13",
            "body": "Get good",
            "score": -4
        },
        {
            "depth": 0,
            "author": "Finikyu",
            "body": "Bedrock or Java?\n\nIf Java, quickly install a world map mod.",
            "score": -19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Negative_Stranger227",
                    "body": "I don’t know.  How do I tell?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ponyaqua",
                            "body": "It's iPad, you can't be on Java.",
                            "score": 24,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Finikyu",
                                    "body": "Yeah my bad, somehow skipped over that. :C",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Nathaniel820",
                    "body": "A world map mod is useless if you didn’t already have it installed before\n\nEdit: You guys have no idea how a map mod works, it will reveal literally nothing about chunks that haven’t already been loaded **after** the mod was installed",
                    "score": -14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Finikyu",
                            "body": "Not at all since you could use chunkify to load all the chunks.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nathaniel820",
                                    "body": "That isn't \"quickly install a mod,\" that's brute forcing the answer while also increasing your world's file size by 10x for no reason.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Finikyu",
                                            "body": "Brute forcing an answer? It's a solution and that's what they want, it's not a quiz.\nAnd you can do it on a copy of the world, find the coordinates then get rid of the enlarged copy, it's not a problem.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Pure_pi",
            "body": "Skill issue ",
            "score": -23,
            "replies": [
                {
                    "depth": 1,
                    "author": "SoupMarten",
                    "body": "Bro wtf he's a six yo",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Pure_pi",
                            "body": "Deal with it",
                            "score": -3
                        }
                    ]
                }
            ]
        }
    ]
}