{
    "title": "What is an innocent prank on my students on their MC server?",
    "comments": [
        {
            "depth": 0,
            "author": "MinecraftModBot",
            "body": "* Upvote this comment if this is a good quality post that fits the purpose of r/Minecraft\n\n* Downvote this comment if this post is poor quality or does not fit the purpose of r/Minecraft\n\n* Downvote this comment *and report the post* if it breaks the [rules](https://www.reddit.com/r/Minecraft/wiki/rules)\n\n---\n\n[Subreddit Rules](https://old.reddit.com/r/Minecraft/wiki/rules)[](## Hansrutger|1cz3dfv)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MaliseHaligree",
            "body": "- Dig a hole under their bed and drop a zombie so they can't sleep.\n\n\n- Build something truly horrible and ask earnestly about how you did and be super excited about it\n\n\n- Put parrots everywhere with a jukebox that's set to a pressure plate to turn on when they enter the room (they dance)",
            "score": 94,
            "replies": [
                {
                    "depth": 1,
                    "author": "Laterbot",
                    "body": "Parrots is probably the only idea here I'd say is good",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zawalimbooo",
                            "body": "The zombie one is funny",
                            "score": 22
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Americanshat",
            "body": "Make a treasure hunt for their things back, but every clue is a math problem you've taught and/or will help them for math next year\n\nIf you were able to do it, steal their loot (not ***everything*** but some noticeable stuff) and leave a note saying if they want their look back, go to these cords\n\nFrom there, at those cords make a math problem that uses one of the equations you taught that year (so if you were a Geometry math teacher make a riddle that uses Pythagorean theorem to get to another cord, etc. etc.)\n\nAnd at the end when they do find the cords, have all their stuff there and thank them for playing the little quest and wish them luck in the next school year.\n\nAlso, you could possibly add a secret chest under ground under each of these riddle cords with the correct answer just in case they need it, or some way to see the correct answer instead of having to ask you every time they mess up (if/when they do)",
            "score": 48,
            "replies": [
                {
                    "depth": 1,
                    "author": "ulysse333",
                    "body": "If my teacher did the treasure hunt, I would be super excited to solve the clues! You should do that OP",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "MiFiWi",
                    "body": "Bonus: Make the final location where the stuff is buried right under the chests you stole it from.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "gibbles57",
            "body": "Some kind of treasure hunt to find a treasure that doesn’t actually exist or spawn a bunch of chickens in their houses.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChaosCorbin",
                    "body": "\"I buried three chests around your house\" when there are only two chests",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LordRael013",
                            "body": "Bury three chests and name them in an anvil so it shows up in the UI.  Name them \"1,\" \"3,\" and \"4\".  Of course you'd have to then say you buried 4 chests.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Nightzero661",
            "body": "Build “Math is always watching”",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "ShamPoo_TurK",
                    "body": "“Math will always be behind you for the rest of your life”",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NapoleonicPizza21",
            "body": "put a bunch of tnt below their houses and put a pressure plate on their door, so when they enter it the tnt starts hissing and they think it's going to explode...\n\nbut put water around the tnt so it doesn't actually explode. might give them a heart attack but nothing wrong in the end",
            "score": 1
        },
        {
            "depth": 0,
            "author": "blake_ch",
            "body": "Put a sign next to their houses to inform them about that surprise math exam tomorrow morning.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BrisingrAerowing",
            "body": "Look up Grian's how to annoy your friends videos. Some awesome things in those.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "QL_lynx",
            "body": "Summon dozen of snow golems and watch their base become a christmas movie",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Milly_Thompson",
            "body": "I like to build cute things that are easy to take down (like statues or topiaries) or change signs to new messages, putting Random buttons or pressure plates around that don't do anything but are super suspicious.  Moving around their storage very subtly or moving sat pets by pushing them around.  Name tag animals \"dinnerbone\" to flip them upside down.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LoopyOgre1128",
            "body": "You are the coolest teacher ever",
            "score": 1
        },
        {
            "depth": 0,
            "author": "atomfullerene",
            "body": "I suggest a math based prank.  Something to do with exponential growth comes to mind, because it seems like nothing at first but rapidly gets out of hand.  Maybe use command blocks to spawn double the amount of chickens every day.  Of course, you would have to stop before crashing the world.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MixAmongUs",
            "body": "Noise machine hidden somewhere in a base",
            "score": 1
        },
        {
            "depth": 0,
            "author": "danman_d",
            "body": "How bout a big billboard in their shopping district with the quadratic equation on it :)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MellyTheJelly",
            "body": "You could also put single light grey glass panes in their chests, it will look invisible and they will get confused as to why they can't put stuff in their chests! (Also you can rename the light grey glass panes to something funny)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "burimon36",
            "body": "Definitely setup anvil traps xD",
            "score": 1
        },
        {
            "depth": 0,
            "author": "XOXO-Gossip-Crab",
            "body": "Make a village with a bunch of nitwits and name them after your students",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Most_Cycle9064",
            "body": "God I wish I had a teacher like you XD\n\nOnly mention of Minecraft in our school was Minecraft education edition because I asked for it because im a total n e r d",
            "score": 1
        },
        {
            "depth": 0,
            "author": "boltzmannman",
            "body": "A button on a lamp with a sign that says \"touch the button to die\". Under the lamp you have an observer, powered rail, and a bunch of TNT minecarts, so if they press the button or break the lamp, they die. It's a completely voluntary prank—after all, you are announcing exactly what it does up front.",
            "score": 1
        }
    ]
}