{
    "title": "Sarah Jessica Parker on the set of \"And Just Like That...\" in New York City 🗽",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Snarkeesha",
            "body": "Would have slapped at the met gala",
            "score": 2685,
            "replies": [
                {
                    "depth": 1,
                    "author": "bruin0509",
                    "body": "I read this as “I would have slapped her at the met gala” lol",
                    "score": 598,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Alive-Beyond-9686",
                            "body": "![gif](giphy|l2YWvTHSQWRFsgjGE)",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "justheretosavestuff",
                    "body": "It even fits the theme!",
                    "score": 308
                },
                {
                    "depth": 1,
                    "author": "IBarbieliciousI",
                    "body": "Honestly I think it would be considered too plain and simple for the met gala. At least for someone like her who likes to go all out for the ball.",
                    "score": 184,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kaleighawesome",
                            "body": "still beats a ton of looks that were actually there 😂😂😭",
                            "score": 252
                        },
                        {
                            "depth": 2,
                            "author": "houseofprimetofu",
                            "body": "Take off the jacket and add more shiny then it’s perfect.",
                            "score": 36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kaleighawesome",
                                    "body": "omg imagine like lines of shiny fabric made to look like rainfall/water flowing over the fabric!!!",
                                    "score": 31,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "houseofprimetofu",
                                            "body": "Yeah!! Exactly!",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "chairmanofthekolkhoz",
                            "body": "Her dress this year was more boring than this one",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Revolutionary-You449",
                    "body": "Right?\n\nSomeone would have said. “No, put on these antlers and squirrel hide dress. Don’t forget the bear heels. Ah. Couture.",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Frondswithbenefits",
                            "body": "This is.....so accurate. Lol",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Revolutionary-You449",
                                    "body": "Some snobby ass would have still snapped back with “where are her pigeon lashes!!”",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Frondswithbenefits",
                                            "body": "Lol.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Antique-Customer-149",
                    "body": "Ikr! This looks amazing 😍",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Positive_Amphibian",
            "body": "This show is genuinely terrible and i am SO excited for its return",
            "score": 330,
            "replies": [
                {
                    "depth": 1,
                    "author": "notcool_neverwas",
                    "body": "As someone who loved the original, I also find this reboot atrocious but I’ve watched every episode and will be returning for this new season. 😂😂 it’s my new comfort hate show! Che was one of my biggest annoyances last season, so maybe it will improve a bit now that they’re gone.",
                    "score": 75,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Positive_Amphibian",
                            "body": "It's S tier garbage, it's such an amazing hate watch! And i hate the dogpile on Che's actress because it's not their fault, but jesus christ Che is a horrible and horribly written character. To the point that they could've killed off her character and i think fans would've celebrated 😭",
                            "score": 36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "notcool_neverwas",
                                    "body": "Oh for sure! I’ve been a fan of Sara Ramirez since their Grey’s Anatomy days, but WHEW Che was such an awfully written character (and I think they knew that). \n\nI also think AJLT often tries too hard to make up for all of the sins/missteps from the original - and now they *over*corrected in ways that don’t feel authentic or plausible.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Positive_Amphibian",
                                            "body": "This is it exactly. They're embarrassed that their old show is kind of racist and homophobic and they're overcorrecting too hard. It's why we get miranda's white savior word vomit in episode 1, charlotte's annoying (but \"diverse\") kids, poc and queer characters inserted with little to no care or effort at all on the writer's parts, and all of these overly on the nose \"woke\" storylines. And since the writing sucks and things often don't have resolution or aren't connected to the rest of the show, it always feels so forced and random",
                                            "score": 10
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DestroyerOfMils",
                            "body": "The blizzard episode (and costumes) live rent free in my head!!!!!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rosiekeen",
                    "body": "Omg same. I love watching it weekly to complain about lol",
                    "score": 39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Positive_Amphibian",
                            "body": "It's honestly camp! It's such a horrible imitation of the original, it kind of comes full circle and goes back around to being fun\n\nSteve rapidly aging, the awful fashion, the AI esque writing - like the fact that they introduce plot lines that never get resolved, that Stanford is canonically a monk now??, an off screen fallout between two of the leads, the stand up comedy and LGBTQ rally scenes that tell me no one in the writer's room has ever been to either, Big literally dying during a Peloton ad and Carrie not calling 911 - oh my god there's so many gems",
                            "score": 54,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "candleflame3",
                                    "body": "Don't forget the wheezing goat sounds from the fingering Miranda got off Che while Carrie peed in her bed.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Positive_Amphibian",
                                            "body": "https://preview.redd.it/yhc70spun22d1.jpeg?width=1170&format=pjpg&auto=webp&s=ad93dd3aa2e9784860b9aad5b35e9a335bd62544",
                                            "score": 5
                                        },
                                        {
                                            "depth": 4,
                                            "author": "sassypapaya",
                                            "body": "thanks I hate it 😭",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Correct-Bitch",
                    "body": "hear me out: golden girls reboot instead but with this costume team.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bellesdiner0228",
            "body": "Nothing will make me watch this show. But this dress almost made me slip. Damn. She looks so beautiful.",
            "score": 1857,
            "replies": [
                {
                    "depth": 1,
                    "author": "Creative_Key_9488",
                    "body": "Watch it and suffer with the rest of us! 😂",
                    "score": 519,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AnniaT",
                            "body": "I loved the original SATC but decided not to deal with anything more after the first movie because it seems like everything after that is a mess. And I was scared it would ruin the show to me lol\n\n\nIs it worth it?",
                            "score": 245,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ComerECalarABoca",
                                    "body": "It’s horrendous. I hate it so much, I can’t wait for the next season.",
                                    "score": 658,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ill-Vermicelli-1684",
                                            "body": "This is exactly how I feel about it. \n\nIt’s awful. Truly. I’m hooked.",
                                            "score": 275,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dangerislander",
                                                    "body": "As a standalone show - and pretending SATC doesn't exist - is it at least decent?\n\nOr is it shit because it changes everything from the original?",
                                                    "score": 33,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ill-Vermicelli-1684",
                                                            "body": "Nah, I think it’s pretty bad all around. \n\nThere’s some changes from the original which is frustrating, but they’re also trying to introduce elements of diversity and inclusion (which is good! I am here for that!) into the show but doing it really, really poorly imho.",
                                                            "score": 141,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "dangerislander",
                                                                    "body": "Oh damnnn... sounds like it comes across as performative. Apparently that's the same with the recent Greys seasons. Gonna pass on this show then! I'll stick to watching TikTok clips lmao",
                                                                    "score": 23,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ill-Vermicelli-1684",
                                                                            "body": "Yep. Like they have some non-binary characters (cool!) but they are very one-dimensional and sort of awful. It’s that kind of thing.",
                                                                            "score": 32,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "derrickcat",
                                                                                    "body": "\"sort of\"! - that is a generous take\n\noh it's just awful, the whole show, i love it",
                                                                                    "score": 12
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "carrtoonist",
                                                                                    "body": "Which is hilarious because there's a plot point in a couple episodes with that character where they complain about exactly that but within a different context",
                                                                                    "score": 7
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "gotchibabe",
                                                                            "body": "Season 19 of Greys was ok because the new intern class is somewhat enjoyable - but you’re right the show starting in like season 15 has been on a whole ass soapbox",
                                                                            "score": 8
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Snuffleupagus27",
                                                                            "body": "Greys seemed to always have a cast of pretty diverse characters, how did they manage to mess that up?",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "gotchibabe",
                                                                                    "body": "Her name is Krista Vernoff - she also helped ruin the last season of Shameless",
                                                                                    "score": 4
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Visible-Scientist-46",
                                                                    "body": "Darren Star has no idea how to do diversity. I tweeted @YoungerTV several times with suggestions for office friends, or neighbors, but they never did it. It's like they live in a different NYC than I did.",
                                                                    "score": 27,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "bluecoastblue",
                                                                            "body": "He does diversity like he does women---with thinly veiled disdain. I find the new seasons unwatchable.",
                                                                            "score": 45,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Visible-Scientist-46",
                                                                                    "body": "Me too! Hard pass.",
                                                                                    "score": 2
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ZestyPossum",
                                                                    "body": "Yeah, it's like they're trying to shout and wave the big diversity flag in our faces. \"See?! We're all inclusive and woke now!\"",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "parkay_quartz",
                                                            "body": "It's very bad, but if you watched The original and have someone to hate watch with it makes for a good time. My gf and I watched the original series in anticipation and while I don't think the original is perfect, the sequel series is a MASSIVE drop in quality.\n\nIt also ruins a lot of character motivations and decisions from the original, they really do Miranda dirty here. They also really downplay the Big stuff when they rush to reintroduce Aiden which I thought was kind of a slap in the face to everyone who went through all the BS with Carrie in the original. \n\nAll that being said it's almost fun to watch because of how bad it is, and I appreciate the camp.",
                                                            "score": 26,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ohmydeartrashpanda",
                                                                    "body": "I got that slap in the face! I was right there with Carrie all those seasons going through the whole story with Big (and I really loved that guy too and the actor as well). Hated Aiden. Then Big & Carrie have their happily ever after, I'm happy, all is fine with the world. And then \"Just like that\" happens. Kills him off in the second episode. I was so f\\*cking mad. I still am. Who the f\\*ck does that?? \n\nAnd then Aiden came back? WTF???!!! Still hate that guy.\n\nI probably saw this about six months ago by now and I am still furious!",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "MCR2004",
                                                            "body": "I think most fans would’ve been fine with changes from the original because there are tons of untapped stories about women in their 50’s and up unfortunately they made it either 1. Ignoring the things that change with age (Carrie and the new Samantha waiting in line at a club acting that is totally normal at their age, or picking up 20 somethings at a bar) OR 2. Acting like 50s and up is a time when women loudly announce they have to pee and are extremely awkward in general",
                                                            "score": 6
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "NYLady13",
                                                            "body": "No,. it's terrible, and you don't have to pretend SATX doesn't exist- the characters really don't act like \"themselves\".",
                                                            "score": 6
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "noposters",
                                                            "body": "Do it is an absolute abomination",
                                                            "score": 2
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "fluffyball13",
                                                    "body": "Hahahah same😂",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CokeMooch",
                                                            "body": "It’s so bad I can’t look away.",
                                                            "score": 12
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "eternalbean",
                                                            "body": "This thread is killing me 😂😂😂 hilarious —— and now I kinda wanna check it out hahaha",
                                                            "score": 11
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "EgoFlyer",
                                            "body": "Oh my god, this is exactly it 😂",
                                            "score": 7
                                        },
                                        {
                                            "depth": 4,
                                            "author": "lepetitgrenade",
                                            "body": "😂",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "International-Bird17",
                                            "body": "Lmao exactly ",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "emgyres",
                                            "body": "This is very much the vibe",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TheChaddingtonBear",
                                            "body": "The problem is the Michael Patrick king was always an ordinary writer. He’s soap opera level, and that’s essentially what ajlt is. Sex and the city worked because there were a bunch of really good women comedy writers who had a unique opportunity to tell all their funny embarrassing sex stories. We’d seen this with Elaine in Seinfeld and to a lesser degree friends but satc was like a damn breaking.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "tenderourghosts",
                                    "body": "I think the main issue with AJLT is that they’re trying to “correct” parts of the original series that were not culturally or politically sensitive, but it ends up feeling really forced with a bunch of one dimensional characters that have as much screen time as the original mainstays. A similar thing happened with the revival of The L Word with Generation Q. 2 episode storylines with no overall plot backbone. Hot button “buzzwords” thrown in with no real rhyme or reason. The clothes are pretty, though.",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AnniaT",
                                            "body": "I don't like when reboots/sequels do that. Yes, there were things that wouldn't fly now, but just let them be, it was a reflection of its time. It feels forced and artifical when they go on the checklist correcting modus. The characters end up not being themselves anymore.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "hunnyflash",
                                                    "body": "This felt really bad in the first season, but the 2nd season toned it down and it felt a lot more natural. I'm hoping they keep up that energy. \n\nI put off watching season 2 for the longest time, but I was okay with it. I'm still not totally happy with everything they've done to the characters, but it felt a lot more like the old show.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "shespokestyle",
                                            "body": "Exactly! Everything felt force. Even that Aiden thing doesn't even make sense. She always loved John and it was such a slap in the face to make her date Aiden again. It should've ended with just John and let Aiden have a happy ending with the mother of his kids.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "tenderourghosts",
                                                    "body": "The Aidan thing was definitely fan service, and a sloppy job at that lol. I never felt like her and Aidan made sense as a couple. Mr. Big wasn’t great but neither was Carrie, they were just great together 🤣",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "lizziexo",
                                    "body": "Just to third what other people said; don’t watch it. I loved the original show + first movie. Second movie was so gross I pretend it didn’t happen. \n\nAJLT is just truly awful. It’s not bad in a funny way either, it’s just depressing how I used to love this show and everyone creatively seems to make the worst decisions whenever possible. I stopped watching. I visit the subreddit sometimes and they still hate it too.",
                                    "score": 50,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "remoteworker9",
                                            "body": "I don’t like either movie, they’re worse than AJLT in my opinion.",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "archersarrows",
                                    "body": "I paid money to hear Kim Catrall say, \"Lawrence of My Labia.\" SATC can't take anything more from me.",
                                    "score": 23
                                },
                                {
                                    "depth": 3,
                                    "author": "blossombear31",
                                    "body": "I haven’t watched the movies either! I gave the revival a chance but no, I couldn’t watch it, too bad lol\n\nI have watched a scene from the movie countless times when [Charlotte shouts at Big](https://youtu.be/H-O-z5gELUY?si=RnwU0i-NWiLPTVJM) lmao",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "NotElizaHenry",
                                            "body": "Oh my god, this is why I love SATC. Tears, drama, yelling, heartbreak, then Charlotte’s lil penguin walk to the other side of the car. No matter how serious they tried to make it they couldn’t stop themselves from throwing in something completely silly. ",
                                            "score": 11
                                        },
                                        {
                                            "depth": 4,
                                            "author": "oops_im_existing",
                                            "body": "i liked the movies, for some reason. hate this show though.",
                                            "score": 6
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Creative_Key_9488",
                                    "body": "It IS a mess! It’s so bad! I can’t wait for the next season!",
                                    "score": 27
                                },
                                {
                                    "depth": 3,
                                    "author": "SiobhanRoy1234",
                                    "body": "I watched it all and to me there is a divide: the original SATC versus the movies + AJLT. The original show is sooooo good! The movies and AJLT are a campy caricature. I like watching the campy caricature but I see it as separate from the OG show. I will refuse to see Samantha’s storyline in those as canon!!",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AnniaT",
                                            "body": "I think the first movie still captured the vibe of the original, even if I didn't like the actions of some of the characters. But the second movie just no 😭\n\n\nSomething that also detracts me from AJLT is the absence of Samantha, hence why I never watched it. The 4 friends but specially Samantha was the heart and soul of the show for me. I know it's not their fault Kim didn't want to join, but still.",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SiobhanRoy1234",
                                                    "body": "I was so disappointed in the first movie 🙈. The sense of humour that was so essential to SATC just….wasn’t there. There’s one ‘humorous’ scene where Charlotte gets diarrhea, I mean wtf? But that’s just my opinion 🤷🏻‍♀️",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Owl_button",
                                                            "body": "When Charlotte “Poughkeepsies” her pants after accidentally drinking a little water in the shower in Mexico 😣 \nThat scene made me cringe so bad-I know the word is overused but I cringed indeed.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "hunnyflash",
                                                                    "body": "I think that happened because all she was eating was that yogurt or pudding lol",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CaveJohnson82",
                                    "body": "No. I watched the first series and it was appalling.",
                                    "score": 13
                                },
                                {
                                    "depth": 3,
                                    "author": "sanfollowill",
                                    "body": "It’s awful but nothing can ruin the original for me. \n\nI also love how awful it is. It’s the most unrealistic version of what would have happened with these characters. I can’t get enough.",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "MyAviato666",
                                    "body": "It's not worth it at all. But still.. join us.\n\nEdit: even though it's pretty bad I still enjoy watching it.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "TacoPartyGalore",
                                    "body": "There’s a video out there of a motorcyclist on a highway kicking a car hogging up the left lane, the car veering to hit him, and instead hitting the retaining wall.  It loses control and careens down the opposite side of the highway, where it slams but an SUV that flips over.  This show is like that, and you won’t be able to stop watching.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "JACHR1900",
                                    "body": "I dont think so. I watched the first eipsode of the new show and as usual, it is ALL about carrie. And if you arent all about carrie then dont bother. I see enough narcissist behavior in politics I sure dont want to watch it  in another program. Besides, she has aged as we all do but the personality hasnt matured at all. Her character lacks dignity. But thats just my opinion...",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "soccerguy721",
                                    "body": "It’s not! Don’t ruin your memories.  It’s a farce and true fans are horrified.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "shespokestyle",
                                    "body": "Same. I'm just rewatching Season 1 of SATC on Netflix. Best season so far. I saw clips of this and it felt like they just shit on the first 6 seasons with the character development. They also tried to make this fucking show diverse with woke shit. Also, the issue with her love with BIG and saying that it was all a mistake and that she loved Aiden after all. Like, she never grew up and she's stuck in her 30's Carrie. Also, making Miranda date women because the actress is into women doesn't even make sense. Miranda loved Steve and then everything turned shit. Show is the worse. They're really trying to make it relatable. They should just end the show.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "CamelInfinite5771",
                                    "body": "I’m not capable of watching SATC anything without Samantha.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "ZestyPossum",
                                    "body": "I went in with very low expectations. And yeah, it's so bad it's actually enjoyable and fun.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Aromatic_Razzmatazz",
                            "body": "I've gotten into the absolutely cutting critiques on YouTube of the new reboot, aspyn j is especially watchable. Still get to enjoy the fashion, with lots of snark on the side. ",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PinkTalkingDead",
                                    "body": "Ooh ok good thanks for the rec, I haven’t found an AJLT commentary channel that I really like yet",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "J_pepperwood0",
                                    "body": "Her commentaries are so good! I will never watch the show but I am feasting on the snark",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Chaywood",
                            "body": "It's so much fun to hate 😂",
                            "score": 14,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Creative_Key_9488",
                                    "body": "So much fun! What I dislike is how much they made me hate Miranda. She used to be my second favourite after Samantha and now I hate her. Ugh.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Chaywood",
                                            "body": "They butcheredddd Miranda's character, it's so bad!",
                                            "score": 8
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "coco__bee",
                            "body": "![gif](giphy|Ae7SI3LoPYj8Q)",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "trishyco",
                            "body": "My friend and I only watch to complain about it to each other via text",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "TacoPartyGalore",
                            "body": "The hate watching is STRONG",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Poppidots",
                            "body": "I stopped watching after the first season It's just awful.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Glissandra1982",
                            "body": "I can’t bring myself to do it either.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Tubie123",
                            "body": "Its a beautiful disaster,  im sure the next season wont disappoint lol",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bigsleep5756",
                    "body": "my husband & i started “hate” watching it a few years back and we LOVE it. (even tho we yell at the tv sometimes bc of certain decisions/characters) we even rewatched the series recently 🤣",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "alaosbshsukxndb",
                            "body": "That’s what happened to me and my mom lol. It began as us wanting to see how bad it is, and now we are eagerly awaiting the third season🤡",
                            "score": 12
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JoleneDollyParton",
                    "body": "there was this tweet that was something like \"I love AJLT. I hate it. I want it to be cancelled. I want it to win 100 Emmys,\" and it pretty much sums up everything I feel.",
                    "score": 59,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vieneri",
                            "body": "is Carrie still with Big? They do not go well together AT ALL",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littlebittydoodle",
                                    "body": "Umm I have some news for you. You may want to sit down 🪑",
                                    "score": 68,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "vieneri",
                                            "body": "i just read about it. Did not see it coming",
                                            "score": 17,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "JoleneDollyParton",
                                                    "body": "good, i did not want to break this news to you, lol",
                                                    "score": 16
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "CamelInfinite5771",
                                                    "body": "And it made Peloton’s stock drop dramatically in real life",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "NotElizaHenry",
                                            "body": "I went into it not knowing. I totally forgot they got married and I was all “I’m so happy for them, Cartier seems so happy, I can’t wait to see what their life looks like together!” I felt so betrayed. ",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "FormerlySalve_Lilac",
                                            "body": "And definitely on a chair, not a peleton",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CrazyButRightOn",
                                    "body": "Only on Thursdays.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OldNewUsedConfused",
                    "body": "The dress deserves a show of its own",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PinkTalkingDead",
                            "body": "This is a very SATC era Carrie quote 💝 ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OldNewUsedConfused",
                                    "body": "Lol!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MissBanana_",
                    "body": "My best friend and I grew up watching SaTC and now on the very rare occasion we can get together, we drink wine and watch “and just like that” and rip on it the entire time and it’s a *blast*. It’s one of those shows that’s only enjoyable when you have someone you can make fun of it with it.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Bellesdiner0228",
                            "body": "That sounds like it would be a blast. I'd absolutely do it in that scenario too.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "keekeeVogel",
                    "body": "It makes me sad, I can’t either. But yeah I had to click on this cuz it took me back. She looks stunning in this dress. 👏",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Lethave",
                    "body": "Please know I don't watch it because I want to at all. Next season really cannot come soon enough based on this dress",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "dragonrider1965",
                    "body": "Same , love this on her but I can’t watch that show .",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Special-Investigator",
                    "body": "my exact thoughts",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Much_Fee7070",
                    "body": "The dress IS beautiful.  But damn.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "casperdacrook",
                    "body": "I swear there’s a tile on the bathroom floor at my grandmother’s that vaguely looks nothing like her. I wish I had a picture so nobody could agree with me",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Bellesdiner0228",
                            "body": "Is it bad, I think I get what you mean? Like a pale pink tile with a vague hint of floral?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "casperdacrook",
                                    "body": "You been to my nana’s?",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BojackTrashMan",
                    "body": "Same. The concept of the show sounds awful. The women without their brunches and without Samantha? That was the whole show. \n\nAnd it sounds like they try to do diversity without any authentic voice to it. \n\nBut I'm like you. This dress is so good it *almost* made me want to watch",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Poppidots",
                    "body": "Really? Because I think she looks ridiculous.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PinkTalkingDead",
                            "body": "Pardon me but _what_ ",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "itsyagirlrey",
            "body": "She's so gorgeous but I miss curly haired Carrie!! Seasons 1&2 of SATC gave me so much confidence as someone who had the same wild curly hair texture as her that I rarely saw on TV!",
            "score": 178,
            "replies": [
                {
                    "depth": 1,
                    "author": "mayqween",
                    "body": "Agreed - it's the second worst crime against curly hair since the Felicity haircut.",
                    "score": 75,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AcidicKiss12",
                            "body": "I’m dead at this reference, I was thinking the same 🤣",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "eternalbean",
                                    "body": "It’s so funny because I really loved felicity’s short hair 😂 she looked so beautiful! But Keri Russell’s face is truly one of a kind",
                                    "score": 13
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lawyercat63",
                    "body": "Gray hair can cause a change in texture. Maybe it’s not the same?",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "candleflame3",
                            "body": "My grey hairs so far are amusingly kinky.  I might have a full head of witch hair when they all come in.",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "Coriandercilantroyo",
                            "body": "Nicole Kidman has mentioned her curls aren't the same. She said something about years of styling and coloring",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "vieneri",
                    "body": "As a curly hair girl myself, season 5 episode 5 of satc she had gorgeous hair, though.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CrazyButRightOn",
                            "body": "Oddly specific.",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "orbjo",
            "body": "She looks like she’s playing a “Good witch” version of her hocus pocus character\n\n\nThis is the highest compliment of hotness ",
            "score": 217,
            "replies": [
                {
                    "depth": 1,
                    "author": "lilacjive",
                    "body": "Yes, nailed it",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "Sec2727",
                    "body": "![gif](giphy|VQtnoNhXmb4atK6F51)",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "naomicambellwalk",
                    "body": "Omg I love this description",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "toseeincolor",
                    "body": "I will always love her. Young me didn’t even know the role she played in my gay awakening.  How could she not? Her Hocus Pocus character has me still coming back every Halloween. \n\nWhat a fantastic character and what a movie.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "hisosih",
            "body": "I'm not a SATC girlie but I always love seeing SJP's looks as Carrie, her styling is so ethereal always.",
            "score": 629,
            "replies": [
                {
                    "depth": 1,
                    "author": "jadenscookies",
                    "body": "i completely agree! i almost watched SATC only because of SJP’s outfits. it nearly convinced me! \n(that, and a quote from the queen SJP herself) “When I first moved to New York and I was totally broke, sometimes I would buy Vogue instead of dinner. I felt it fed me more.”",
                    "score": 96,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lucylucylove",
                            "body": "SatC is literally iconic. You must watch! Just keep in mind that it's in a time capsule",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Glissandra1982",
                                    "body": "I adore SATC - I haven’t watched any of the new show though. I need my Samantha Jones.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lucylucylove",
                                            "body": "I LOVE her! I also love this scene from forgetting Sara Marshall \nhttps://youtu.be/TgdyaBpydNw?si=oB_ZtS09XP0ErKDj\n\nIt always makes me crack up whenever I hear Samantha's name",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Glissandra1982",
                                                    "body": "Yes!! I quote that a lot!",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "EvenHuckleberry4331",
                                    "body": "I completely agree. It’s such a part of my psyche.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "sweetpotatothyme",
                            "body": "Kasia Sopniewska on YT posts fun, short recaps of the original seasons and also highlights the fashion. It's a great way to peek in without committing to the show.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jadenscookies",
                                    "body": "that sounds great actually! i’ll definitely check it out",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LordyIHopeThereIsPie",
            "body": "I will watch every episode of this crappy reboot and complain how bad it is.",
            "score": 421,
            "replies": [
                {
                    "depth": 1,
                    "author": "mamrieatepainttt",
                    "body": "I don't think anyone that watches genuinely enjoys it, at this pt we all just hate watch.",
                    "score": 78,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oops_im_existing",
                            "body": "i stopped my hate watching of this. maybe i don't hate this show enough",
                            "score": 32,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mamrieatepainttt",
                                    "body": "I'm jealous of you, girl. I want so badly to drop this steaming pile of doodoo but I can't stop myself.",
                                    "score": 11
                                },
                                {
                                    "depth": 3,
                                    "author": "dangerislander",
                                    "body": "Nah I think you're just normal lol",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "oops_im_existing",
                                            "body": "omg why am i lowkey offended that you called me \"normal\" 😂",
                                            "score": 13
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "littlebittydoodle",
                            "body": "I’ve literally not heard one person say it’s “good.” I hate watch too, and can’t wait for the next season.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mamrieatepainttt",
                                    "body": "Me either, even from die hard fans, all i read is 'this is terrible for xyz reasons.' I keep hoping it gets canceled tbh so I can stop watching. But I won't if it keeps going, car crash status. I do love the ~lewks tho.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "littlebittydoodle",
                                            "body": "Same. It’s absolute trash TV and I appreciate the escape, but I can’t see how they’ll keep it going.",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RaindropsAndCrickets",
                                    "body": "Yeah, the most you ever hear is that “oh wow! It’s a good episode! Wow, I really liked this one because it was so much better than the other episodes! If only they didn’t include XYZ in this one, it would’ve been great! I mean, not compared to the original SATC, but relatively speaking…”",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Duel_Option",
                            "body": "My wife begs to differ, meanwhile I \ncontemplated taking a sledgehammer to the TV when she would watch it.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PinkTalkingDead",
                                    "body": "Can you share what she likes about it? I’m genuinely curious lol\n\nDid she never watch the original?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Duel_Option",
                                            "body": "I genuinely couldn’t tell you what she likes exactly. \n\nFor context, I love the original series and introduced her to it and she binged it right in time to see the second movie.\n\nIf I had a guess, I think she enjoyed it so much and didn’t have the gap between the series and movies that she just went along with whatever they made.\n\nFor myself as an original viewer when it was on HBO, the dramatic shift/tone to the movies and now “And Just Like That” is simply too much to much.\n\nSome of me is impressed that she will casually watch and not be critical, almost like she’s oblivious to quality.\n\nShe is the type of person that likes “Sharknado” though, so that might be the real reason lol",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mamrieatepainttt",
                                    "body": "I appreciated the topics and conversations brought from them. It was just the execution of said topics, instead of it being seamless or subtle, they hit you over the head with everything. All the topics and the /diversty/",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Duel_Option",
                                            "body": "Pandering, that’s the operative word for what the show does and it’s so blatant they might as well have cue cards to tell the audience what to feel. \n\nInsert sad moment, sexual innuendo joke, ageism round table, CIS gender exposition.\n\nIt’s like chat GPT spit out a plot and someone very high and very dumb wrote a script based off it.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mamrieatepainttt",
                                                    "body": "Yes ty, well said. It's honestly insulting at points.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "StasRutt",
                    "body": "The chokehold this stupid show has on me.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "estedavis",
                    "body": "I will see you there",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "DistrictFast4628",
                    "body": "Same!",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "Which_way_witcher",
                    "body": "I let others go through the pain to watch it so I can enjoy laughing with them as they recap how horrible it was. The funny recaps are better than hate watching.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "prolelol",
                    "body": "Is it supposed to be bad, but still somewhat watchable?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "alaosbshsukxndb",
                            "body": "It’s not that it’s truly really bad, it’s just very different than Sex and the City. Yet features the same characters lol. \n\nI started out hating it but secretly enjoy it now",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "championgoober",
                    "body": "Amen.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HeartFullOfHappy",
                    "body": "I won’t watch the show anymore but I watch the funny YouTube reviews!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "l3tigre",
                    "body": "I could have sworn they ended the whole thing last season... seemed a perfect stopping point...",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Glissandra1982",
                    "body": "I wish I had some girlfriends to hate watch it with.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mrgnfnn",
            "body": "Straight off the runway!",
            "score": 48
        },
        {
            "depth": 0,
            "author": "stellar14",
            "body": "Simone Rocha was in my year in college… it’s crazy to see how huge and successful she got. She’s incredibly talented and manages to make ageless and timeless designs.",
            "score": 77,
            "replies": [
                {
                    "depth": 1,
                    "author": "Betseywaps",
                    "body": "That’s so cool! Did ppl know back then that she would become super successful? Was she a star student or something? I’m such a big fan of her work",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stellar14",
                            "body": "Her dad is the successful designer John Rocha so she wasn’t starting from scratch, had good internships in Marc Jacobs and stuff, but she’s massively surpassed him… she’s was probably given a harder time in college because of her history.",
                            "score": 13
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mologav",
                    "body": "Is she one of the Rocha’s who grew up in Ireland or England?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stellar14",
                            "body": "Ireland",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mologav",
                                    "body": "Cool",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "issagoood",
            "body": "She just looks so good in clothes",
            "score": 70,
            "replies": [
                {
                    "depth": 1,
                    "author": "littlebittydoodle",
                    "body": "So well said! She doesn’t even need to show skin. She looks flawless.",
                    "score": 12
                }
            ]
        },
        {
            "depth": 0,
            "author": "Brandy_Marsh",
            "body": "My god this woman can dress",
            "score": 25
        },
        {
            "depth": 0,
            "author": "MedicalExamination65",
            "body": "Classic Carrie, I love it.",
            "score": 17
        },
        {
            "depth": 0,
            "author": "StasRutt",
            "body": "Now THIS feels like Carrie",
            "score": 16
        },
        {
            "depth": 0,
            "author": "Rare-Key8765",
            "body": "She’s beautiful. I’m in love with that dress!",
            "score": 80,
            "replies": [
                {
                    "depth": 1,
                    "author": "DraMeowQueen",
                    "body": "I’m in love with the bra, lol. Just realized that Carrie always wears great bras and would like to know what brands are.",
                    "score": 57,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mamrieatepainttt",
                            "body": "It's cause she's always had a clause in her contract that she wouldn't do nudity. She's the only one of the main girlies that didn't show boobage.",
                            "score": 43
                        },
                        {
                            "depth": 2,
                            "author": "WhateverYouSay1084",
                            "body": "I would kill to have a bra that fits that great!",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Aworthyopponent",
                                    "body": "Her bra doesn’t appear to fit her well. She is popping out on top, the middle part should against her sternum, and it appears to provide no support. Check out r/abrathatfits for help on sizing and recommendations on how to get a great bra. My life changed once I realized my true size and what a good fitting bra actually looks and feels like. I am not even joking, I am very busty for my frame so life truly was harder lol.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WhateverYouSay1084",
                                            "body": "Idk, maybe but I feel at least somewhat confident that the costuming team made sure her bra fit well. I can't really afford a bra that fits anyway. What I get is whatever Marshall's or TJ Maxx has on clearance.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Aworthyopponent",
                                                    "body": "Yeah you’re probably right and I’m not a professional so I guess I don’t truly know. A lot of the time it’s really the size we get wrong. A good bra doesn’t need to be expensive, a good bra is just one that fits well even if the size is one you don’t normally wear.",
                                                    "score": 5
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SentimentalSaladBowl",
            "body": "That dress is kind of hideous and yet I still find myself upset that I don’t have it.",
            "score": 62,
            "replies": [
                {
                    "depth": 1,
                    "author": "OnlyPaperListens",
                    "body": "I feel exactly the same way. It's atrocious yet I respect it. It confuses me.",
                    "score": 27,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "da_innernette",
                            "body": "Interesting what’s ugly about it to you? I don’t mean that argumentatively! I think every aspect of it is cool, the fit, the tailoring, the sheerness, the flowers. But curious what parts are standing out to ya!",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OnlyPaperListens",
                                    "body": "A sheer gauzy fabric should be about flow. It should be wispy and ethereal. Weighing it down with saggy pockets stuffed with crap (pretty crap, but still crap) shoots it in the metaphorical foot. It's like tying dumbbells to a butterfly.\n\nIf I were tasked with fixing it but retaining the concept, I would remove all the pockets and instead do thicker seams, then line the seams with individual petals and leaves.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jteitler",
                                            "body": "Omg dumbbells to a butterfly-this is the most perfect analogy and now I can't unsee it. You are exactly right!",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "da_innernette",
                                            "body": "Ooooh yeah I can see that! Thanks for explaining I genuinely was curious!",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "SentimentalSaladBowl",
                                    "body": "No, I’m with you on everything. It’s just one of those things I like that I am CERTAIN most other people will hate. \n\nA lot of times I will say “that’s hideous, I love it” or “that is so dumb, love it” when a friend has a new article of clothing. And it’s a compliment. Stupid, ugly, too much. These are all terms of endearment to me. 🤓",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "da_innernette",
                                            "body": "Hahahah. Totally get that. Tbh those are probably my favorite pieces in fashion and art. The ones that aren’t classically “pretty” and are just more polarizing or confusing. The more intriguing the better!!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "emilydoooom",
                    "body": "I’m so distracted by the horrible fit of that bra under it…",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Which_way_witcher",
                    "body": "I like the floofyness but it's just not executed well making it ugly. I like what it *could* have been.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "meepmarpalarp",
                    "body": "How I feel about Carrie’s entire aesthetic tbh",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SentimentalSaladBowl",
                            "body": "![gif](giphy|dXFKDUolyLLi8gq6Cl|downsized)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "oldwellprophecy",
            "body": "That’s one of the most beautiful dresses I’ve ever seen. What a dream.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "cancerheaux",
            "body": "yayyyy i actually like this show lol can’t wait for it to come back",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "notcool_neverwas",
                    "body": "I’m starting to think I do, too 😂😂😂 I still DON’T think the first season was good, but by the end of the second I was like “Wait am I *enjoying* this??” 😭😭",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "ilca_",
            "body": "I love this",
            "score": 8
        },
        {
            "depth": 0,
            "author": "GoodCalendarYear",
            "body": "That dress is everything!!",
            "score": 8
        },
        {
            "depth": 0,
            "author": "meowparade",
            "body": "This feels very Carrie.  I watched the first season, where they all dressed and acted like they were in their 80s in the Victorian era, so this feels very refreshing!",
            "score": 7
        },
        {
            "depth": 0,
            "author": "alhubalawal",
            "body": "Oh my that dress is absolutely fabulous",
            "score": 7
        },
        {
            "depth": 0,
            "author": "ready-to-rumball",
            "body": "That dress is gorg 😍",
            "score": 8
        },
        {
            "depth": 0,
            "author": "I_dont_cuddle",
            "body": "R/abrathatfits should have been consulted",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "catchingstatic",
                    "body": "Thought the same thing. I was like “that gore is not tacking!” But TBH, you can’t get cleavage like that with a bra that actually fits correctly.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "1of3musketeers",
            "body": "I will never understand the lack coordinating undergarments. It makes you look like a crazy person. I said what I said. Carrie has had great outfits. I can’t see or say that this is one of them.\n\nBy coordinating I mean a slip or the like. Panties and bra color don’t matter.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Pristine-Fusion6591",
                    "body": "And here I thought that the bra was green on purpose. \n\nNo. Really. I still think that. It was intentional and the green goes with the flowers in the see through pockets. I think this entire look…appears exact how it was meant to.",
                    "score": 12
                }
            ]
        },
        {
            "depth": 0,
            "author": "Express_Shake3980",
            "body": "I had to stop watching AJLT when Miranda got fingered in Carrie’s kitchen . I’m scarred for life by that particular scene .",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "MayorCharlesCoulon",
                    "body": "They did Steve dirty.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "dangerislander",
            "body": "I ain't got any fashion style whatsoever... but I always thought her style on this show (and on SATC) was so cool and amazing. She always looks good.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "TropicalPrairie",
            "body": "I'm getting slight Peaches and Cream Barbie vibes and I dig it.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "GrayCatGreatCat",
            "body": "I live under a rock and had no idea they made a new show.  I thought the consensus was that we were all a little collectively embarrassed by how poorly it aged.  But no what the fuck, there is a whole 2 season (and ongoing?) modern day version of this?  Just busted out the edibles and started season one.  Thanks, cuties!",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Strict-Minute-8815",
            "body": "This is truly the worst tv show I’ve ever seen but god love the outfits.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Sir_Poofs_Alot",
            "body": "I am worried about bees in this dress",
            "score": 5
        },
        {
            "depth": 0,
            "author": "sssb13",
            "body": "That dress 🧚‍♂️ spring faerie!",
            "score": 6
        },
        {
            "depth": 0,
            "author": "blackbirdbluebird17",
            "body": "I’m sorry, the fashion on this… series? Property? Universe? is getting more and more ridiculous. The great thing about the original SATC was that the fashion was fun and interesting, but still very much in the vein of what normal, fashion-interested people would wear out and about. Now they’re just putting everyone in weird runway looks just because.",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "Which_way_witcher",
                    "body": "It's because SJP is choosing her own fashions for AJLT. \n\nFields refuses to be part of this ness and Fields is what made SATC so iconic. SJP just doesn't have the same skill.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "oops_im_existing",
                    "body": "the fashion on this show looks very \"try hard middle aged woman that flaunts her wealth\"",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dangerislander",
                            "body": "Yes but they look so nice to look at! Lol",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "oops_im_existing",
                                    "body": "yeah true i have no idea why i take so much offense to this show 😅",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mai_tai87",
                    "body": "I think this would look better either with a different jacket, or none at all. It looks very bulky considering how sheer it is.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Feisty-Rhubarb-5474",
            "body": "She really pulls off this color",
            "score": 5
        },
        {
            "depth": 0,
            "author": "EfficientIndustry423",
            "body": "I can’t unsee her as a witch.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "warriorholmes",
            "body": "Carrie’s looks have always been SOOO beautiful to me. Yes, questionable at times but Sarah has a way of working fashion imo\n\nI’m in love with this!!!! She looks beautiful omg",
            "score": 4
        },
        {
            "depth": 0,
            "author": "thedeadlyrhythm42",
            "body": "As a general thought spurred on by this picture, it must be exhausting to feel trapped into needing to perpetually look like the version of yourself from the year 2000",
            "score": 2
        },
        {
            "depth": 0,
            "author": "uksiddy",
            "body": "Idk what this is, but I really love it??? It’s so enchanting!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "wolf_town",
            "body": "i’m sick and tired of sheer dresses. you’ve seen one you’ve seen them all. but SJP can make most things look good.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "eloquent_owl",
            "body": "It’s interesting seeing older women still dress in a sexy way, I wonder what she’d look like without all the styling and grooming.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "timethief991",
                    "body": "https://preview.redd.it/bfe5xliaxz1d1.jpeg?width=500&format=pjpg&auto=webp&s=5279e6020b1a8fec223e94404724a58c0ba8c6a3",
                    "score": 49,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "littlebittydoodle",
                            "body": "💀",
                            "score": 12
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "East-Pound9884",
                    "body": "Like the rest of us lol.",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "notcool_neverwas",
                    "body": "She’d probably look fine. I hope I still look good when I’m pushing sixty.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "eloquent_owl",
                            "body": "Yes she looks great! I wonder at what age all the effort to look attractive becomes too much of a hassle.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "notcool_neverwas",
                                    "body": "I gotcha! Yeah, I feel like it depends on the person? I do wonder this, too. I love doing all the things now (at 33), and I guess I just hope I can age relatively gracefully without completely giving up lol.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Which_way_witcher",
                            "body": "As long as you have millions and a whole team of experts behind you making sure you look fab you can be just like her!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bb-blehs",
            "body": "Absolutely insufferable delulu show that brainwashed a generation but she always looks *goooood*",
            "score": 19
        },
        {
            "depth": 0,
            "author": "moonchild-731",
            "body": "Ohhhhhh my i love that dress 😍😍",
            "score": 3
        },
        {
            "depth": 0,
            "author": "SainttValentine",
            "body": "Man I love that dress",
            "score": 3
        },
        {
            "depth": 0,
            "author": "littleliongirless",
            "body": "Wow, the first look from this show that I GET. Lovely.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "MrSpiderisadomme",
            "body": "I don’t just want hair that beautiful at her age, I want hair that beautiful NOW 😭",
            "score": 3
        },
        {
            "depth": 0,
            "author": "notcool_neverwas",
            "body": "I love it! It feels like spring and also very Carrie",
            "score": 3
        },
        {
            "depth": 0,
            "author": "CraftyInformation370",
            "body": "What a stunning and fashionable queen. She’s always inspired me to add a pop of colour to my wardrobe ❤️",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Formal-Cucumber-1138",
            "body": "That dress and her body is Wow, just Wow. Love everything about this picture",
            "score": 3
        },
        {
            "depth": 0,
            "author": "GameOfLife24",
            "body": "I am thankful I could never like and get into the first show so i have no need to be disappointed about the reboot",
            "score": 3
        },
        {
            "depth": 0,
            "author": "seoulsrvr",
            "body": "yikes",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "BurntSiennaSienna",
                    "body": "Glad I’m not the only one. That was my thought.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "notorious_BIGfoot",
            "body": "I’m sorry, they’re still filming this show?? \n\nI am the demographic and I don’t know one person who watches it.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "RubyStar92",
                    "body": "I actually really like it, it’s nostalgic whilst still feeling new!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "edouggie",
            "body": "STUNNINNNNGGG",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ohhidoggo",
            "body": "Ephemeral ✨",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SummerNothingness",
            "body": "i just love that her face is still her face. and she's still got it, too. whew!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InternetAddict104",
            "body": "I cannot believe this franchise is considered one of the peaks of fashion she’s literally wearing a green bra and what looks like boxer shorts under a see through dress covered in poorly stitched on fake flowers it looks like a kindergarten art project, not a luxury name brand fashion look.",
            "score": 32,
            "replies": [
                {
                    "depth": 1,
                    "author": "flirtydodo",
                    "body": "it's called effortlessly chic like a nymph from the woods who woke up from her 100 years slumber after the landlords in ny cursed her, good god cynthia\n\nBut honestly, true",
                    "score": 25
                },
                {
                    "depth": 1,
                    "author": "Mimidoo22",
                    "body": "Agree. And it’s a dress for a 15 or 20 something. Not someone in their 50s or whatever. It’s cognitively dissonant. She can keep trying but we all get old. Not saying she should wear a house dress but nymph-y? I’m a no.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "InternetAddict104",
                            "body": "Tbh even if Olivia Rodrigo or Anya Taylor Joy (just as examples within your age range) wore this dress I’d still hate it. It’s an ugly dress with a lazy execution no matter who’s wearing it.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mimidoo22",
                                    "body": "Agree.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "moosegoose90",
            "body": "How is this still on TV",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dmbfantomas",
                    "body": "So they can stop her from making ads for mobile gambling apps.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "oops_im_existing",
                    "body": "people do watch it. i truly hate it, though. it falls into the category of \"trashy tv\" for sure. trashy tv gets views.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "moosegoose90",
                            "body": "I tried watching the first season and I honestly couldn’t even finish it",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "whorl-",
            "body": "Looks like she is making a cameo on Bridgerton.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Mental-Rooster4229",
            "body": "Father Time is undefeated",
            "score": 3
        },
        {
            "depth": 0,
            "author": "coopatroopa2015",
            "body": "Wow this is such a beautiful look",
            "score": 6
        },
        {
            "depth": 0,
            "author": "eternalbean",
            "body": "I adore this.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "SurlyTemp1e",
            "body": "Damn I love that outfit and Carrie or Sarah is just the perfect one to pull it off ❤️❤️",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Tamarishka",
            "body": "I wanted to watch it but I just cant, its so bad, cringe and irritating. SATC I know every episode by heart🤣",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Caltuxpebbles",
            "body": "So so gorgeous",
            "score": 2
        },
        {
            "depth": 0,
            "author": "hr_newbie_co",
            "body": "Very SJP. She looks lovely!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Shoddy_Budget_1533",
            "body": "I love that Carrie is still dressing sexy but maybe pull the hair back so it’s not competing with the poofy jacket?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Odd-Potato-1213",
            "body": "https://preview.redd.it/ebmspjt2r02d1.jpeg?width=750&format=pjpg&auto=webp&s=4522afefea23be0fbd9fa334293e03ff658a3301",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "AliciaDawnD",
                    "body": "DUDE!! 😂😂😂",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "PartyyLemons",
            "body": "I am obsessed with her ❤️😍",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Tiki-Jedi",
            "body": "I feel bad for her and her RBF. She lights up when she smiles or laughs and looks gorgeous. Then when she’s straight faced she looks like an angry principal about to call delinquents into her office after a playground scuffle.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "_HowVery",
            "body": "She wears clothes so beautifully",
            "score": 2
        },
        {
            "depth": 0,
            "author": "anothertrytaken",
            "body": "I can’t wait for new season! My friends come over, we eat and watch and then tear it apart because they’ve destroyed our beloved characters. But then we do it the next week and the weeks after that 😂 👠",
            "score": 2
        },
        {
            "depth": 0,
            "author": "NotAMiscreant",
            "body": "The hair the dress her face. I guess I’ll watch the show now",
            "score": 2
        },
        {
            "depth": 0,
            "author": "purpledot_",
            "body": "Forever an icon.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "EvenHuckleberry4331",
            "body": "God, what a look. This is stunning.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "galaxybuns",
            "body": "I love this!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Haveyounodecorum",
            "body": "Gorgeous",
            "score": 2
        },
        {
            "depth": 0,
            "author": "mrsringo",
            "body": "Lovely!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bitchwhiskers4eva",
            "body": "Can anyone in NYC tell me if people actually dress this way?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Small-Wolverine-7166",
            "body": "A buddy of mine described her as the “most unattractive, attractive person”",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Lilylikeslilies",
            "body": "Really beautiful outfit with a little twist for older fans of SATC (there were times when they were promoting wearing black bras under white sheer tops and it was hit at the time).",
            "score": 2
        },
        {
            "depth": 0,
            "author": "soccerguy721",
            "body": "Ridiculous. Can’t believe they renewed that mess. And that mess of a dress",
            "score": 2
        },
        {
            "depth": 0,
            "author": "CheesecakeExpress",
            "body": "What a gorgeous outfit",
            "score": 2
        },
        {
            "depth": 0,
            "author": "planetmarsupial",
            "body": "I’m convinced SJP can wear literally anything and look chic AF",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "littlebittydoodle",
                    "body": "Anything except that “hat” the other day…",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Knowitallnutcase",
            "body": "I feel like the costume designer is designing as though these ladies are still in their 30’s. I’m a designer and honestly, I would make the wardrobe a bit more classy…yes I know, the original clothing was so cool and forward, thanks to the costume designers…I just feel it makes SJP look old to be dressing her this way. I’d have her in some Chanel with jeans and boots. And some pearls. JMTC.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "oops_im_existing",
            "body": "how is this show still on. it's so flippin bad.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "duckytale",
            "body": "please no more torture tv show",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Lonely-Foundation658",
            "body": "Her eyes.\n\nhttps://preview.redd.it/71i4gab2402d1.jpeg?width=1080&format=pjpg&auto=webp&s=1ada5538027a9d117aaa8808e56978003a524736",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Alive-Beyond-9686",
                    "body": "![gif](giphy|R19DedSfkJdtv0VknG)",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "spaghettify",
            "body": " oh, this look is stunning!!!!!!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "cloudydays2021",
            "body": "This is a ridiculous look, from the flowers that seemingly are pocketed in reusable produce bags,  to the pull string thing that looks like it’s from an REI raincoat, to the bows on the cuffs that look like  they were repurposed from a wrapped box of chocolate.\n\nHair, makeup and shoes are nice but this dress is so fucking stupid looking.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "No-Cat-8606",
            "body": "Love love love this dress but the one thing that kills it for me is the little pockets for the stems.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ThomasBay",
            "body": "No thank you",
            "score": 2
        },
        {
            "depth": 0,
            "author": "mrjoelforce",
            "body": "She’s got a face like ipecac syrup.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nurse-mik",
            "body": "Ehhh I don’t know about that dress for a woman who is 59 or 60 years old. I don’t really get it and I don’t know what it’s trying to say. 🤣🤣🤣 I mean it is a beautiful dress. Don’t get me wrong. I just don’t know if it’s that I would wear.🤣",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "IcedHemp77",
                    "body": "I could never pull it off, but I think she looks fantastic in it.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wardinator1991",
            "body": "![gif](giphy|l0ExqbRzq05DHIlJm|downsized)\n\nShe’s so beautiful",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Glittering-Relief402",
            "body": "My husband worked at a mobile zoo, and they had a pig named \"Sarah Jessica Porker.\" They ate her eventually, and I'm still mad about it cause I don't even eat pork, plus why give her such a cute fucking name if you were just going to do that? Just name her \"pork chop\" or some shit",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Impressive_Mistake66",
                    "body": "um…what?!",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stunning-Character94",
            "body": "That's not Sarah Jessica parker. That's a wax figurine.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "bgroins",
                    "body": "It appears to be melting.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Stunning-Character94",
                            "body": "😂",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "jamesjaimeclark",
            "body": "I think the jacket swallows her and her hair (lovely as it is) would look better as an updo IMO   I miss Betsey",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TapestryJack",
            "body": "Somewhere, 2 brave boys in New Zealand felt a shiver.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Visible-Scientist-46",
            "body": "After the Bella Hadid Cannes dress, wearing a bra under a see-through dress seems really uptight, and showing off a midriff seems daring. /s\n\nhttps://www.reddit.com/r/popculturechat/s/8jibRS5jZt",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lrube",
            "body": "She is so lucky to get to wear these outfits.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "camposdav",
            "body": "Does anyone know if Samantha will be back besides a telephone call?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "UngregariousDame",
            "body": "That dress is everything",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AliciaDawnD",
            "body": "That dress!!! 🥹🤌🏾🤌🏾",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Previous-Loquat-6846",
            "body": "This show is still on??",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SpicyMustFlow",
            "body": "Not the biggest fan of sheer dresses, but damn, this fit is *gorgeous*. She looks like a fairy angel, but make it ✨️Fashion✨️",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AlternativeFair2740",
            "body": "I know I shouldn’t be shocked and pleased, but I am shocked and pleased that she’s aging appropriately. It’s just so… rare?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "JFKcheekkisser",
                    "body": "She looks a bit older than her age if we’re being honest.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AlternativeFair2740",
                            "body": "She absolutely doesn’t though. She looks like a normal woman entering her 6th decade, who just happens to be strikingly beautiful. \n\nBeauty standards are fucked.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Special-Investigator",
            "body": "she is SERVINGGG",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TransLifelineCali",
            "body": "i see the resemblance.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mspacmaniac",
            "body": "Someone please tell me where that incredible frock came from and how much money I cannot afford to spend on it 😂",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yearoftherabbit",
            "body": "She has such beautiful eyes, I think if I met her the eye contact I would keep would be creepy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "grinchbettahavemoney",
            "body": "This is cute but that ugly ass hat she was wearing was just…… horrendous",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Key_Bee7805",
            "body": "![gif](giphy|d18LVgDBdf0Y0)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PsychologicalRace739",
            "body": "lol remember scrotey mcboogerballs episode 🤣",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MeeranQureshi",
            "body": "Pretty.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "moltentofu",
            "body": "I once accidentally almost knocked her over in the produce section of the East Hampton Citarella’s.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "keekspeaks",
            "body": "What I wouldn’t give to just look at this in person just once. And maybe slip it on for 10 minutes",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ludate_Solem",
            "body": "Such a nice dress(?)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Gayf0rgod",
            "body": "![gif](giphy|KWRjfFe4x7nwyh9GlX|downsized)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "spookaluke",
            "body": "I have not and will not watch this show, but I love SJP. Ever since Square Pegs. She is an icon.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "shezcrafti",
            "body": "I’m not in the loop apparently, and have only seen the original run of SATC and the 1st film. What’s bad about this show?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "T1M_rEAPeR",
            "body": "![gif](giphy|WmrCY6ZjXAc4dAHg9G)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lilonionforager",
            "body": "She looks so good, I always hate how much vitriol there is around her looks - I don’t watch S&TC and don’t consider myself a fan but she is so pretty! And this dress is incredible on her",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Significant_Gate_599",
            "body": "I didn’t like the show, but I like the pics of outfits (primarily those of Carrie’s) from it. This one is sublime imo 🌸",
            "score": 1
        },
        {
            "depth": 0,
            "author": "holdwithfaith",
            "body": "Still with this show.  Ugh.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Icy-Relationship",
            "body": "Hopefully she'll go back into the trailer,  just like that",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thewolfonthefold",
            "body": "Hope she finds the witch that cursed her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hot26",
            "body": "I honestly don’t think I can handle another season ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "moonsdulcet",
            "body": "Omg GrandMOTHER",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KickinGa55",
            "body": "My sheer curtains are ruined.  Thanks.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "irissteensma",
            "body": "She needs a curly long bob. I'm the last one to ever say older women should cut their hair but the length and straightness isn't doing her any favors.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Frosty_Cap_9473",
            "body": "Time to binge again",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Own-Firefighter-2728",
            "body": "She’s holding a photo of the souks where she ran into Aidan in the movie, no?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fun-Dependent-2695",
            "body": "The dress is  a bit too Midjourney for me.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gibbsnibs",
            "body": "The dress is so beautiful, but I'm not a fan of the visible mismatched underwear, though I do think the stylists were trying to coordinste with the dress",
            "score": 1
        },
        {
            "depth": 0,
            "author": "D33M0ND5",
            "body": "She looks great!!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Agreeable-Wrangler77",
            "body": "Love that she is aging gracefully. She looks beautiful and natural 💖",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Which_way_witcher",
                    "body": "She's had surgery and \"enhancements\". None of this is natural. She just hasn't overdone it like some others have.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Vegetable_Burrito",
            "body": "I can’t believe they are still making this pile of shit show.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Straight-Boss-3460",
            "body": "Man, Iggy Pop’s really gone down hill…",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Informal_Process2238",
                    "body": "It’s his lust for life",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Which_way_witcher",
            "body": "Thanks, I hate it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "beardingmesoftly",
            "body": "Woof",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LazyRiver115",
            "body": "![gif](giphy|vI48pZM690GcsccqhK|downsized)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Legitimate_Shower834",
            "body": "I can't unsee what South Park said about her",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lonely-Foundation658",
            "body": "She looks like Trump in the face.\nEspecially the first photo.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "plenumpanels",
                    "body": "Lmao she looks like a Trump and Melania morph",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lonely-Foundation658",
                            "body": "YES!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mamahides",
            "body": "She is such a beautiful human! I never watched SATC but I think k I want to now. I love her style",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Low_Commission9477",
                    "body": "She’s about the ugliest human being I’ve ever seen",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mamahides",
                            "body": "That’s the beauty of opinions and beauty! Everyone thinks different people and things are beautiful! 🤷🏻‍♀️😅",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Low_Commission9477",
                                    "body": "Very true I just can’t ever get that over that quote from fam guy where they say she her face looks like a horse, and I can’t see anything but that now, lol thanks for being mature about my opinion and not being a Karen and yelling at me.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mamahides",
                                            "body": "Omg I totally remember that 😂😂😂 my dad was obsessed with sjp then she was in like vogue or something and they did a close up of her bare feet and now he can’t even look at her🤷🏻‍♀️ people get grossed by random things and there’s not much at all we can do to change those opinions 😂 I don’t get the hype around Beyoncé? She’s pretty but she’s no more pretty then an average woman to me and I’ll die on that hill. She’s average but rich.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "candleflame3",
                                                    "body": "Once I noticed Daniel Craig's enormous ears, it was over for me.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mamahides",
                                                            "body": "Stoooop I just googled him and I am now so mad lol go look at Barry Keoghan walk from the side he walks like the little man from up without the cane",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "candleflame3",
                                                                    "body": "sorry",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "mamahides",
                                                                            "body": "It’s okay! You have my family group chat a new topic",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Low_Commission9477",
                                                    "body": "Yea she ain’t no gorgeous zendaya or like Rihanna",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mamahides",
                                                            "body": "THANK YOU!!\n\n![gif](giphy|LmfDnwbA811C249lQi)",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Low_Commission9477",
                                                                    "body": "Whew that woman. I mean if she’s future people like Kevin talks about in shameless than hell yea",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Europupo",
            "body": "and just like that. she got old. But I’m still in love with SanDeE ⭐️ from L.A. Story",
            "score": 0
        },
        {
            "depth": 0,
            "author": "PolarGCNips",
            "body": "Puke",
            "score": 0
        },
        {
            "depth": 0,
            "author": "pokemakkaroni",
            "body": "granni in dress. nice",
            "score": 0
        },
        {
            "depth": 0,
            "author": "p00ki3l0uh00",
            "body": "Disgusted erection",
            "score": 0
        },
        {
            "depth": 0,
            "author": "gouldybobs",
            "body": "Tales of the crypt?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "But-WhyThough",
            "body": "Titles like that give me the ick",
            "score": 0
        },
        {
            "depth": 0,
            "author": "WorriedMarch4398",
            "body": "Looks more like Dee Snider every time I see her. Never seen Dee and Sarah at the same place before. Just sayin!",
            "score": -1
        },
        {
            "depth": 0,
            "author": "NevilleSoggyBottom",
            "body": "Great melons",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Proper-Aspect-2947",
            "body": " Just want to make note of her beautiful, natural face. Not a bunch of fillers, tox and filters.",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "oops_im_existing",
                    "body": "why do people always have to point this out",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Bad_Gus_Bus",
                    "body": "Except that her face is the product of aging with fillers, botox, and lifts…",
                    "score": 3
                }
            ]
        }
    ]
}