{
    "title": "Kate Hudson tells Call Her Daddy she took a year off men because her therapist told her to",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "peripheralpill",
            "body": "very many of us would benefit from doing the self-work before entering a relationship",
            "score": 2771,
            "replies": [
                {
                    "depth": 1,
                    "author": "Different-Cut-6992",
                    "body": "Listen, the men I was meeting were complete CRAP! I implemented a “Boy Ban” for 3-6 months. After that I hoped back into dating and meet by current boyfriend, we’ve been together for 3 years.",
                    "score": 591,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pandallamayoda",
                            "body": "Mine was a couple of years but I have BDP and needed to do some serious work and allow time for myself and what I loved and wanted. Then I met my partner. 11 years together and an amazing son!",
                            "score": 214,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Welpmart",
                                    "body": "I'm sure it's an acronym from a non-English language, but I read that as Borderline Dersonality Pisorder and had a good chuckle.",
                                    "score": 172,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ainzlei839",
                                            "body": "Why? I think that’s what they meant….",
                                            "score": 31,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "zeusicles",
                                                    "body": "I have several pisorders too it’s a tough life",
                                                    "score": 44
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "DrakeFloyd",
                                                    "body": "They flipped the P and D lol",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ainzlei839",
                                                            "body": "LMAOOOO I didn’t even see that, NOR The way you spelled it I’m dumb hahaha",
                                                            "score": 18
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Welpmart",
                                                    "body": "Reread what I wrote.",
                                                    "score": 49,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LittleMissMeanAss",
                                                            "body": "The brains autocorrect is truly unmatched.",
                                                            "score": 55,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "jim_nihilist",
                                                                    "body": "My phones autocorrect, too. But in a negative way.",
                                                                    "score": 6
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Ok_Cable6231",
                                    "body": "I love this “hoped into dating.” One does need to have hope to get into dating!",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jim_nihilist",
                                            "body": "I hope so.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "rhiannononon",
                            "body": "Damn. I’ve been on 2 year boy ban and still only find not nice people:(",
                            "score": 63,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "wildflowerstargazer",
                                    "body": "It can take awhile but keep doing you okay! ✨🌸",
                                    "score": 33
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bristolfarms",
                            "body": "i’ve been single for forever so i’m kind of like 🤣 how much longer can i work on myself before i find a good person to date? plus it’s harder when you’re queer but still date men because then there’s just homophobia. plus racism…",
                            "score": 19
                        },
                        {
                            "depth": 2,
                            "author": "GoodCalendarYear",
                            "body": "Felt this. I dated terrible guy after terrible guy. Stopped dating for a year. The guy pursuing me now seems okay. We've only been out once though. So we'll see.",
                            "score": 36
                        },
                        {
                            "depth": 2,
                            "author": "AgitatedAd7265",
                            "body": "I took a 9 month boy ban and then met my husband at a birthday party. 11 years together, 3 years married this July. I told everyone that night that he was the man I was going to marry! Everyone rolled their eyes. Look at us now",
                            "score": 90
                        },
                        {
                            "depth": 2,
                            "author": "DawnDishsoap_Duck",
                            "body": "LMAO I’m sorry girl but 3-6 months is not a boy ban that’s just called being between relationships",
                            "score": 45,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "floandthemash",
                                    "body": "Agreed, I’d say a ban is at the very least closer to a year",
                                    "score": 12
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "tardisintheparty",
                    "body": "I'm a lesbian but I did that for about a year after a decade of failed relationships with some genuinely cruel women. Found my life partner basically immediately after my year break and it is a wonderful relationship. Anecdotally, it works!",
                    "score": 56
                },
                {
                    "depth": 1,
                    "author": "alison_bee",
                    "body": "Did this at 27 and it was a life-changing thing. I’m 35 now, and a completely different person, 100% for the better. \n\nI’m so, so glad that I didn’t meet my now-husband until after that period of personal growth because I would have fucked that shit up so bad lol. Definitely would not be happily married to him right now!",
                    "score": 40,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "goldentriever",
                            "body": "This was really helpful for me to read right now thank you",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "Blume_Sama",
                            "body": "Just curious, only if you are open to talk about it ofc, why do you think it helped you? Couldn’t you have done the work with your now-husband? Why do you think being alone was necessary for you?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ihatemost",
                                    "body": "I'm not OP but I can answer. You have to give a lot in a relationship. Which means you have less time for yourself, that's just how it is. It's much harder, if not impossible in some contexts, to do all that work on yourself while also being there for your partner while also having all the other life occupations. ",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "alison_bee",
                                    "body": "The person below me explained my view on it pretty well! \n\nI just was not ready to be a partner before that time. I thought I was, but really I didn’t even know what it meant to truly be someone’s partner. I didn’t even really know what I wanted and needed from a relationship, so my alone time and self reflection helped me figure that out.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Easy_Union_6866",
                    "body": "I decided to stop dating after a really awful relationship - been single for a year and a half and it’s been great. I have recently started dating again, but it’s really slim pickins out there, ladies",
                    "score": 84,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "UncoolSlicedBread",
                            "body": "Same, but from the perspective of a dude. Honestly? It’s given me more peace with my boundaries and a different perspective on relationships.",
                            "score": 33
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Guilty-Company-9755",
                    "body": "As someone who is doing the work now IN a relationship I 100% agree with you.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Strict-Brick-5274",
                    "body": "Honestly you shouldn't enter relationships until you have. People think relationships should just happen, but really they should be cherished and considered a privilege not a right. Because you are literally relating to another person on such intimate levels & they don't deserve to have added trauma because someone was horny. Like fap and deal with your baggage and then and only then will it be even worth getting into a relationship because you'll attract the right partner. \n\nR/relationships seems like the place where people have a million and one problems and decide \"you know what'll fix this? A romantic endeavour\" and then post about how shitty their relationship is.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "remadeforme",
                    "body": "I have a friend I have gently suggested taking some time off and am screaming it in my head.  She's getting into such terrible relationships but like, the abusive way. So she's not getting beat anymore but she's discovered extreme emotional manipulation and gas lighting from the last one. 😭",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Wyni201",
                    "body": "CoughTaylorSwiftCough",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DogandCat-lover27",
                            "body": "Add JLo",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "yunghazel",
            "body": "Taking time off from dating is addicting cause I’m on year 3 and I don’t see an end in sight. The thought of dating in today’s culture gives me the heebie geebies! No desire.      \n\nI recommend everyone (men included) to take a dating break and dive into hobbies, learn about yourself. Also live alone if you can!",
            "score": 792,
            "replies": [
                {
                    "depth": 1,
                    "author": "Oli_love90",
                    "body": "This is me too, I was like “oh let me take a year to work on myself” and it’s so addicting just being on your own. I think it’ll be a really hard adjustment if someone ever comes into my life.",
                    "score": 217,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FutureRealHousewife",
                            "body": "I’ve been single for seven years (my last serious breakup was horrible) and I cannot imagine sharing space with someone else at this point. It sounds daunting to me.",
                            "score": 81,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ThisIs2MuchPressure",
                                    "body": "The irony of your username 😭 but also you could just be a saucy single side character like DanaPam",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FutureRealHousewife",
                                            "body": "It is ironic, but I would be willing to live in a different wing of a large house if I had to. Friend of the housewives is possible lol",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PinkTalkingDead",
                                                    "body": "Ooh me too! Diff wing though, obviously, but we can meet for our evening 5:30 cocktail and gossip sesh like Ms Patricia on Southern Charm 🍸 ",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "PinkTalkingDead",
                                            "body": "“Did you know? $25,000” 👉😎\n\nHonestly an icon",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "yunghazel",
                            "body": "Right like idk if I can share my space with someone. I like coming home and being quiet because I have a customer facing job. The thought of coming home and having to talk?! Oh no. I definitely want separate beds 😫",
                            "score": 77,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "elodieroyer",
                                    "body": "whoopie goldberg was so right when she said “i don’t want someone in my house”",
                                    "score": 67
                                },
                                {
                                    "depth": 3,
                                    "author": "Small-Cookie-5496",
                                    "body": "Ugh. That’s my nightmare too lol. I need quiet. I don’t want to share my space with a boy anymore",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "PinkTalkingDead",
                                    "body": "Saaame! I tell people this when they ask me why I don’t go out more lol I’m like- I spend 40+ hours a week talking to people and moving around constantly (I’m a bar manager). Home is where I get to be quiet and try not to think!",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SmolSnakePancake",
                            "body": "Shit, I'm in the healthiest relationship I've ever been in and I still miss living alone. It was so nice :')",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Antipyretic",
                    "body": "Christ I wish I had the ability to live alone lol. I’ll just be a single roommate bitch forever",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "Ygomaster07",
                    "body": "I'm a guy and I'm currently taking a break from not dating, but mostly because I'm still healing from my divorce/needing to get my health in check. \n\n\n\nI'm on year 5 going on year 6.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "BlueArya",
                    "body": "Lollll I took a 3 year break too and same! I was not pressed at all to end that time either I just happened to meet my life partner and the rest is history ✨",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DZLars",
                    "body": "I've been single all my life. Please everyone take no breaks, I need every shot I can get!!!",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Aran1989",
                    "body": "Totally agree (am a man, 34 yo). I sometimes think about getting back out there, but honestly I love this time to myself. I get to focus on myself, my career, learning, my hobbies, and the meaningful relationships around me. I've learned a lot about myself because of that (what's important) and I really do feel like I've grown so much since my last long-term relationship. That being said, there is still work to be done on myself, and I am in no hurry to find somebody (if they come along, cool, but I'm not actively looking atm).",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "remadeforme",
                    "body": "I got married in the early 2010s in my early 20s and have never been so glad I managed to skip the dating scene then I currently am hearing about it from friends. ",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Shrosher",
                    "body": "Do you just, like, not have sex then?",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "yunghazel",
                            "body": "Sadly no, I’m basically a born again virgin lol. I would love to have my back broken, however being single for so long has significantly raised my standards. So the next person I’m intimate with is going to be a serious relationship.",
                            "score": 63,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sluttynoodle_",
                                    "body": "are you me, cause I've literally said this paragraph word for word before lol",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "throwaanchorsaweigh",
                            "body": "This is such a funny question. Sex is nice but knowing complete peace?? Absolutely incomparable",
                            "score": 27
                        },
                        {
                            "depth": 2,
                            "author": "Small-Cookie-5496",
                            "body": "It’s not so bad. Anyways you could easily have it if you wanted too.",
                            "score": 10
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Luna_Soma",
            "body": "I decided I was going to take 6 months off from dating at one point. I was so good at it that I crammed all 6 months into 3 weeks. Ended up meeting a dude and marrying him 2 years later. It was a huge mistake and we were way better off as friends.\n\nTaking time to be single and know yourself individually is so important.",
            "score": 1026,
            "replies": [
                {
                    "depth": 1,
                    "author": "HistorianOk9952",
                    "body": "I did not know where this story was going 😭",
                    "score": 758,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Luna_Soma",
                            "body": "It went straight to divorce lol. \n\nAll good though, it also resulted in one of the coolest kids ever and my ex and I becoming best friends eventually, like we should’ve been from the start.",
                            "score": 420,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MissSweetMurderer",
                                    "body": "This was a rollercoaster! From yeah to no, to nope, to ugh, to awwww",
                                    "score": 79
                                },
                                {
                                    "depth": 3,
                                    "author": "Guilty-Company-9755",
                                    "body": "I appreciate this comment so much. Thank you for speaking about this side of divorce and showing people a family can still thrive even though things have changed",
                                    "score": 50,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Luna_Soma",
                                            "body": "💕💕💕\n\nIt’s not easy and it took a long time and a lot of work, but I’m very lucky my kid has the absolute best stepmom as well. I just saw her today and I was talking about how much I appreciate her. It’s a combination of luck and hard work, and it definitely isn’t feasible for everyone but I’m so glad for my son’s sake, that it worked for us. Everyone is a million times happier than they would be if we hadn’t divorced.",
                                            "score": 44
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "remadeforme",
                                    "body": "I wish male - female friendships were more accepted. Like, if you meet a guy and think he's super cool you're naturally going to look at it from a romantic perspective because heteronormative glasses are given to us in childhood. \n\n\nBut if you already have a bunch of male friends it's a lot more obvious when it's romantic vs friend imo",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Routine_Bluejay4678",
                            "body": "It was a rollercoaster!",
                            "score": 28
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ultravioletblueberry",
                    "body": "Y’all I am trying to do this so fucking hard but it’s like men know when I’m trying to avoid them.  They’re coming out of the god damn woodworks and overwhelming me.  Like leave me the fuck alone.",
                    "score": 47,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Luna_Soma",
                            "body": "I find being hideous and generally unpleasant works to keep the men away from me.. maybe try that?",
                            "score": 48,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ultravioletblueberry",
                                    "body": "I do try to be upfront and generally unpleasant; but for some reason it’s like fuck me amirite?  Recently I had to sit down one dudes best friend to basically shame him for his stalking tendencies towards me even though I’ve made it super clear I’m not interested.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Luna_Soma",
                                            "body": "Ugh and I bet he thinks he’s a nice guy. I hope you’re staying safe",
                                            "score": 16
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Small-Cookie-5496",
                            "body": "Hmm have you tried being an exhausted 40 year old? Seems to work for me",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheGreatGildedDildo",
                    "body": "I got out of a horribly abusive relationship, said I’d be single for a year, and wanted to just casually go out on dates to learn who I was and how to have fun again. \n\nAnyway, I met my now husband 4 months later. He’s the fucking love of my life and best friend. We’ve been together 6 years, married 4. \n\nI love and appreciate him so much. He’s truly my soul mate. My only regret is that I was like a wounded and abused animal. Abuse can have insidious effects, and I took a lot of my own self-loathing and insecurities and PTSD out on him. \n\nI finally have done the self work and can finally say I’m a different person, a better partner, for him and myself. \n\nStay single for a while to become the best version of you so you can meet someone who is also hopefully at their best.",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Luna_Soma",
                            "body": "I’m sorry for everything you went through before you met your husband. I wish you healing and a gentle love moving forward.\n\nAnd on a less serious note, your username gives me life.",
                            "score": 23,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheGreatGildedDildo",
                                    "body": "Thank you so much! I have been sober from alcohol for a year. Weed helped out a lot with that but now I’m just sober, which is so fucking beautiful. Therapy was key. Yoga is a must for me. I’m trying to meditate as well, but it’s tough haha.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Luna_Soma",
                                            "body": "I love this for you 💕",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Blume_Sama",
                            "body": "Would you say that going with him that fast was a mistake? Or do you think that because he is a good partner for you, he was able to help you get better?",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Mo_blankets_",
                    "body": "Are you me?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Luna_Soma",
                            "body": "I don’t know how to tell you this, but yes, I am. Sorry I stole your identity.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "Basil_Minimum",
                            "body": "And me 😭",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "buzzfeed_sucks",
            "body": "Im on year 12 and living my best life",
            "score": 663,
            "replies": [
                {
                    "depth": 1,
                    "author": "BadaBina",
                    "body": "Year 5 and it's the literal happiest and freest I have ever felt in my whole life!",
                    "score": 233
                },
                {
                    "depth": 1,
                    "author": "Potatoskins937492",
                    "body": "Being single has given me peace of mind I've never previously had with a partner. Next to cycling my birth control, it's the best gift I've ever given myself.",
                    "score": 122,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Wunderlandtripzz",
                            "body": "Recently single again and the guy I'm casually seeing is trying to demand birth control because God forbid he pull out or use a condom. Boy bye",
                            "score": 72,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "launchcode_1234",
                                    "body": "This guy feels entitled to raw nut in a woman he’s only seeing casually? Big yikes. These types rarely get STDs tests either.",
                                    "score": 106,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Wunderlandtripzz",
                                            "body": "I've been caving on a lot for him because I'm kind of affection starved and he's extremely affectionate, but this is a deal breaker for me.",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "emilygoldfinch410",
                                                    "body": "Thank goodness you hit a deal breaker before getting into a situation that ends with a baby!",
                                                    "score": 29
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BachShitCrazy",
                                    "body": "He doesn’t get to demand you take artificial hormones (pill) or deal with extremely painful periods (IUD) just so he doesn’t have to wear a condom or pull out. Absolutely not kick him to the curb he’s trash",
                                    "score": 43
                                },
                                {
                                    "depth": 3,
                                    "author": "gilligvroom",
                                    "body": "My vasectomy appointment took less than 15 minutes and 3 days of 'recovery.' If he hates condoms so much he has options 😅 Tell'em to go freeze some swimmers and stop being a dickhead while you're dumping him.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Wunderlandtripzz",
                                            "body": "Mfer tells me he has a breeding kink but doesnt want kids. Dumbest shit ever",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "greyghibli",
                                    "body": "birth controls and condoms aren’t really an either or thing, its and and. Neither are perfect. Unless getting an unwanted child would not be a problem.\n\nedit: looks like this guy doesn’t want to use a condom??? wtf",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "velvetvagine",
                                    "body": "Ditch him.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "rad2themax",
                            "body": "The two best things you can do for yourself as a woman. Quit men and periods. You get so much more life back.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "I_likesports",
                                    "body": "Acting like a healthy relationship isn’t a positive",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "rad2themax",
                                            "body": "It still takes a huge amount of your life and time.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "I_likesports",
                                                    "body": "You can spend it doing things you love with a person you love. That’s what life is about",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "earlyviolet",
                    "body": "Year 8 checking in! Literally the best decision of my life. Went back to school, became a nurse, now own my own house that is organized and decorated perfectly according to my needs and tastes.\n\n\nWhy would I bring someone else in to try to fuck all this up?",
                    "score": 56,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Small-Cookie-5496",
                            "body": "Haha also a single nurse and feel the same. Why? So some guy can live 8 years longer? In *my* house?? Not on my watch!",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "earlyviolet",
                                    "body": "Fucking preach! The number of my colleagues I hear complaining about the man-children they're dragging around, and I'm just like, \"Wow, so anyway, I'mma jet off to Chicago with my girlfriends this weekend just because.\" ✌️",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Small-Cookie-5496",
                                            "body": "Haha nice! Live it up lady! I’ve actually seen the studies - & can confirm from experience - women have 7 hours of less work per week when single…even with children. So you gain a literal hour per day back.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ThisIs2MuchPressure",
                            "body": "Jesus Christ this literally sounds like the dream 👀",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "earlyviolet",
                                    "body": "It's not too late! I got my RN license at age 40. The industry is still a little fucked right now after covid, but the money remains excellent, and we're working hard to fix the staffing problems.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HistorianOk9952",
                    "body": "4 months in, 20 more to go!",
                    "score": 36
                },
                {
                    "depth": 1,
                    "author": "effie-sue",
                    "body": "I’ve been single for longer than I care to admit, but I’m not sad about it! I tell people that I’m often alone, but I’m never lonely. \n\nI don’t have time for B.S. I don’t like “the dating scene” and it’s a part-time gig to find a partner. \n\nWould I like a long term companion? Yes, but at the same time I like being able to do what I want, when I want, and how I want.",
                    "score": 38
                },
                {
                    "depth": 1,
                    "author": "Topwingwoman2",
                    "body": "Yep, 6 years for me after the divorce from hell. We share kids and still have a toxic relationship so that continues to detour me.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "Educational-Pool-936",
                    "body": "Year 5. Amazing. Finishing a masters degree. Kids are great. Income doubled. Traveling a ton. Lots of friends. Man-sober is the way",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ThisIs2MuchPressure",
                            "body": "Man sober!!!!!! 💀",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Creative-Road-5293",
                                    "body": "I know a guy who lives without women and he seems happy. Maybe we just aren't meant to be together. 😂",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Small-Cookie-5496",
                                    "body": "Male Free",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "notade50",
                    "body": "Year 17 here! I’m so much healthier and happier when I’m not in a relationship.",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "blackaubreyplaza",
                    "body": "32 here and could not recommend more",
                    "score": 40
                },
                {
                    "depth": 1,
                    "author": "um_-_no",
                    "body": "Year 2 and honestly the thought of going on a date seems like so much effort. Not about that life lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "wolf_town",
            "body": "ariana needs this therapist",
            "score": 118,
            "replies": [
                {
                    "depth": 1,
                    "author": "kenrnfjj",
                    "body": "Why she seems pretty happy with her relationship",
                    "score": -14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "peripheralpill",
                            "body": "everyone's happy at the beginning. but if you don't have your shit together and are riding on the new relationship high, the end of the honeymoon phase can be a real eye opener",
                            "score": 34
                        },
                        {
                            "depth": 2,
                            "author": "wolf_town",
                            "body": "idk it’s just a pattern with her. she was also very happy with her ex husband at first. i wish she had taken time to be alone before she’d jump to the next relationship is all.",
                            "score": 17
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fruitopeon",
            "body": "The real story here is why has society become such a busy relentless grind on our collective souls that the idea of romantic relationships now just seems like “1 more extra burden” to take on? I know Kate Hudson isn’t exactly overworked and stressed out and worried about basic finances. But from what I see on this thread, it’s a lot of people that are basically just saying a relationship was too stressful to fit in to their busy and already hectic lives so not taking one on gave them some temporary peace.\n\nI guess my point is, if for instance we all had a 3 day weekend, maybe we’d all actually be in a less stressful place where we would make time for romance or other kinds of human connection.",
            "score": 45,
            "replies": [
                {
                    "depth": 1,
                    "author": "Small-Cookie-5496",
                    "body": "I agree with this for most things yes. No reason we need to be working nearly this hard just to put food on the table when the actual wealth being created could let the entire plant live comfortably. That said I don’t think our stressful lives is the only issue. I think taking time gives you perspective on who actually deserves time in your life.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "FlagshipHuman",
                    "body": "As someone who only gets Sundays off, and who has been working the last 2 Sundays as well, and whose general sleeping time can stretch to 3 AM because of work, i second this so much",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "Ygomaster07",
                    "body": "I never thought of it like that. It's unfortunate people feel this way.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "blackaubreyplaza",
            "body": "I’m 32 years off men",
            "score": 146,
            "replies": [
                {
                    "depth": 1,
                    "author": "pushin_on_my_buttons",
                    "body": "Great now all I hear is Aubrey Plaza with her monotonous sarcastic voice saying that",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "blackaubreyplaza",
                            "body": "I don’t think she’s sarcastic at all",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "Routine_Bluejay4678",
                            "body": "Why did I hear that in her voice before I even saw the username 😂",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "Small-Cookie-5496",
                            "body": "Where does she say this?",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Britneyfan123",
                                    "body": "Never all they’re saying is that they imagine saying it",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "isolatedsyystem",
                    "body": "I'm 34 years off men. I'm also a lesbian though.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "candidu66",
            "body": "Fuck. Even Kate Hudson can't find a good man.",
            "score": 128,
            "replies": [
                {
                    "depth": 1,
                    "author": "hazyphasers",
                    "body": "She's happily engaged to her baby girl's father :)",
                    "score": 77
                },
                {
                    "depth": 1,
                    "author": "Satori2155",
                    "body": "Good men are literally everywhere lol",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "candidu66",
                            "body": "![gif](giphy|1AIeYgwnqeBUxh6juu)",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "redpanda6969",
                            "body": "Girl where",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TSE_Jazz",
            "body": "It’s important for guys to do the same thing with women too sometimes. In a happy relationship now, but it took time and personal growth to get there too",
            "score": 235,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jokers_friend",
                    "body": "Yep. Been in therapy for years. Swore off dating until I’m healed. It’s lonely a lot, but it’s better than traumatizing someone else.",
                    "score": 48,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ygomaster07",
                            "body": "Or getting traumatized yourself.",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hopeful_tatertot",
                    "body": "This is absolutely important for you guys. When my husband met me he was finally in a place to \"try one last time\" because he had some horrible relationships in his past and needed to heal and grow for a bit. We both knew the other person was \"the one\" when we met.",
                    "score": 40
                },
                {
                    "depth": 1,
                    "author": "Ygomaster07",
                    "body": "I'm a guy and I'm doing this, although part of it isn't by choice, since being in a relationship is always something I've wanted, but i know I'm not ready yet. I'm hoping I'll be able to have that personal growth for myself too.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "GratefulnFree",
            "body": "I’ve had 9 years away from men. It’s so peaceful",
            "score": 43
        },
        {
            "depth": 0,
            "author": "CamelsCannotSew",
            "body": "I did this, the year before I met my husband! I decided I needed to be in a place in my life where making time for someone would be a sacrifice and therefore they'd have to be pretty great to make me want to do that. It was the best thing I did, because after a year I started dating and went on about 10 dates before going for a coffee with my husband. And I was busy 6/7 nights a week, and he would just fit in with me, even if it meant turning up at mine with dinner pre-made after I'd had a match or training session.",
            "score": 57,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ygomaster07",
                    "body": "A match?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CamelsCannotSew",
                            "body": "Like, a sports match. I play a sport and we have midweek matches as well as training on a different night.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "arealdisneyprincess",
            "body": "I mean...sounds like she has a great therapist. smh, men lmaooo",
            "score": 150
        },
        {
            "depth": 0,
            "author": "Max_452",
            "body": "More people should do this.",
            "score": 41
        },
        {
            "depth": 0,
            "author": "hopeful_tatertot",
            "body": "Honestly this is a great idea. I just focused on growth, loving myself, and loving life for about 12 years after some bad relationships. I met my now husband in my 30s and I don't think I would have been in the mental or emotional state to have the healthy dynamic that we have if I hadn't taken time.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "trixiesalamander",
                    "body": "This is so comforting to me! I’m about to turn 30 and so many of my friends/family think I’m “running out of time” and need to find a man ASAP. I have a fella but he’s NOT in a place to actively date right now because of a trauma that happened about 6 months into us dating. We’re still exclusive, and while I’m “waiting” I’m working on myself too! And even if it doesn’t work out, I don’t think being kind and patient to someone while they’re struggling is ever a mistake. But I still get affected by the words of people saying that I’m too old to meet anyone and all the good men will be already taken…. So it’s really nice to hear a success story!",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "NeonLotus11",
            "body": "As a rule I would always take a year between long term relationships before dating again and I highly reccomend. I've ended up loving my alone time and look back fondly on it. We all need some processing time and room for growth.",
            "score": 23
        },
        {
            "depth": 0,
            "author": "Oomlotte99",
            "body": "I am unintentionally doing this. Ha ha.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Bubbly-End-6156",
            "body": "I took 13 years off. My therapist wants me to go back to men lol",
            "score": 18
        },
        {
            "depth": 0,
            "author": "pottedPlant_64",
            "body": "Lol, just a year? My man drought, break, is biblical scale and I don’t even have a therapist.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Small-Cookie-5496",
                    "body": "Right?? Amateur",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Suchalittlefancy33",
            "body": "I was single for 2 years after my ex and I broke up. Our relationship was incredibly toxic. \nI grew so much and really matured as a person during those two years I was single. I didn’t date anyone and I learned to enjoy my own self. \n\nI am now engaged and in the healthiest, most loving relationship. I would have been completely happy and fulfilled being single for the rest of my life but I feel so lucky to have such a beautiful relationship with an amazing man. 🖤",
            "score": 16
        },
        {
            "depth": 0,
            "author": "Humble-Throat-2689",
            "body": "I did the self work and discovered I like myself better than another person.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Small-Cookie-5496",
                    "body": "Same. Going to be hard to meet someone who can compete with what I can offer me.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Affectionate_Bet_459",
            "body": "Wow. I’m taking year off men bc I told me too. Niceeee.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "RealOzSultan",
            "body": "How to lose a man in 365 days",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Littlewing1307",
            "body": "I took close to 3 years off. Best thing I ever did for myself!",
            "score": 12
        },
        {
            "depth": 0,
            "author": "hostilegirrl",
            "body": "It's been 3 years since I've tried to date anyone, and it's been really good for me. I found an inner peace that I've never had before. I think everyone could benefit from giving themselves some time to learn more about who they are and what they want.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "assflea",
            "body": "Good advice tbh. I was always a serial monogamist and then took about 18 months off after my last traumatic breakup. Learning to be comfortable single raised my standards lol",
            "score": 22
        },
        {
            "depth": 0,
            "author": "foxbrows",
            "body": "I went through a breakup before Covid hit, and after starting to do some self work.. I like being alone too much. I flew too close to the sun with my boy ban",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Pristine-Fusion6591",
            "body": "I didn’t need a therapist to tell me. I knew. It’s not what I need right now. \n\nI honestly barely miss it. I think I could be okay being single for the rest of my life.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Small-Cookie-5496",
                    "body": "Same. If I do meet someone I think I could be happy never living together. But I’m not trying too - if it happens cool but if not, no problem.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GoddessScully",
            "body": "I was single and celibate for 6 years before meeting my partner. So was he. We both needed that time to grow and develop as people so we could come together. If neither of us had done that work on ourselves during that time we would not be able to have as healthy and vibrant of a relationship as we do.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Secret_Fudge6470",
            "body": "I took a year off men once. I imagine it’s more productive if it’s like, intentional and not just a result of being a nerd. ",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Unhappy-Pirate3944",
            "body": "It’s been 4 years for me 😁🫡",
            "score": 4
        },
        {
            "depth": 0,
            "author": "pushin_on_my_buttons",
            "body": "I’m 22 and taking a break from men too. \n\nI feel like I’ve been dating nonstop for a decade and it’s kinda the truth. \n\nHad my first serious boyfriend when I was 14 and after him I think I never stayed single for more than two months. \n\nAlmost all my relationships have been pretty toxic. The last one wasn’t and we broke up like amicably but now I feel like I need to stay single for sometime.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "Spinner064",
                    "body": "Lol",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pushin_on_my_buttons",
                            "body": "What’s funny?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HarryJohnson3",
                    "body": "I think you reflect the audience of call her daddy perfectly.",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Nice_Marmot_7",
            "body": "I’m glad she did that and mentions avoiding repeating patterns. I’ve never seen the parallel discussed, but her dad was a musician who split, and she has three kids with three different musicians. Fertile ground for therapy indeed, lol.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "crystal-crawler",
            "body": "I’ve gone on dating pauses too. I’ve been with my current partner now for a while. But If something happened, I don’t feel any desire to re-enter the dating scene. I’m just very comfortable with who I am and I don’t feel that I would need to seek out romantic companionship again.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PreviousSalary",
            "body": "Therapist ate this tbh",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Soren_Camus1905",
            "body": "Solid advice honestly.\n\nBest thing I ever did was decide I needed to work on myself and get to the bottom of some issues.\n\nIt’s not fair to involve other people in such intimate and at times confusing growth.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "MrsPeg",
            "body": "Sad.  Women should not need a therapist to tell them that.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "RoseConnection_RN",
            "body": "Shoutout to her therapist",
            "score": 3
        },
        {
            "depth": 0,
            "author": "TheRabadoo",
            "body": "Doesn’t matter the gender, take a break to focus on yourself before getting into a relationship. Some real weirdos in the comments are missing this point and making it men vs women.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "13donor",
            "body": "Why do people jump into awful relationships…Cause their not awful at the start.  Life teaches lessons…is the result.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Jedi_Belle01",
            "body": "After I left my ex husband, I didn’t date for nearly a year. Met my current husband towards the end of it and have been together seventeen years. Sometimes it helps to gain perspective to take time off from dating",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Chipring13",
            "body": "Meanwhile my therapist was like “I know I shouldn’t say this… but like most of your problems would go away if you got laid” \nOk girl. Maybe. Maybe…",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Small-Cookie-5496",
                    "body": "What were your problems??? I’ve never had a lay fix any of mine…but kind of jealous",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "iamaforceofnature",
            "body": "Honestly I think more people would benefit from doing something like this 🤷‍♀️",
            "score": 2
        },
        {
            "depth": 0,
            "author": "shaylaa30",
            "body": "Tbh that’s good advise considering she’s been in several long term relationships",
            "score": 3
        },
        {
            "depth": 0,
            "author": "jawnstein82",
            "body": "She does she had like 3 baby daddies",
            "score": 5
        },
        {
            "depth": 0,
            "author": "LazyRiver115",
            "body": "Anybody have her therapist’s number? 👀",
            "score": 2
        },
        {
            "depth": 0,
            "author": "lepetitgrenade",
            "body": "I did too and it was the best year of my life mentally. I made so much progress in therapy.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Moist-Dragonfly2569",
            "body": "Lol guarantee that’s not how her therapist framed it good on her regardless",
            "score": 1
        },
        {
            "depth": 0,
            "author": "w3are138",
            "body": "Valid. I went from one relationship to the next to the next etc and honestly that was so dumb. Being alone sometimes is important. People need time to work on themselves.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Unitedfateful",
            "body": "I had a seizure reading OPs title",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bitchinstein",
            "body": "Same! I took a full year of no dating and celibacy to get my head right. I was definitely picking the wrong type of men and I would end up in bad, horrible abusive situations.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Reyjr",
            "body": "Took a 7 year stretch from dating. Got a lot accomplished when I focused on me",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DooglyOoklin",
            "body": "I got out of an abusive relationship in 2020. it's been 4 years. I love being single. If they come, they come! I'm not out there looking though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Throwaway500005",
            "body": "Taylor Swift, take note",
            "score": 0
        },
        {
            "depth": 0,
            "author": "StayUpLatePlayGames",
            "body": "Couple of things. \n\nTherapists shouldn’t be telling you to do things.  You tell them stuff. They ask questions. \n\nThis idea of “work on yourself” is kinda BS. What, do an art class? Concentrate on being mindful?",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChartInFurch",
                    "body": "Couple of things. \n\nTherapists aren't all the same. \n\nThere's an entire article attached to the headline. \n\nYou're last line tells me your therapist is very much not the bar to judge by.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "StayUpLatePlayGames",
                            "body": "I don’t attend a therapist. I’d need to meet one I respected. \n\nPeople who are addicted to therapy are unlikely to get anything resolved.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RedditLife1234567",
            "body": "Did she have sex during this time (with a man) but didn't count that as dating because it was just hookup? Didn't read the article so not sure if she celibate or just no dating (but sex was still on the table).",
            "score": 0
        },
        {
            "depth": 0,
            "author": "McTitty3000",
            "body": "And they say the male podcasters are trash lol",
            "score": -1
        }
    ]
}