{
    "title": "Cassie Thanks Fans for Support After Release of Diddy Assault Video: ‘Domestic Violence Is the Issue…Open Your Heart to Believing Victims the First Time’",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sabira",
            "body": "I’m so glad that people are believing her. \n\nYears ago during the initial wave of #metoo across social media, I used that window of time to speak out about an abusive situation that I had survived. Prior to that, it was always devastating for me to get so many responses from loved ones who refused to believe me and would respond with statements like:\n\n“I’ve never seen that side of him myself, so I don’t believe you.”\n\n“Are you sure that this isn’t your mind just making all of this up?”\n\nFuck that shit. \n\nIt’s so important to believe what abuse victims are saying, and to also understand why it can be incredibly difficult for them to leave that situation.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Curiosities",
                    "body": "100% all of this. One of the most important lessons to learn (and share) is abusers are not abusive to everyone. Cultivating those other relationships maintains their ego, validation, and gives them deniability. And that was a lesson to learn for sure. I've been abused by multiple people, including the ex who gave me PTSD (I soooo feel her statement about always going to be healing from the past) , and the isolation can be the worst. And people express appreciation for them and how great they are, and meanwhile, you know the truth of your experiences.\n\nAnd society, and abusers, do their hardest to paint anyone coming forward as having an agenda, 'for clout', oh she wants to destroy him, etc and it grinds us down to figuring silence is better, even after we do get out of those situations.\n\nI am glad that Cassie is getting support. I just hate that it took that video release to turn some people's opinions around.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Stinkycheese8001",
                    "body": "Because people would rather believe that you are lying than accept that their own judgement and perception of a person is so wildly wrong.  ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "velvetvagine",
                            "body": "![gif](giphy|S4DS8r0OYiOp7v3H8m)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "StrangerDays-7",
                    "body": "CNN reported that Combs wasn’t allowed to mention Cassie in his “apology” video because they both signed off on either mentioning either one in the settlement. I hope Cassie is released from that clause. Diddy may very well end up in prison for the rest of his life like R Kelly and Cassie shouldn’t be held down by a NDA now that everyone knows Diddy is a rapist, sex trafficker and domestic partner abuser",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Best_Draft_6629",
                    "body": "That's why I will never tell anyone when I was >!`SA`!< as a child or >!SA!< as an adult, because I've seen firsthand from my mum, older sisters, and my brothers how they question the victim, say they're lying and don't believe them.\n\nI'm sorry you had to experience that.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sabira",
                            "body": "Thank you. I’m so sorry to hear that you had to experience that, too ❤️",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MeeranQureshi",
                    "body": "Agreed.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "impeccabletim",
            "body": "**[Full statement from Cassie via Instagram:](https://www.instagram.com/p/C7T6OCKRJ-W/)**\n\n>Thank you for all of the love and support from my family, friends, strangers and those I have yet to meet. The outpouring of love has created a place for my younger self to settle and feel safe now, but this is only the beginning. Domestic Violence is THE issue. It broke me down to someone I never thought I would become. With a lot of hard work, I am better today, but I will always be recovering from my past.\n>\n>Thank you to everyone that has taken the time to take this matter seriously. My only ask is that EVERYONE open your heart to believing victims the first time. It takes a lot of heart to tell the truth out of a situation that you were powerless in.\n>\n>I offer my hand to those that are still living in fear. Reach out to your people, don't cut them off. No one should carry this weight alone.\n>\n>This healing journey is never ending, but this support means everything to me. Thank you.\n>\n>Love Always,  \n>Cassie",
            "score": 1
        },
        {
            "depth": 0,
            "author": "liselotta",
            "body": "I made the mistake of looking at her Instagram when the hotel video came out. There are so many comments on her old posts calling her a liar. I hope those people did some reflection on why they didn't believe her, and why they felt the need to post on her instagram(???), but I doubt it.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "FrozenRose_816",
                    "body": "I’m sure those same people will jump through every hoop to try to still be right. “Well okay there was this ONE TIME but I bet this was the only time and she’s still lying because there’s no proof of all the other times!!!” 🙄",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mommyoftwoangels",
            "body": "Amen.  This is a systemic issue within the entire country and the law does not assist victims like this; not nearly enough. Then when it’s all over, they just leave you in shambles.  I can’t believe this is the USA.  It’s befuddling let alone outrageous.  Prayers 💛💛💛💛💛💛",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MakingTheEight",
            "body": "I still cannot fathom the depravity of Diddy and what he put Cassie through for a whole decade. The details from her lawsuit are horrifying and I'm sure that the lawsuit didn't include every evil thing he did to her.   \nI'm honestly so proud of Cassie that she was able to get away from him and rebuild her life and find happiness in her life and her family.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "haubenmeise",
            "body": "Time tells truth. Well. Surveillance did too. But its a shame that people still deny victims their voices.",
            "score": 1
        }
    ]
}