{
    "title": "Nicola Coughlan wore Azzi & Osta to the ‘Bridgerton’ season 3 premiere in Brazil",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "crackerfactorywheel",
            "body": "I don’t hate it, but it’s not one of my favorite Nicola Coughlan looks. It’s giving “Capital citizen celebrating Christmas.”",
            "score": 1329,
            "replies": [
                {
                    "depth": 1,
                    "author": "altdultosaurs",
                    "body": "Which tbh can be fun. I like this hood but I would like it all more sans sleeves. I love that the skirt is almost tulip or rosebud shaped.",
                    "score": 163,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mia-Wal-22-89",
                            "body": "I’m into the weird structure too. I love how she takes risks. But I really hate the gloves. I don’t know what the embellishments are supposed to be but it looks like they gilded the arms of someone with treeman syndrome.",
                            "score": 33
                        },
                        {
                            "depth": 2,
                            "author": "crackerfactorywheel",
                            "body": "Yeah, I think it could’ve been a really fun concept! The sleeves and the fabric bring it down for me. If the sleeves were embroidered, I would’ve liked it much better.",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Alone-Assistance6787",
                                    "body": "Yep. The embellishment on thr sleeves make her arms look out of proportion, and the hood is made is the completely the wrong fabric which makes it stick out like some kind of space age wing, and not in a good way. ",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Responsible-Data-695",
                    "body": "I do. I hate it. \n\nNicola is drop-dead gorgeous, so don't come at me, people, but the styling I've seen at her latest events was not it. \n\nI'm not an expert, so I can't fully explain what should be done differently, but some of these outfits seem to swallow her. She has a short and curvy frame, and none of these dresses show that in a nice way. I saw her recently in a white dress that was just odd, to put it politely. The drop shoulder thingy with the straps bending weirdly over her boobs, the gloves that were digging into her upper arms, and that huge peplum thingy around her hips and tummy just made her look bigger than she is. \n\nI mean, look how [gorgeous](https://x.com/kikibridger/status/1679723538817880064) she looks in a dress that fits and hugs her figure.",
                    "score": 185,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "crackerfactorywheel",
                            "body": "I usually love that she takes risks with her fashion! As a short, curvy person myself, I like that she’s not afraid of wearing things that take up space and aren’t always “flattering.” This one could’ve worked, but IMO, the sleeves and choice of fabric bring it down for me. I do love the dress you linked too.",
                            "score": 73,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Responsible-Data-695",
                                    "body": "I know what you mean. I'm not short, but I'm a big person, so I love seeing people celebrating their bodies even when they don't fit the standard ideals of beauty. Like I said, I think Nicola is beautiful, and I am a huge fan of her. I hope she continues to wear whatever makes her comfortable, but she doesn't seem comfortable to me. I may be wrong.",
                                    "score": 11
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EgoFlyer",
                            "body": "I don’t think every dress needs to be the standard idea of “flattering,” but they should fit. I think this dress has fit issues.",
                            "score": 58,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "crackerfactorywheel",
                                    "body": "Agreed that dresses don’t need to be the standard idea of “flattering.” Also agreed that there are fit issues here. The bodice and the waist are puckering oddly, which makes me think it needed more tailoring or it should’ve been made with a different fabric.",
                                    "score": 15
                                },
                                {
                                    "depth": 3,
                                    "author": "RickardHenryLee",
                                    "body": "the bust darts are definitely a mess. but I actually love the overall look! someone just needed an extra day or two to fit that bodice on her properly.",
                                    "score": 16
                                },
                                {
                                    "depth": 3,
                                    "author": "Responsible-Data-695",
                                    "body": "Fair enough. Like I said, I don't know much about fashion, so the language escapes me. I love \"alternative fashion\" (is that's a thing) - as in things that are out there and don't fit the standard, but I think people who wear such things exude more confidence (i.e. HBC) \n\nI know Nicola has been getting lots of flack about her body, and she's still very young, so maybe the confidence is not quite there, but to me she seems a bit lost in some of these outfits. \n\nAnd yeah, this dress has obvious fit issues even to my untrained eye.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "artemisthewild",
                                            "body": "She is 37. Based on her interviews, she seems to pick what she likes and has pretty definite ideas of what that is.\n\nETA: I corrected my wording, oops!",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "crackerfactorywheel",
                                                    "body": "It blew my mind when I found out Nicola Coughlan was 37. My brain just automatically assumes she’s closer to being a teenager because of Derry Girls.\n\nhttps://i.redd.it/95m876uzw12d1.gif",
                                                    "score": 9
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Hufflepuff_23",
                                                    "body": "You’re kidding!? I did not know that",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "artemisthewild",
                                                            "body": "She is indeed 37! Have you seen Bridgerton? Her character’s best friend Eloise is played by Claudia Jessie, who is 34. Both actresses do a remarkable job of playing characters who are meant to be 19 or so in season 1 of the show!",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "EgoFlyer",
                                            "body": "Yeah, the fashion industry just tends to give more space for slender people to explore alternative or edgier fashion, especially odd shapes, so I try to be careful with my wording around that. Wasn’t saying you were wrong or anything, just trying to be specific about why I think the dress has problems.",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "anoeba",
                            "body": "Damn that dress in your link is gorgeous on her.",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "thisisthewayilive504",
                            "body": "PREACH!!! could not agree more",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "hikehikebaby",
                            "body": "100%",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MyViscountess",
                    "body": "Cackling 🤣",
                    "score": 27
                },
                {
                    "depth": 1,
                    "author": "ready-to-rumball",
                    "body": "😆 goddamnit",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "FeralBaby7",
                    "body": "This is so accurate I love it.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Primordial5",
                    "body": "Yes, but she’s still devastatingly beautiful.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "PeachyBaleen",
                    "body": "She looks amazing from the collarbones up and it’s very fierce, but that bodice is giving me anxiety",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "CuTe_M0nitor",
                    "body": "Is she pregnant?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Babycat834",
            "body": "It’s giving Volturi from Twilight",
            "score": 316,
            "replies": [
                {
                    "depth": 1,
                    "author": "hummusisyummy",
                    "body": "![gif](giphy|13st3p22s9qD6M)\n\nHahah, it totally is! 🤣",
                    "score": 56,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KaleidoscopeNo9102",
                            "body": "I thought this was Corey feldman",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "airi-hatake",
                            "body": "goodness, his daughter he had with kate beckinsale looks exactly like him. she stole his whole face.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hummusisyummy",
                                    "body": "Yes!! She is his twin. Haha!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bookwormaesthetic",
                    "body": "This comment convinced me to love the look. 😂",
                    "score": 21
                },
                {
                    "depth": 1,
                    "author": "ItchyEdge5",
                    "body": "Yesss",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "sabira",
            "body": "I think that this outfit would work well with either the hood or the textured arms, but not both.",
            "score": 583,
            "replies": [
                {
                    "depth": 1,
                    "author": "pumpkinspruce",
                    "body": "Was just thinking it would look great without the hood.",
                    "score": 63
                },
                {
                    "depth": 1,
                    "author": "Scoompii",
                    "body": "Or with a larger cage on the bottom…not necessarily regency era style but without googling that I wouldn’t know otherwise and still would give more Bridgerton vibes as opposed to hand maids tale/sultry little red riding hood.",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RitaRaccoon",
                            "body": "I feel just the opposite. If this were tight fitting down through her hips, maybe a fit and flair or a mermaid, it would be a home run! Why emphasize your midsection? (Or is this just my projecting my tummy insecurities)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "schrodingers_bra",
                    "body": "I think it also needs different colored gloves. The first two images she looks arm-less (the gold texture just looks like gown decoration) which gives the effect of a highly decorated nesting doll or Fabergé egg.",
                    "score": 23
                },
                {
                    "depth": 1,
                    "author": "cupcakeartist",
                    "body": "I was thinking the same thing. I feel like the elements were competing.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "MBeMine",
                    "body": "Ugh, I feel like I say this every time.  This could have been beautiful.  But, once again, the tailoring is terrible and the inverted nipple darts are a big NO.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "CallMeOutScotty",
                    "body": "Makes her hands look invisible",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tinasglasses",
            "body": "She looks like she’s promoting the handmaid’s tale lol",
            "score": 731,
            "replies": [
                {
                    "depth": 1,
                    "author": "RecentConstruction26",
                    "body": "Yeah, she looks like Lady Gaga got a part in the handmaid's tale. ",
                    "score": 173,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "anon342365",
                            "body": "![gif](giphy|12msOFU8oL1eww)",
                            "score": 27
                        },
                        {
                            "depth": 2,
                            "author": "phlegmdawg",
                            "body": "Make it extreme patriarchy, but fabulous.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Longjumping-Age9023",
                    "body": "I see the 4th witch in Hocus Pocus",
                    "score": 32
                }
            ]
        },
        {
            "depth": 0,
            "author": "originalschmidt",
            "body": "I don’t like the profile of it so much but I do like the full frontal version. \n\nThe hood sticks out a bit too far in the back for me.",
            "score": 114,
            "replies": [
                {
                    "depth": 1,
                    "author": "frolicndetour",
                    "body": "Same.  The weird puffing out at the waist is so unflattering to anyone, but you can't see it from straight on.",
                    "score": 40,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "originalschmidt",
                            "body": "I don’t mind the puffing but I don’t like how it looks like a bulge, I’d rather more symmetrical and rounded shape than a poofy  weird bulge.",
                            "score": 10
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Maseycakes",
            "body": "She looks like a Dark Souls NPC",
            "score": 65,
            "replies": [
                {
                    "depth": 1,
                    "author": "CurdleTelorast",
                    "body": "Hahaha good one 😂",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "CaseyRC",
            "body": "I love the *drama* of it but hate the actual *look*",
            "score": 114,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lost-and-dumbfound",
                    "body": "It looks like a dress that looked amazing as a sketch but so much less so once it was actually made.",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "thistleandpeony",
                    "body": "If it was sleeker, with a very structured bodice, and finer detail on the arms it would be great. But the material is too thick, it's weirdly puffy, and the arm texture is giving Dollar Store Christmas decoration. *She's* beautiful but this dress is a miss for me.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CaseyRC",
                            "body": "yeah for me, only one thing can be voluminous but both skirt and hood being soo structured and big doesn't work for me.  if the hood is gonna be big, a sleek skirt and bodice would balance it out and make the most of her figure which is gorgeous.  but this is honestly one of the least flattering things I've seen her in which is a shame because she deserves better.  Larger women are so poorly catered to for red carpet events, hell anyone over an american 2 is basically told they won't get a dress, and normally she rocks whatever she wears, but she doesn't look her best here,a nd worse she looks like she knows it\n\nI'd love to know what the weather is like in Brazil right now because I'd have sweat off ten pounds wearing all that at just the thought of wearing it in Brazil!",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Lokifin",
                            "body": "I'm not sure it's the material. I think it might be that they started with a way bigger size and didnt have time to tailor it correctly. The darts look like they're just tacked on instead of planned around her measurements, and I'm thinking the waist got a similar treatment.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CaseyRC",
                                    "body": "the waist is *sooooo* bobbly  and bumpy.  i think its a mix of poor construction *and* the material tbh",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lokifin",
                                            "body": "They spent 8 months on the hood construction and 2 hours on the dress 😂",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Lokifin",
                                            "body": "Okay, I looked again. I love the heavy satin for the hood and bodice, but you're right it's not working for the skirt as is. It looks like it would stand up on its own.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CaseyRC",
                                                    "body": "Now Im imagining her stepping into it like some sort of Iron Man costume! just the back opening up and her stepping in.  who needs a mannequin",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Lokifin",
                                                            "body": "LOL it opens up like a clamshell. She's in PJs underneath.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "CaseyRC",
                                                                    "body": "when 20 seconds from workwear to pjs is *too* long, just press a button and step out straight to your couch, footloose and (bra) fancy free.  Rebecca Ferguson is taking notes.  Wearing workout leggings under her dress isn't gonna cut it anymore, its pjs or failure!",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pf2612no",
                    "body": "There are elements of it that I really dig, but the execution of it doesn’t work for me. I love that Nicola is willing to take fashion risks, though. More often than not, she lands right on the mark. I’m always excited to see what she’s going to wear next.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "LeotiaBlood",
                    "body": "Yes. I hate the arms, but love the hood.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Much-Cartographer264",
            "body": "It took until photo 3 for me to process where her arms had gone. I was so confused. \n\nIt’s gorgeous though, love the hood",
            "score": 148,
            "replies": [
                {
                    "depth": 1,
                    "author": "schrodingers_bra",
                    "body": "Agree - the gloves need to be a different color to distinguish her arms better.",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "stormsync",
                    "body": "Same, I was like \"did they trap her in a tube???\" and was quite concerned.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "babyitscoldoutside00",
                    "body": "Same. I was concerned for her arms.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "tsundear96",
            "body": "It appears that many designers don’t know what to do with a plus size body. This dress looks like it was sketched for a size 2 model and simply resized for her without taking body shape into consideration at all",
            "score": 76,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lokifin",
                    "body": "I think for Nicola, she has double the disadvantages, being plus size and super short. Some designers can do one, but I don't think many can do both.",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WinterMedical",
                            "body": "Yeah it is easy to design for tall and thin. To design well for everyone requires a deep understanding of proportion that most designers never bother to learn. It is literally an art.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lokifin",
                                    "body": "Which is bananas when you look at this dress. Clearly the designer is interested in 3D structure and movement. None of that hood is translated to anything around her body.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WinterMedical",
                                            "body": "Also the seams on the chest. It feels like a Project Runway avant garde challenge.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Calm-Ad8987",
                                                    "body": "It looks so poorly & hastily fitted! Like what is going on with the boob region? Just looks like lazy shoddy workmanship.",
                                                    "score": 4
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "WinterMedical",
                                            "body": "They need to go to art school.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "just-slaying",
                    "body": "This 💯",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "I-am-me-86",
                    "body": "Size 10 is not plus size wtf?",
                    "score": -4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Amphigorey",
            "body": "Speaking as an experienced sewist, the placement of the bust darts is *really weird.* They're in completely the wrong place. \n\nYou can make bold choices in a garment, like the hood and the extravagant gloves, but to leave the bust looking like you didn't bother to do any fit adjustments makes no sense to me. The bodice looks like a first draft, not a finished piece.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cephalopodium",
                    "body": "Do you know what’s up with the top parts of the darts on the bodice?  It almost looks like there is a small pocket.  I’m very confused",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Amphigorey",
                            "body": "Looking at it closer, I see they aren't true darts. The bodice front is constructed from a single piece of fabric and then cut and folded to fit, in the same manner that you'd use a dart, but they put this odd pouf at her bust, which is what's creating the pocket effect you're noticing. It's because they tucked the excess fabric by joining a longer piece with a shorter piece. The seam is clean under the bust. I think it's deliberate, to echo the puff of the skirt, but it comes off as messy instead of purposeful.\n\n....ahhhh I just noticed how terrible the construction of the gloves is. They didn't even give her a proper thumb! I've made gloves - they are a pain - and real gloves have WAY more seams and pieces than that. Poor Nicola, they do not look fun to wear.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cephalopodium",
                                    "body": "Thank you! \n\nI don’t really know very much about dress construction, but it feels like something that could have been great but it just wasn’t pulled off well.  I want to like it, but the more I look at it- the more I dislike it.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SalientSazon",
            "body": "Welp I very much dislike this. This satinny red and this cold embellishment looks like a Christmas ornament, which would be fine for a Christmas party. I would like it better without the hood, I think its out of place, and last, this red is not the right red for her I don't think.",
            "score": 125
        },
        {
            "depth": 0,
            "author": "Inf1nite_gal",
            "body": "from side it looks quite weird, like she doesnt have arms",
            "score": 15
        },
        {
            "depth": 0,
            "author": "sicksadbadgirl",
            "body": "Looks like golden chicken wings.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "aseasonedcliche",
                    "body": "If her hands were visible I think this look would slay but otherwise, this is also what I see LOL",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lotus4Lotus",
            "body": "I get the vision of this look, but the construction is what’s throwing me off. Satin fabric is *notoriously* unforgiving and if there’s even the slightest puckering, it shows. Love her, but it’s a boot from me.\n\n![gif](giphy|l4FGxSYe3WrlShZgQ|downsized)",
            "score": 7
        },
        {
            "depth": 0,
            "author": "dearthofkindness",
            "body": "I love it. Sue me\n\n![gif](giphy|eLvhchyvNNOuLbOtYP)",
            "score": 74,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fleetwood_Spac",
                    "body": "Love everything except the way the shoes peek out at the bottom. I think open toe platforms were not the way to go with this",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "blackbirdbluebird17",
                    "body": "Same! It’s so over the top! My only thing is it should have had a train, go hard or go home.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "wildly_domestic",
                    "body": "Was thinking this as well. I think she looks absolutely gorgeous and I can tell she feels gorgeous. I am stunned, shook, all of it.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Roxy175",
                    "body": "I was feeling totally crazy looking at these comments because I absolutely love this.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "megjed",
                    "body": "I don’t totally like the waist but I like the sleeves and the hood, very interesting",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Curly-Pat",
            "body": "This dress is just awful and poorly fit. \nShe is so gorgeous, why do they keep dressing her in these oversized cartoonish outfits?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "MaximumNice39",
            "body": "It's not flattering to her shape.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "impeccabletim",
            "body": "She looks like a supervillain, I love it!!!",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Visible_Writing7386",
            "body": "Red riding hood costume ..😭",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheTyto_Alba",
                    "body": "But make it festive 😂",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "hesathomes",
            "body": "Oh that is unfortunate.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Pinacoladaplankton",
            "body": "Daaamnnn!!!! Gorgeous!!!",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Shootinggstarr",
            "body": "Oh..no....",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Educational-Cake-944",
            "body": "This is horrible",
            "score": 3
        },
        {
            "depth": 0,
            "author": "pergamon123",
            "body": "Why is everyone suddenly doing this weird hand pose? It looks so affected that it’s super off putting",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Numerous-Stranger-81",
            "body": "She looks like a melted sour patch kid.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "l3m0ngr4ss",
            "body": "she is beloved in brazil for derry girls!",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "overwhelmed_robin",
                    "body": "Would not have expected Derry Girls to be popular in Brazil!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrMush48",
            "body": "Oh dear. It’s making her look shorter and stouter than she is. The woman is gorgeous and this is just too much. It’s wearing her.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "hayypeachyy",
            "body": "this girl cannot dress lol",
            "score": 9
        },
        {
            "depth": 0,
            "author": "_gooniesneversaydie_",
            "body": "I had my Christmas tree themed in gold and red last year!  Very reminiscent 😂",
            "score": 3
        },
        {
            "depth": 0,
            "author": "WhiteRavenGoiku4",
            "body": "I love the boldness. I'm intrigued by the style and choice of the additions to the sleeve with what looks like gilded leaves or feathers that make it a little contemporary, avant guard, sleek fabric sorcery style. And the fusion of dress from the cowl that stands up on its own at the crown of the head I impressed with and love the idea of design choices.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "N80N00N00",
            "body": "No.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Kaizen2468",
            "body": "That’s a horrible look for her.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "IPauseForHurricanes",
            "body": "No.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "UziSuzieThia",
            "body": "\"We've been sent good weather \"",
            "score": 3
        },
        {
            "depth": 0,
            "author": "InABoatOnARiver",
            "body": "It’s giving The Handmaid’s Tale but make it fashion.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "randomburnerish",
            "body": "I love that she takes high fashion risks! It won’t always be a smash hit with everyone but she looks comfortable and confident",
            "score": 13
        },
        {
            "depth": 0,
            "author": "alohell",
            "body": "I really don’t love it, but she looks like she feels confident and sexy and I’m here for that.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "millennial_sentinel",
            "body": "this is embarrassing \n\nit’s just awful and unflattering",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Interesting-Pay-8986",
            "body": "It’s not really flattering",
            "score": 6
        },
        {
            "depth": 0,
            "author": "IntelligentRock3854",
            "body": "I don’t like it, it emphasizes the stomach which isn’t a flattering look for her as she’s got amazing curves.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "throwaway00009000000",
            "body": "Eh…the hood is giving Jabba the Hut in A Handmaids Tale. Someone photoshop it.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Adventurous_Home_555",
            "body": "She’s absolutely stunning but I don’t think this dress works for her body type",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Raccoon_Bride",
            "body": "This is not flattering at all",
            "score": 3
        },
        {
            "depth": 0,
            "author": "YouNeedCheeses",
            "body": "The red gloves after the gold make her arms look really short. I like that she’s adventurous with her looks but this one isn’t my favourite!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "harleyquinones",
            "body": "Kinda beside the point, but if anyone could tell me what the exact shade of red would be called in pics 1, 4, and 5, I would be absolutely delighted.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dependent_Room_2922",
                    "body": "Maybe candy apple but maybe a it's darker than a typical candy apple?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "harleyquinones",
                            "body": "Oh wow, yeah it is a tiny bit darker, but it's very very close. Thank you!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "elvis-wantacookie",
            "body": "This is a bit weird, but the hood really works for her. It really brings the focus to her face, as it should\n\n…But then the sleeves ruin that",
            "score": 2
        },
        {
            "depth": 0,
            "author": "eaturvegetables",
            "body": "shes such a boss",
            "score": 2
        },
        {
            "depth": 0,
            "author": "powerhungrymouse",
            "body": "It's not my favourite look of hers but I love that she is not afraid to wear anything and has so much fun with her clothes.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "_lady_muck",
            "body": "Oh dear",
            "score": 2
        },
        {
            "depth": 0,
            "author": "MarsScully",
            "body": "It’s so extra, I love it.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Significant-Stay-721",
            "body": "She is forever Claire, and I love her!🥰",
            "score": 2
        },
        {
            "depth": 0,
            "author": "LionessRegulus7249",
            "body": "The bottom of that dress is unflattering.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "pineapplebandit11",
            "body": "Took me a while to find her arms in the first bc purple",
            "score": 2
        },
        {
            "depth": 0,
            "author": "EmmaRose0280",
            "body": "Another unflattering silhouette I feel! I love her daring style but this is a miss for me",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ZealousidealGroup559",
            "body": "I am BAFFLED why she always gravitate towards these cocoon shapes. The girl loves an oversized sillouette and she is not that shape! It just adds wierd bulk.\n\nShe looks so good in Bridgerton this season, why can't she choose leaner cuts like that?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "mattchinn",
                    "body": "Agreed.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "emoaa",
            "body": "Just love the construction of it. The hood especially!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "patooweet",
            "body": "I don’t even watch Bridgerton but I love this woman.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "lavendersagemint",
            "body": "I couldn’t work out the shape of her arm from the side. I don’t find this shape flattering for her, though the color is very pretty.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "darthrobyn",
            "body": "She looks like a freaking painting. Gorgeous!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Historical-Roof-2768",
            "body": "Her publicist is working overtime these days!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "throwaway17197",
            "body": "She has the stylist she deserves",
            "score": 2
        },
        {
            "depth": 0,
            "author": "coaldean",
            "body": "it’s so bad that i kind of love it",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Unnecessary_Bunny_",
            "body": "The dress is beautiful, but the Christmas tinsel is bad",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LivinLaVidaListless",
            "body": "This dress is great from the front. Nicola is hot af and she deserves better than that side view.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kyjmic",
            "body": "I like the dress but not into the gold Christmas tinsel arms.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "metdear",
            "body": "What in the Last of Us Handmaid's Tale is this, lol.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "heartbylines",
            "body": "The gloves ruined this 😭",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Wooden-Limit1989",
            "body": "Sexy red riding hood lol. She definitely takes risks\n I like it. It's interesting I wish it wasn't puffy at all though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RancidHorseJizz",
            "body": "I can't decide whether she looks like a jalapeno or a tomato. Either way, there are better outfits for her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Simple_Reference1419",
            "body": "She looks like she's hunting, big bad wolf in little red riding hoods clothing!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mia0821",
            "body": "It’s giving Handmaid’s Tale",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hot-Clock6418",
            "body": "Better a cape than hood but she’s always serving. She wears clothes. They never wear her",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Goodgoditsgrowing",
            "body": "I love aspects of it. The gold arm kind of throws me off and the flattened soufflé of a hood pisses me off because it didn’t have to sag. I’m sure they liked the sag but I don’t. \n\nThe color? Excellent on her. Like, yes, that Handmaids comparison is apt, but I blame the awful hood for some of that. Maybe the gold arm was an attempt to steer clear of Handmaids tale comparisons? I like hoods and even I think this should have been a headpiece instead - add the gold up on her head, crop the sleeves so it’s not so Handmaids tale, and we can talk. \n\nColor and fabric divine though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Zorba_thesugarglider",
            "body": "I overall like it. But at first glance the sleeves gave me an optical illusion of her having little T. rex arms.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Alive-Beyond-9686",
            "body": "You go thing!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Grumpy_001",
            "body": " O",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Stunning-Gur-3915",
            "body": "She looks beautiful, but I like the idea of it more than the execution.\n\n\n I wish the back of the hood wasn't as structured, the side profile of the hood is just off...like something is being smuggled inside. The puckering of the satin at the bust makes it look like no alterations were done and they just threw her in a premade dress.  The arm decorations look like spray painted flowers from Dollar Tree. The top of the skirt looks like when you're about the sit in a a-line dress and get that puff of air at the waist. A gold shoe would have looked nicer.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fancy-Pumpkin837",
            "body": "The proportions optically look all over the place",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Routine-Week2329",
            "body": "Love the concept. Not the execution. Wish it was a different color as it doesn’t seem to fit with bridgerton but maybe I don’t know enough about season 3.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "danesete",
            "body": "It’s giving little red riding hood",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Technical_Ad_4894",
            "body": "Looks great from the front. Not so much on the side view",
            "score": 1
        },
        {
            "depth": 0,
            "author": "frasiercrane97",
            "body": "Blinged out little red riding hood",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ok-Stress-3570",
            "body": "She’s such a beautiful person and these last few dresses I’ve been have been wearing her and are horribly unflattering. What in the world is this!?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Orchid_Significant",
            "body": "It took me a second to figure out where her arms were",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AsheratOfTheSea",
            "body": "This dress looks like the usual shit designers pull with plus sized bodies: hide the upper arms, and let’s make the hips artificially bigger to make her waist look smaller. The dresses she wore in Bridgerton S3 (post glow-up) were more flattering. She’s gorgeous and deserves better.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "portreport",
            "body": "Currently it's kinda hot here in Rio so I hope the air conditioning was top notch at the place of the premier. I felt super bad for her and the actor that plays Colin, their outfits were absolutely not made for hot weather",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HoneyBee-2023",
            "body": "Looks spiky. Me likey.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Effective-Warning178",
            "body": "I've gotten more into this season than others, not surprised it's the most viewed season of the series I alone makeup half of those millions of streamed hours lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "shambean2",
            "body": "I don't know if I like it or not but I love how she always gives us something interesting!!! Some red carpet ppl can be complete bores. And I love the scarlet on her, it suits her",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fickle-Election-8137",
            "body": "It’s not my favorite look, Nicola is always beautiful but I just don’t feel like this is doing her justice",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aceofbasesupremacy",
            "body": "umm…gorgeous from the neck up!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "my_stupid_name",
            "body": "Every time I see her I get aggravated at how poorly fashion houses seem to be able to work with bodies that aren't standard.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Normal-person0101",
            "body": "Rio was 32°C, honestly, a more tropical dress would be nicer, her and Colin hasn't dress for a hot city.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ok_Teacher_5849",
            "body": "I like how bold her style choices are in general, and I usually love her outfits, but this just does not work well for me. I think I just dislike the combination of the skirt shape and hood shape - I like both by themselves, but together it's too poofy in too many places or something. But, it's original, I love the colors, and she wears it really well so still applauding her for this!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "January1171",
            "body": "I feel like I would like this way more if there was more contrast between her hands and the dress. Visually they just blend together. \n\nOtherwise, I love the silhouette!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jgbyrd",
            "body": "elden ring for the premier",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Huge_Presentation_85",
            "body": "She literally looks like the human version of Gout in that dress lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fluid_Fox23",
            "body": "Nah don’t like the outfit",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Key_Bee7805",
            "body": "I think she kills it every time. Not my favorite but I love that she is always giving Fashion and body",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Available-Egg-2380",
            "body": "Not my favorite. She's lovely and that dress is wearing her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "darkhummus",
            "body": "She is a glorious icon and this dress does absolutely nothing for her",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bonaventure1122",
            "body": "This is the best Reverend Mother cosplay yet.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dragonrider1965",
            "body": "I like the color and that is it . She’s gorgeous and has been wearing some beautiful styles lately, this is not one of them .",
            "score": 1
        },
        {
            "depth": 0,
            "author": "garden__gate",
            "body": "This is the first thing I thought of:\n\nhttps://preview.redd.it/jgsse1exe12d1.jpeg?width=316&format=pjpg&auto=webp&s=e8e1b7136af98f40cf902f7375c3d228a2eba012",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yuyufan43",
            "body": "She is so stunning! I first saw her on Taskmaster so I got to see how adorable she is in real life and she honestly seems like such a gem\n\n![gif](giphy|jsBBMiiAj1xe10CEFb|downsized)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "harleyqueenzel",
            "body": "Why does this outfit feel like a Russian nesting doll?? 😭",
            "score": 1
        },
        {
            "depth": 0,
            "author": "magicalfolk",
            "body": "The color is so beautiful on her but the dress no.  She clearly loves going all out / a lot going on fashion but I think if she chose to focus on highlighting one thing it would’ve looked better. Like the gloves / the hood / the color / silhouette. Not all of it together all at once.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "October_13th",
            "body": "![gif](giphy|WpD1gFWnFrlG9QhHy9|downsized)\n\nLove her, but I don’t love this dress.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thesoggydingo",
            "body": "This is SO bitchy. I love it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hikingjunkiee",
            "body": "![gif](giphy|AoBgxayGMHlIs)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Machine_Winter",
            "body": "https://preview.redd.it/9bomvyqki12d1.jpeg?width=262&format=pjpg&auto=webp&s=0a77e2426022083a669aacccf67e664e08876d21",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RaindropsAndCrickets",
            "body": "Little Red Riding Hood!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CrabMeat6984",
                    "body": "Little?!?’",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "meowparade",
            "body": "Hood and arms aside, I don’t like the way the skirt is weirdly puffy in front.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "littesb23",
            "body": "Ok so… I LOVE this. She has become such an unexpected fashion girlie and I feel like she has been serving. This is something I’d expect to see on Anya or Zendaya. I hope Nicola stays a red carpet staple after this season",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Putrid-Gene-9077",
            "body": "I don't love it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bknippy1959",
            "body": "I’m not feeling this look. She’s hit it out of the park with all the others.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ChroniclyCurly",
            "body": "It’s giving a modern “Queen of Hearts” from Alice in Wonderland",
            "score": 1
        },
        {
            "depth": 0,
            "author": "YeOldeMoldy",
            "body": "Godskin noble ass hood",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sparklefield",
            "body": "I thought she was missing arms 😭😭😭",
            "score": 1
        },
        {
            "depth": 0,
            "author": "horcynusorca",
            "body": "Beautiful color ,but imho she deserves better,it doesn’t look very flattering",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bright_Air6869",
            "body": "Love it. But would like only one arm, maybe. I love her doing these bold looks. And the face card never declines",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sonic_toaster",
            "body": "This looks like AI weirdness",
            "score": 1
        },
        {
            "depth": 0,
            "author": "artemisthewild",
            "body": "Whatever is going on with the bodice reminds me very much of a hand muff sewn far too high.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hydrationstation0986",
            "body": "It’s giving 🔺",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Vegetable_Burrito",
            "body": "The hood looks like it’s pushing her head down.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "I-am-me-86",
            "body": "The dress is beautiful! \n\nIt's, however, rather unflattering. Nicola is amazing! She deserves to be in beautiful and flattering clothes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "discucion99",
            "body": "Unpopular opinion but I love it. She looks like the most fun member of the bene gesserit from Dune.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DovaP33n",
            "body": "That colour looks fantastic on her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bobbib14",
            "body": "This looks like a painting on top of a billboard. Wild look",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jewell1974",
            "body": "Weird dress.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "EllectraHeart",
            "body": "i appreciate that the takes fashion risks",
            "score": 1
        },
        {
            "depth": 0,
            "author": "secret_princesita",
            "body": "chicken run meets the handmaid’s tale",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MBeMine",
            "body": "Ugh, I feel like I say this every time.  This could have been beautiful.  But, once again, the tailoring is terrible and the inverted nipple darts are a big NO.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Coyotesamigo",
            "body": "Hunger games host",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mediumeasy",
            "body": "im sorry, i love it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "victorian_vigilante",
            "body": "Great idea, awful execution",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ggfangirl85",
            "body": "To me it says…I work for the Galactic Empire. Bow before me you Rebel Scum!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nodogsallowed23",
            "body": "Dress should’ve been black, gold, or purple. Not red. Looks like Christmas skin disease.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Serenity_Moon_66",
            "body": "It's giving me Handmaid's Tale. I usually love what she wears. As long as she was happy in it. That's what counts 👏🏼❤️",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SummerJinkx",
            "body": "This dress is great, just need some structure",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zeromavs",
            "body": "Does she have the same condition as Ceelo Green?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "cetus_lapetus",
            "body": "I don't love the look but I really appreciate that she's willing to shake it up and that designers are making fun and unique things for a fuller figured woman",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tiffanydisasterxoxo",
            "body": "It looks phallic or buttplug-ic",
            "score": 1
        },
        {
            "depth": 0,
            "author": "shutyourgob16",
            "body": "is this supposed to be a pillow case?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AssortedGourds",
            "body": "I LOVE that fat celebrities are pushing back on the idea of \"flattering\" and are adding volume in places we've all been told should be small. Lizzo has done this quite a bit (and she confirmed that it was what she was going for). It's so subversive in the best way and it makes my heart sing every time I see it.\n\nI do feel like whoever her dresser/assistant is should have made the back of the hood look better for these shots but it's whatever.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "redflagsmoothie",
            "body": "Ok but she looks like a bedazzled handmaid",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nacho78",
            "body": "What are we doing?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "peppermintvalet",
            "body": "Yassified under his eye",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Barfignugen",
            "body": "Anyone else getting “Handmaids Tale but make it fashun”?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InquireWithJason",
            "body": "Looks piggish",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueonBlack26",
            "body": "What. The. Fuck.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueonBlack26",
            "body": "Thanks I hate it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Engineer-Sufficient",
            "body": "it’s giving crossover between lady whistledown x handmaids tale and",
            "score": 1
        },
        {
            "depth": 0,
            "author": "marshmellow_delight",
            "body": "A rare miss…it’s giving Casper meets Wendy\n\nhttps://preview.redd.it/9h7a8d5p232d1.jpeg?width=353&format=pjpg&auto=webp&s=5ec5b9c69fac608519f3d204177059625cb9812d",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mochafiend",
            "body": "I love this color on her but I’m disappointed in it. She’s so pretty, why are none of these outfits working?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "airi-hatake",
            "body": "i hate that thing celebs do when they pose for pics where their mouths are open and they show their two front teeth. i know it is trying to give seductive or sensual but it doesn't look good to me.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LadyAleswith",
            "body": "Her stylist is an idiot.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hot-Temperature-4629",
            "body": "It's giving advanced syphilis. Werk that gummata hunty! Penicillin G benthazine don't got shit on you! Slay!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CookDane6954",
            "body": "With the exception of Anya Taylor Joy and Cate Blanchett, this spring has been such a disappointing dress season. Nicola Coughlan, Aubrey Plaza, Lily Gladstone, Hunter Schafer… I honestly can’t think of a wonkier season.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ShortCarpenter2534",
            "body": "She’s beautiful, dress is awful!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lepetitgrenade",
            "body": "I sorta like it but the silhouette only works from the front.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Small-Measurement791",
            "body": "Where was she at the Met Gala? :/",
            "score": 1
        },
        {
            "depth": 0,
            "author": "fatherlolita",
            "body": "What in the hunger games capital fashion is that",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lucyparke",
            "body": "This is the worst I’ve seen her in. She usually looks so chic!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "breyness",
            "body": "I feel like her short stature is working against the structure of the outfit",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Academic-Map-1035",
            "body": "Shes mothering I fear",
            "score": 1
        },
        {
            "depth": 0,
            "author": "peripheralpill",
            "body": "love the high fantasy drama of it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ColorMatchUrButthole",
            "body": "Y'all are crazy this is fierce",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SideEye2X",
            "body": "The hand maids tale Christmas edition",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PotusObamna",
            "body": "I think it’s really alluring 🤷🏻‍♀️ I like the old world portraiture lewk - a darker setting might help it?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Impossible_Leg9377",
            "body": "Her skin is amazing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OutForAWalkBeach",
            "body": "So we’re doing hand maid’s tale now, aren’t we?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Miss_Consuela",
            "body": "Aww she’s sooo bloody gorgeous. Her stylist has done her dirty here. The colour is absolutely fabulous, unfortunately the cut of that dress does the lovely Nicola no justice.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "navsingh12",
            "body": "This looks awful.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Prestigious-Log-7210",
            "body": "I hate everything about this, I honestly thought she was an amputee in first picture.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheLadySaintly",
            "body": "Took me far too long to work out where her arms were",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Frosty_Cap_9473",
            "body": "She looks gorgeous in everything wish she was there in my childhood and then I wouldn't have hated my 45kg of my body",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Soft-Mirror-6926",
            "body": "Don't love it , don't hate it either , the waist doesn't seem tailored",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CaffeinatedSim",
            "body": "Red Queen Vibe",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hopeless-hobo",
            "body": "Are those the gloves from the table scene in Beetlejuice?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sarcasticseductress",
            "body": "She’s had some great looks recently, this just isn’t one of them.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lujenchia",
            "body": "It took me 30 seconds to discover she still have her hands, either the clothing or the photographer needs some improvement.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "olegass",
            "body": "Such a f*****g icon!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "needanoffswitch",
            "body": "She always looks like she doesn't know what to do with her hands.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dependent_Room_2922",
            "body": "It's a bold look, but I feel so over her. Hooray for short-girl representation and hooray for non-size 2 representation, but the constant effusive praise seems reflexive no matter the actual look. \n\nThere are elements to admire in this look but there's also some weird construction and it's so over the top like she's in shiny red balloons or in the profile pic like the back of her head, her belly and her butt are all pregnant. And while I'm at it, I'll go ahead and add that I find her expression odd in some shots. In this set it's mainly the 5th one, the one with one hand on her belly. She looks sort of blank and like she feeling the first small rumble of an upset stomach.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "shortbrunette1992",
            "body": "Not her best look. She looks like she’s cosplaying a rich handmaiden or something.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dry_Article7569",
            "body": "This looks like the promo photo from the handmaids tale.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "monster_lily",
            "body": "I hate the arms they look like chicken feathers or something",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BananaGravy420",
            "body": "Horrifying",
            "score": 1
        },
        {
            "depth": 0,
            "author": "morus_rubra",
            "body": "It does nothing for her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sarathev",
            "body": "This looks like \"under his eye\" but if the 'he' was a Ru Paul rejected contestant.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fitzfuzzington",
            "body": "Gwan Nicola with your Brazil premiere! \n\n\nThrilled that this young one from Galway has her face plastered on posters across the world. Wishing her continued success.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "terpinolenekween",
            "body": "The skirt needed to be more structured. It's puckering on the waist. \n\n\nI don't hate the look, but the sleeves are horrible imo.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fluffyhat0812",
            "body": "this does not photograph well from the side but the front is STUNNING",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hr_newbie_co",
            "body": "The shape of her outfits are always so weird. Also, this would look better with gold shoes. She’s gorgeous though!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Alvin3792",
            "body": "The visual illusion that she has tiny gold arms is freaking me out. I hate it lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "petterdaddy",
            "body": "I do not love the execution but I do love the concept and how willing she is to do some weird stuff. Queen.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "santosdragmother",
            "body": "I loveeeeee it red riding hood giving dragon",
            "score": -3
        },
        {
            "depth": 0,
            "author": "dustmybroom88",
            "body": "I think she is gorgeous, but this outfit ain’t it.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "calicoskiies",
            "body": "I love this. She looks so fierce!",
            "score": -3
        },
        {
            "depth": 0,
            "author": "External_Relation435",
            "body": "This makes her look so tiny. Like a Russian nesting doll. ",
            "score": -5
        }
    ]
}