{
    "title": "Anyone else a huge fan of the VH1 I Love the 70s, 80s, etc from back in the day?",
    "comments": [
        {
            "depth": 0,
            "author": "areallyreallycoolhat",
            "body": "I fucking loved these, I feel like these specials are where 99% of my understanding of pre-internet pop culture comes from",
            "score": 488,
            "replies": [
                {
                    "depth": 1,
                    "author": "misguidedsadist1",
                    "body": "This is it. It was like pop culture before til tok memes lol",
                    "score": 99
                },
                {
                    "depth": 1,
                    "author": "whimsical_trash",
                    "body": "I asked my young friend how they learn about pop culture history without stuff like this. She was like, from you. I was like well that's no good you need I love the 00s!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "two_oh_seven",
                    "body": "10000000000% same here!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Inagrowmygarten",
                    "body": "1000%",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ready-to-rumball",
                    "body": "You stated it perfectly. As a 90’s kid I learned so much about pop culture from the 70s and 80s.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ExactPanda",
            "body": "I Love the 80s is God-tier pop culture television! I recorded them all on VHS.\n\nI'm mad they did an I Love the 2000s, but it came out in 2008.",
            "score": 207,
            "replies": [
                {
                    "depth": 1,
                    "author": "ElevenBurnie",
                    "body": "I remember thinking they botched the 2000s one because 1) the decade was not over and 2) decades need time to marinate before they can really be understood",
                    "score": 106,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AromaticChallenge7",
                            "body": "“Decades need time to marinate” is a great way to put that but it also made me spit water all over my keyboard 😂",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Craphole-Island",
                    "body": "They did do another one in like 2014 called “I Love the New Millennium” about the 2000s but yeah I agree so stupid that they did that\n\nEDIT: Sorry the “New Millennium” one was the 2008 one lol. The 2014 one was “I Love the 2000s”.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "theeblowersdaughter",
            "body": "I kill at trivia night because of this show. I tried to ask if anyone else got their pop culture knowledge at trivia night from VH1 but no one else knew what I was talking about 🥲",
            "score": 121,
            "replies": [
                {
                    "depth": 1,
                    "author": "jadegives2rides",
                    "body": "Did you also watch the World Series of Pop Culture that aired around the same time?\n\nI was like 11 or 12 answering all of them lol",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "severus_snapshot",
                            "body": "Wasn't the group that won named El Chupacabra? Something like that.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "LouCat10",
                            "body": "I loved the World Series of Pop Culture!! I was determined to win it someday…and then they never did it again. I think of it whenever I hear the song Kokomo because one of the final questions was naming all the places in that song.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sisterinked",
                                    "body": "I can name them all!!",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Strict-Minute-8815",
                                    "body": "SAME. When I read this I thought I don’t remember leaving this comment 🤣",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ExactPanda",
                            "body": "What a fantastic time if you were a pop culture or trivia geek",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "DCStoolie",
                            "body": "Unlocking a very old memory here",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "babyrothko",
            "body": "I was just thinking of these!! I was obsessed and I realized how funny some of these celebs were and it made me fans of theirs lol. I loved the personal stories and seeing all the toys and food lol. Omg I need to binge these asap",
            "score": 102,
            "replies": [
                {
                    "depth": 1,
                    "author": "justheretosavestuff",
                    "body": "I think these shows were where I first saw Paul F. Tompkins",
                    "score": 49,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jadegives2rides",
                            "body": "Michael Ian Black for me. He was my fave.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "justheretosavestuff",
                                    "body": "I knew Michael Ian Black from when he played Johnny Blue Jeans on Viva Variety (a show that sometimes feels like a fever dream that only I remember), but he was also a favorite",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "emkitty333",
                                    "body": "Yes that’s what made me see a Michael Ian Black stand up and he did not disappoint!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DizzyLemon666",
            "body": "I wish I could buy or watch episodes somewhere",
            "score": 63,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sass_McQueen64",
                    "body": "They have some on YouTube",
                    "score": 32
                },
                {
                    "depth": 1,
                    "author": "Ask_me_4_a_story",
                    "body": "I binge watched the whole I Love the 90s series on YouTube a few weekends ago. They are still really funny because of the comedians, so good! ",
                    "score": 19
                }
            ]
        },
        {
            "depth": 0,
            "author": "background_action92",
            "body": "Hell yeah! It was this and the Best week ever! The one wherebtheybwere ranking the hottest celebrities was dope too.",
            "score": 56,
            "replies": [
                {
                    "depth": 1,
                    "author": "ExactPanda",
                    "body": "I loved those VH1 countdowns they used to do. 100 greatest child stars, most shocking moments in rock and roll, one hit wonders, greatest songs of the 90s, etc",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PinkTalkingDead",
                            "body": "Same! Part of the cool thing growing up with having to watch whatever was on the tv meant I watched so many things I wouldn’t have chosen if I had the chance, it really broadened my horizons ",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Eating_Bagels",
                    "body": "Omg I totally forgot about Best week ever! That was such a fun show.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "omgcow",
            "body": "Those shows are the foundation of my pop culture knowledge. There are so many movies/shows I haven’t seen but I can still reference because I saw them on I Love [Insert Decade Here].",
            "score": 41
        },
        {
            "depth": 0,
            "author": "IamToddDebeikis",
            "body": "I LOVED this so much. Michael Ian Black as chaotic evil is perfect. I loved him as Bill Tundle on Burning Love.",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ask_me_4_a_story",
                    "body": "That was such a wild show! I hate reality TV but I love fake reality TV. You might like a really weird fake self improvement show Michael Ian Black did called “You’re Whole” so fuckin funny ",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IamToddDebeikis",
                            "body": "Going to check that out. I love the whole burning love crew",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheyMightBeDiets",
            "body": "I recorded so much I Love the 70s/80s/90s on my satellite recorder box, and also The Soup! I was too young to understand everything but I loved the info dump of so much stuff that happened in pop culture that I miss.\n\nI highly recommend [Intelexual Media's video series](https://youtu.be/7ckMf0xKJdw?si=mLMuS89g8xsN8pef), her research and video clips/documentation is amazing. Of course it isn't the talking heads of the VH1 pop culture comedians but I appreciate all her amazing work to make history and culture interesting and not watered-down and sanitized.",
            "score": 31,
            "replies": [
                {
                    "depth": 1,
                    "author": "Invisible-Locket13",
                    "body": "The Soup was so great. My dad and I loved it, and he got a real kick out of “Chicken Tetrazzini!” We didn’t watch reality TV back then so that’s where we got all of the run downs",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "littlecreamsoda79",
                            "body": "So meaty",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Invisible-Locket13",
                                    "body": "Let’s talk about chicks, man *chiiicks, maaan*",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "WinterSun22O9",
            "body": "I had an 80s phase as a teen. I even somehow found a VH1 I ♥️ the 80s shirt at the mall once and grabbed it. I watched one episode that counted down the best songs and got a little miffed that dad kept talking when they got to Safety Dance because it was my fave lol",
            "score": 26
        },
        {
            "depth": 0,
            "author": "Sass_McQueen64",
            "body": "I yearn for these to come back.",
            "score": 29
        },
        {
            "depth": 0,
            "author": "NomNom83WasTaken",
            "body": "Michael Ian Black describing Mr. DeLorean as having a problem with \"la coca-ina\" is burned into my brain.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LouCat10",
                    "body": "Yes, “la coca-ina” lives rent free in my brain as well!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NomNom83WasTaken",
                            "body": "Every now and then it will bubble up and I have to say it out loud. Thank god my husband knows what the hell I'm talking about and will chuckle, too.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "LouCat10",
                                    "body": "I’m so glad my husband knows it too or I would seem totally nuts!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AcanthisittaUpset866",
                    "body": "I have found my people!!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NomNom83WasTaken",
                            "body": "![gif](giphy|kSlJtVrqxDYKk|downsized)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AcanthisittaUpset866",
                                    "body": "I love it. Makes my cold heart melt just a little.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lost-Asparagus111",
            "body": "Yep, loved these! Also love seeing Mo Rocca on Celebrity Jeopardy.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "AcanthisittaUpset866",
                    "body": "Me too! My husband and I are huge fans of the “I Love the…” shows and Mo was one of our favorites! We were so excited to watch him on Celebrity Jeopardy!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NowMindYou",
            "body": "Literally where most of my references come from. Imagine my shock and surprise when I saw Hal Sparks on QAF",
            "score": 39
        },
        {
            "depth": 0,
            "author": "SpiritualPeanut",
            "body": "My friends and I legitimately quote various moments from I Love the 80s/90s on a frequent basis 😂. We were OBSESSED.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "downticmsofhs",
                    "body": "Me, I’m just always thinking about Donal Logue singing “FAME! I’m gonna rip my tshirt! Exposing my nipples on the streets of New York FAME!”",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "JeannieGoldWedding",
                    "body": "Omg I have some too! Mine are:\n\n“I don’t know what to do when I got a white baby in my hands!” RIP Patrice O’Neal 💙\n\nAlso Hal Spark’s “I’m whittling myself a VCR!”\n\nIt’s not so much a joke but when George Lopez was talking about his uncle being buried in a Member’s Only jacket and Constance Marie cracked tf up lol",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "Falcons2Flynn",
                    "body": "I gotta know what the go to quotes are since me and my friends do that same thing!",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SpiritualPeanut",
                            "body": "I’m pretty sure there’s more, but I can think of a few off the top of my head…\n\n“Splatow!” (discussing Silence of the Lambs)\n“Makes me wanna boot” (scratch and sniff stickers)\n“Gloworm - you helped me many a night”\n“Don’t nobody wanna watch you Rockwell”",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bunni_butt",
                                    "body": "omg the boot comment always made me crack up, the most random ass scratch and sniff stickers lol.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "LadyCheeba",
                                    "body": "omg i quote the rockwell one all the time hahaha",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hup110516",
            "body": "I loved these! Same with Best Week Ever.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Invisible-Locket13",
            "body": "This show raised me. I knew (and still know) way too much about 70s and 80s pop culture for a kid born in 1993.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "vintage-glamour",
                    "body": "me but i was born in 2000",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Invisible-Locket13",
                            "body": "Happy cake day!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "JeannieGoldWedding",
            "body": "This series and having three older sisters that are 70s/80s babies gave me a pop culture foundation that still grounds me today!\n\nDid anyone else have a huge childhood crush on Michael Ian Black solely because of this show?",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "ExactPanda",
                    "body": "MIB and Hal Sparks",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dear-Ambition-273",
            "body": "I was obsessed.  I’m mad I missed the chance to be a commentator on one of these.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "akam80thesquirrel",
            "body": "This is how I discovered Michael Ian Black and I am very appreciative",
            "score": 10
        },
        {
            "depth": 0,
            "author": "Low_Departure_5853",
            "body": "I always think about wanting to watch these again. I still quote some of them.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "kayayem",
            "body": "Omg yes, when there was a re-run I’d stop everything and watch. The part deux wasn’t as good though, and neither were the 2000s. But the 70s 80s and 90s were gold. This is still the only place I know some of the really big comedians from too like Bill Burr lol.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "ham_sami",
            "body": "VH1 is such an underrated gift to pop culture. Our generation wouldn’t be nearly as invested in celebrity culture without it. MTV is the obvious one but VH1 was just as impactful to me.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SansaDeservedBetter",
            "body": "Mo Rocca and Godfrey were hysterical in the 90’s specials.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "diddilybop",
            "body": "omg mo rocca and michael ian black were my favorites from this series! both of them had me laughing so hard that i almost spit out soda on my friend once 😂",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Nasus_13",
            "body": "VH1 always had the best shows.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "littlecreamsoda79",
            "body": "Yes!! Give me some of this, Best Week Ever, Celebrity Fit Club.... Vh1 was awesome",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Remarkable_Toe_4423",
            "body": "Is that Andrew wk?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "StasRutt",
                    "body": "Yes lol I weirdly knew of him from this before I knew of his music career",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "yokayla",
            "body": "I was obsessed.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Visual_Vegetable_169",
            "body": "I used to watch these & the \"stupidest quotes\" videos religiously as a kid. 2000s VH1 was where I learned everything I knew about pop culture lmao",
            "score": 5
        },
        {
            "depth": 0,
            "author": "SensitiveWasabi1228",
            "body": "Shut uuuuuuppppp! I just re-watched these. They're on YouTube. In the series Ghosts, they watch a show entitled, \"How 'bout Those 90s,\" and it's a show like this, which is what made me look these up!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Rain-Bat",
            "body": "I was *just* talking about this show the other day.\n\nTruly peak pop culture",
            "score": 3
        },
        {
            "depth": 0,
            "author": "morbidlonging",
            "body": "i used to love watching this! This is a very accurate alignment chart, op!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "StasRutt",
            "body": "We need to bring it back! The youth need to learn culture history! I actually bonded so much with my Mom over these shows because her childhood was 70s and then young adulthood was 80s and 90s so it was such fun insight into her growing up. Plus it let me appreciate so much from previous generations. THE YOUTH NEED IT BACK\n\n![gif](giphy|FtBw4gIVV6fTO)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "youneedsomemilk23",
            "body": "The way 14 year old me was THIRSTING over Michael Ian Black\n\n![gif](giphy|3PzmBpZt0iimrcWvfV|downsized)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "leafonawall",
            "body": "I genuinely think this is highly educational content and wish kids watched these in school. Pop culture is a reflection and historical marker of the world. It’s a great way to learn about the historical contexts.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "JoleneDollyParton",
                    "body": "we should force anyone to watch them before they comment here TBH",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "JoleneDollyParton",
            "body": "I'll always remember Dave Grohl saying \"..because when you are 12 or 13, love really is a battlefield.\" I loved these shows.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Future-Book-1446",
            "body": "YEEEEESSSSS",
            "score": 2
        },
        {
            "depth": 0,
            "author": "couchtomatopotato",
            "body": "i rewatched during covid. i LOVED this show in 08!!! wish theyd bring it back.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "88moonkitty",
            "body": "My friend and I still quote stuff from this show to each other!\n\n“And push the clouds, push the clouds.”…anybody? Lol",
            "score": 2
        },
        {
            "depth": 0,
            "author": "shaeleymae",
            "body": "Michael Ian black was my first real man crush",
            "score": 2
        },
        {
            "depth": 0,
            "author": "nuggetghost",
            "body": "i looooooved these!!!! the 90s ones especially and then the 00s",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Craphole-Island",
            "body": "These shows taught me so much about pop culture. I only know so much bc of these VH1 shows (plus the VH1 and E! countdown shows lol and True Hollywood Story)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "deadmallsanita",
            "body": "What ever happened to the neutral good guys?   \nI love that this special brought Mo Rocca to the masses <3.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "StasRutt",
            "body": "Does anyone remember the VH1 show with I think Doug Benson? Where he goes to kidnap buzz aldrin because of the astronaut kidnapping story? Buzz aldrin punches him and goes “you gotta wake up pretty damn early to surprise buzz aldrin” which I quote CONSTANTLY",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yuyufan43",
            "body": "Michael Ian Black was the best",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MrMush48",
            "body": "Yes, and I love Michael Ian Black!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yelyah66",
            "body": "Oh my god I'm not the only one 🥲 I used to watch the marathons of these as a kid, I thought I belonged in the 80's.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "criminy_crimini",
            "body": "lol Michael Ian Black being chaotic evil is spot on 🤣",
            "score": 1
        },
        {
            "depth": 0,
            "author": "joaniemoon",
            "body": "Had to check what sub I was on because I was not expecting to see Greg fitzsimmons pop up on my feed",
            "score": 1
        },
        {
            "depth": 0,
            "author": "not-so-radical",
            "body": "Is that the dad from Lab Rats next to Luiz Guzman???",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ForcedToMakeIt",
                    "body": "I googled it and was his characters name Donald Davenport? If so then yes,  that's him. His name is Hal Sparks, he's a stand up comedian and actor. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ohlittleindian",
            "body": "STRIKES BACK",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CatGotNoTail",
            "body": "I loved these! I was watching Pop-Up Video on YouTube last night and I love the 90s came up on my recommended viewing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Aviere",
            "body": "These are the exact reason why I know so much about pop culture, I watched all of them. I know so much useless trivia!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PlentyDrawer",
            "body": "I would watch these shows while doing my homework.  So much fun.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "smart_cereal",
            "body": "I literally watched these on repeat as a kid and wanted to be a commentator sooo badly. I actually saw Fitzsimmons do a stand up routine a few years ago!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "skibearz",
            "body": "i would watch these all the time! my dad would sometimes join me, which i always thought was funny as he’s normally a serious person, but it turns out he loves pop culture as much as i do 😂",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tmtm1119",
            "body": "God yes!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cherssssss",
            "body": "I loved these!! So extremely funny and I learned so much.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "neutralmondmilkhotel",
            "body": "This alignment chart is so wildly accurate.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MartinezJr221",
            "body": "Yeah, I love 70s, & 80s. We're great shows, but I felt it was a little to early talk about I love the 90s, during 2003 or 2004, cause it was too fresh for us. I love the new millennium was just stupid...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AliciaDawnD",
            "body": "This chart is amazingly accurate!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ThatBabyIsCancelled",
            "body": "These shows are why millennials know so much about pop culture that was before our time",
            "score": 1
        },
        {
            "depth": 0,
            "author": "vintage-glamour",
            "body": "Stop it oh my god, this was my childhood. My parents are pop culture *fiends* and I'm realizing this is probably where my obsession began. Anyone else remember Pop-Up Video on VH1 Classic?!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "glamazon_69",
            "body": "Thanks for the official reminder to rewatch all of these from the beginning!!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "itsalicianotalicia",
            "body": "I have so much random knowledge about celebrities, music, politics and whatever. People are usually surprised and figure I'm young to know certain things. My secret is that I was obsessed with these shows when I was a teenager",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RoeRoeRoeYourVote",
            "body": "I was *obsessed*. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "emkitty333",
            "body": "Yes!!! I wish they would do a 2000’s/2010’s! These were so great!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sunshineriptide",
            "body": "I had the biggest crush on Hal Sparks back then, haha",
            "score": 1
        },
        {
            "depth": 0,
            "author": "No-Cat-8606",
            "body": "What about Best Week Ever?! That show was great too. There actually was a female comedian on there that I have been trying to remember her name for YEARS\n\nhttps://preview.redd.it/ob1qo1bth72d1.jpeg?width=4032&format=pjpg&auto=webp&s=fab8590628ae93133329944ce7f710e7a9247e01",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Falcons2Flynn",
                    "body": "Are there any details about the comedian you can remember? Watched Best Week Ever a ton!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "No-Cat-8606",
                            "body": "I saw her once in a show about the 2000s and got that screenshot of her. The only thing I could remember was she always wore a star necklace (like she happen to be in that photo)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "originalschmidt",
            "body": "I watched these a ton!! I also enjoyed That 70’s House which was a reality competition show where the cast stayed in a completely 70s style house, no technology passed the 70s, they had to dress 70s, they had different challenges and stuff and the best part was the The Hustle were anytime The Hustle started playing they all had to stop whatever they were doing and do The Hustle!! It was a fun time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CuriousMonster9",
            "body": "Yesss, I loved these shows! They were a big gateway into pop culture history for me.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "alyboba19",
            "body": "I watched every single one! They were great crash course for every decade.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BluthFamilyNews",
            "body": "Put it on streaming! It’s like the library of Alexandria for losers like me.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Frequent_Disaster_",
            "body": "I only know those faces from that show! I miss those days.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "VictoriaSobocki",
            "body": "It’s great",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bidetpanties",
            "body": "Loved it! I had a crush on Hal Sparks",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Exotic-Doughnut-6271",
            "body": "Omg so many memories unlocked",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Street-Chard",
            "body": "My sister and I STILL quote these they’re so good",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thetrashpanda2020",
            "body": "This needs to come back",
            "score": 1
        }
    ]
}