{
    "title": "Jennifer Lopez Says ‘You Know Better Than That’ When Asked About Ben Affleck Marriage",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SitchChick",
            "body": "The greatest love story never told, but please don't ask if the book has ended",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cold_Breadfruit_9794",
                    "body": "😂😭",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "loulou-v",
                    "body": "🗣️🗣️🗣️",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "pushin_on_my_buttons",
                    "body": "Ugh, as if!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HI_l0la",
                    "body": "Need to save it for the next chapter that was never told... Or is *unreleased*?...  Whichever way that will allow her to milk it for money or press.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cat_tower38",
            "body": "This whole thing is just to gain more attention for her netflix movie. Liking relationship insta posts then no ring, then ring, now Ben’s giggling hiding his hand picking up his son lol then they’re seen in cars together it’s so silly",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "walkingtalkingdread",
                    "body": "it’s a smart move after all the roasting she got for that bodega order clip. if nothing else, JLo knows how to keep her name in people’s mouths.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kwyjibo1988",
                            "body": "Thank god Will Smith ain't her husband!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Annabellee84",
                                    "body": "Omg that gave me a good chuckle!thanks😂",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "seriously-wtaf",
                                    "body": "Please don’t give them any ideas 😩",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "joshually",
                                    "body": "I literally choked",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "pushin_on_my_buttons",
                            "body": "Whoever is responsible for her rise to fame in the first place knows how to keep her name in our mouths.\n\nGossip and media exposure are the reasons why JLo is relevant to this day.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Goodgoditsgrowing",
                                    "body": "I blame Selena’s murderer for this whole chain of events",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TacoPartyGalore",
                                            "body": "Fuck Yolanda. When she’s paroled soon, we should force her to hear of all Jennifer’s music and watch all her movies & documentaries.  That’ll teach her!",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "pushin_on_my_buttons",
                                            "body": "Exactly. \n\nLike if she never died she would probably be like Beyoncé big, one of the biggest acts in the world.\n\nIf she never died JLo would never have been a thing.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "happysunbear",
                                                    "body": "Well, Tommy Motola made sure she was a thing, just to get back at Mariah. Hence “I don’t know her” and everything since that’s followed.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TacoPartyGalore",
                                                            "body": "I wish we didn’t know her",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Tenley95",
                                    "body": "Like most celebs?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pushin_on_my_buttons",
                                            "body": "Yes and no. \n\nJLo never had the talent to justify that level of fame and recognition within the industry. \n\nShe just happened to be at the right place, at the right time, with the right people in the late 90s when Hollywood felt like it was time America had a Latina superstar. \n\nI do love her songs from that time period (late 90s-early 00s) but she is just not that good.\n\nSomeone in the high places has definitely been shoving her down our throats since the beginning by continuously having her in the news. Basically they been using the power of the tabloid press to keep her relevant ever since she first rose to fame after the Selena biopic. That’s how she stays afloat.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Rare_Vibez",
                                                    "body": "When she said she hasn’t had an album in 18 years, I was shocked. I didn’t think someone that famous could have done so little.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "greina23",
                                                            "body": "And it isn't true. Her last album was in 2014. \n\nAs for so little, she has released some stand-alone singles\n\nAin't Your Mama\n\nDinero\n\nPa' Ti\n\nAnd she with Maluma released a soundtrack to her Marry Me (?) movie.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Rare_Vibez",
                                                                    "body": "Maybe she said 8. Either way, that feels like a low output for someone so big.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "greina23",
                                                                            "body": "Nah, I saw the clip you spoke of and she said 18 years. She could have misspoken, but she did say 18 years",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Rare_Vibez",
                                                                                    "body": "I think I’ve just concluded JLO confuses me 😭",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Downtown-Mixture6167",
                                    "body": "Your flare is killing me! That’s my absolute favorite snl skit. Hands down",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pushin_on_my_buttons",
                                            "body": "Mine too!\n\nMy god did I just found my people\n\n![gif](giphy|6EQzurED9q9uU)",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Healmetho",
                            "body": "I missed this!! What?!",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Rockindobbs",
                            "body": "Not to be ‘that guy (gal)’ but she’s too old for these childish media games.\nI think she’s a diva without the goods to back it up. But she’s talented enough. And beautiful. \nShe does have an interesting enough story that if she just showed some humility & tried being genuine, she could really stay relevant long term. \n\nNo one is going to give a shit when she’s 60 & still doing this. \n\nWe should’t give a shit now.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "redlikedirt",
                                    "body": "She’s on the Madonna track, with less media savvy",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Rockindobbs",
                                            "body": "Right?! \nBc people just say ‘well that’s just Madonna’ And she played up to the persona. She didn’t take it all that seriously. And she’s talented & innovative. \nAnd I’m not even a Madonna fan. \n\nI think JLo truly thinks she’s a Whitney, Mariah, Celine level talent.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "originalschmidt",
                    "body": "Honestly if I were them and had the media all up in my relationship like that… I’d fuck with them hard too. I bet it’s a lot of fun for them.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Time-Ad-3625",
                            "body": "They put the media in their relationship.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "petterdaddy",
                    "body": "Yeah I might spend too much time on the internet but this seems like fairly obvious PR 101. What’s-his-face in that romcom with Sydney Sweeney legit tanked his relationship* and admitted it was planned later just for a dumbass movie.\n\n* I know it was an engagement but every time i read it over it made it sound like I was referring to his social media followings.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Kaiisim",
                    "body": "Meh good for them then. If people are gonna get excited about other peoples misery then using that against them is fine imo.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "RetrogradeSeason",
                    "body": "Underated and valid viewpoint",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "4_celine",
                    "body": "I’m honestly here for it. I realized that I’ll pretty much watch any terrible JLo movie. I love all of them.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Glowing_up",
                            "body": "That one where she goes back to that guys house and beats 10 shades of shit out of him is top notch entertainment.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "BalletWishesBarbie",
                            "body": "Maid in Manhattan was my jam, but now I see Ralph Fiennes and think of his character in 'The Menu' and as Voldemort and I'm like 'Girl, RUN.'",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "aussielover24",
                                    "body": "He’s wonderful in Grand Budapest Hotel! To me it helps balance his roles lol so I don’t view him as just Voldemort or the chef in The Menu anymore",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dragonfliesloveme",
                                            "body": "Omg i love him in GBH!",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "BalletWishesBarbie",
                                            "body": "He's so great in that. Still a maid in Manhattan sequel where there's a huge wedding, she's beaming, honeymoon is amazing, but she starts to notice, there's a lot of security for a mere businessman but whatever he's worth a lot. People defer to him but hey he's rich. His mansion is oddly quiet but his staff seem okay don't they. And he's a Mafia Don like he's a crime lord and she finds out that whilst he treats her like a queen he's like this monster of a human and now she's trapped.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TacoPartyGalore",
                                    "body": "Poor man had an agent get him a role in a romantic comedy. That’s just not his bag.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "babs1789",
                    "body": "I don’t think even this will help her “movie”.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "nousername331",
            "body": "She would rather people ask her about Ben than her time with Diddy. Some are saying this is a ruse to take the heat off of her involvement with Diddy.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cold_Breadfruit_9794",
                    "body": "She would likely be a victim in that situation. This man is a serial abuser and an incredibly dangerous man. People need to be more mindful of that",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "VintageJane",
                            "body": "And she was a young aspiring musician and he was a super powerful and rich producer.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "LightspeedBalloon",
                    "body": "Ooooh that's the first \"this is for PR\" theory that makes sense to me.\n\nI do think this is all real, but I also think she's milking it because that's how she's programmed, and she can have several goals at once.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GreatExpectations65",
                            "body": "Yes, this. Totally agree.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bitchyhouseplant",
                    "body": "This seems like the most likely reason to create other drama right now. Especially after that video with Cassie got out. I’m sure her team is fielding calls and emails left and right wanting to know what she experienced or witnessed while with Diddy.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BalletWishesBarbie",
                    "body": "JLo girl, we remember 'ain't it funny'. 🤨",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Oh_gosh_donut",
                    "body": "I believe this 100%. She and Diddy were a whole thing early in her career. She was present for/involved in at least one sketchy incident with him back then (I don't remember the details and can't be bothered to look them up but I believe someone was shot on NYE?). JLo isn't just a diva- she's actually a bad person.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mrsbear19",
                            "body": "She snuck a gun into a club for him that was used in a shooting",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "peacock_head",
                                    "body": "Wut. I never heard about this!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "babecanoe",
                                            "body": "It was a BIG deal when it happened. The Shameless podcast has a pretty good Scandal episode on this incident if you want to learn more.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TacoPartyGalore",
                                    "body": "She makes fun of that incident in her silly little movie.  The actor that plays her love interest drops a gun on the ground. But most people don’t get the reference cause they did a control-alt-delete of that particular file, or they never heard of it. It’s an inside joke that falls flat.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bb_LemonSquid",
                    "body": "Interesting! With all the wackiness that could be true. At first I was thinking maybe they’re having problems stemming from her prior relationship with Diddy. But if they’re just doing this for “publicity” I think you’re right and it might be a distraction.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "emeraldcastles",
                    "body": "Happy someone else said this, I think she really wants to take attention away from her connection to Diddy.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "AstridxOutlaw",
                    "body": "I can actually find this plausible because Ben hates PR bullshit but he might swing it to protect his wife",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "thegirldreamer",
            "body": "Jen and Ben both need new PR people. ",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "canarinoir",
                    "body": "Unless this is just to distract everyone from the fact that she dated Diddy back in the day.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Soft_One5688",
            "body": "“Lopez herself wrapped up the conference, speaking to the crowd in Spanish and blowing kisses. ‘Thank you. No one asked me anything in Spanish but okay.’”\n\nThis woman is unbearable. Only Latina when it’s convenient, treats the community like crap unless she’s promoting something. And we know she doesn’t really speak the language, nobody wanted to hear her broken down answers.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Violet624",
                    "body": "Ben speaks Spanish better than her",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "maniacalmustacheride",
                            "body": "He’s legit fluent.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "maniacalmustacheride",
                    "body": "![gif](giphy|4WFirPVJhAhavWrcd3)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Nexus718",
            "body": "It's literally the topic of your recent album, and documentary about said album. At least that's what I heard, because I don't have time to watch or listen to that shit. You brought this attention to yourself on this one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MissionExpert8179",
            "body": "Simu Liu just always seems like such a great dude to have around. 👏",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "alpacaapicnic",
                    "body": "I didn’t know who he was and then started seeing him _everywhere_ - yea, in movies, and TV shows, and reality TV shows…then literally a quote from him on the local middle school’s sign. He needs to give his PR person a raise!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Anxious_Catch_2024",
                    "body": "Maybe he changed or something... I don't much about him except that a news article exposed him to be a [incel](https://www.eviemagazine.com/post/barbie-faces-backlash-for-casting-simu-liu-pedophilia-gay-reddit) and problematic",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mandoo86",
                            "body": "That whole convo was taken out of context. He was talking about the biology of pedophiles and the lack of therapy and resources to help them be better.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ratribenki",
                                    "body": "Specifically because he was playing a pedophile and he was doing research into the psychology of them.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Noshonoyoo",
                                    "body": "Pretty much every article that talks about it is quoting twitter posts. None of the big papers have made an article about it, it’s only random/less known smaller websites. None give any context and they’re all using the \"allegedly\" wording.\n\nIf anything, that sounds almost like hidden/subtle racism to me, but what do i know lol.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MissShadowplay",
                            "body": "I've seen his statements and honestly he just seemed like a dumb guy, but not one with malice. My only fault with him is that he's chronically online but I guess who wouldn't be if you're a celeb",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "twoplustwoskin",
                                    "body": "I completely disagree. Dude was an accountant at a top 4 firm in Toronto for about a decade before getting into film. His reputation within the Toronto film scene, where he filmed Kim’s Connivence, is that he is a colossal asshole to work with.\n\nHe was able to propel himself by having one of the best agents in Toronto, Norbert Abrams behind him. Same agent who represents or has represented most of Canadas top film exports.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "neontittytits",
                                    "body": "I hate how dangerous man-thoughts get explained away as “he’s just dumb”. It can be both and those dumb men can put in more effort. Reminds me of how old white racists get reduced to “they’re just old”",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MissShadowplay",
                                            "body": "One can only hope that age, experience, and in his case a boatload of resources and a publicist can help him to evolve",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Tsjjgj",
                            "body": "That's some anti Asian racism bull. 'Rumoured from a tweet', 'Anonymous reddit account linked to Liu', 'It's not racism bc'. It's pretty gross that you are super ok with reposting this garbage. I get it's celebrity gossip, but yeesh.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Cherssssss",
                            "body": "Yikes on 🚴",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "MissionExpert8179",
                            "body": "Oh my. I didn’t know anything about this.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "True-One4042",
            "body": "![gif](giphy|dn65vbCqM8IZzCpBmV)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "spacyspice",
            "body": "Random but today I learned that when Ben was supposed to appear in the show \"Finding your roots\" he got the show delayed bc he didn't want the show to talk about his slave-owner ancestors",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Signal-Illustrator38",
                    "body": "Did you Google search \"give me a gotcha on Jlo and / or Ben?\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spacyspice",
                            "body": "Nah I genuinely found that info because someone mentioned that show on a sub, and as a non-american I decided to google about it. And it's mentioned on their wiki page lol, at least in my language",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "_kaetee",
                            "body": "No one would need to google that. They’re both more infamous than they are famous.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Affectionate_Bet_459",
            "body": "Well Jen, clearly you don’t bc you’re on your 4th marriage babe. Give it a rest.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "M0rninPooter",
            "body": "Can you imagine creating such hype around a 20 year romance for it to crash and burn so spectacularly? An album, a movie and a movie album. All about how amazing Benjamin Affleck is and it looks like he’s leaving her… again.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ernurse748",
            "body": "Girl, you don’t get to pull off your rain jacket on the red carpet and then get snippy when people discuss your shirt.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "unbanned_once_more",
            "body": "Jenny dear, as someone who’s shamelessly courted publicity of absolutely *any* kind for the entirety of your miserable career, to now disingenuously tut-tut and patronise a reporter like that makes you look really cuntish.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Crazy-Place1680",
            "body": "She is so smug",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "anglgrl384",
                    "body": "She can be smug but the question was inappropriate and they deserved to be called out.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stormy_Kun",
            "body": "Imagine thinking everyday people are actually care about your inability to stay in a relationship.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CalendarAggressive11",
            "body": "I feel like this is all a distraction so people don't ask her about diddy",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheYankunian",
            "body": "Good for her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "marzipan_dumpling",
            "body": "“You know better than that. Isn’t it quite obvious I don’t take marriage seriously.”",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rcheek1710",
            "body": "\"Which one\"? would've also been an appropriate answer.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tangerinebb",
            "body": "i'd actually cross the street to avoid this woman",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OrlaKathleen",
            "body": "Well Ben didn’t",
            "score": 1
        }
    ]
}