{
    "title": "Sip & Spill Daily Discussion Thread",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "iliketoomanysingers",
            "body": "Had a dream I won an Oscar but in the dream they not only stuck me in the very back but also counted my walk up to the stage as part of my speech time 😭",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cold_Breadfruit_9794",
                    "body": "Nooooooo!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "OccasionMobile389",
                    "body": "I can't breathe 😂 I'm sorry 😭 😭 \n\n\nSounds like you pissed someone in the dream academy off real bad",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "carolinemathildes",
            "body": "Last night I finished the second draft of a book that I've been working on! \n\nThe pro is that I like it a lot better than the first draft! It's a romance, and I really like the main characters together, so that's fun. Parts of it I love and personally think are super cute. Overall, I think I'm happy with it.\n\nUnfortunately I hate the entire third act and the main conflict and I have no idea how to fix it right now so my current plan is for it to just sit on my computer forever, unread, until the idea of how to fix it comes to me in a dream lol. I'm so disappointed that that part of it just doesn't work for me on the page.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "FinnickOdairInHisUnd",
                    "body": "I’ve been trying to write a book for the first time and I can’t stop just trying to perfect the first chapter. I’m so proud of you for finishing a first draft Nevermind a second!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "carolinemathildes",
                            "body": "Thank you so much! I really appreciate that :)\n\nI don't edit the chapters as I go, otherwise I'd be stuck too. I just write one and then keep going until the end. Maybe that's not the best method but it works for me.\n\nWhen NaNoWriMo comes around in November, you should see if you have a local group to write with! It helped a lot when I was writing in November and gave me the drive to just push through.\n\nGood luck!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AdministrativeBat932",
                                    "body": "this is such a great idea",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "stars_doulikedem",
                    "body": "Oh congratulations!! That’s a huge accomplishment. The third act will come to you eventually 🩷",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "carolinemathildes",
                            "body": "Thank you!!! <3",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NowMindYou",
                    "body": "Glad I'm not the only writer who sleeps it away. Sometimes they break is really all you need.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "AdministrativeBat932",
                    "body": "HUGE congratulations! I have done one first draft of one book and I know how much commitment and work it takes. Like others have said, I bet the solutions to your issues will show up in due time...but in the meantime, I am really impressed that you finished your second draft!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Creative_Beyond_8085",
            "body": "I bet Mila Kunis does some May/December,Idea Of You knockoff in a couple months. Probably on Tubi or something.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pushin_on_my_buttons",
            "body": "I’m in the mood for new music so what are some songs you guys are obsessed with as of lately?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "just-slaying",
                    "body": "Pink Floyd... drowning in nostalgia",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "carolinemathildes",
                    "body": "just love by Lubalin, and Never Need Me by Rachel Chinouriri.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ClarielOfTheMask",
                    "body": "Pomegranate seeds by Julian \nDesire by grace potter\nSeize the Power by Yonaka\nTired as Fuck by the Staves\n\nAnd some I Will Survive by Gloria Gaynor for the vibes",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Well-Jenelle",
                    "body": "Window by Still Woozy  \nHoneymoon by Jo Hill  \nHelp Herself by bbno$",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "PatriciaMorticia",
                    "body": "Snow Wife - American Horror Show & All Night\n\nManėskin - Pretty much anything by them",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "plant_touchin",
                    "body": "Want you by blk odyssy is on repeeeeeat for me. Also Rakata by arca!!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "buzzfeed_sucks",
            "body": "It’s disgustingly hot here and I STILL can’t shower. I also still have to wear a girdle - which makes everything that much hotter. Excuse me while I scream into the void",
            "score": 1
        },
        {
            "depth": 0,
            "author": "impeccabletim",
            "body": "Got my first Jury Summons ™ and Idk how to feel.🙃",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DateCard",
                    "body": "Once I am retired, I look forward to serving on a jury if the opportunity arises. I think it would be very interesting to take part in that. But, if you have a job, young kids, etc., it really is such an inconvenience.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AdministrativeBat932",
                            "body": "I completely agree! I moved around a TON in my 20s and never lived anywhere long enough to get a summons, I guess? Then I got my first summons when I had a newborn and was able to avoid it, and just got my second one last year and they ended up not needing me to report.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GroundbreakingBite96",
                    "body": "I got mine a couple months and mailed it back almost super late, but just got back on Friday that it’s deferred so I’m happy about that.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cold_Breadfruit_9794",
            "body": "I’m watching the Survivor finale and >!Liz saying she would have beat all of them is peak delusion. She’s so unlikable, lord. On the flip side, I never thought I’d be rooting for a male Swiftie, and yet, here we are.!<",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cold_Breadfruit_9794",
                    "body": "I’m going to need Taylor to write a song >! For poor Charlie, because some real bullshit just played out. Love Kenzie, but come on!<",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "thcdiamonds",
            "body": "I just saw the post about Taylor and Travis possibly getting engaged soon so it got me thinking who gets married first? Taylor and Travis or Benny and Selena?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "PatriciaMorticia",
                    "body": "My money's on Taylor & Travis but I could see Selena slink off to Vegas for a quickie wedding.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NowMindYou",
            "body": "For jaded and cynical know it alls, I'm very surprised y'all keep asking why the police don't stop people like Diddy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cold_Breadfruit_9794",
            "body": "The disrespect and ignorance I’ve seen over that damn Apple list is annoying. Especially from people that think Thriller should be number one (I don’t even think they’re correct, and I could fully prep an essay on why Abbey Road would have been my pick lol). Multiple albums could be in the top spot, let’s be serious! Lauryn Hill is an iconic artist, and The Miseducation Of Lauryn Hill is a *legendary* album. Put some damn respect on Lauryn’s name, and that flawless album’s name!!! It’s a great choice for top spot! 😤",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "buzzfeed_sucks",
                    "body": "People always get so mad at these kinda of lists. But like, it’s totally subjective, especially when you get into the top 5-10. They’re all great albums. \n\nThat said, I’ll never get over rolling stone not including Celine in the best vocalists of all time.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Cold_Breadfruit_9794",
                            "body": "Seriously, did she piss someone off? I also notice Mariah albums always get the shaft on these lists. There’s often the usual suspects on these lists, but she regularly gets snubbed which I find wild. Imo she’s an albums artist, and not just a singles artist, but you’d never notice it from this list.\n\nFor the most part I thought the top 10 was pretty damn fair, though Blond felt high to me, but man, people really start getting disrespectful even something is one place off. The comments I’ve seen aimed at Lauryn and her brilliant album, have been so nasty. 😵‍💫\n\nLike no one’s list is going to look exactly the same, and realistically? There are more than ten albums in the world that could rank from 1-10, hell, even 1-100. 😅",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}