{
    "title": "Billie Eilish’s managers like and repost shade against Taylor Swift",
    "comments": [
        {
            "depth": 0,
            "author": "Immernichts",
            "body": "I don’t think Taylor was the thing stopping Katy Perry’s Witness from shining.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ShipToWreck",
                    "body": "That part. That was a mess of Katy’s own making. And ultimately the result of her not working with Dr. Luke or Bonnie McKee anymore. I get why she stopped working with Luke obviously but Bonnie and Katy were a powerhouse songwriting duo.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "anglgrl384",
                    "body": "She was not. The songs weren't connecting with the GP. But people need to stop acting like it totally flopped. Witness still debuted at #1",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "musthavecupcakes_19",
            "body": "![gif](giphy|fCUCbWXe9JONVsJSUd|downsized)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "peppermintmeow",
                    "body": "You and me! Have an award.\n\n![gif](giphy|IldYDX0Mkh48RMH7zp|downsized)",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TPixiewings",
                            "body": "No, YOU have an award!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "madam_hooch",
            "body": "the pandemonium that would occur if this was Tree liking shady tweets lets be real.... at least use a private account to do this lol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Aggravating_Life7851",
                    "body": "This is so unprofessional but I love mess so I’m here for it\n\n![gif](giphy|t3dLl0TGHCxTG)",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "blossombear31",
                            "body": "The only way to react tbh\n\n![gif](giphy|2UvAUplPi4ESnKa3W0)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ok-Buddy-7979",
                    "body": "I’m lost, who is Tree?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Plus-Leg-4408",
                            "body": "Taylor’s Publicist",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Redditisglitchy",
                            "body": "Taylor’s publicist",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ok-Buddy-7979",
                                    "body": "Oh so that’s who the sub about Taylor and Travis being PR is constantly screaming at in my suggested feed",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Stinkycheese8001",
                                            "body": "Are you sure they aren’t just dedicated arborists?",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Redditisglitchy",
                                            "body": "I’d mute that deranged sub for some peace IIWY",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Celebrating_socks",
                                                    "body": "Do you mean the one where someone unironically wrote a long post about a tarot reading they did on their relationship? Because that’s really just the other side of parasocial behavior lmao",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "mstrss9",
                                            "body": "I feel like they’re paying reddit to be suggested because I see several posts from there every time I’m on",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "pumpkinspruce",
            "body": "Forget Kendrick/Drake, Taylor/Billie is the new East Coast vs West Coast music feud.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Starbuck0304",
                    "body": "The only difference is Taylor & her team is not doing Jack.  Taylor puts out 4 vinyls, that’s not new to her.  She released 3 voice memos, so. Billie is doing the exact same thing to same thing but producer is lining shady posts?  At least Taylor does not get involved.  It’s unprofessional. Everyone does this.  Taylor is singled out only because she is successful.  I hate to say it, but she should be able to do remixes and releases just like others if she wants to.  Just because she is successful doesn’t mean she should have different rules.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pumpkinspruce",
                            "body": "Acting like Taylor is a sweet innocent doing nothing is the height of hilarity to me. The woman didn’t get to be the most powerful popstar in the world by being nice.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OctoberSong_",
                                    "body": "Exactly, and she’s a billionaire. I’ll never get over people defending her- I PROMISE you all, there are NO ETHICAL BILLIONAIRES. We aren’t just saying this cuz we think it’s a cute little saying.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "OctoberSong_",
                            "body": "So Billie is releasing, all at once, a bunch of variants of the same album that all have the exact same track list, so fans can pick out which one they want. Taylor will drop multiple variants with one new song on each so fans need to buy all variants to hear all of her new songs. During 1989 she released one color variant at a time and advertised them one at a time as limited edition, never revealing she was going to keep releasing more and more limited color versions, so fans didn’t get to pick out their favorite, they were surprised by more each time.\n\nWhat they do is very different, someone better than me could explain in more detail. It’s actually worth looking up and finding a post detailing exactly everything she’s done in this regard, you might find it surprising. But Taylor is 100% not being singled out for being “successful”. She’s using predatory business practices to get ahead with numbers and to take advantage of sales from her fans who will buy anything she releases.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "2MillionMiler",
                                    "body": "Predatory business practices - you're joking, right? People who want to buy the variations will. And others (tbh probably the majority of Swifties like myself) won't because we know they'll all be available via streaming eventually anyway. It's not predatory if she knows there is a target demographic for it. Personally as a fan I think it's stupid to buy them but I'm not mad at other people who do.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "OctoberSong_",
                                            "body": "Right we’re going to pretend she doesn’t have a cult like following of impressionable young people - it’s not predatory to pressure them to buy things. Lmao just because people have free will doesn’t mean it’s cool to try to manipulate them when you KNOW you have a DEEP ROOTED PARASOCIAL RELATIONSHIP WITH THEM. Please be so fucking for real.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "2MillionMiler",
                                                    "body": "Lol we're not going to agree on this and you can downvote me into the depths of Tartarus if you want - but predatory is not the right word to describe what *all* of these artists are doing right now. Opportunistic? Yes. Annoying? Yes. Harmful to her fanbase (aka predatory)? No.\n\nHaters gonna hate",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mangopear",
                                                            "body": "They literally just pointed out that what Taylor is doing is *not* what all of the artists are doing right now. Whatever word you want to call it, I’m not a fan of it myself, and think it’s grossly unnecessary for a billionaire and the biggest artist in the world.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Fxreverboy",
                                                            "body": "Nah you're drinking the kool aid. This shit is lame and takes advantage of people, especially saying something is going to be EXCLUSIVE and that being a total lie. If it helps you accept that reality if I bundle other artists in, sure, others do it, but Tay is a master of cultivating this relationship with her audience to take financial advantage of. She's a brand, not your friend to defend. I'm just as happy to say the lot of them who engage in these tactics are being predatory, but I'm sorry - no one is doing this, especially with vinyls, like her.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "minty-teaa",
                            "body": "How is Billie doing the same thing?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dear-Ambition-273",
            "body": "I guess I’m not going to be able to trust the hive chatter to make up my mind for me about how I feel about this album 😂. Pitchfork confused me, you mean I have to listen to it myself and make up my own mind?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "NotQute",
                    "body": "Hit me hard and soft? I think there is a lot to like but not a lot of catchy hooks, a bunch or Happier Than Ever tracks didn't really click for me till like a year later I suspect this is the same for me, but i think she is gonna still get flop era accusations",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "snark-owl",
                            "body": "other than LUNCH nothing really stood out to me and it pales in comparison to Chanelle Roan's \"knee deep in the passenger seat\"",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "milkradio",
                                    "body": "Personally, Birds of a Feather has been stuck on a loop in my head.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "BinxTheWarlockPatron",
                                    "body": "I love Chappell’s album so much. Words can’t express it",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "NotQute",
            "body": "If my whole job was to on Billie's publicity team I'd be stressed about rollout too. \n\nYou could make a compelling succession style HBO dramas about a fictional version of the teams behind the pop girlie's for the 2024 music year. The cold calculation of every team Swift move, Cowboy Carter discourse,  Eternal Sunshines rollout being muffled by her messy personal life, Billie team trying to release as the TTPD new cycle SHOULD be winding down by old models, Coachella being dismissed as overhyped but then Sabrina and Chappel riding a wave to mainstream success off it. \n\nFun time to be a fan, but stressful time to be a Stan I imagine\n\nEdit: the fact that there's comments Unironically stanning Taylor's publicist shows my idea has wheels lmao, HBO my phone lines are open",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "floandthemash",
                    "body": "Ngl I’d watch the shit outta that",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Rare_Reception_6166",
                    "body": "in tree paine we trust",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "paintsplatcat",
            "body": "Billie released like 10 different coloured vinyl variants for her new album, each with a cute photo of her posing with them. I listen to neither artist and this looks like massive hypocrisy to me.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "susire",
                    "body": "I don’t stan for either of them but isn’t the difference that Billie it’s just a different color and people can pick versus Taylor who only releases new tracks on different vinyls so people have to get them all?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "minty-teaa",
                            "body": "And she released that info before releasing the album, which means people weren’t blind sighted after they made a purchase.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "paintsplatcat",
                            "body": "Taylor is definitely worse, yes. She also released 4 'clock' vinyls for Midnights which when you buy all 4, you can also buy a clock handle so you can hang them up on the wall. 4 of the same album. But in my humble meaningless opinion, having anything more than 2/3 variants of an album is evil",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "seren-",
                            "body": "I didn't like it either and looked into it, Billie allegedly goes to pretty great lengths to make her vinyls as environmentally friendly as possible. I don't know enough about the environmental impact of vinyls to know if it means anything. There is an in-depth description on the store page for them.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "maelstron",
                                    "body": "Seems like she recycled them for the new album . And also seems like recycled vinyls have bad audio.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "caca_milis_",
                            "body": "“So people HAVE to get them all” (emphasis mine).\n\nNobody “has” to do anything.\n\nI don’t agree with the sales model, but as a fan of Taylor’s songwriting I have no issue not buying shit I don’t need.\n\nThe songs are all available on streaming and while Taylor’s marketing team do their best to create hype around it, I have not once felt like I “needed” or “had to” buy anything she puts out.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "alliecat0718",
                                    "body": "Right like sorry but if you feel like you HAVE to buy everything she puts out, that’s on you, not her.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "JiminyFckingCricket",
                            "body": "Yeah, except no one is forcing anyone to buy it. I am a fan of both ladies but neither is getting me to pull my wallet out for more than 1 physical copy. It just ain’t happening but if there are people out there who will and these girls can make money, more power to ‘em. They’re playing the same game. Taylor is better at it tho lol",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "paintsplatcat",
                                    "body": "I don't think anyone thought billie eilish or taylor swift were holding a gun to you and forcing you to buy their vinyls",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Carolina_Blues",
                            "body": "billie had some kind of thing going where if you bought a certain number of versions you got a signed insert, so yeah she’s a hypocrite",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "savannahkellen",
                            "body": "So you're saying that at least Taylor's variants have some sort of incentive? Isn't that better? A different song or paint splatter? Which one is worth more?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "longlisten527",
                    "body": "Didn’t she say that though? She said she does it too because of billboard and what they have to do to get numbers or something like that",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "savannahkellen",
            "body": "Others in the industry, as well as random people online, very much resent Taylor's continued success. They expected her to have aged out by now but she hasn't, she's still at the top of the game while others who might have had bursts of huge success have come and gone. She IS an anomaly and they can't understand it. \n\nI've seen increased sentiments about how she should \"step aside and give others a chance to occupy her slot\" and it's like....why? It goes deeper than \"she releases too many variants at inconvenient times,\" which is the main issue they're peddling right now to explain away her success - it's actually that they hate that she's still out here, releasing music at a very sustained and steady rate, that's being consumed at a crazy high rate. And I'm sorry, but there's a jealousy element here as well. \n\nShe's a musician who likes creating music, has realized since 2020 that she doesn't have to be bound to traditional music release rules, and realizes that she can still pull off the charts and sales success that a lot of her peers have been unable to sustain, or tap into. Good for her to be capitalizing while she still can, because history has told her that her career should've been down the tubes by now. Completely understandable why she wouldn't want to voluntarily take her foot off the brakes (when she literally still enjoys making music) just because some people thinks it's unfair that she's too popular. \n\nI think she's allowed to want her album to remain #1 as long as possible, and if others want to release 100 more variants to try and compete with her, they are free to - she's not out here trashing Billie's album, she's just promoting herself.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LeotiaBlood",
                    "body": "It does make me wanna hunt down some gossip articles from like 1990-1995 to see what they were writing about Madonna’s continued success. I bet there are some similar criticisms.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Stinkycheese8001",
                            "body": "Oh no, they were saying she was a try-hard has-been.  ",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ellie-Bee",
                    "body": "> I've seen increased sentiments about how she should \"step aside and give others a chance to occupy her slot\" and it's like... why?\n\nAgreed. I also don’t understand this sentiment. No one *deserves* a #1 album spot. The music industry is highly competitive. Why does Taylor need to step aside so that Billie — another highly successful and influential musician — has her “time” at the top? \n\nAlso, releasing some CDs with a few voice memos is hardly “breaking her neck” to block other artists. If Taylor really wanted to do that, she could have planned to release Anthology in different variants a month after TTPD came out.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "InevitableNo3703",
                            "body": "It’s like telling a football team in the Super Bowl to not play hard because we want the other team to “shine”.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "snow-vs-starbuck",
                    "body": "The same thing happens with Simone Biles. “She should retire and give other gymnasts a chance to win gold.” Fuck. That. \n\nWant to win? Cool. Go out there and be the best; don’t expect the best to step down so you can have a turn at the top.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "apeoples13",
                            "body": "It’s funny because I don’t remember anyone telling Michael Phelps to stop winning golds so other men could win instead. Such a double standard",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BurlieGirl",
                                    "body": "Yes. See also - Serena Williams. She aged out eventually but even after she had her daughter people were saying that she’s had her time, just retire.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "chickfilamoo",
                                    "body": "bc men are valued for their age and wisdom where women are valued for being shiny and new",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "snow-vs-starbuck",
                                    "body": "Omg I didn’t even think of that comparison, and you are so right!!",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Kaleighawesome",
                                    "body": "i’m so happy you said this! i was scrolling down to comment this and saw your comment. hard agree.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "InevitableNo3703",
                            "body": "Especially after working their asses off the majority of their lives. Hell no I’m not stepping to the side at the top of my game for charity. And it’s mostly women saying this about other women. It’s business and hard work baby. We want the same recognition & compensation men get but at a higher cost. Work hard but not too hard, it’s not lady like. Give me a break.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "chocolatecauldrons",
                    "body": "Exactly. Until Beyoncé and Taylor this decade, the public has literally been putting women on the shelf at 30. I’m honestly so impressed that we have these two women in the music industry who are making it clear that if they’re working hard, they’re allowed to keep wanting success. There’s this weird resentment from the younger pop artists’ fandoms that feels very rooted in ageism - older artists don’t owe younger artists anything. They should not be expected to “step aside”. That argument is reductive and anti-feminist!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Apprehensive-Mix4383",
                            "body": "I think similarly for Hollywood, there are also more 30+ actresses than before who are still popular",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "shy247er",
                    "body": "You hit the nail on the head with the first paragraph. The industry wants the next Taylor, but for that to happen this Taylor has to drop and she keeps getting more and more successful.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chickfilamoo",
                            "body": "The irony of this point is Billie very much was New Taylor at a point in time, her whole run with WWAFAWDWG (her first album) was very reminiscent of Taylor’s Fearless era run in terms of critical acclaim, awards, and being generally bright young and shiny.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "maelstron",
                    "body": "It seems like ageism mixed with misogyny. \n\nTaylor is 34 years old and people want her to step aside for new singers like Olivia and Billie. 34 years old isn't really old for singer songwriters. \n\nWhy would Taylor just give up? Especially when she is on a new peak. It is a business and not a charity \n\nTaylors albums average six weeks in first place, maybe Billie could please 8 weeks later from TTPD and avoid a clash.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Away-Acanthisitta665",
                    "body": "well said",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "squidneyforau",
                    "body": "I appreciate the insight of the \"women have a set time to be successful\". I had not viewed this whole situation thing in that light. I think there are people who dislike Taylor and have taken this situation as yet another opportunity to be like, \"See, she's awful!\" \n\nI made a comment on the thread and would love to hear what you think. \n\nSetting aside the success factor, I do agree that Taylor is extremely successful and she has every right to strive to achieve it. Do you think that she is taking an environmental criticism poorly? I really do not think Billie was intentionally targeting Taylor with the interview but Taylor may have taken it as a criticism because it is hard to deny that her marketing techniques are wasteful. What is curious to me is the intentional collaboration with an DJ who is also an nmenvironmentalist, etc. It comes off as a weird battle for Taylor to pick when this is the same person that swifties were very upset about last year for her jet travel. \n\nThere is a layer of hypocrisy or something here. It bothers me about Taylor's response.. I can't quite put my finger on it.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "maelstron",
                            "body": ">rd to deny that her marketing techniques are wasteful. What is curious to me is the intentional collaboration with an DJ who is also an nmenvironmentalist, etc. It comes off as a weird battle for Taylor to pick when this is the same person that swifties were very upset about last year for her jet travel. \n\nIf you think the Collab with Blondish is a answer to Billie you are being naive. \n\nThese remixes are ready for some time.\n\nTaylor just doing her rollout as planned months ago.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cherryandcokes",
                    "body": "It’s more like she’s obsessed with #1 even though she’s been #1 for weeks. It seems like overkill, and people (non-Swifties) are getting tired of her, plus being that chart obsessed is uncool, so of course she’s getting mocked.\n\nEdit: the Swifties downvoted me, but you know I’m right, lol",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "alitabestgirl",
                            "body": "Don't you think Billie is being chart obsessed too? Considering the amount of vinyls and variants released.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cherryandcokes",
                                    "body": "I think she cares about charts, but not giving OTT chart obsessed, flop sweat, vein popping energy.  If she is releasing variants continuously a month later to hold onto a spot, then yes.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BenThePrick",
                    "body": "You’re cutting her way, way too much slack. She has done a ton of shitty things — the Katy Perry stunt being up there with the worst. And then she says there’s a special place in hell for women who hate other women. It’s all complete bullshit.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Superb-Camp905",
                            "body": "People hold the “special place in hell” quote against her so much, which fair if it was said recently, but it was over a decade ago when she was in her early twenties. I would be mad as hell if one dramatic thing I said when I was 23 was held against me 11 years later 😂",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "kookiekoo",
                            "body": "Katy Perry back then was also equally nasty towards Taylor. She was team Kimye (you know, the couple that tried to end her career and made a disgusting revenge-porn type MV against Taylor?).  She also went to Kanye’s concert where everyone around her was chanting “Kanye made that bitch famous” and posted it online. Taylor had every right to be petty after all that.\n\nThey’ve made amends since then and are friends again now anyway so clearly both of them are over it.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "50RupeesOveractingKa",
                                    "body": "> Katy Perry back then was also equally nasty towards Taylor.\n\nPeople also forget that Katy Perry was the one still taking shots in 2017 with Swish Swish. People make her out to be the victim because everyone remembers Bad Blood nobody  remembers Swish Swish. So most people think that Taylor was the only one being shady and forget that Katy was being equally shady too.\n\nI'm just glad that both of them have sorted out their issues now.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "InevitableNo3703",
                                    "body": "Taylor is better than me.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "BenThePrick",
                                    "body": "Listen — I am a tremendous fan of her music (less so recently) I just don’t like some of the shit she pulls.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "kookiekoo",
                                            "body": "Sure, but I’m just talking about the specific example that you mentioned in your comment.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "informalspy13",
                            "body": "I’m definitely biased but when Katy dated John Mayer (and later went to a Kanye concert singing along to *those* Famous lyrics) I decided Taylor had a right to be petty lol",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Glittering_Mouse2728",
            "body": "I seriously don't get this. So what if an artist releases 50 variants of the same song? Obviously people still prefer to listen to that than to billie's album. It's not like taylor puts a gun to their head to listen to her music and not billie's. I think the fact that she doesn't even have to release new music to beat other artists speaks volumes. I'm not a taylor fan, i probably know 5 songs of hers if even that, but let's not kid ourselves. \n\n Also, why shouldn't she try to be number one? Why should she step aside and let others be better than her??",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sydney_2000",
                    "body": "Right? She released some voice memos and shipped CDs in her 5th week. If Billie couldn't beat that with a new album in its first week, that's not exactly Taylor's fault. \n\nBillie's team is doing exactly the same thing, it's a business and they're competing. She's not owed a top spot.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Cherryandcokes",
                    "body": "It’s a BTS type situation with T.Swift where it’s her passionate & looney fans picking up the bulk of these unnecessary variants, and not regular people.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "50RupeesOveractingKa",
                            "body": "Variants make up a tiny portion of the sales. Only a few hardcore fans bother to pick up more than one variant for any album. This is true for every fandom in the world.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fxreverboy",
                                    "body": "Of pure sales? You're kidding yourself. Normies aren't buying physicals this late in the cycle, if EVER. These are fans who, because of their parasocial connection with her and this being a community for them, buy variants to keep their favorite artist at number one. Regular consumers aren't touching physicals in 2024. This is *all* fanbase-driven. The same can be said for every fanbase out there that mass buys singles to game Billboard, which is why you see inflated singles going Top 10 lifted by sales when the SEAs would have them in bubbling under.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "NotQute",
                            "body": "i feel like Swifties adopting Kpop tactics and fervor has totally flown under the radar unless you had a kpop phase lol",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "catscatscatsomgcats",
                            "body": "Excuse me as an army I am very offended but yes I am one of these people.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "longlisten527",
                    "body": "The only people making this up are like crazed fans and shitty public sites. Neither artists cares and if they did it’s not gonna be taking digs at each other. Billie’s manager is fucked uo for those tweets",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "InternetAddict104",
                    "body": "To be fair, Taylor has had beef with all three women used as examples, so it looks kinda intentional. \n\nTaylor v Katy was huge and lasted years, all over fucking dancers\n\nTaylor v SZA was more about their fans than them personally (SZA fans thought she should’ve won Album of the Year instead of Taylor)\n\nTaylor v Billie is more recent and started when Billie shaded her for making a thousand unnecessary and wasteful variants of all her albums (which is true, there’s no need to make a thousand versions of the same thing, the only difference being a color change or a song is 2 seconds longer)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "AnnamAvis",
            "body": "Do music artists not schedule their releases weeks, if not months, in advance?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AdonisJames89",
                    "body": "Nah sometimes you just gotta compete. Nelly did a recent interview and said in his era, him jay, Em and 50 came out and you had to stand on your own. But i wouldn't be surprised if taylor did this did on purpose though",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "imveganwhat",
                            "body": "Taylor released first so how is it \"on purpose\"?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AdonisJames89",
                                    "body": "*to so stuff like this as shown on previous examples",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mcatlin23",
            "body": "This is such a dumb take. I’m all for legitimate criticism of taylor, but seriously this is stupid as hell. It’s a business. So she’s just supposed to roll over and let her album fall so Billie can have a win? And her not wanting to do that makes her a bad person? Billie has released a metric fuck ton of variants too and can’t beat a middle of the road Taylor Swift album in its fifth week… that’s not Swift’s fault. And Taylor wanting to stay on top of the charts isn’t some evil anti woman conspiracy. It’s what every artist does because it’s good for brand and business.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "RedditAli-Jess",
                    "body": "It's also dumb because Billie clearly has all this stuff to release in her back pocket for the very purpose of maintaining chart position. She's ready to do the exact same thing, but had to release it now to gun for #1. I seriously doubt all these extras were made to be released straight away. And yeah, promotion of your album in week 5 isn't shady/mean/wrong.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "paperandtiger",
                    "body": "This is the comment. And in 10 years when Billie's 32 and still cranking out incredible work, people will cast her as the opportunistic try-hard instead of the brilliant ingenue. This cycle is so damn predictable.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "harpy_1121",
                            "body": "![gif](giphy|i6zD9DhtAMFLq|downsized)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Aggravating_Life7851",
                    "body": "People can blame Taylor all they want but at the end of the day it’s on billboard for allowing it in the first place",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lizzy-stix",
                            "body": "What kills me is that’s exactly what Billie was saying. Like this is from The Interview that started this whole mess:\n\n> (Billie’s Mom): But to be fair, the problem is systemic, right? Because if Billboard, to be honest, is going to not have limits… I would love to see limits, like no more than four colors. Or some kind of rules, because you can’t fault an artist for playing the No. 1 game.\n\n> Eilish: I was watching The Hunger Games and it made me think about it, because it’s like, we’re all going to do it because [it’s] the only way to play the game. It’s just accentuating this already kind of messed up way of this industry working.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Aggravating_Life7851",
                                    "body": "Exactly and even if artists don’t want to play the game, their label can still make them play it because it means more money for them. The issue is deeper then Taylor",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "2MillionMiler",
                    "body": "Also, I love Billie a ton, but the new album is not very good.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "longlisten527",
                            "body": "Eh, controversial take. It’s probably her best",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Solocollective",
                    "body": "I agree but… it’s completely understandable that she rubs many of her peers the wrong way. She’s a total opportunist, which is a helpful trait in business but also annoying as hell to be around. Especially in the eyes of fellow artists who resent business-focused art. \n\nImagine you have a corporate job where the tenured top-performer is relentlessly being the most extra, making every moment about themselves, and taking advantage of every system hack to grow their numbers. Nobody likes that person because it forces everyone else to play that silly game or forfeit the competition. It’s exhausting behavior. \n\nI’ve loved every Taylor drop since Debut but the collective eye roll was palpable at the TTPD Grammy announcement.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ellie-Bee",
                            "body": ">Especially in the eyes of fellow artists who resent business-focused art.\n\nAt the level Taylor and Billie are playing at, it’s *all* business-focused. These aren’t artists making art for other artists and living in an off-the-beaten path art commune. They’re multi-million (even billion) dollar brands. To even get to that stratosphere, they would have had to be business-focused.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "mcatlin23",
                            "body": "I see what you are saying but they are not co workers, they are rival brands, literally. If billie’s brand or whoever elses isn’t strong enough to compete they can be bitter betties about it sure but it doesn’t make Taylor morally wrong for being a bigger brand.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Solocollective",
                                    "body": "The excessive album variants are pretty tacky and blatantly obvious. Plenty of pop girls are “rivals” yet supportive of one another. And it’s a competitive year in female pop music so out comes Taylor with these tactics. \n\nIt’s just an odd look for someone who used to harp on, “there’s a special place in hell for women who don’t support other women.”\n\nBecause let’s be real. She’s #1 because of her brilliant marketing and business tactics, not the quality of this album. It’s rightfully annoying to fellow artists. Call it bitter but people in the industry see more so as, “okay Taylor 🙄there’s more to life than being #1 but go off sis” lol",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "millenZslut",
                            "body": "“business-focused art” feels so oxymoronic lol",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "millenZslut",
                                    "body": "dislikers must be corporate memphis fans",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Itstimeforcookies19",
            "body": "Here I was just this morning thinking wow I haven’t seen Taylor in my feed in a few days… and then here we are. People literally can’t let go of talking about her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sanandrios",
            "body": "I'm not a swiftie, but if she \"outshines\" artists by simply releasing music, who's fault is that? lol\n\nAlso, billie hasn't taken a commercial plane since ocean eyes, so have several seats.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "flirtydodo",
                    "body": "I am downright a hater and I agree. Is this a charity? I am so confused.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "kgal1298",
                    "body": "My entire take is this is just them trying to garner more sales be creating a fake controversy because in the end they're both capitalists and it's up to the public to buy physical CDs or stream. I like both artists and I think Billie's album will win more awards overall, but with that said I could care less about who charts for album sales.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "AlternativeSlice2001",
                    "body": "But she wasn’t releasing music. She released like three Voicenotes on a record that has already been out as another variant. It’s what she did to SZA and Katy before Billie. It seems very shady, mean, and money hungry.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "50RupeesOveractingKa",
                            "body": "Those voice notes didn't contribute much to the album sales, for sure. Probably 2-3k units, at the most. The gap between TTPD and HMHAS at the last count was 50k.\n\nThe main gap comes from Taylor's CDs shipping this week, which was planned in advance.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "kgal1298",
                            "body": "Wait which Katy album are we talking about? Are we talking about Witness? or Smile? Because I don't think it was going to take much to push Katy out of record sales anyway both those albums just weren't strong contenders.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AlternativeSlice2001",
                                    "body": "Witness. folklore deserved to outsell smile and I personally don’t care for Katy. I’m just noticing a pattern. Witness wouldn’t have been as much of a flop if she would have stuck with her original rollout plan and not got scared.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "chickfilamoo",
                                            "body": "I feel like there’s some revisionist history going on with Witness in this conversation. It just wasn’t a great album especially in comparison to Katy’s previous output. Even before the album came out, people were cooling on the album because the singles were not great. Taylor didn’t even release anything new, she just put her old catalog back on Spotify. If that was enough to ruin her entire album rollout, it wasn’t a strong release.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AlternativeSlice2001",
                                                    "body": "I don’t think she did it to ruin Katy’s rollout, but to take attention away from Katy. I don’t think you would’ve been as bad if Katy did not like I said, get scared after releasing her purposeful pop song and getting backlash.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Redditisglitchy",
                            "body": "If *three voice memos* is enough to block Billie’s entire album then it couldn’t have been that strong of a contender in the first place. Releasing variants, remixes, etc, is literally the rollout for every mainstream artist/album. Thats just how the music industry and charts work, there’s nothing “mean” about it",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kgal1298",
                                    "body": "Yeah I mean it's just sales. And Billie said she wanted this album to be listened to cohesively so there was no strong single push like there was with Fortnight. Also, I could see some parents getting mad if they hear Lunch on the radio simply because well society \\*looks around\\*",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CassyCollins",
                                            "body": "Where's the strong push for fortnight? It's been a month and we only got a music video and one remix.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "kgal1298",
                                                    "body": "True she did way more, but she usually will release 4-5 remixes per single which she also did with Willow. I think Me is the one single she let fizzle 😂. I bet she has a few more fortnight remix drops or if it’s not performing she’s going to drop another music video for another song.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "noodle_dumpling",
                            "body": "I don't think it's about money in this case. Taylor cares about chart performance/breaking records to a fault (and she has never claimed otherwise), so she's trying to maintain her position as long as possible. Not saying she should care this much, but I don't think it's personal for her. Billie literally said only a few weeks ago that she doesn't care about charts unlike other top artists so now it looks pretty hypocritical for her to be releasing all these remixes and variants to try to get to #1. And her manager should be a little more professional than publicly liking shady tweets about another artist. Billie and her team clearly do care, and they should have planned better, instead of scrambling now after seeing Taylor is predicted to maintain her #1 position.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GraveDancer40",
                                    "body": "This is what I keep saying. Taylor (and her team) released the voice memos to stay number 1. Had nothing to do with Billie.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "50RupeesOveractingKa",
                                    "body": "Yeah, you nailed it. People keep trying to paint her as some sort of evil anti-feminist who only does this to other women, forgetting that she did the same to Drake, which pissed him off so much. \n\nShe cares about charts. Nothing personal with Billie or anyone else.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Glittering_Mouse2728",
                            "body": ">She released like three Voicenotes on a record that has already been out as another variant. It’s what she did to SZA and Katy before Billie\n\n And apparently that's still better than whatever else the others 3 released.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "savannahkellen",
                            "body": "How is that shadier than the shade displayed by the manager here and Billie herself with her previous hypocrisy regarding charts and variants?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AlternativeSlice2001",
                                    "body": "Billie’s manager is being shady which I do think her manager needs to behave more professionally. Billie herself wasn’t even talking about Taylor Swift when she was talking about the variants. Artist like Taylor Swift, who constantly released “different” variants of the same album are greedy and yes, it is shady for her to release this new variant when Billie going to release her album.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "savannahkellen",
                                            "body": "Sorry but I'm confused by what you're talking about - when did Taylor say that she wasn't going to release any more variants, especially during Billie's release? She didn't lol.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "dosgatitas",
                                                            "body": "There’s four vinyl variants of TTPD",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Glum-Freedom-3029",
                                                            "body": "She literally never said that…",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Glum-Freedom-3029",
                                                                            "body": "You repeating yourself over and over again doesn’t change the fact that she never said anything about limiting the variants she is going to release 🤷🏻‍♀️",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "noodle_dumpling",
                                                                                    "body": "I love how they keep insisting it happened but cannot provide one source, but we are the ones gaslighting lol",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Glum-Freedom-3029",
                                                                                            "body": "Exactly lol. People are so obsessed with villanizing Taylor that they are just making things up at this point. You want to criticize her, fine, there are valid things to critique, but you lose any credibility when you start making shit up that she never said or that never happened 🤷🏻‍♀️",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "savannahkellen",
                                                            "body": "I'm fairly certain she has never spoken of \"fans being tired of different variants from Midnights\" so she's making a change and she had already advertised 4 variants months before TTPD was released. There was never a point during those announcements that she claimed there was only 2.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "noodle_dumpling",
                                                            "body": "Can you link one source where she said that? Pretty sure that never happened.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AlternativeSlice2001",
                                                                    "body": "Yeah, I was wrong. I got confused because I went swiftly neutral and saw that the black dog would be like her vinyl variant and assumed she wasn’t going to release anymore because they said it was going to be her final one and I could’ve sworn there was a post when they were saying she wasn’t going to release any more, and took it at face value because I more important things going on then to keep up with what I consider to be the epitome of evil a billionaire.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "clemthearcher",
                                                                            "body": "Taylor Swift is the epitome of evil to you?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AlternativeSlice2001",
                                                                                    "body": "Not Taylor Swift, billionaires in general that means Elon Jay Z, Jeff Bezos, Kim Kardashian. I have enough hate in my heart to equally spread it out. I admittedly do you have a bit of a spot for Taylor because I used to be a Swiftie.\n\nEdit: it’s honestly not even these people themselves. It’s the fact of the idea of a billionaire being someone who has crushed so many people to hoard so much wealth and to keep hoarding it and to make sure you make as little money as possible so they can have more of it is just plain evil to me.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Few-Tradition-7819",
                                                                            "body": "I think I kind of get what you are referring to, she did say something in Singapore about The Black Dog being the final variant in the four \"The\" set she was releasing. I guess in technicality she might think that they're the only four variants (12 in total if you add up CD, vinyl and cassette) and consider adding the voice memos separately as well as the but daddy acoustic something else. But there's also the Target edition, the Anthology is only on streaming and I'm guessing she's waiting until the original drops in the charts to drop physical copies of that so she can boost her numbers back up since everyone is hanging for it.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AlternativeSlice2001",
                                                                                    "body": "I actually don’t mind artist, releasing specifically Taylor releasing different variants as long as she is also releasing at the same at least get all of the songs which is my main problem with her releasing different variants . there’s not one variant of midnights with every song on it which I think it’s unfair and greedy.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Few-Tradition-7819",
                                                                                            "body": "Yes I agree! I saw someone defend the midnights thing by saying all the songs are on streaming, you can just make your own playlists, but if I stop paying for streaming, I lose access to that. There's no one physical copy that has *all* the songs even discluding the remixes. The thing that annoys me with the voice memos/acoustics is that it's individual, but you have to buy the whole digital album again with it. Even releasing them separately for 0.99 cents then later bundling everything up into one would be a less ick thing to do.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "AlternativeSlice2001",
                                                                                                    "body": "Thank you for understanding what I’m talking about when I’m talking about her different variants. I don’t have a problem if you come out with a whole bunch of different color variants or if there is a variant that is deluxe and the rest are not as long as there is at least one with all the songs I find it unfair for her to do this and greedy. This is also another tactic to keep her at the top of the charts because she has all her fans to go rush and hear the new bonus song she has because you have to buy it separately.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Few-Tradition-7819",
                                                                                                            "body": "She must have heard us talking...she's just dropped 3 more single songs (acoustic live in Paris) you have buy the digital albums separately again if you want all 3 of them.\n\n![gif](giphy|E4l3Bs0rGcBiM|downsized)",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "AlternativeSlice2001",
                                                                                                                    "body": "![gif](giphy|3oEjHCWdU7F4hkcudy)\n\nShe",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "hailsssss__13",
                            "body": "I’d like to point out that Taylor literally have Sza a shout-out on her Instagram when billboard announced Anti-Hero was her longest leading #1. She has also send people flowers for dethroning her position in the past.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AlternativeSlice2001",
                                    "body": "Yeah, she did this after she broke a record, and SZA was being attacked by racist Swifties, which was gaining attention and backlash for Taylor saying anything even if she’s not doing it to put down other female artist, I still think it’s greedy for reasons that I’ve explained in other comments.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "seren-",
                    "body": "Billie does actually frequently fly commercial. There are videos of fans spotting her.\n\nI'm not big on spending energy on defending celebrities, but that's just not a true statement. I will say that   \n\"shading\" artists publicly like this is messy and seems unhelpful.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "nopenopenahnahaha",
                    "body": "I’m sure Billie does use a private jet, but she’s also been seen by fans on commercial flights several times",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "warrior_3",
                    "body": "this person is constantly weaponizing their fanbase, and we all know it.\n\nbeyonce isn't constantly attempting to overshadow her peers, and she absolutely could.  it wouldn't mean their art isnt worthy, it would just mean beyonce wanted to weaponize her well established fanbase.\n\ncomparing their respective carbon footprints is like saying a hummer is just as bad as the keystone pipeline. yes both are bad but one is worse.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kookiekoo",
                            "body": "But idk why does Taylor need to be like anybody else? She has always been very upfront and honest about how much she loves chart success, records, accolades etc. She wants to be #1 for as long as possible and other artists also have full freedom to do what it takes to get the #1 position. She’s in second place for most weeks at #1 only behind the Beatles. Girlie wants that record.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "warrior_3",
                                    "body": "I don't believe she should pretend to be a magnanimous human. I personally like that she shows exactly who she is at heart, a bully who marginalizes other women in her industry to maintain her fragile ego.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "2MillionMiler",
            "body": "Taylor is at the top of her game and has been for quite some time now. This is all just meaningless noise to her. I love Billie too - and I doubt she's \"feuding\" with Taylor about this. Seems like manufactured rage-bait.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "randomoverthinker_",
            "body": " so what now she’s not supposed to release music ever in fear she’ll “overshadow” others? Maybe they can all share a giant outlook calendar. Look Taylor is at a point where she can release shit and her fans will buy it. It won’t last forever, but honestly you’re a shit publicist if you don’t know how to work around it. If it weren’t Taylor it would be someone else. The public needs an uber para social relationship and they’ll find it.  This is so reminiscent of kpop. Together with all the thousand variants of albums. It’s what the stans would say. Also talking as if Billie is some poor indie artist lol.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "makishleys",
            "body": "i just really cant stand either of them. billie is not an underdog she is a very successful musician who would probably do the same thing taylor is doing. its celebrity and stan culture thats the main issue here.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kris_jbb",
            "body": "🌳 would never btw",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Blonsky",
            "body": "https://preview.redd.it/df19m9bg592d1.jpeg?width=1179&format=pjpg&auto=webp&s=0c4c8d7451616af0bda92589e517b25b770acff7",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Claypothos",
            "body": "Aw. Poor millionaires/billionaires.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LivingDeliously",
            "body": "Y’all will downvote me into the pits of hell but idc, I agree that it’s obvious that Taylor releases variants in order to block other artist, female pop artist in particular; but for this specific instance, TTPD is a better album than Hit me Hard and Soft. Billie’s album isn’t bad, but it just simply doesn’t measure up to her other albums. I expected a lot more and at the moment I actually find myself enjoying Taylor’s new work a bit more. In this instance, it feels like bitterness on her managers end to engage with these tweets. Billie in her own right is a major artist, it’s not like she’s a smaller artist being blocked by the big bad Taylor swift.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Banana_in_the_darkk",
                    "body": "Exactly, she has the following and the power to over shine Swift if the album really is better.\n\nI want to support Billie Eilish, but her history of hypocrisy frustrates me. Though nothing is worse than when she fed an innocent hardworking lgbtq woman to the wolves without any apology or signs of remorse whatsoever. That woman got death threats and her career was hurt (plus god only knows what happened to her mental health after that). Eilish may be lgbtq, but she’s no ally.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Glum-Freedom-3029",
                            "body": "What I found to be most hypocritical about this release was when Billie was talking about how harmful variants are to the environment, yet in the UK she made people buy three different variants if they wanted to get a signed copy - the only reason she didn’t do it in the US is because bundling isn’t allowed under Billboard’s rules 🙃",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "sugarplumbanshee",
                            "body": "What woman did she throw to the wolves? There’s not quite enough info here for me to be able to google it",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "VampireSaint75",
                                    "body": "Billie did a cover story with Variety and talked about being attracted to women, and on the red carpet a queer interviewer asked her about it, and Billie made a post on Instagram saying the reporter “outed her” when she had literally just come out. Then the woman got tons of hate because Billie made it sound like she had made her come out of the closet without her consent when that wasn’t the case at all",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Wallys_Wild_West",
                    "body": ">Billie’s album isn’t bad, but it just simply doesn’t measure up to her other albums.\n\nThis is just exactly what people have been saying about TTPD, though.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TerribleDanger",
                            "body": "I think both albums have a love it/hate it issue. I like Billie and am a fan of Taylor. I didn’t love HMHAS, but I did love TTPD. However I see large quantities of fans in both communities holding views similar and opposite to mine.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "LivingDeliously",
                            "body": "And TTPD is still a better album.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "IHATEsg7",
                    "body": "I also feel like she wouldn't do this to someone she actually respects",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LivingDeliously",
                            "body": "Are you referring to Taylor or Billie?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "minty-teaa",
                    "body": ">>TTPD is a better album than Hit me hard and soft\n\nThis is subjective and I disagree entirely.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LivingDeliously",
                            "body": "I agree that it’s subjective, in the sense that people have different preferences, but I think the numbers also show that TTPD is a stronger album. Again if anyone could go head to head with Swift, it would be Billie, especially with her coming off the What Was I Made For high. If the album was better, it would be doing better numbers. Note that Billie has also released variants",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SHDO333",
                                    "body": "Quality does not equal sales…\n\nBlockbuster films are not always the best films. Best books are not always the best selling. Even within an artist discography, the best album is not always the highest selling.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Apprehensive-Mix4383",
                                    "body": "> If the album was better, it would be doing better numbers\n\nNot this again..",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sharkwithglasses",
            "body": "This is really unprofessional of him. If anyone in Taylor’s team had done it, there would be a lot more outrage.\n\nIt’s the music industry, not a charity. Taylor has every right to try to stay at #1; Billie has every right to go for it, too. Taylor has released voice memos for a long time. What makes it irritating to me, is Billie’s hypocrisy. She says she doesn’t care about numbers, but her actions say she clearly does. She complains about variants, and then releases a gazillion variants. \n\nIt’s not blocking if you are being outsold and out streamed. Billie is hardly an Indie artist; she’s a critical darling with multiple Grammy and Oscars under her belt.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AgentBrittany",
                    "body": "Your last paragraph says it all. Billie has 2 fucking Oscars.  I don't like some of the things I've read about \"Oh, poor Billie,\" like she isn't a massive critical darling herself. And I say this as both a Swiftie and a Billie fan-I like Billie's new album a lot. But Billie's managers aren't going to help her sell more albums by liking or retweeting shit on that stupid website, either.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Rude_Lifeguard",
            "body": "This is the exact same thing that happened with SZA, the only differenze is that she didnt really engage and just focused on her (amazong) album",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "informalspy13",
                    "body": "I thought Taylor and Sza shouted each other out back then because their fanbases were at each other’s throats",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lizzy-stix",
                            "body": "They did. Some of SZA’s team were liking shady stuff over the chart positions and Taylor came out of nowhere to show some love to SZA to diffuse the fan drama over it.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "AgentBrittany",
                            "body": "They did (edited because I got confused). They both shouted each other out.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TortillaWallace",
            "body": "The only good thing Elon is gonna do with twitter is making likes private. Scouring likes and checking follows/unfollows is the most brainrot part of celebrity gossip culture.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "informalspy13",
                    "body": "To be fair one of them retweeted that hate post which led people to the likes and the other posted on his public story lol",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "clemthearcher",
                            "body": "Yeah this was definitely intentional and purposefully public",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cherryandcokes",
                    "body": "That would suck, and be bad for Twitter. I miss when you could see IG likes, so many men liking thirst traps on main, lmao, and also could get a sense of what people were truly like. Plus we would’ve never saw that whole storyline play out between Demi Lovato & Henry Cavill, lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mel-06",
            "body": "I’d love to stay here and chat but I got to work on my final 😭😭\n\n![gif](giphy|9Y5BbDSkSTiY8)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "longlisten527",
            "body": "They’re soooo dumb",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dr_icicle",
            "body": "I do love his description. Also I love mess about celebrities who annoy me lol. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "estofaulty",
            "body": "I don’t see why people keep using and promoting Elon Musk’s platform with posts like this given how he treats his employees and how terrible he treats people on his platform.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "NotQute",
                    "body": "because we been there for 10 years and no one can agree where to move to. I want to move to cohost but none of my mutuals do...im lonely enough already, i don't want to post to no one thats so sad lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kendal-Lite",
            "body": "Does Billie know and agree with what he’s posting though?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Celebrating_socks",
                    "body": "Tbh if I were her I’d be pissed about him being messy like this, even if I did agree.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mutzadella",
            "body": "it is not the fact that taylor can outsell everyone that is the problem being pointed out here. it is the way she uses that influence to purposefully squash others in the industry ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "squidneyforau",
            "body": "Alright as a fan of both, I'm really trying to wrap my head around this situation and I'm wanting to have an open discourse. It has begun to feel... icky and I can't quite put my finger on it. \n\nFor probably more dedicated swifties than me, if you felt the Billie interview earlier this year was directed (in a shady way) at Taylor, why? I feel like if it was in any way directed at her, it's because Taylor fosters a FOMO consumption amongst her fans. Midnights still doesn't have a single piece of physical media with all the songs on it, and we are coming up on two years post release, yes (please correct me if I'm wrong)? By nature, releasing 4 variants with one exclusive song versus one with  all of the songs is inherently wasteful. I understand it's for charts, etc. We also have singles on a CD... I could go on. People in the TS main sub were very upset about her jet usage, so I'm a bit confused now why offense is being taken when indirect criticism is offered about the inherent wasteful nature of her merchandise selling methods. \n\nBillie inviting a man on stage that remarked Taylor doesn't write her songs? No cool at all. \n\nIn regards to \"not caring about charts\", both artists have made comments (which are now *years* old) that show a flippant manner towards charts. Woman should be allowed to be successful. Taylor go get your bag sis, Billie you too. Is it a bad thing to say that the strive for success could be done in a more environmentally conscious way? At least Billie's variants are colors only. I think arguing that the variants between the two artists are the same is disengenuous when one makes just about every variant exclusive in a musical format way. \n\nI really am a fan of both but Billie was raised as a staunch environmentalist. She still flies commercial. I think her comments were broad and not directly aimed at Taylor but I see where the offense could be taken. Taylor engages in wasteful practices. A lot of artists do - it is a nature of the industry. However, no one has made a fuss (in a way) about the interview except Taylor? \n\nIt seems we hold these women to different standards. Billie is younger and as she develops as an artist, her success must be done in an \"acceptable\" manner. Taylor is a seasoned artist and has had plenty of scandals, but is asking for constant improvement like this valid of her? If this was another top female artist, such as Beyoncé or Ariana, etc would this be such a thing? \n\nI'd love to discuss. I enjoy both artists and think both albums are great. :-)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InternetAddict104",
            "body": "Is he wrong though",
            "score": 1
        },
        {
            "depth": 0,
            "author": "extrasmallbillie",
            "body": "All I’m saying is imagine telling the Beatles that they shouldn’t have released the white album so that way they could allow The Rolling Stones be at number 1 longer than them. \n(Only comparing ttpd to the white album bc they’re both double albums)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "minty-teaa",
            "body": "I mean, Taylor went on stage and announced a new album on a night that was supposed to celebrate everyone, then did a drop on the same night as Billie. It’s weird.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FlagrantFleur",
            "body": "The swifties working OT in these comments right now:\n\nhttps://preview.redd.it/jnedeomit82d1.jpeg?width=575&format=pjpg&auto=webp&s=211ec3b1eeddcc79f716c16a793a2c69d7320cb1",
            "score": 1
        },
        {
            "depth": 0,
            "author": "icecreamsandwiches1",
            "body": "This is definitely a swiftie sub so you are going to get many biased opinions. \n\nThe truth is, Taylor purposefully released new versions of her sub par album so that swifties would buy them up and boost her sales. The timing is directly related to Billie releasing her album. Taylor is 34 years old and trying to compete with a 22 year old. It looks petty and pathetic.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "savannahkellen",
                    "body": "She's not trying to compete, she IS the competition. \n\nTrying to paint Billie as this indie child that's being bullied is hilarious. This girl is an industry darling. She's not the \"little man\" that the people need to stand up for lol.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GetRealPrimrose",
            "body": "Congrats to Taylor Swift. First woman who can become a billionaire but needs her fanbase to protect her against memes retweeted by a less popular artist’s manager",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "anglgrl384",
                    "body": "How is this on her? She didn't ask them to do anything. They're stans. Of course they're going to go after people who are shady to Taylor.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "AgentBrittany",
                    "body": "Taylor is the only artist with unhinged stans on the internet or something? Do we all not remember Beyonce stans bullying the woman they said JayZ was sleeping with? This isn't just a Taylor stan situation, this is crazy stans in general.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "AutumnFairyTales",
            "body": "Crazy how everyone STILL prefers re-records from Taylor over Billie’s overdone angsty whisper “songs” she makes while she’s covered in basketball shorts and Dorito dust lol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "seren-",
                    "body": "this isn't a good look.. there are so many valid reasons to hate on celebrities other than their outfit choice. especially when her habit of wearing baggy clothes started due to body insecurity.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AutumnFairyTales",
                            "body": "Girl I don’t give a fat fuck lol it’s an anonymous comment section. Everyone has insecurities. Park your high horse elsewhere",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "seren-",
                                    "body": "proud of being a bad person online? can’t say you’re the first person i’ve met with that outlook !",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AutumnFairyTales",
                                            "body": "Proud of being a pick me with an embarrassing parasocial relationship to a celebrity? Good thing neither of us give a fuck about the others opinions of each other lmfao",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "plant_touchin",
            "body": "I meeeeeeean looks like a pattern to me (of ts)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "warrior_3",
            "body": "Great! I love that the tide is turning.  Taylor Swift is the new Madonna- marginal musical talent, overhyped, over saturated, a shameless promoter of privilege and white feminism.   History will not be kind to her public image, there was a time when jlo was America’s sweetheart. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mundane_Street98",
            "body": "Good, Swift is the worst.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "milkradio",
            "body": "Whatever, they’re right and they should say it. Billie’s album is truly beautiful and will stand the test of time imo.",
            "score": 1
        }
    ]
}