{
    "title": "Lauryn Hill winning AOTY at the 1999 Grammy Awards. She was the first hip-hop artist to win the award.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/popculturechat! ☺️\n\nAs a proud BIPOC, LGBTQ+ & woman-dominated space, this sub is for [civil discussion only.](https://www.reddit.com/r/popculturechat/wiki/index/rules/civil-discussion-only/) If you don't know where to begin, start by participating in [our Sip & Spill Daily Discussion Threads!](https://www.reddit.com/r/popculturechat/search/?q=Sip%20%26%20Spill%20Discussion&restrict_sr=1&sr_nsfw=&include_over_18=1&sort=new)\n\n###No bullies, no bigotry. &#9994;&#127999;&#9994;&#127998;&#9994;&#127997;&#9994;&#127996;&#9994;&#127995;&#127987;&#65039;&#8205;&#127752;&#127987;&#65039;&#8205;&#9895;&#65039;\n\nPlease [read & respect our rules](https://www.reddit.com/r/popculturechat/wiki/index/rules/), [abide by Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette), and [check out our wiki](https://www.reddit.com/r/popculturechat/wiki/index/)! For any questions, [our modmail](https://www.reddit.com/message/compose?to=%2Fr%2Fpopculturechat) is always open.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/popculturechat) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mrgnfnn",
            "body": "Whitney was so happy when other artists won awards.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Puzzleheaded_Time719",
                    "body": "I love watching clips from when she was happy. It's really easy to see how the whole world fell in love with her. Addiction sucks.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Guilty-Company-9755",
                            "body": "It sucks so bad. She had so much talent and grace, she was a juggernaut. It's really too bad she couldn't get away from her addiction",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Puzzleheaded_Time719",
                                    "body": "There's so much stigma around it too and a serious lack of compassion.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FnkyTown",
                            "body": "I remember being pissed at Bobby Brown for years because I was convinced he had introduced Whitney to the hard stuff. Nope. He was an alcoholic, and she was a big coke head in the 80s and got him hooked on stuff. Crazy.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Puzzleheaded_Time719",
                                    "body": "Yeah she has that habit for a long time. Poor thing.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bighaircutforbigtuna",
                    "body": "They’re also both Jersey Girls who grew up a town over from one another!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "YouWereBrained",
                    "body": "And that was a huge honor, for Whitney Houston of all people to think you were awesome.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Minute-Ad8501",
                    "body": "She was such a hype women for a lot of artists, love her for that",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HereOnCompanyTime",
                    "body": "It's the absolute sweetest thing to see her genuine excitement for her peers success.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Just-Plankton-8553",
            "body": "And she never made another record again why Lauryn whyyyyy",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BrandonBollingers",
                    "body": "LH is an amazing talent and I was lucky to see her live about 10 years ago but I think she might have some mental health issues. In addition to what the other poster said about difficulty to work with (which I saw during her set when she stopped multiple times to chastise the crew) she's also said some very public very disturbing things about Bob Marley and his family, which I think has furthered her isolation in the music industry. \n\nWhile she was in a relationship with Wycleaf Jean, she cheated on him with Bob Marley's son and became pregnant. She basically stated that she intentionally hunted out a descendent of bob marley because she wanted to procreate with Bob's offspring because she wanted to be closer to Bob. She wrote a screenplay where she was to play Bob Marley's wife. The Marley family has spoken out against her. \n\nThere were also allegations that she was involved and manipulated in a high control cult that influenced her choices to turn down opportunities.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Just-Plankton-8553",
                            "body": "Woah now that’s a real rabbit hole here. I had no idea about any of this. Gonna go do a deep dive.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JoleneDollyParton",
                                    "body": "Todd in the shadows video about the Lauryn Hill unplugged album is really interesting.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Jaded-Blueberry-8000",
                            "body": "There are also claims that Miseducation was plagiarized. idk enough about it to really say whether or not that is true, but i could see it tainting her reputation regardless, especially if she already had a rep as “difficult.”",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jh4336",
                    "body": "This may be a rabbit hole you don't want to go down and I'm pretty sure it isn't true, but there were allegations that she took credit for a lot more than what she actually made on the album. It was also a push by the label to market her as a genius etc and meant that writers/producers (New Ark) weren't properly compensated. \n\nNow everything from here is hearsay, but the rumor goes on to say that the people who she screwed over told everyone in the industry not to work with her, and she was blacklisted in the community and hence never made another album. If you look at her career since then, musicians have been skeptical of how she could have been the main producer on an album given that it seemed she had a lack of instrumental musical ability.\n\nI don't think its true, but a lot of people have said since she's very difficult to work with, would fire people for no reason, insisted on being called Ms. Hill and is constantly late (the latter two of which are proven).\n\nWhat's wild is that she's so incredibly talented, that even if she had more help than people thought making music, it wouldn't diminish her artistry IMO. \n\nImportant to add that she rebuffed these claims and was pretty robust in her response. I just love a bit of music drama. You probably didn't expect a mini essay responding to you but here we are.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Blue_Robin_04",
                            "body": "Hill is undeniably one of those pretentious artists. Her mental health struggles are unfortunate, though. They always are.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "velvetvagine",
                                    "body": "Precocious?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "hugeorange123",
                            "body": "A lot of that controversy is true tho. She was embroiled in litigation for years after making the album for not properly crediting people and I'm pretty sure a lot of those musicians ended being compensated. I don't think any of the accusations were unfounded. Also the influence of a strange pastor on her life hasn't been exaggerated either. She is talented but couldn't give or share credit because she was desperate to one up Wyclef tbh.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Just-Plankton-8553",
                            "body": "Nah I love it thank you. Yeah I wouldn’t be surprised if Lauryn Hill was difficult I feel like a lot of people on a high artistry level just function on different energy than some other people. Still a bummer we never got another album.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "lizzy-stix",
                            "body": "This is interesting — I think the same thing happened to Sheryl Crow (I was listening to a podcast about her earlier career recently) where her collaborators for her first album were angry with her getting all the credit and there was a lot of messy stuff behind the scenes but I guess it’s forgotten because she released so many more albums without them.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "johnny_charms",
                                    "body": "The same thing happened with Avril Lavigne, her first two albums had co-writers claim they did all the work and discredited her contributions. Yet she keeps coming out with albums involving different co-writers and producers showing she must be doing something in the writing process.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Jaded-Blueberry-8000",
                                            "body": "i think it’s so lame when people do that as soon as a star gets big. ppl absolutely deserve credit for their contributions but like.. if someone is paying you to make them look good on the tracks, why are you demanding credit when you’re not the front man? \n\nI just feel like if they REALLY did all the work and the lead artist did nothing… put out an album without the lead singer and see how well it does. prove that you’re the key to their success, don’t whine after the fact that nobody thanked you enough. i do see why money being involved would bring out the greed in people.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "funkmastermcflash",
                                                    "body": "Because if they aren't listed as cowriters, they aren't eligible to receive royalties from those songs and their contributions aren't widely known which limits their ability to gain future work.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "docileathena",
                                    "body": "What is the podcast?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lizzy-stix",
                                            "body": "Pop Pantheon! They do episodes on major pop artists.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SubstantialSmell512",
                            "body": "I love Miseducation but I've long thought this must be slightly true. Either that or the litigation or the extreme success of Miseducation made her too scared to record a proper follow up. Stranger things have happened but how do you make a near perfect debut solo record then just not release another studio album or even EP? Why the big drop off in musical output if a lot of it was just you?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Jaded-Blueberry-8000",
                                    "body": "i mean she IS a mom",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SubstantialSmell512",
                                            "body": "I don't follow. 1. She WAS already a mom when she recorded and released Miseducation. 2. Are you saying that this musical genius and talent, who released a bestselling and critically acclaimed album at the age of 23, hasn't released a follow up because she is a mother? Like no mom has ever released a studio album? I have sympathy with maybe mental illness, burned out etc but \"she is a mom\" seems hollow.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Jaded-Blueberry-8000",
                                                    "body": "lol tbf i had no idea she had kids before that, i just saw someone mention she has 6 kids and i can’t see anyone dropping multiple critically acclaimed albums with six kids to take care of. it wasn’t a dig at her or anything. lots of celebs take a step back from their career to raise their kids and i don’t blame them one bit.\n\nof course moms have released studio albums but idk of any with six kids, and moms are busy people, there’s no shame in NOT releasing music after kids if you’re more focused on parenting.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "SubstantialSmell512",
                                                            "body": "Sure, I hear ya, priorities shift and people change (though she still does infrequent tours and shows). But, Miseducation was huge, that's not a success that many people walk away from - or are even allowed to.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "areallyreallycoolhat",
                            "body": "Lauryn also by her own admission abused her kids. Her daughter spoke publicly about it, Lauren admitted she was right and then wrote a long rambling Facebook post mostly excusing herself about how she beat them for their own protection and compared herself raising her kids to Sarah Conner raising John Conner.\n\n\nTMOLH is incredible, but yeah Lauryn has always been the biggest obstacle to her own success.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "waxingtheworld",
                            "body": "just because this stood out to me, \" she could have been the main producer on an album given that it seemed she had a lack of instrumental musical ability.\"\n\n  \nRick Rubin is a genius and he's said,\n\n\"When Anderson asked if Rubin played any instruments, he replied, “Barely,” adding that he does not know how to work a soundboard. “**I have no technical ability**,” Rubin said. “And I know nothing about music.”\"",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "17thfloorelevators",
                    "body": "She has 6 kids. Once she's not so deep in the motherhood trenches hopefully she will be back",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GreenDolphin86",
            "body": "Whitney was always a girls girl, especially when it came to other Black women.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "aliarawa",
                    "body": "Whitney was the original of this\n\n![gif](giphy|OpsfQone2H2Ok|downsized)",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "New-Examination8400",
                            "body": "![gif](giphy|6751A64NJkyCQ)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Harrychronicjr69",
                    "body": "Mighta been the cocaine too 🤷🏻‍♂️",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Burrito-tuesday",
                            "body": "Nah, look at Nikki",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Harrychronicjr69",
                                    "body": "Watch the few milliseconds before sting opens the envelope. She’s buggin.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mansonfamily",
                                            "body": "Youuu better lay low",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Harrychronicjr69",
                                                    "body": "![gif](giphy|FG0pobaFxyIH6)\n\nHonestly the bet award win was he sweatiest of bug outs televised",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Burrito-tuesday",
                                                    "body": "I did have a “what did I just do?” moment at first and then getting a reply *right away*?? ngl I looked out my windows lol",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Burrito-tuesday",
                                            "body": "I’m not doubting the cocaine use at all, just the effects of it. It doesn’t turn everyone into a paranoid rage monster like Nikki,  some just party hearty on it.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Jaded-Blueberry-8000",
                                            "body": "i was thinking that too lol. she looks like she’s on something. no hate, most of hollywood is at those things 😂",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SamosaAndMimosa",
                            "body": "She might have just been extremely happy because black women have been famously and historically snubbed for this award at the Grammys 🤷🏽‍♀️",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Alice_Buttons",
                                    "body": "Absolutely. Representation matters and she knew it.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Harrychronicjr69",
                                    "body": "Orrrrrrr she’s on a shit ton of drugs as usual and also happy a black woman won the award 🤷🏻‍♂️",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Upset_Performance291",
                                            "body": "Why does it even matter? We all know she was an addict. How about we not try to invalidate her as a person because of her struggles. Plenty of people have commented on how humble and supportive she was. The “lol crackhead jokes” are nearly 30 years old at this point. What point are you even trying to make? Like, even if she was high here, she certainly wouldn’t be the only one in that room who’d “indulged” that night.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Booze4Blood",
            "body": "Whitney hella gave that away 🥹",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lizzy-stix",
            "body": "I love that album but didn’t get into it at the time because I was a bit young for it. Did anyone else know Lauryn primarily from watching Sister Act 2 a billion times? lol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "jh4336",
                    "body": "Such an amazing movie. I found out recently that it was panned by critics when it came out! \n\nIt was an Oscar winner in our house.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "notcool_neverwas",
                            "body": "I love that movie and the first one! They’re like my comfort movies",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lucyjayne",
                    "body": "Will always be one of my favorite movies!!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CPGFL",
                    "body": "Not religious, but now I'll be singing Oh Happy Day constantly today",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "tenshi_73",
                    "body": "Oh man, my siblings and I LOVED this movie. We'd always rent it out from our local library. We never watched the first one because our library didn't have that one, I only watched it recently lol. But we'd check out new VHS every week but we'd always rotate between the same ones: The Mummy, The Mummy Returns and Sister Act 2 over and over and over again.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Super_Albatross_6283",
            "body": "Ahhhh this is amazing I love her. She’s so beautiful and her smiling is so striking.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Femme-O",
            "body": "I love how Whitney always hyped up other female artists 🥹",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BrandonBollingers",
            "body": "Imagine THE Whitney Houston hyping up your win like that. \n\n![gif](giphy|FibBZ3bFGGcoXCB1kd|downsized)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KemBemGem",
            "body": "I love Whitney so much, she was a real girl’s girl ❤️❤️❤️\n\n![gif](giphy|Dh7LzLIfvmETK)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rennisdodmane",
            "body": "I miss Whitney so much",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mamadovah1102",
            "body": "RIP Whitney and The Miseducation of Lauryn Hill is a masterpiece to this day.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Pink_Blacksmith",
            "body": "And still the last Black woman to win album of the year. So no Black woman has won the award in 25 years. 25 years? Actually disrespectful.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SimilarNerve731",
                    "body": "And the fact that only 3 Black women won the award is wild",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Rude_Lifeguard",
                            "body": "only 11 black people total, in 65 years",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AssumptionAdvanced58",
                                    "body": "In 2000 black people were only 12% of the population in the USA. Before that obviously less. These awards are driven by the money they generate. So if you do the math & figure the age bracket of who is voting it's not surprising. But I couldn't be happier for this #1 choice. I was shocked that a couple of them were in that top 10 at all.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Imautochillen",
                                    "body": "Doesn't it like reflect the demographics of the United States? It's  like 20% of all winners...",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bbbcurls",
                    "body": "It’s wild Beyonce has never won this award.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "notcool_neverwas",
                            "body": "Truly, and even crazier since I think she’s like the artist who has the most Grammy awards? Im not a beehive stan, but I thought *for sure* Lemonade was going to take it.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SimilarNerve731",
                                    "body": "Adele, who won the award that year, even said that Beyoncé should’ve got it",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "brightirene",
                                            "body": "[https://youtu.be/ctuggqUSITM?si=y6HYYpMF-rE5spvH&t=7](https://youtu.be/ctuggqUSITM?si=y6HYYpMF-rE5spvH&t=7)\n\nThat's the speech Adele gave. And Adele is right, Beyonce should have won.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Jaded-Blueberry-8000",
                                    "body": "Adele winning over Lemonade was garbage and even Adele knew it. I’m not a huge Beyonce fan but that was outright ridiculous. I don’t think it’s fair for people to insist Beyonce win AOTY for every release now tho just bc she was snubbed for past albums.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tenshi_73",
                                            "body": "I think that's what's going to happen next year (especially after Jay Z's speech) with Cowboy Carter. I haven't listened to the album in full yet, and we're still in the middle of the year to really compare it with others but I think they may give it to her as a career award.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Jaded-Blueberry-8000",
                                                    "body": "I think they will. I’m still mad at Jay Z for that. Imagine being one of the most powerful and wealthy producers in the music industry and using an event like that to complain that your wife hasn’t won AOTY. He doesn’t give a fuck about celebrating black artistry, he’s mad bc the woman he’s been grooming for the last 20+ years isn’t getting him the accolades he feels entitled to. \n\nI fucking hate Jay Z so much, he uses Beyoncé as a product to keep himself relevant and she fucking LETS HIM!! He’s a POS billionaire who is just as bad as the rest of those exploitative famefuckers in the industry.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "_CoachMcGuirk",
                            "body": "was this Kanyes point back in he day when he snatched the mic from tay tay?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Jaded-Blueberry-8000",
                                    "body": "No, actually. That was in 2009, Lemonade lost in 2015 (I think)",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "thedogdaysarenotover",
                                    "body": "No, that was the VMAs and Beyonce actually did take the big prize at the show that year.  Kanye interrupted Taylor's speech for Best Female Video but Beyonce won Video of the Year at the end of the night.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Jaded-Blueberry-8000",
                            "body": "she should’ve won for lemonade or i am sasha fierce but i’m getting sick of ppl saying she deserves AOTY for every single album now just because she was snubbed in the past. people were so mad she didn’t get nominated for Renaissance but it was just a damn good year for pop, even if she’s been nominated I think there were better albums that should’ve won. I loved Midnights but didn’t think it was worth AOTY… but I still would’ve picked three other nominees over Renaissance, bc it just wasn’t that great of an album when compared to her all-time career best albums.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheStigianKing",
                    "body": "Not really. Modern black female artists just don't measure up.\n\nWho is the modern day Lauren Hill or Jill Scott?\n\nDoja Cat? Nicky Minaj? \n\nThey are mostly too busy singing about over sexualized filth than contributing anything meaningfully considered art.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "brightirene",
                            "body": "Beyonce is obvious, but Ella Mai is excellent.\n\nHere's a song of hers:  \n[https://www.youtube.com/watch?v=m2Zwsn1EK6U](https://www.youtube.com/watch?v=m2Zwsn1EK6U)\n\ne-   \nLianne LaHavas (I listened to her album Is Your Love Big Enough? eighty million times probably)  \nJorja Smith  \nH.E.R.\n\n  \nBut they all have incredible NPR Tiny Desk Concerts- peep them",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TJ_McWeaksauce",
            "body": "I feel like I haven't heard anything about Lauryn Hill in about 20 years. I looked her up on Wikipedia to see what she's been up to. Damn, the past 14 years of her life have been wild.\n\n[https://en.wikipedia.org/wiki/Lauryn\\_Hill#2010%E2%80%93present:\\_Further\\_activities\\_and\\_imprisonment](https://en.wikipedia.org/wiki/Lauryn_Hill#2010%E2%80%93present:_Further_activities_and_imprisonment)\n\nI'm surprised Hill's rise and fall aren't talked about more. She reached the pinnacle of success at the turn of the century, but today almost nobody talks about her.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "lizzy-stix",
                    "body": "Kinda reminds me of Damien Rice?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "AssumptionAdvanced58",
                    "body": "She was too busy having dem babies. One album list comes out & she is back on top. I'm all about it. My playlist is a video one. I have 5 of her solo videos on there. I liked the Fugees too.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "JoleneDollyParton",
                    "body": "She’s been talked about, but there’s really nothing new to say about her. There were some TikTok’s going around about her tour recently, she did actually show up, reviews were mixed.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "thecatw0man_",
            "body": "This makes me so sad. Whitney looks good here, but knowing that she was in a constant struggle with her addiction (behind the scenes and sometimes in front) is just so sad to me. She was an incredible talent, and I wish she found the strength to win her battle. RIP Whitney 🩷",
            "score": 1
        },
        {
            "depth": 0,
            "author": "loulou-v",
            "body": "Seeing Whitney so happy for Lauryn made everything even more iconic. One of the most deserved grammy wins, this album is a masterpiece.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yuyufan43",
            "body": "Whitney was a queen",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Badabumdabam",
            "body": "I mean, Lairyn's album was and it's still a bomb.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FranceAM",
            "body": "She was def misquoted and people ran with that...which probably turned people off her. \n\n“An apocryphal quote from 1996—in which it was asserted that Hill once said she’d rather her children starve than have white people buy her albums—has lingered in many corners.”\n\n[https://www.thedailybeast.com/how-a-racist-smear-campaign-destroyed-lauryn-hills-career](https://www.thedailybeast.com/how-a-racist-smear-campaign-destroyed-lauryn-hills-career)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "bestblackdress",
                    "body": "I remember that! I believe it was a random caller to the Howard Stern show who claimed she said that, and everyone just took it as fact. Rolling Stone did an article debunking it a few years later, but the damage was done.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "lucyjayne",
            "body": "Damn, look how happy Whitney was for Lauryn!! This is making me tear up and I'm not sure why. what a great moment.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "woodsywoods4",
                    "body": "I'm literally crying with happiness at my desk so you're not alone 😭 Whitney's support of other artist is so beautiful",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BaseTensMachines",
            "body": "Lauryn Hill is just soooo unbelievably beautiful I might never get over it.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Guilty-Company-9755",
                    "body": "A gorgeous woman, and she just stays gorgeous",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "lezbopunkbytch-hahah",
            "body": "go Lauryn!!! 🥳🥳🥳 <3",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FallAltruistic721",
            "body": "Great singer, shittiest diva ever..",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Perfect-Ad-9071",
            "body": "I remember this so clearly. She thanked her kids for not messing up her nice white dress!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Prize_Macaroon_6998",
            "body": "Too bad she's one of the biggest assholes in music industry history.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "roymccowboy",
            "body": "Macklemore got robbed",
            "score": 1
        }
    ]
}