{
    "title": "Non-invasive zaps to the spinal cord can treat paralysis—but no one knows why",
    "comments": [
        {
            "depth": 0,
            "author": "Realistic_Lead8421",
            "body": "This is true for so many treatments. If you look past the gobbledygook, you may find that no one knows why any of the five thousand antideprssants work. Methotrexate as well as dozens of other medications are known to work for various conditiions but no one really understands why .",
            "score": 106,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dense_Surround3071",
                    "body": "I discovered this when my wife was in nursing school. When I would read up on a drug in her textbook, it would invariably say that 'Doctors believe' in reference to how the drugs functioned. They have no clue. They're throwing shit at the wall to see if it sticks.",
                    "score": 61,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Realistic_Lead8421",
                            "body": "Quite literally. For instance the efficacy of selective serotonin reuptake inhibitors (SSRIs) for depression was first observed in patients with inflammatory bowel disease (IBD). The initial discovery occurred somewhat serendipitously when patients being treated for IBD with SSRIs reported significant improvements in their depressive symptoms. This gave rise to oversimplistic and  now thoroughly scientifically debunked 'chemical imbalance' theory  that is still used as the major marketing slogan by pharmaceutical companies.",
                            "score": 46,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Dense_Surround3071",
                                    "body": "I think I would just have been stoked about being able to take a normal shit. 😏",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DrMike27",
                                            "body": "My man shitting facts here!",
                                            "score": 10
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TelluricThread0",
                                    "body": "None of what you said is true...\n\n\nThere is no widely recognized evidence that the antidepressant effects of SSRIs were first discovered in patients being treated for IBD. SSRIs were developed and studied primarily for their effects on depression before any potential benefits for IBD were observed.\n\nThe efficacy of SSRIs for depression was observed through various clinical trials and research studies focused on psychiatric conditions, not specifically through their use in IBD treatment.",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "laser50",
            "body": "For a (simplified) nerve line that works on small electric signals, perhaps it's the stimulation that makes them go places, which normally possibly only really happens when you are still in the womb?\n\nFuck I don't know, but that's pretty cool.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "GyattScratchFever",
            "body": "They should name the device The Kundalini Genie",
            "score": 7
        },
        {
            "depth": 0,
            "author": "TheTopNacho",
            "body": "You mean exciting sensory afferents to increase neural drive to otherwise partially deinnervated motor systems, bringing neurons closer to action potential threshold, functionally compensating for loss of upper motor neuron connectivity isn't understood?\n\n Not completely understood? Maybe. But we have a pretty good idea what is going on.\n\nAnd yes it works",
            "score": 10
        },
        {
            "depth": 0,
            "author": "partyamoeba",
            "body": "I have seen videos of synapses searching for connection and like migrating and moving around like slime mold does for food. I wonder if the pulses like tricks the nerves into repolarization and rest mode and like brings them back to life in way, makes them try to connect and work again. I don't know anything about neurology past studying in college and nursing, but just thoughts.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Shojo_Tombo",
                    "body": "Hmm, I think I'm going to go attach a TENS to my fingers and toes and test this theory. (Don't worry, it's chemo-induced neuropathy, not diabetic!)",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "partyamoeba",
                            "body": "Good luck",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "El_Cartografo",
            "body": "[They](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://en.wikipedia.org/wiki/Transcranial_magnetic_stimulation&ved=2ahUKEwjd8qrw76GGAxWCHjQIHZF0Aj4QmhN6BQiBARAC&usg=AOvVaw2UP67ds-IGq44L98-mseMo) can also cure depression.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "DeepSpaceNebulae",
                    "body": "Cure? It requires regular treatments, and like almost all things with us variable humans its effectiveness varies by person",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Psychological_Half_9",
            "body": "I know why. It's cuz yer rebootin the battery. Restartin the engine.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "squeezy102",
            "body": "I feel like you really can’t put “non invasive” and “zaps to your spinal cord” in the same sentence, but what do I know…",
            "score": 1
        },
        {
            "depth": 0,
            "author": "IcyOrganization5235",
            "body": "\"No! But what about Elon's mind control!\" - Musk simps",
            "score": -5
        }
    ]
}