{
    "title": "Scientists grow diamonds from scratch in 15 minutes thanks to groundbreaking new process",
    "comments": [
        {
            "depth": 0,
            "author": "Abraxas_1408",
            "body": "I worked in jewelry and I can tell you this:  the quality of natural stones (diamonds) on the market every year decreases as the price increases. The availability of better quality diamonds is there, but for exorbitant prices. The increase in price and increase in rarity is all artificial. One company, DeBeers has had a monopoly on the diamond market forever and they set all that shit. \n\nI hope artificial diamonds catch on and small companies come in loading the diamond market with high quality rocks that shake up the industry and knock all these large companies that have monopolies on their asses.  Let it be one more industry that us millennials kill.",
            "score": 647,
            "replies": [
                {
                    "depth": 1,
                    "author": "drempire",
                    "body": "I've always found it bizarre that people know about the debeers monopoly and we can get much cheaper diamonds but still people will pay more for less. \n\nMarketing works.",
                    "score": 231,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "2lostnspace2",
                            "body": "And you can't help stupid either",
                            "score": 56,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TThor",
                                    "body": "I agree with this quote, but at the same time feels like it undersells the problem; People are explicitly not naturally rational. We might be capable of some rational thinking, but humans inherently are programmed to be driven by reactionary gut instinct, and to go against that instinct requires consistent effort.\n\nMarketing psychology knows this all too well. They don't care about appealing to reason, they focus their efforts on tricking that gut instinct, because that part is so easily manipulated.\n\nAt the end of the day, no matter how smart each of us might be, deep down we are *all* stupid, the question is moreso whether each of us will put in the effort to suppress the stupid each day.",
                                    "score": 24
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "viv_chiller",
                            "body": "The suffering of a desperate miner is more romantic.",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ohTHOSEballs",
                                    "body": "*minor",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dsrogers",
                                            "body": "*minor miner",
                                            "score": 7
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "yellowbrickstairs",
                                    "body": "I need anyone who has ever touched my jewellery to be dead, otherwise it's just not as good",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "littlebubulle",
                            "body": "A few people genuinely don't know that artificial diamonds are actual diamonds and not zirconium. It's kind of understandable since \"artificial\" is often used as \"substitute\".\n\n\nAnd then there is the people who all do it just for status signalling instead of utility. Meaning that quality or functionality doesn't matter, just the price tag or rarity.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "craznazn247",
                                    "body": "I’ve heard the terms “created” and “mined” thrown around instead. I feel like that’s more honest.\n\n“Artificial” has a negative connotation and has an implication of low-quality (thanks food industry), and “Natural” has positive connotations, despite it being the generally lower-quality and ethically questionable product.",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "GlockAF",
                                    "body": "Yeah, the higher index of refraction for cubic zirconia (shinier and sparklier) is SUCH a turn-off for an item that is explicitly purchased because it is shiny and sparkly.\n\n/s",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Late-Reply2898",
                            "body": "Well since there is no useful or practical purpose for jewelry then we can conclude that paying too much for it is entirely the point.  Just like a house in doucheland or a Range Rover.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "leenpaws",
                            "body": "nah…dudes wanna get laid",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fornicatinzebra",
                                    "body": "If that's your reason for marriage, sorry but you need to sort out your priorities",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "leenpaws",
                                            "body": "that’s the thing, if  that’s not the reason for mairraige, it’s the reason for buying something as dumb as an overpriced ornament",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "jw255",
                                    "body": "... Are women gonna get any flack for driving the demand?\n\nAnecdotally, my ex of 5 years wanted a 20k diamond ring even though she knew about the DeBeers bullshit. I didn't do it and she bought it for herself. Absolutely ridiculous.",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "nimama3233",
                                    "body": "Lab grown diamonds are fully indistinguishable from “natural” diamonds; they’re the exact same thing atomically.  You can get almost double the weight if you get lab grown.\n\nTherefore, lab grown diamonds get you almost double the pussy. \n\nNot many women will say “no, I prefer smaller blood diamonds to the indistinguishable and larger ethical diamond.”",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Bongoisnthere",
                                            "body": "False. \n\nIts the suffering that makes them special.",
                                            "score": 4
                                        },
                                        {
                                            "depth": 4,
                                            "author": "bladex1234",
                                            "body": "They distinguishable. The natural ones have flaws, even if invisible under a magnifying glass.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "nimama3233",
                                                    "body": "Lab grown diamonds also have clarity and color imperfections",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "techhouseliving",
                                            "body": "In fact they are much higher quality lab grown so much that some people have been asking for less perfection.  I'm not making this up",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Subject_Case_1658",
                            "body": "Personally, I think it’s cool how a natural diamond takes 1-3 billion years to form in the earth. \n\nLab Diamonds on the other hand are mostly made in giant factories in China and take days.\n\nYes, they are the chemically the same thing. But I still wouldn’t buy a lab one for an engagement ring.",
                            "score": -19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "drempire",
                                    "body": "You missing the point about Debeers. They are the ones who decide on the cost of the natural diamonds keeping the price artificially high. \n\nIf natural diamonds wasn't controlled by Debeers then the natural diamonds would also be much cheaper",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Subject_Case_1658",
                                            "body": "DeBeers hasn't been the largest natural diamond producer for 20 years. There isnt a monopoly anymore. The prices are more or less determined by the market.\n\nNatural diamonds sell for more than lab grown because they are far rarer, and cost more to extract and thus more desirable.\n\nI’m all for lab diamonds, I think it’s really cool. But the thought of it being mass produced in a Chinese factory and the thought of some one else having the exact same stone as me is a little off putting.",
                                            "score": -10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "bladex1234",
                                                    "body": "If you’re going to mention DeBeers not being the only company, then you should equally mention China isn’t the only place where lab grown diamonds are made. Also not to mention the environmental and social impact of diamond mining.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "krogmatt",
                    "body": "I starts by not calling them “artificial”. Grown in a lab yes, but they’re still real diamonds. Just without the exploitation and murder to produce (and they’re cheaper)",
                    "score": 36,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "big_duo3674",
                            "body": "I guarantee that terminology is heavily promoted by the diamond mining companies, it does work in making them sound like it's not actually a true diamond even though the molecular structure is the exact same. It's like oil companies promoting the \"dangers\" of modern nuclear energy",
                            "score": 17
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "leenpaws",
                    "body": "most ppl  already know this…i hope ppl realize diamonds are stupid..unless used to harden a drill or tool of some sort…",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "DehydratedButTired",
                    "body": "I keep waiting for the market to switch to a \"flaw\" trend where diamonds with \"natural flaws\" become more valuable because they are much harder to create in a lab.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "TThor",
                    "body": "hearing some commercials for a local jewellery chain, \"Get her real diamonds, because your love is real!\" Fucking blood-diamond peddlers will hold on to their scam as long as possible.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Abraxas_1408",
                            "body": "Yeah it’s a dying industry. One indicator is that a few jewelry companies have declared bankruptcy and/or been bought out by Signet Jewelers that owns Sterling Jewelers who owns Kay’s and Jared. I know zales got bought out by them recently. \n\nhttps://www.signetjewelers.com/brands/default.aspx",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DancingBears88",
                    "body": "Yeah! Fuck you Antwerp!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "yoyoadrienne",
                    "body": "My dad’s gf tried to sell a diamond ring she inherited to a jeweler that dealt in pre-owned and he wouldn’t buy it because he had a diamond surplus and people weren’t buying.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Abraxas_1408",
                            "body": "That’s surprising. But a lot of them will turn down diamonds that don’t meet their standards now. Diamonds have grades and a lot of diamond retailers don’t educate their customers to what exactly they’re buying, kind of like a car dealership. The consumer diamonds are getting shittier and shittier so that these companies can increase their profits. So they’re selling low grade diamonds at middle-high grade prices. When people go sell these diamonds they find out they’re not worth shit and some people won’t even buy them. The place I used to work at would put 4 shitty quarter karat diamonds in a setting next to each other, call it 1 karat and sell it with a 100% markup. People would buy crap like that thinking they got a karat for a steal, but they literally just bought diamonds put together in a setting that were too shitty and imperfect to sell individually.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "yoyoadrienne",
                                    "body": "lol. Jewelry is insane now, especially pearls (my favorite stone). I remember in the 90’s as a child modest pieces could be afforded by the middle class easily for anniversaries or special occasions and now similar pieces are going for around $1k a pop.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Abraxas_1408",
                                            "body": "Yeah. Here’s the thing about pearls!   They grow them in the clams now.  They have farms. They cost nothing!  There’s nothing rare about them.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "yoyoadrienne",
                                                    "body": "I know! And the prices used to reflect this. But over the past few years the price of every “salt water pearl” is now starting at hundreds of dollars each!\n\nAnd now with the advent of sm the secret is out that fine jewelry is a giant scam.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Abraxas_1408",
                                                            "body": "Yeah the whole industry needs to collapse.  None of that shit is worth anything.  Maybe small companies will come in and rebuild it, selling all that at what it’s actually worth.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "xzyleth",
                    "body": "Same thing happened with aluminum",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "giuseppezuc",
                    "body": "I’m shaking up the industry by not buying any diamond whatsoever!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Abraxas_1408",
                            "body": "Fuck yeah. Fuck that industry. It profits on human suffering and has for a long time.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "scobysex",
                    "body": "I know one thing. If I ever created such a thing, I'd be pretty scared of ending up suiciding with a shotgun wound to the back of the head and a note under my mattress that says, \"if anything happens to me, it was DeBeers\"",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Abraxas_1408",
                            "body": "Yeah I’m pretty sure you don’t build a diamond empire world monopoly that uses slave labor, indentured servitude, and blood diamonds without making quite a few people disappear. There’s definitely a very large number of skeletons they keep in a very large closet.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "EmotionalDmpsterFire",
                    "body": "Let's go one step further. How are diamonds even special any more when they can be grown so easily. And furthermore, how special is something that everyone has? Why are diamonds even in the picture any more?\n\nWedding bands should be special/unique to the couple/individuals and not just about how much money is thrown at it. DeBeers really guilted people into this. I'd like to see people crafting a custom wedding band for each other. Maybe the dude is a woodworker so she has one crafted for him using some of his favorite wood. Etc",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Abraxas_1408",
                            "body": "I actually had my wife’s engagement ring and band custom made.  There’s a lot of places that will do this btw. They don’t make much Money off the ring and setting. They make it all on the rock.  They can 3d model the ring and just print it I think, but it’s really easy to do now.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Esc_ape_artist",
                    "body": "DeBeers bowed out of the global diamond monopoly in 2000. Yes, they still have their hands in it, but they’re not the only players in the rarified market of natural diamond mining and cutting. Lab-grown gems have taken a bite out of the business despite the propaganda to buy “natural” diamonds.  Even DeBeers’ parent company is more interested in copper than diamonds.  \n\nSo I don’t know how much artificial squeeze there is in the market anymore, it was absolutely true 20 years ago, but the market has shifted quite a bit over the intervening decades.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GiveMeYourCrust",
                            "body": "Found DeShill.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Esc_ape_artist",
                                    "body": "Why don’t you go take a look at the news surrounding the diamond industry?  Everything I just said is readily available, page one, of a Google search. I DGAF about diamonds, I don’t buy them, and I think the whole “aura” around purchasing diamonds is fucking stupid.  If you like them, great, but don’t buy them because of some expensive made-up cache about them.",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Significant-Dog-8166",
                    "body": "It’s funny that the way “real diamonds” get detected is by finding flaws, which is ironically exactly how BAD quality diamonds were determined prior to synthetic diamonds existence.  We’re supposed to pay the maximum money for diamonds that are flawed… but not very flawed, but not flawless.  None of it makes sense.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Abraxas_1408",
                            "body": "I remember when they started marketing “gold” or “yellow” diamonds as a thing but they were really just really shitty diamond with a lot of impurities in them. It’s like someone created a diamond by compressing dirty toilet water.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hashirama4AP",
            "body": "Key Points:\n\n1. Researchers have figured that a gallium-nickel-iron mixture — coupled with a pinch of silicon — is optimal for catalyzing the growth of diamonds.\n2. with this blend, the team obtained diamonds from the crucible's base after just 15 minutes. Within two and a half hours, a more complete diamond film formed\n3. Spectroscopic analyses showed that this film was largely pure but contained a few silicon atoms\n4. One problem is that the diamonds grown with this technique are tiny; the largest ones are hundreds of thousands of times smaller than the ones grown with HPHT.  That makes them too small to be used as jewels.\n5. In about a year or two, the world might have a clearer picture of things like possible commercial impact",
            "score": 68
        },
        {
            "depth": 0,
            "author": "Radioactive_Fire",
            "body": "not gonna stop the weird emotional and cultural attachment people have to 'real diamonds' thanks to 100+ years of industry propaganda",
            "score": 244,
            "replies": [
                {
                    "depth": 1,
                    "author": "dropdeaddev",
                    "body": "Although that’s proven to be far less effective on millennials, who are even opting for coloured stones or other synthetics over diamonds. \n\nDiamond is a great stone for jewellery, but I personally couldn’t really justify spending THAT much. Maybe small accent stones, since those are far cheaper per carat weight.",
                    "score": 88,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "one_hyun",
                            "body": "I would rather go for a diamond since there are costs to upkeeping softer stones like sapphires, emeralds, etc. But a lot of millennials and younger generations are caring less about the actual price itself. Bring on the lab diamonds!",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "atlasrising",
                                    "body": "sapphire is the next hardest stone after diamond on the mohs scale",
                                    "score": 35,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dropdeaddev",
                                            "body": "True, although it is important to remember the gap in hardness between 9 and 10 is bigger than the difference between 1 and 9. \n\nThat said, as long as your stone is harder than average dust particles (7), you don’t have much to worry about. \n\nSource: Gemmologist",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Unlucky-Candidate198",
                                                    "body": "Your average dust particle is a 7??? Damn, that’s much higher than I would have ever guessed. Also slightly concerning when you consider you breath in a lot of dust. Life really is just a constant struggle of trying not to die from your environment (and the sun). \n\nBro you working somewhere where all the local dust is gemstone dust or something? Sheesh.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "dropdeaddev",
                                                            "body": "I suppose I should say “the hardest dust particles in your average environment”, I don’t really know how common different substances are in the air, but unless you’re somewhere specific where there’s a reason harder particles would be in the air? 7 is about the limit. \n\nSand for instance has a hardness of 7. Quartz, also 7, is found in a lot of common rocks. Concrete, between 6 and 7.",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Unlucky-Candidate198",
                                                                    "body": "Neat. Thank you for the knowledge :)\n\nIt further cements my avoidant behaviour of breathing anywhere near concrete dust (that I know is there, obviously).",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "dropdeaddev",
                                                                            "body": "Yeah, you can’t really avoid small amounts, but high concentration should definitely be avoided. Silicosis is not something you want, and why jewellers wear masks when polishing, since silica is a common abrasive used in polishing compounds for gold/silver/etc. \n\nBut as far as jewelry goes, as long as you don’t work in a gemstone mine or gem cutting/polishing factory, 7 is the hardest dust you’re going to be around. :)",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "thesprung",
                                                    "body": "Do you have a source on that gap? Curious geologist here",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "POKEMONMAN1123456789",
                                                            "body": "It’s logarithmic I think",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "dropdeaddev",
                                                                    "body": "Near logarithmic, yes, but I believe (not entirely sure) that that was discovered after the scale was invented. It’s a comparative scale using common minerals as being representative of certain hardness levels. \n\nMeaning that a diamond has a mohs hardness of exactly 10 because diamond is the benchmark that sets that measurement, not because diamond happened to be closest to 10 on a logarithmic scale.",
                                                                    "score": 9
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "captainahhsum",
                                                    "body": "Homie, I am following you hoping to get more tidbits of knowledge like this!!! I know nothing about this stuff but LOVE finding normal people that are experts in things I am interested in.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "dropdeaddev",
                                                            "body": "Well, if you have any questions, feel free to ask. :) might as well put my knowledge to use in some way. Lol",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Brexsh1t",
                                            "body": "Actually Moissanite is the second hardest gemstone after Diamond. White sapphire is the third hardest though.",
                                            "score": 10
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Few-Swordfish-780",
                                            "body": "That’s why they use it on good watch faces.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "dropdeaddev",
                                    "body": "Not really for sapphires, they’re a hardness of 9, and the biggest thing you’ll have to worry about wearing it down is dust in the air (Hardness 7 unless you’re in a stone polishing factory).",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "UnmixedGametes",
                                            "body": "That will be a problem is 2,000 years. Otherwise it’s just another bit of “buy my shiny crap” marketing from the scum lords of the diamond world.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dropdeaddev",
                                                    "body": "You mean them saying 8 and 9 hardness will diminish in quality faster? Yes. You won’t need to have your ruby “repolished” at any point. Softer stones however may, depending on their environment. You wouldn’t want Fluorite as a jewelry stone, which is a shame, because it can look absolutely liquid if polished correctly. :) Those kinds of stones are meant for glass display cases, not a ring.",
                                                    "score": 5
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "dropdeaddev",
                                    "body": "I’m a gemmologist, and although I personally agree that coloured stones are awesome, there are a FEW areas where you can’t beat diamond. These also apply to synthetics, which are identical besides trace elements that don’t really matter at roughly 1/3rd the price. \n\n1: It’s a 10 on the mohs hardness scale, literally the HARDEST substance on earth. The gap between 9 and 10 on the scale is a lot bigger than the gap between 1 and 9. There is something pretty cool about having the worlds hardest substance on your finger. \n\n2: Because it is so hard, it has the SHARPEST facets. To the extent that experienced gemmologists can ID a diamond just from looking at facet edges. There’s basically no rounding, so it reflects light better and looks crisper. There are certainly similar stones that are close enough that you won’t notice without a microscope, but still, a SLIGHT advantage over other stones. \n\n3: Because diamond is resistant to heat, you can literally cast in gold AROUND it. You can do this with corundum too (Sapphire and Ruby), but there is a visible difference between “white” sapphire and diamond, so if you’re wanting a clear stone, diamond is your only real option for a really sparkly “white” stone. Very niche technique, but if for some reason it’s a requirement for your design, diamond is the best option. \n\nBeen out of school for 8 years, so I’ll come back and edit in more if I think of any. Gemmology doesn’t exactly come up frequently. :)",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "spiritplumber",
                                            "body": "Are there industrial benefits over synthetic?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dropdeaddev",
                                                    "body": "The only benefit I can think of that natural stones have over synthetics that actually matters at all is inclusions. \n\nInclusions are small “defects” in stones, bits of solid, liquid, or gas. Normally, these are considered flaws when visible in most stones like diamond. But if you find one that’s interesting, rare, or beautiful? You have a collectors item. Kinda like how misprinted bills or coins can be worth more than normal ones. \n\nThat, or I suppose in some very niche scientific applications, the trace materials left behind from the synthetic creation process might be of some importance. Like how you can only use metal from sunken ships before the atom bomb was ever used to make equipment very sensitive to radiation. You’d have to ask a scientist though, as I’d only be guessing.",
                                                    "score": 5
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "AntiProtonBoy",
                                            "body": ">  literally the HARDEST substance on earth\n\nNot really.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dropdeaddev",
                                                    "body": "What is harder than diamond?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "aeschenkarnos",
                                    "body": "In the unlikely event I ever get married, I think I will get a ring tattoo. A physical ring would catch on stuff at work, possibly trap stuff under it that I don’t want trapped, and if removed is all too easily lost.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "UnmixedGametes",
                                    "body": "Costs? What bs is this?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Perry_cox29",
                            "body": "Very few of my friends have diamonds. Even the clear stones are Moissanite.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dropdeaddev",
                                    "body": "Definitely a good substitute, and getting easier and easier to find it seems.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aflarge",
                    "body": "Only blood diamonds count as love because blood is pumped by the heart or something I don't know",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Hashirama4AP",
                    "body": "Apparently, this method still has to catch up to make diamonds of the size used in ornaments/rings in the current day!",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "WhatADunderfulWorld",
                    "body": "I just bought a man made and love it. You can’t tell and great to know it is better for the world and still will last forever r",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Poodlesghost",
                    "body": "That can easily be corrected by marketing technique called lying.  Tell them an African suffered to dig it out of the ground even if you cooked it in a microwave. Whatevs. Nothing we buy is as advertised. Regulation is dead.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "AlDente",
                    "body": "Yes. The same can be said of religion, class systems, and monarchies. We are a weird species.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "t4rdi5_",
                    "body": "De beers has to be the most successful marketing story in all of civilized history.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "belizeanheat",
                    "body": "Well not right away, obviously. But younger people couldn't give two fucks about that",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "frisch85",
                    "body": "There's actually a reason why this exists and it makes perfect sense even tho it doesn't or shouldn't apply to today's times anymore (but I have at least one friend who still expects this practice).\n\nBack in the days women were mostly not working, so in order to have some financial security (in case their man falls terminally ill or dies as an example) the ring poses as a safety net. In case of the couple separating unexpectedly, the woman would then go and sell the highly valuable ring which would basically allow her to pay for essentials for at least 3 months, which would be enough time for her to find a job (or another man). This is why there was/is a rule that the engagement ring should approximately three time of the mans monthly salary.\n\nNow ofc the diamond industry had their hands in this too but it's not really for no reason, the price for diamonds and gold is pretty stable and it might even become more valuable in time, the lab created diamonds won't serve the same purpose.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Radioactive_Fire",
                            "body": "It doesn't make any sense at all, and that is not why that happened. It happened after the great depression because the value of diamonds crashed and its link to weddings was entire manufactured by advertisers. The 3 month rule was also created by advertisers, its all a load of shit. \n\n[https://podcasts.apple.com/ca/podcast/marketing-pioneers-from-the-aop-archives/id493536367?i=1000576690657](https://podcasts.apple.com/ca/podcast/marketing-pioneers-from-the-aop-archives/id493536367?i=1000576690657)",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "laminarflowca",
            "body": "DeBeers hates this one simple trick.",
            "score": 29
        },
        {
            "depth": 0,
            "author": "UnmixedGametes",
            "body": "The sooner DeBeers and the whole “jewel diamond industry” scam is crushed out of existence the better. \n\nNone of the people controlling that business are good people.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "ReasonablyBadass",
            "body": "If it's cheap enough, it may be another carbon storage solution. ",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hashirama4AP",
                    "body": "seems the technique uses methane and graphene as of now, but the idea sounds very interesting.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "FaceDeer",
                    "body": "If diamond could be made in quantities large enough to be relevant for carbon storage then carbon storage will be the *least* significant thing that will change.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ReasonablyBadass",
                            "body": "Why? Industrial diamonds are already a thing and the only other significant use case I know of might be optical processors, but those aren't fully developed yet.\n\n\nOr do you mean because we would need a cheap energy source? ",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FaceDeer",
                                    "body": "Industrial diamonds are a thing, but they still aren't available in the sort of bulk or cheapness that would be implied by this. We'd be talking about gigatons of diamond. People would be using diamond to grit their sidewalks in winter.\n\nYeah, the other advancements that would be required for something like this would be pretty significant too, it's not really a realistic scenario. It's always going to be easier to turn the carbon into graphite or something like that. But if you were to wave a magic wand and make that much diamond happen then that would still be really impactful.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ReasonablyBadass",
                                            "body": "What would the implications be? Like, were are diamonds a bottleneck?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FaceDeer",
                                                    "body": "It's not that they're a \"bottleneck\", they just aren't used for a ton of stuff they could be used for.\n\nDiamonds have very high heat conductivity, for example. They'd be useful as heat sinks. Diamond is being investigated as a replacement for silicon in computer chips, that'd help get heat out even better. Anything you don't want scratched would do great with a diamond coating. Anything you want abrasive would have diamond dust in it. Mix diamond into concrete to make it lighter and stronger. Use it for lenses, it has a high index of refraction. These are all just ideas off the top of my head. There are likely tons of applications that nobody's even considered diamond for because diamond is rare, and you're proposing that somehow diamond has suddenly become as common and cheap as coal. Of course it's going to be used for an enormous number of things.\n\nHeck, you can burn the stuff. It'd be a very high-purity solid fuel.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "nusuntcinevabannat",
                                                            "body": "> high-purity solid fuel\n\nyeah, a high-density solid fuel that when burned gives off pure CO2. BEST FUEL EVER.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FaceDeer",
                                                                    "body": "CO2 that was sequestered from the atmosphere in the first place, according to this scenario. It would be a *carbon-neutral* fuel.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "nusuntcinevabannat",
                                            "body": "I suggest you go have a look on eBay or Alibaba.\n\nIndustrial diamonds are not only artificial diamonds but also natural non-gem quality ones and off cuts. You can buy baggies of them for whatever you like.\n\nNileRed made a video where he turned them into CO2 for carbonated water.\n\nA long time ago AvE cut a hole into a counter top by gluing a bunch of them to a round plastic thing with JB weld.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FaceDeer",
                                                    "body": "They're not *cheaper than dirt* yet.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "nusuntcinevabannat",
                                    "body": "industrial diamonds are used in a lot of things: cutting stone, cutting anything tougher than HSS, polishing.\n\nIn WWII they were a strategic resource - and why today there is a monopoly on them - because they were used for tooling to cut hard materials.\n\nMost likely they will be the same in the next.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Chevey0",
            "body": "DeBeers has entered the chat..\nDeBeers has purchased the process…\nDeBeers has raised the price of diamonds by 10%….",
            "score": 3
        },
        {
            "depth": 0,
            "author": "DehydratedButTired",
            "body": "As big as a blueberry seems pretty large for a diamond. I think they are underselling it here. They could disrupt the entire engagement ring price market with their process.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "photo-manipulation",
            "body": "Key Points:\n\n1. Researchers have figured that a gallium-nickel-iron mixture — coupled with a pinch of silicon — is optimal for catalyzing the growth of diamonds.\n2. with this blend, the team obtained diamonds from the crucible's base after just 15 minutes. Within two and a half hours, a more complete diamond film formed\n3. Spectroscopic analyses showed that this film was largely pure but contained a few silicon atoms\n4. One problem is that the diamonds grown with this technique are tiny; the largest ones are hundreds of thousands of times smaller than the ones grown with HPHT. That makes them too small to be used as jewels.\n5. In about a year or two, the world might have a clearer picture of things like possible commercial impact",
            "score": 5
        },
        {
            "depth": 0,
            "author": "CarousersCorner",
            "body": "Lab grown diamonds should be cheap af, and used to make jewelry extensively. Is there any real reason they shouldn't be?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheEvolDr",
                    "body": "They're pretty inexpensive in comparison to natural diamonds. 2ct natural ≈ $30k / 2ct lab ≈ $1800.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Experttom",
            "body": "Why do people buy diamonds ?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Scavwithaslick",
            "body": "How come the value of diamonds haven’t been super devalued after artificial diamonds have become so cheap and easy to make? Why are they still so valuable?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "80sCrackBaby",
                    "body": "because absolutely no one who can afford a diamond wants a fake diamond",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "bonerb0ys",
            "body": "I look forward to the diamond cellphone screens.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheEvolDr",
                    "body": "Hells yea, it's finally gonna survive that 6ft drop.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DokkanProductions",
            "body": "Then it has no value",
            "score": 2
        },
        {
            "depth": 0,
            "author": "radome9",
            "body": "The Diamond Age begins.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Secret_Thing7482",
            "body": "Bye bye debeers",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheEvolDr",
            "body": "Nice. Guys can stop breaking the bank on those gift giving holidays and still come out a winner.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Katiari",
            "body": "Diamonds are forever (fucked if de Beers can't somehow litigate these people into poverty.)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "80sCrackBaby",
            "body": "buying fake diamonds is crazy",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Spirited_Comedian225",
            "body": "Debeers also invented the 3 month salary rule for engagement rings. I have know idea why people listen to that crap.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OpinionLow9091",
            "body": "I want a artificial 💎  fork.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PalmBreezy",
            "body": "Debeers allegedly contemplating suicide",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ModernizedSlavery",
            "body": "Why do we even give a fuck about diamonds honestly? How did the world come to care so much for such bullshit things?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CountKristopher",
                    "body": "They’re incredibly useful in every day tools to industrial and technological applications.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ModernizedSlavery",
                            "body": "Ok that’s good to know. But as far as everyday regular people, why spend thousands on something that has no real value outside of people “buying into” its value, if that makes sense.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CountKristopher",
                                    "body": "Yeah showpieces are useless",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheEvolDr",
                    "body": "De Beers, 1947. They started ads stating if you want to be a real man get her what she wants, a diamond. Really it was the \"Diamonds are forever\" marketing. Prior to that pearls were the popular choice. In the 18th and 19th centuries sapphire was the preferred choice for engagement rings.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ModernizedSlavery",
                            "body": "Interesting, so it really was all just marketing and advertisement. Well I hope the diamond industry comes crashing one day. Too many shady practices around the whole process.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Life-Dragonfly-8147",
                    "body": "Women",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Anonplox",
            "body": "Still buying natural diamonds. \n\nI’m 20 years, Lab Grown will be seen as costume jewelry.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "ra1nx__",
            "body": "Just like everything else in this world. Why buy fake things when I can afford the real thing. The only people who buy lab grown diamonds are the ones who cant afford natural diamonds.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "cassiuswright",
                    "body": "Or those who don't wish to contribute to conflict zones...",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ra1nx__",
                            "body": "You know you can buy natural diamonds that are conflict free now, right?",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}