{
    "title": "Daily cannabis use now outpaces daily alcohol use in the United States according to the results of a study incorporating data going back to 1979",
    "comments": [
        {
            "depth": 0,
            "author": "copperblood",
            "body": "If alcohol was discovered today then tomorrow it would be classified as a Schedule 1 Drug",
            "score": 645,
            "replies": [
                {
                    "depth": 1,
                    "author": "The-Dead-Internet",
                    "body": "It was already banned the problem is the same with making anything else illegal people will make it and or sell it and that makes gangs more powerful and it's a loss of revenue for the state.\n\n\n\n\nThe thing is the alcohol industry has spent a ton of money on keeping everything else illegal including weed because when there's a legal alternative they lose a significant amount of customer's.",
                    "score": 235,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MyOtherCarIsAHippo",
                            "body": "It was also banned because it was a viable alternative to petroleum, which Ford and Rockefeller were vehemently opposed to.",
                            "score": 80,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dahjay",
                                    "body": "Ah, the ancient oligarchs. Our oligarchs only fly their cock shaped rockets into the way upper atmosphere to sate their pervy desires to their loves, and build mega-yachts that dock under a foreign flag because they hired a professional financial firm to do what they do which is help their clients pay as little tax as possible. \n\nNASCAR's CPU is built on an alcohol backbone.",
                                    "score": 52
                                },
                                {
                                    "depth": 3,
                                    "author": "OPPyayouknowme",
                                    "body": "Like corn? Not great to be growing all this corn now, just watched the latest John Oliver",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MyOtherCarIsAHippo",
                                            "body": "I am not familiar with the segment but corn can be used as a bio fuel and feed for livestock after fermentation.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Shojo_Tombo",
                                                    "body": "It should be on YT, and it's worth a watch. Growing corn is terrible for the environment, and takes way more energy to produce than it creates through ethanol production.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MyOtherCarIsAHippo",
                                                            "body": "Oh for sure, but is it the lesser of two evils? I believe pussy willows are one of the best plants to ferment for bio fuels. The thing is, distillation isn't rocket science and can be done  on a small scale using just about anything. The establishment will always want to control how independent people are.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Similar_Spring_4683",
                            "body": "It’s crazy to look at the history of the richest brewers and the mafia in America were smuggling boos… look into seagrams Canadian family and how they profited off the prohibition .",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "Technical_Carpet5874",
                            "body": "It was never actually banned. Even in prohibition you could get alcohol at the pharmacy as a nerve tonic",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "the_TAOest",
                            "body": "America had a long history of protectionism for industries and specific companies.  This free market is not so free. \n\nSadly, the regulations protect OG companies and create major hurdles for new ones.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "artfulpain",
                    "body": "Historically it's been racist policies. So I doubt it.",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "the_y_combinator",
                            "body": "This. Has nothing to do with it being new. It has to do with the \"wrong people\" using it.",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "StruggleSouth7023",
                                    "body": "How does that apply to alcohol though, having been used by nearly every civilization, culture, and ethnicity for 10s of thousands of years.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Jsimpson059",
                                            "body": "Some of the greatest proponents of prohibition were also members of the racist know-nothing party. A group that got their names from burning down catholic churches and telling the cops they \"knew nothing\". They used alcohol to demonize Irish and German immigrants (who also owned the majority of breweries in the US before prohibition). ",
                                            "score": 5
                                        },
                                        {
                                            "depth": 4,
                                            "author": "the_y_combinator",
                                            "body": ">If alcohol was discovered today\n\nWe are only two posts down, dude. The entire discussion was predicated on an alternate history.",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Elastichedgehog",
                                    "body": "Criminalise the wrong 'uns who don't vote for you.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Danktizzle",
                    "body": "If stoners were as violent as drunks, it would have never been listed.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "eventualist",
                    "body": "Yes one can hope",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "MrDERPMcDERP",
                    "body": "And/or classified like asbestos",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "CeeArthur",
                    "body": "I just gave you the 420th upvote!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "phinphis",
                    "body": "Thc is not a benign drug.  There are lots of health issues with over uses.  My brother inlaw was feeling ill and throwing up for a couple of months with no clue as to why.  They did tests and discovered his caniboid receptor in his stomach were messed up, causing him to get sick.  Turns  out it's from consuming thc in high potency.  He stopped using thc, and he recovered.    I'm sure we'll see a host of medical issues around Thc as people consume more.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Informal_Seesaw259",
                            "body": "I know this is being downvoted because of the massive amount of positive propaganda around cannabis use. But addictive overuse of the drug causes psychosis, paranoia and increases depression and anxiety.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "boredpsychnurse",
                                    "body": "Yes. I’m an inpatient psychiatric nurse. We see sooo many people come in with first break psychosis episodes after ingesting edibles. It can last for months",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "RevolutionaryHole69",
                            "body": "Smoking cannabis isn't the same as high concentration crack head level pure THC use. People that do that shit are crack heads.",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Chickachic-aaaaahhh",
                    "body": "When cannabis addictions just make you dumb and lazy while alcohol addictions cripple you. I agree. Alcohol will ruin your mind, body, and spirit.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "TheRevolutionaryArmy",
                    "body": "But now they are saying that it’s basically down a level so it’s Schedule 2 and cannabis takes the number 1 spot!!",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Individual-Pie9739",
            "body": "If you think the number of pot smokers was ever accurately measured then your tripping.",
            "score": 76,
            "replies": [
                {
                    "depth": 1,
                    "author": "LostVirgin11",
                    "body": "just high not tripping",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "Pixelated_",
            "body": "Every major mistake I've ever made in life, alcohol was involved. It's the most damaging drug to our society.\n\n\nWith cannabis the most trouble I get into is finishing a pint of ice cream.\n\n\n✌️🫶",
            "score": 434,
            "replies": [
                {
                    "depth": 1,
                    "author": "Busterlimes",
                    "body": "The only problems cannabis caused for me was law enforcement.  The most dangerous part about it fucking up your life is actually the government fucking up your life.",
                    "score": 183,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AardQuenIgni",
                            "body": "It was pretty funny getting caught smoking weed by my parents at 18. I remember my dad said \"well I'm just thankful you were stupid enough to do it at home and get caught by us\" \n\n\nI replied \"idk I thought it was pretty smart to avoid places the police could catch me\" \n\n\nTheyre still salty about that response over a decade later.",
                            "score": 81,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DawsonJBailey",
                                    "body": "Haha that’s funny when I got caught I got whooped and then started finding sketchy random places to smoke 😂",
                                    "score": 15
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ledfox",
                            "body": "I remember seeing a great comic about this.\n\nSomething like:\n\nCop: I'm arresting you for your own good - that weed will ruin your life!\n\nGuy: (gets sentenced, goes to jail, can't find work and lives in a box)\n\nCop: See, I told you weed would ruin your life!",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "whiteflagwaiver",
                                    "body": "All while the cop has \"Don't tread on me\" stickers on his mugs.",
                                    "score": 17
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "OpinionLow9091",
                            "body": "Weed should have always been legal, but the government likes to control the narrative to their taste.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Busterlimes",
                                    "body": "Weed was made illegal based off of racism and has always been used as a tool to maintain hierarchical control",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Knitwalk1414",
                                            "body": "Also, cotton, lumber and big pharma lobbied against it.  Hemp can clothe and build better buildings.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Altruistic-Spare-788",
                                            "body": "So.  Was that why alcohol was made illegal?    A bunch of people racist against whites?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DidSome1SaySomething",
                            "body": "This is so true. When I moved from a state where weed is illegal to a state where it's not, suddenly the paranoia I used to get from smoking vanished. Until then, I'd always just assumed that paranoia was a crappy side effect of marijuana. Turns out it's just a crappy side effect of the law.",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "49thDipper",
                    "body": "Hello fam!  👍🏼💪🏼💪🏼💪🏼🫡",
                    "score": 25
                },
                {
                    "depth": 1,
                    "author": "hymen_destroyer",
                    "body": "I had stopped smoking weed because I was having issues with paranoia...\n\n...when it was made legal in my state I started smoking again and lo and behold, the paranoia isn't a problem anymore!\n\n....I wonder why...🤔",
                    "score": 36,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Bliss266",
                            "body": "On the flip side, I’m about 2 weeks into being weed free, in a rec legal state, and I haven’t felt even a quarter of the anxiety I felt on the daily even when not high. Some people dig it, but for others it just causes too much worrying. In a social situation it’s fine, but if I’m by myself? You can be sure that I’m going to spend a solid chunk of time over thinking every single thing I did that day.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Risley",
                                    "body": "For me it’s the memory issues.  I just look my smarts.  ",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Risley",
                            "body": "Different strains?\n\n\nWhat I find EXTREMELY helpful now is that you can see what’s in the weed now, you can actually find ones that don’t have the shit in them that makes you paranoid ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "relevant_mh_quote",
                                    "body": "What specific stuff is in it that makes you paranoid?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "boredpsychnurse",
                            "body": "Huh. Opposite for me. I was always OK with home- grown- but this legal stuff is crazy, addictive and strong. Makes me paranoid and lazy af.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "The-Dead-Internet",
                    "body": "I have done every drug on the DEAs top fun list and walked away from them, alcohol has been the hardest drug for me and I still slip up on occasion. \n\n\nStay strong.",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Pixelated_",
                            "body": "100% It was the last addiction that I kicked, and the hardest to quit *by far.*  I had already given up cigarette smoking, a 60mg Oxycontin habit and the 4 pharmaceuticals that I was getting from my legal drug dealer aka Doctor. (Xanax, Ambien, Adderall and Lopressor)\n\nAlcohol took me 15 fucking years to quit. Now I'm 4 years sober.  We are all stronger than we realize.  <3",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "lifeofrevelations",
                            "body": "you mean it has been the funnest.  At least for me.  I wish I could still drink.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GaucheAndOffKilter",
                    "body": "Someone posted a comedy bit earlier where the guy was talking about how much he screwed his life while drinking. \n\nMeanwhile pot just makes it so I fall asleep at 10pm and beforehand eat a pint of ice cream. I think I know which is the better option, as long as I can keep running five miles a day to offset the calories.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "Dense_Surround3071",
                    "body": "I have a shit load of karma points on Reddit..... I do enjoy ice cream as well though.",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Pixelated_",
                            "body": "**u/Pixelated_ 72,264 karma**\n\n**u/Dense_Surround3071 72,517 karma**\n\nSince humanity's spiritual goal is to get rid of karma, I'm winning. \n\nWait that was arrogant of me. There goes some more karma points.  Goddammit I'm never getting off Earth.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Dense_Surround3071",
                                    "body": "Didn't worry bro.... I got you with that upvote. 👍",
                                    "score": 11
                                },
                                {
                                    "depth": 3,
                                    "author": "Blue_Robin_04",
                                    "body": "This should be a new bot game.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RockieK",
                    "body": "Amen to munchies!",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "jibboo24",
                    "body": "i finished two the other day :( :) :(",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "alittlebitneverhurt",
                    "body": "Agree with the sentiment - I've been arrested for possession of marijuana twice, never arrested for alcohol related things but absolutely fucked up my life with alcohol throughout my 20's. Weed is way better in just about every way.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hal______9000",
                            "body": "Why is every post about alcohol, not daily cannabis use? ",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cakeordeathimeancak3",
                                    "body": "They are trying to justify their drug use",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "russian_hacker_1917",
                    "body": "\"oops I ate way too much ice cream while high\" gang checking in",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "CubbyNINJA",
                    "body": "Worst thing I’ve ever done when I smoked 1 too many bowls was I didn’t clean the kitty litter when we had guests coming over. Wife came home with me passed out on the couch with the dog, video game on the TV and half our snacks for the guests eaten (dog jumped onto the table and ate them before also passing out). \n\nShe woke me up, I cleaned the litter and walked to the store for more snacks. Cost a whole 30 bucks to fix my mistake and I was fucking hilarious all night while we were entertaining the guests.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "CeeArthur",
                    "body": "Same.  I fucked my life up beyond belief with alcohol use, lows I never thought I'd reach.  Near death several times.  I've recovered thankfully (2 years) and recreationally use cannabis - the difference is, I've now been at the same job over a year, stable relationship, on good terms with all my family and friends, get out and do things, get lots of exercise, eat healthy (maybe a bit too much occasionally).  It's night and day the impact it has on your life.\n\n  \nEdit : Just to add, I'm Canadian and it is legal (sold in government stores) here",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Aeon1508",
                    "body": "Only bad things that have ever happened to me because of cannabis are because I got caught with it and because I tested positive for it",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "LovinMcJesus",
                    "body": "Get 4 friends together and get drunk, you will start fights.  Get 4 friends together and get stoned, you start a band.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Risley",
                    "body": "Doesn’t it give you memory recall issues the next day that take forever to go away?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Pixelated_",
                            "body": "Yes, when drunk I would lose all memories of what happened the night before. Alcohol brought out the absolute worst in me. Cannabis has brought me peace after 2 decades of alcohol completely ruining my life.\n\nAlcohol is the most damaging drug known because of its ubiquitous nature and the normalization of negative alcohol-fueled behaviors in our society. The amount of alcohol-related deaths alone is staggering. \n\nAnyone defending it over cannabis is experiencing cognitive dissonance because they are unable to quit drinking.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "domestic_omnom",
                    "body": "I'm like the only regular cannabis user that doesn't get the munchies.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ratmfreak",
                    "body": "The most trouble it got me into was completely ruining my mental health and exacerbating my chronic anxiety. Good shit.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "foodie_4eva",
            "body": "Yeah, livers everywhere are rejoicing and starting to recover.",
            "score": 105,
            "replies": [
                {
                    "depth": 1,
                    "author": "blazelet",
                    "body": "Yup I was a pretty heavy drinker for 10 years. In December I switched to cannabis and haven’t had a drink in 5 months.\n\nGoing to work my way off cannabis next as the brain fog isn’t ideal, but I feel so much better without drinking and have lost a ton of weight.",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DawsonJBailey",
                            "body": "How long did it take you to start feeling better and did you lose weight from not drinking alone or did you start exercising more? Just wondering cause recently I stopped drinking and I don’t plan on starting again but I’m wondering when I’m gonna start feeling better again lol",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blazelet",
                                    "body": "I started feeling significantly better in about 2 weeks. \n\nThe weight loss was solely from not drinking, unfortunately my lifestyle and job are very sedentary but I was able to drop from 255 to 225 in 5 months and am still going. I noticed when I quit drinking I also did less snacking, now I just eat my 3 square meals and even then my portion size is smaller, im just not famished all the time like I was when drinking, so that’s another change but it’s directly because of cutting alcohol.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Top-Engineering7264",
                                            "body": "100%…i stopped drinking 6 months ago, without really any other diet or activity changes ive lost about 40#…and i am fully convinced alcohol makes you crave carbs. Most of the greasy fast foods and salty snacks i ate before dont even seem appetizing now",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Publius82",
                    "body": "Shut up, livers.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Little-Dingo171",
                            "body": "I go to sleep, I don't feel a thing, but when I wake up my liver screams at me",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "andthatswhyIdidit",
                    "body": "[Not really.](https://onlinelibrary.wiley.com/doi/full/10.1111/add.16519)\n\nAlcohol consume DID NOT DECREASE, it is just that cannabis increased more.\n\nThis is a rather bleak outlook. No livers saved here.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "lqcnyc",
                    "body": "Lungs everywhere are sad being destroyed by smoke and vape juice. I’m pro cannabis legalization but any smoke and vape juice are harmful to lungs. And yes there is edibles but most people smoke and vape.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Vendetta4Avril",
                            "body": "I mean, I’ve been smoking pot for like 15 years, and once it was legalized in my state, I started taking edibles almost exclusively. I still have a vape pen, but one cart can last me like a month. I used to go through half an ounce every two weeks. Many of my stoner friends are the same- less smoke, more edibles. \n\nI think people will take what they can get, and unfortunately it’s still illegal in a lot of places, which leads to just buying weed.",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lqcnyc",
                                    "body": "That’s great you’re making the healthy choice. It’s legal in my state and it’s insane how many people are smoking on the streets. Almost everywhere you go you can smell and see it. Even though I don’t partake in weed anymore I get why most people like smoking or vaping. It takes effect in like 5 seconds and you can control it much more. Like you can just take a tiny puff and that’s it or you can rip like 20 huge puffs. And the social aspect of passing around a joint or blunt or pen or whatever. Edibles still have a long way to go. I’ve tried the fast acting edibles like mints and the drinks and they’re definitely making progress in terms of working quickly a being able to have more control of how high you want to be, but almost everyone still associates weed with smoking. I have the fondest memories of smoking with friends. Not edibles with friends.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kooky-Onion9203",
                                            "body": "I started on edibles and honestly had some of my best times with them, but nowadays I get anxious when I'm too high. Had a panic attack a while back from a dab and haven't done anything but smoke flower and take a few small puffs from a vape pen since.\n\nI'd love to treat my lungs better, but the delayed high of edibles just makes them too unpredictable for me. Like you said, it's a lot easier to gauge how high I'm getting and stop at a reasonable level when I smoke.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lqcnyc",
                                                    "body": "Yeah the panic attacks made me stop. I was like how is this fun?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Kooky-Onion9203",
                                                            "body": "It sucks cause I used to just crash out when I got too high and be totally fine otherwise. I started feeling paranoid about having a heart attack because I had some chronic chest pain for a while after I got covid, and I haven't been able to get toasted comfortably since.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "foodie_4eva",
                            "body": "Smoke is bad for the lungs, but still very little data showing marijuana use causes permanent lung disease and cancer.  I wouldn’t doubt it does increase ur lung cancer risk tho.   we know alcohol definitely does increase ur chances for cirrhosis and fatty liver",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lqcnyc",
                                    "body": "Once it’s federally legal, if that ever happens, then we’ll see the good studies. Any smoke that goes into your lungs increases your risk of lung cancer, whether weed, cigarettes, wood fire, literally anything that creates smoke. Yes you can read that weed magically is the one exception in the world and actually doesn’t do any harm to your lungs! lol those studies or findings or whatever are becoming less credible everyday. The research into weed on the body is so limited and bad due to it being illegal federally. Heck I’d bet some positive “studies” about weed and the lungs that come out in current times may be funded by the weed industry just like cigarettes and alcohol have done over the century.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WindmillRuiner",
                                            "body": "Not all irritants are carcinogens.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lqcnyc",
                                                    "body": "Can you give me examples of carcinogenic smoke that isn’t damaging your lungs?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "turd_vinegar",
                                                            "body": "Prop 65 has entered the chat.\n\nA shit ton of stuff is carcinogenic, meaning it *can* cause cancer, but doesn't cause any damage in practical use cases.\n\nSmoke very likely does though.\n\nSmoking weed, or anything, is very likely damaging to the lung tissue. I don't have the evidence, because of the restrictions on research association being a schedule 1 substance. \n\nBut the research on smoke in general shows it's pretty bad for the lungs.",
                                                            "score": 2
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "fogdukker",
                                                            "body": "That's not what was said. You sure you don't partake?",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SuperNoFrendo",
                            "body": "Those vape pens are not great for you. I use a dry herb vape. You just get THC, nothing else. It's a tiny little oven that heats up the chamber that holds the weed. It never reaches burning temperatures (no combustion = no smoke or ash) but it gets hot enough to vaporize the THC.  \n\nWhen it's done you just open the lid and throw out the spent weed.  Easy peasy.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lqcnyc",
                                    "body": "Yeah I used to have a pax. Definitely the healthiest way to vape",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SteeltoSand",
                    "body": "but now lungs are worried",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DrNinnuxx",
            "body": "Not a fan of cannabis personally, but it's miles better than people drinking everyday.  It's easily the most destructive drug on the planet.",
            "score": 112,
            "replies": [
                {
                    "depth": 1,
                    "author": "Stereo-soundS",
                    "body": "I drank all day every day.  Now I smoke most of the day every day.\n\nI can confirm it is miles better.  Weed cannot come to own you in the same way alcohol does and that comes down to the physical addiction that alcohol brings with it.\n\nReally wanting to smoke weed is much, much different than Needing a drink.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aretasdamon",
                            "body": "Bro I’m cleaning my apartment and learning how to cook with some real skills weeds saving me money by making me a cook and loving my food",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Stereo-soundS",
                                    "body": "I took a week off from work and checked myself into county detox for 3 days and 2 nights because there are no 30 day inpatient facilities in my area other than a psych ward.  They had me on Ativan every 4 hours at one point.\n\nMy point is that you don't have to check into a detox facility because of weed.  You are not at risk of death or having a seizure from not smoking weed.\n\nThe fact that people equivocate these two drugs on any level is laughable.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Beezo514",
                                            "body": "Plus if you drink too much in a limited time, you could die. If you smoke too much in the same time, you could nap. Worst case maybe you get a panic attack or paranoid, not fun, but nothing you won’t wake up from.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "777777hhjhhggggggggg",
                    "body": "Well I get your point, but tobacco kills over twice the number booze does worldwide yearly",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "slapstick_nightmare",
                    "body": "Cannabis has helped me get through some severe chronic pain, stopped my insomnia, and improved my sex life. Alcohol has at best made me mildly relaxed.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Spirited_League5249",
            "body": "Hopefully that trend continues and we'll see a drop in cancers related to alcohol and a drop in deaths and violence related to alcohol (DUI, aggression, etc)",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "SteeltoSand",
                    "body": "but couldn't we see an increase in lung cancer/ throat cancer?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "charliequeue",
                            "body": "Edibles don’t cause either of these :0",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "aamike68",
                                    "body": "Also dry herb vaping ftw.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Spirited_League5249",
                            "body": "For smoking, totally. THC is in edibles, drinks, etc. too though so smoking not necessary.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SkalexAyah",
            "body": "History fixing itself",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "andthatswhyIdidit",
                    "body": " [How](https://onlinelibrary.wiley.com/doi/full/10.1111/add.16519)?\n\nAlcohol consume did NOT decrease, it is just that cannabis increased more. This is not fixing anything, unless you want more people intoxicated, no matter how...",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SkalexAyah",
                            "body": "overtime, alcohol will decrease. \n\nCannabis can’t even be compared to alcohol.\n\nThe amateur ping pong player who is level 9 high will destroy the pro who is level 9 drunk.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "andthatswhyIdidit",
                                    "body": "> overtime, alcohol will decrease. \n\nThat is not what the data of the study shows, sadly.\n\n[It shows an increase in alcohol consumption and an even higher increase of cannabis consumption.](https://onlinelibrary.wiley.com/cms/asset/2b612a77-e62c-412c-ad56-f329a367f807/add16519-fig-0002-m.png)\n\nYour points sound logical, but the data is telling a different story. Go to where the data leads.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "49thDipper",
            "body": "Well that’s good news.",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChickyChickyNugget",
                    "body": "That fact that the rates of DAILY use of cannabis has increased 15-fold in three decades is good news?",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "49thDipper",
                            "body": "Way safer than alcohol.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "andthatswhyIdidit",
                                    "body": "But alcohol consumption did NOT decrease. Like always, nobody reads (or comprehends) the article or the [original study](https://onlinelibrary.wiley.com/doi/full/10.1111/add.16519)...\n\nAlcohol consume did NOT decrease, it is just that cannabis increased MORE.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "ChickyChickyNugget",
                                    "body": "That’s not relevant. It’s not good for you and a lot more people are doing it to an excessive degree. That is objectively not good\n\nEdit: I can’t believe I’m getting downvoted on a “science subreddit” for saying smoking weed every day is not good for you 🤣",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ThatOneAlreadyExists",
                                            "body": "It is relevant. It's safe to assume most daily cannabis users aren't also daily drinkers and that some were daily drinkers.",
                                            "score": 7
                                        },
                                        {
                                            "depth": 4,
                                            "author": "49thDipper",
                                            "body": "Ok",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "turd_vinegar",
                                            "body": "That's not how objective works.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ChickyChickyNugget",
                                                    "body": "To be clear, by objective I mean ‘a fact’",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "turd_vinegar",
                                                            "body": "But you've drawn a conclusion and given it a qualitative opinionated judgement. It's like a textbook subjective take.\n\nIt's simply not a fact. The other things you stated were arguably facts. But declaring something good or bad, is not fact.",
                                                            "score": 6
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RegimentalOneton",
            "body": "Yet the pot stocks  can’t seem to hold value.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "kingofblackice",
                    "body": "We buy weed, not $weed lol",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "NickM16",
                    "body": "I’d love to know of any pot stocks. Weed is going to be even bigger in the future.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DasFreibier",
                    "body": "At least around here weed has been the same price since at least the 90s, truly inflation proof",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "WillBigly",
            "body": "Light it up light it up",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Charmegazord",
                    "body": "*Like it’s 1985 and we high as fuck*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "its_raining_scotch",
            "body": "Interesting how I haven’t necessarily noticed an increase in people being more chillax though.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "unbilotitledd",
                    "body": "Because everyone is jonesing for their next joint",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Avante-Gardenerd",
                    "body": "Need...more...weed...",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Panzer_Rotti",
            "body": "This has been me for the past 22 years. It hasn't hindered me at all, just makes life a bit more bearable.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "andthatswhyIdidit",
            "body": "Are people not reading the article [or even bothering to look up the original study](https://onlinelibrary.wiley.com/doi/full/10.1111/add.16519)?\n\nAlcohol consume did NOT decrease, it is just that cannabis increased more.\n\nIf this would lead to less alcohol consumption in the future, it would be good news. Right now? Not so much...",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hal______9000",
                    "body": "First comment to comment on the study. Thank you ",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ChickyChickyNugget",
                    "body": "*’daily use increased 15-fold since the 1992’",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Lumpzor",
                    "body": "Seriously, all I'm hearing is almost no one wants to be sober.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "dogemikka",
                    "body": "Exactly! And to make it easier for anyone too lazy to open the link you kindly provide...\n\n\nConclusions:\n\nLong-term trends in cannabis use in the United States parallel corresponding changes in cannabis policy, with declines during periods of greater restriction and growth during periods of policy liberalization. A growing share of cannabis consumers report daily or near daily use, and their numbers now exceed the number of daily and near daily drinkers.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "ArtichokeNatural3171",
            "body": "I wonder if crime statistics will reflect a change as well. Its not like one seeks out a brawl after a bowl. They just want snacks.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "theend59",
            "body": "Neither are good but humans will always find a way to medicate",
            "score": 4
        },
        {
            "depth": 0,
            "author": "murderspice",
            "body": "This plant may set us free. !remindme 100 years",
            "score": 5
        },
        {
            "depth": 0,
            "author": "artfulpain",
            "body": "\"There's no such thing as a biological free lunch.\"",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BurnerBoot",
            "body": "And its side affects are real. \n\nI have even hospitalized 3 times due to CHS.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ALL2HUMAN_69",
            "body": "I want to smoke but I think it will cause cancer",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "seilrelies",
                    "body": "Then take edibles",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ALL2HUMAN_69",
                            "body": "I agree",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "samwizeganjas",
                    "body": "Vape and edibles",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "codyscottskillz",
                            "body": "Vapes will probably come out to be carcinogenic too",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "samwizeganjas",
                                    "body": "No, vaporize the weed, not smoke a vape pen",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "codyscottskillz",
                                            "body": "Oh I miss understood",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "samwizeganjas",
                                                    "body": "Yeah i wasn't specific either and i definitely agree vape carts are not Bueno",
                                                    "score": 5
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Little-Dingo171",
                                            "body": "How's that work? genuine question, Is that like dabs?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "samwizeganjas",
                                                    "body": "Yeah dabs or electric dab pen even better because it will only hear up so much so it doesnt burn. Weed* vaporizers that vape the flower are even better",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TelluricThread0",
                                                            "body": "I've done dabs in my volcano, and it sucks. Your only good option with dabs is to burn them.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "broadenandbuild",
                    "body": "There’s some research showing a link between cannabis, no matter how it’s ingested, and testicular cancer",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Sidewalkstash",
                    "body": "A 10 mg edible after a meal kicks in, in about 30 min, last a good 2-3 hours and is god damn amazing.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "treble-n-bass",
                            "body": "2-3 hours?  Edibles?  10-12 hours for me.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WindmillRuiner",
                    "body": "I smoke all day every day. Lungs clean each time. Countless people can say the same. YMMV, of course, but don't let the fear get you. Live your life. You only get one go.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "truebeast822",
            "body": "This is good news! It will chill people the F out",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Fiveohdbblup",
            "body": "Where that picture of the astronaut with the gun pointing to the back of the other one and he's saying, before he pulls the trigger on his buddy, always has been ...",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fiveohdbblup",
                    "body": "I've been around for a few years and before it was legal, most of the people that are smoking now, were smoking then",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "sixtus_clegane119",
                    "body": "It definitely hasn’t always been",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Blackcat0123",
            "body": "I wouldn't describe myself as a super heavy drinker (outside of the occasional special event), but I did drink a lot in 2020 and the couple of years after, because yknow, 2020. I didn't really start smoking weed regularly until 2022 when I moved into a better living situation.\n\nI've largely traded my drinking for cannabis use, which has definitely been an overall net positive for me and also way cheaper. Plus I finally lost the pandemic weight! I mean, a lot of exercise went into that too, but man, the beer gut really creeps up on you.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Acceptable_Wall4085",
            "body": "When the feds realize this they’ll be faster to legalize it and rake in the tax dollars.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Livid_Wish_3398",
            "body": "Practice does make perfect.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Habitual_lazyness",
            "body": "I read the beginning of this article 5 times because I could keep track of what I just read. Don’t smoke and read folks.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InsomniaticWanderer",
            "body": "That's going to be a thing for quite awhile.\n\nMJ has effectively been in prohibition this whole time, so the second we start reclassifying it, it's gonna get abused. Then things will calm down as it starts becoming less and less \"taboo.\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Muted_Cod_9137",
            "body": "Always have, now we're just telling you about it lol.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "YoinkLord",
            "body": "Why not one, then the other?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "larfytarfyfartyparty",
            "body": "Has there ever been an accident on record where a person under the influence of marijuana caused vehicular manslaughter?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DEFMAN1983",
            "body": "I'm guessing it always has been",
            "score": 1
        },
        {
            "depth": 0,
            "author": "chantsnone",
            "body": "One of them is way easier to do everyday",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HD_Thoreau_aweigh",
            "body": "ELI5: how does a quantitative article like this only gave a single chart? Is my ad blocker blocking things?\n\nI don't wanna have to dig for the stats, I wanna be hit in the face with a visual.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jimmybuffett4life",
            "body": "Lets fucking go!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sorryunowin",
            "body": "The race for drugs versus the war on drugs",
            "score": 1
        },
        {
            "depth": 0,
            "author": "the-mac-steak",
            "body": "Good news. Booze is the worst thing you can put in your body",
            "score": 1
        },
        {
            "depth": 0,
            "author": "The_Scarred_Man",
            "body": "This just in, getting high is more enjoyable than being lucid in this capitalist hellscape.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InternationalBand494",
            "body": "Good. I’d rather see a stoned populace rather than a drunk one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Aftermathemetician",
            "body": "I can consume cannabis all month long for the price of a pack of cigarettes or a night of drinking.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ichthius",
            "body": "Good job everyone.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "radome9",
            "body": "Two things immediately pops out to me when reading the study:  \n\n1. It uses the word \"marijuana\" which is an imprecise slang term, usually referring to dried cannabis flowers. Does this mean the study excludes cannabis oil, edibles and other cannabis products?   \n\n2. When measuring the rate of increase of cannabis use (figure 1) they use per capita numbers. But when comparing the  alcohol use and cannabis use (figure 2) they use absolute numbers. Absolute numbers do not correct for population growth and make it difficult to tell if alcohol consumption has gone up, remained stable, or gone down.  \n\nThings like these are red flags, making me wonder what the researchers are trying to obfuscate and why.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "throwaway12222018",
            "body": "I really have a hard time believing this.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PeterNippelstein",
            "body": "Ayy 420 blaze it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Knitwalk1414",
            "body": "Many elderly are now users, they say its the best medication for arthritis.  I am in healthcare.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Baringstraight",
            "body": "People are going to get addicted to cannabis now.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Desert_Isle",
                    "body": "Oh posh, that can't happen.  As proof, I've been smoking it daily for 20 years and haven't gotten addicted yet.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "CoachRockStar",
            "body": "Plants>pills>alcohol (Simple)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "epsteinpetmidgit",
            "body": "Using cannabis a few times will show you just how much of a poison alcohol is...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SeeingEyeDug",
            "body": "I can get a 1 gram vape pen that will last me 6 months for $50.  That's equal cost to one night of getting buzzed on beer at a local bar.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HAIL-THYSELF333",
            "body": "That was my goal.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Popcorn57252",
            "body": "I absolutely love this, but man I just wish it didn't f^ckin' *stink* so badly. I have absolutely zero issues with my friends that smoke, except that I just can't stand to be around them when they smell so *ass.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KenMacMillan123",
            "body": "More drug addicts than alcoholics. wow",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thinkB4WeSpeak",
            "body": "Good time to invest in the marijuana stocks.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Future_Celebration35",
            "body": "'Tegridy",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LazarusTruth",
            "body": "Big Booze won't be happy about this!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Conjurus_Rex15",
                    "body": "This isn’t news for them.  They are already shifting Into canning and bottling THC beverages.  They are well aware of alcohol use trending down, particularly in millennial and gen z.  Non-alcoholic beer is recently thriving and THC drinks are exploding.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Thedeathlyhydro",
            "body": "Good. Continue.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Edwardv054",
            "body": "So things continue to get a bit better.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Routine_Service1397",
            "body": "Far safer",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Formal_Vegetable5885",
                    "body": "I've met boomers a couple times who flat out disagree. An old woman once told me that she knows that weed is what is making the youth of today such degenerates.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrAnonymousForNow",
            "body": "expand your mind man.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "theworlddidwut",
            "body": "One love",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Pickles_1974",
            "body": "Good news.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "TomSpanksss",
            "body": "No wonder everyone is paranoid and filled with anxiety.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "SteeltoSand",
            "body": "but you shouldnt smoke everyday. smoking everyday isnt just as unhealthy as drinking everyday, when you do it for an extended period",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "radome9",
                    "body": "> smoking everyday isnt just as unhealthy as drinking everyday\n\nLol. Not even close.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SteeltoSand",
                            "body": "yes, its very close. your lungs would be very affected. have you seen a pipe that is used every day? do you think your lungs are just different to the tar? \n\n  \nbut keep lying to yourself if it makes smoking everyday easier for you",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "meepgorp",
            "body": "Good. Everybody needs to chill tf out and spend a day watching cartoons and sampling a buffet of Takis once in a while.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "flatworldart",
            "body": "God is perfect \nMan is not\nMan made whiskey \nGod made pot",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "SgtBaxter",
                    "body": "Nature routinely makes alcohol via fermentation.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "flatworldart",
                            "body": "That's not whiskey.",
                            "score": 0
                        }
                    ]
                }
            ]
        }
    ]
}