{
    "title": "Man finds huge 30,000-year-old mammoth bones in his wine cellar",
    "comments": [
        {
            "depth": 0,
            "author": "washingtonpost",
            "body": "When winemaker Andreas Pernerstorfer was renovating his cellar, he stumbled across an unusual treasure, far rarer than the finest wine: He found huge bones, which turned out to be mammoth bones dating back to the Stone Age.\n\nEven more remarkably, [experts ](https://www.oeaw.ac.at/en/news/bis-zu-40000-jahre-alte-mammutknochen-in-weinkeller-entdeckt)say the site contains the bones of at least three mammoths, as they have uncovered a layer of bones lying on top of each other in the cellar in the small village of Gobelsburg, in northeastern Austria.\n\n“I’ve worked in many parts of the world and have never seen so many mammoths in one place,” Hannah Parow-Souchon, the director of the excavation and a researcher at the Austrian Academy of Sciences, said in a telephone interview Thursday. She explained that her reaction to the scale of the discovery, which her team first learned about in March, was one of “shock and excitement.”\n\nTheacademy called the discovery “the most significant find of this kind in more than 100 years.”\n\nRead more here: [https://www.washingtonpost.com/world/2024/05/23/austria-mammoth-stone-age-bones-wine-cellar/?utm\\_campaign=wp\\_main&utm\\_medium=social&utm\\_source=reddit.com](https://www.washingtonpost.com/world/2024/05/23/austria-mammoth-stone-age-bones-wine-cellar/?utm_campaign=wp_main&utm_medium=social&utm_source=reddit.com)",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "klasredux",
                    "body": "22 stone age mammoths were discovered in Waco Texas in 1978... The director of the excavation is quite uninformed about her field. \n\nhttps://texastimetravel.com/directory/waco-mammoth-national-monument/",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "svarogteuse",
                            "body": "She just said its the most she had ever seen, not that existed in one place. No one said the parts of the world she even worked in had mammoths at all. For all we know she is specializes in Australian and South American fossils.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BottledUp",
                                    "body": "Not the kangaroo. The skiing and alps country. Austria.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "svarogteuse",
                                            "body": "Just because you live in and are a native to a country doesn't mean you cant study things from/in other places. I purposefully put South America in there so idiots like you wouldn't think I mistook Austria for Australia, but also chose two locations without mammoths.",
                                            "score": -1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "klasredux",
                                    "body": ">The Academy called the discovery “the most significant find of this kind in more than 100 years.”",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "svarogteuse",
                                            "body": "And the Academy may have only been referencing finds in Austria. Again we have no idea what the actual expertise of the person they spoke to was.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "asuka_rice",
            "body": "Rare wine, I mean find.",
            "score": 0
        }
    ]
}