{
    "title": "Human immune and metabolic biomarker levels, and stress-biomarker associations, differ by season: Implications for biomedical health research (2024)",
    "comments": [
        {
            "depth": 0,
            "author": "basmwklz",
            "body": "Highlights\n\n•We examined seasonal variation in health biomarker levels and stress.→biomarker associations\n\n•Basal levels of most immune and metabolic markers varied non-linearly across the year.\n\n•Associations between perceived stress and each health biomarker also varied seasonally.\n\n•Seasonality should thus be accounted for in studies linking stress, biomarkers, and health.\n\n\nAbstract:\n>Although seasonal changes in physiology are well documented, little is known about how human immune and metabolic markers vary across seasons, and no studies have examined how stress → health biomarker associations differ across the year. To investigate these issues, we analyzed data from 2118 participants of the Midlife in the United States (MIDUS) study to determine whether there were differences in (a) levels of 19 immune and metabolic markers, and (b) the association between perceived stress and each biomarker across the year. Results of component-wide boosted generalized additive models revealed seasonal patterning for most biomarkers, with immune proteins generally peaking when days were shorter. Moreover, whereas levels of hemoglobin A1C rose from late fall to spring, triglycerides were elevated in the summer and fall, and high-density lipoprotein decreased steadily from January to December. Urinary cortisol and cortisone exhibited opposite patterns, peaking at the beginning and end of the year, respectively. Most critically, we found that the effects of perceived stress on 18 of the 19 health biomarkers assessed varied by month of measurement. In some cases, these differences involved the magnitude of the stress → biomarker association but, in other cases, it was the direction of the effect that changed. Studies that do not account for month of biomarker assessment may thus yield misleading or unreproducible results.",
            "score": 1
        }
    ]
}