{
    "title": "In a world first, engineers from Britain's University of Cambridge have shown that cement can be recycled without the same steep cost to the environment as making it from scratch",
    "comments": [
        {
            "depth": 0,
            "author": "Ben-Goldberg",
            "body": "This is amazing!\n\nHowever, it has steps in common with the ordinary Portland cement process that could be improved.\n\nThe molten clinker coming out of the furnace is cooled then ground to a powder.\n\nSpinning the molten clinker to make a new type of mineral wool would almost certainly use less energy than grinding cold clinker.\n\nHow much processing clinker wool would need be used as a replacement for powdered OPC, that's something to experiment with.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "redditsuckbutt696969",
                    "body": "Mmm... Concrete Candy. Or Fairyctete for the bri'ish.\n\nEdit: the fr*nch call it daddy's beard..so..Daddy's Crete?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DrProfJoe",
            "body": "This is neat, but I don't think it could ever be feasible. If you want to use reclaimed cement to create a new structure. **Breaking** and **transporting** sufficient quantities of old cement would be massive economic and ecological expenses.",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "somafiend1987",
                    "body": "You're thinking too short-term. First, you show something can be done. Next, figuring out where to locate such a feature. Knowing where it will go long-term provides a location for the cement and concrete currently heading to landfills. Good locations would be old quarries, putting them away from residential areas. One would assume, early on, there will be a bias. It will likely be used for sidewalks and driveways before the public will accept it on commercial projects.",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Inspect1234",
                            "body": "In Canada, we recycle concrete (mostly the non reinforced) by crushing it and using for base gravels. It actually is a superior product to just gravel as it will hydrate and become stronger than compacted gravel.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "New_girl2022",
                                    "body": "Ya this lol. Op doesn't know shit.",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}