{
    "title": "High dose dietary vitamin D allocates surplus calories to muscle and growth instead of fat via modulation of myostatin and leptin signaling. (Preprint - 2024)",
    "comments": [
        {
            "depth": 0,
            "author": "basmwklz",
            "body": "Abstract:\n>Obesity occurs because the body stores surplus calories as fat rather than as muscle. Fat secretes a hormone, leptin, that modulates energy balance at the brain. Changes in fat mass are mirrored by changes in serum leptin. Elevated leptin prompts the brain to decrease appetite and increase energy expenditure. In obesity, however, impaired leptin sensitivity mutes these leptin-mediated changes. We have limited understanding of what controls leptin production by fat or leptin sensitivity in the brain. Muscle produces a hormone, myostatin, that plays a role in muscle analogous to the one that leptin plays in fat. Absent myostatin leads to increased muscle mass and strength. As with leptin, we also do not know what controls myostatin production or sensitivity. Although fat mass and muscle mass are closely linked, the interplay between leptin and myostatin remains obscure. Here we describe an interplay linked thru vitamin D. Conventionally, it is thought that vitamin D improves strength via trophic effects at the muscle. However, we find here that high dose dietary vitamin D allocates excess calories to muscle and linear growth instead of storage as fat. Vitamin D mediates this allocation by decreasing myostatin production and increasing leptin production and sensitivity. That is, high dose vitamin D improves integration of organismal energy balance. Obesity, aging and other chronic inflammatory diseases are associated with increased fat mass and decreased muscle mass and function (e.g. sarcopenia). Our work provides a physiologic framework for how high-dose vitamin D would increase allocation of calories to muscle instead of fat in these pathologies. Additionally, our work reveals a novel link between the myostatin and leptin signaling whereby myostatin conveys energy needs to modulate leptin effects on calorie allocation. This result provides evidence to update the conventional model of energy stores sensing to a new model of energy balance sensing. In our proposed model, integration of leptin and myostatin signaling allows control of body composition independent of weight. Furthermore, our work reveals how physiologic seasonal variation in vitamin D may be important in controlling season-specific metabolism and calorie allocation to fat in winter and muscle and growth in summer.",
            "score": 41,
            "replies": [
                {
                    "depth": 1,
                    "author": "fkrmds",
                    "body": "The comparisons between muscle and fat instantly make me think it has something to do with water retention. Especially once inflammation was mentioned later on.\n\n\nmight be something stupid like - vitamin D is hard to store so the body sends it to muscles to get used up first.\n\n\ndosn't milk have large amounts of D? maybe there is some interaction with lactic acid from muscles?",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "Memory_Less",
                    "body": "They said 'dietary' and not vitamin D supplements, correct? \n\nThere was research that was pu lished and posted here about supplement vitamin D may cause cancer, clearly making the dietary vitamin D healthier.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "ThinkerSis",
            "body": "Any adverse side effects to high dose vitamin D supplements?",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "The-Dead-Internet",
                    "body": "Yes\nhttps://www.mayoclinic.org/healthy-lifestyle/nutrition-and-healthy-eating/expert-answers/vitamin-d-toxicity/faq-20058108",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "knewbie_one",
                            "body": "\"Taking 60,000 international units (IU) a day of vitamin D for several months has been shown to cause toxicity. This level is many times higher than the U.S. Recommended Dietary Allowance (RDA) for most adults of 600 IU of vitamin D a day.\"",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "im_a_dr_not_",
                                    "body": "2000 IU is the new recommendation\n\nhttps://www.news-medical.net/news/20240131/New-study-recommends-2000-IU-daily-vitamin-D-supplementation.aspx",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Orchid-Analyst-550",
                                            "body": "How does that compare to \"10,000 IU/kg (high-D)\" in this study? Seems like the study's amount of added high-D would be toxic to humans.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "im_a_dr_not_",
                                                    "body": "It said 60,000 iu in that study, which is 30,000 times the amount that the study is link to recommended. Unless you’re referring to a study, which you forgot to post a link to.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "The-Dead-Internet",
                                    "body": "Unfortunately there's people that don't look up toxicity it's even worse with fat soluable vitamins because your body can't just piss it out like B12.\n\n\nThen some people think more is better it's why I steer clear of multivitamins.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Memory_Less",
                                            "body": "Healthy diet wins the race. Vitamins do not act/behave the same way in our bodies to provide the same or similar health benefits.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "VinnieBoombatzz",
                                                    "body": "It's very hard to achieve good levels of vitamin D from food alone, if not impossible. A lot of people use supplements, including prescribed by doctors. Science is not witchcraft.",
                                                    "score": 22,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "sixtus_clegane119",
                                                            "body": "Plus the sun!",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "VinnieBoombatzz",
                                                                    "body": "Yes, but a lot of factors also make sun exposure not a stable source of vitamin D. A lot of people spend most of the day stuck inside for work. Some countries up north have very little daylight during half the year. And people with darker skin have more trouble producing vitamin D.\n\nThere are many valid reasons to supplement vitamin D. There's no reason to try to make it sound like a bad thing.",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "sixtus_clegane119",
                                                                            "body": "I try to do both (and get some in my diet) \n\nAt least 2000iu supplemented a day, the sun is just beautiful when you can. Also I think I read that it helps produce endogenous serotonin",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "VinnieBoombatzz",
                                                                                    "body": "I don't even need the sun to do its biochemical shit for my serotonin levels to increase. I see a sunny day, I'm happy!",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "321blastoffff",
                                                            "body": "This is why I taint tan",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OG_LiLi",
                    "body": "Im pretty dumb, so forgive me if im wrong, but I don’t think that’s what this was intended to measure. Do you just have concerns about it personally? \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4821095/",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Technical_Carpet5874",
                            "body": "Tremendous",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "49thDipper",
            "body": "But how high is the dosage we are talking about here?",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "JarethKingofGoblins",
                    "body": "Worth noting that this was a study done on mice.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dsj417",
                            "body": "Maybe he’s a mouse.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TangoInTheBuffalo",
                                    "body": "Say cheese!",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Memory_Less",
                            "body": "Big time. And I am trying to clarify if it was dietary or supplements that provided the benefits.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "richardpway",
            "body": "In mice. That doesn't mean it works with humans.",
            "score": 1
        }
    ]
}