{
    "title": "What are the arguments for and against the idea that the U.S. and U.K. failed to provide adequate security assurances to Ukraine under the 1994 Budapest Memorandum?",
    "comments": [
        {
            "depth": 0,
            "author": "ummmbacon",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thesoupoftheday",
            "body": "The only party in violation of the Memorandum is Russia.  [The while thing is only two pages long.](https://policymemos.hks.harvard.edu/files/policymemos/files/2-23-22_ukraine-the_budapest_memo.pdf?m=1645824948)  Russia promised not to economically coerce Ukraine, and then did.  Russia promised to respect the territorial integrity of Ukraine, and then annexed Crimea. Russia promised not to attack Ukraine, but invaded in 2014 and again in 2022.  All parties promised to take an invasion of Ukraine to the UNSC, [which the US and Albania did on Feb. 25th, but Russia vetoed.](https://news.un.org/en/story/2022/02/1112802) Sadly, what the Memorandum does **not** contain is a requirement for armed intervention, or any other materiel support in the event of war.\n\n\nThe Memorandum is usually brought up by people that wasn't the West to look bad, either to guilt them into doing more to support Ukraine or to make them appear unreliable friends to other would-be allies. \n\n\nEither way, while I think the US and Europe should be far more to support Ukraine right now, they are doing more than is required by the Memorandum.  Russia, meanwhile, is one nuclear detonation away from being in violation of every single term of that agreement it is also a signatory to.",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "JudgeWhoOverrules",
                    "body": "[Belarius has accused the United States of violating the agreement](https://web.archive.org/web/20140419030507/http://minsk.usembassy.gov/budapest_memorandum.html) (April 2013 response statement by US State Dept) by instituting [economic sanctions](https://www.fieldfisher.com/en/insights/faq-sactions-against-russia-and-belarus)  against Belarius in contradiction of the agreements ban against economic coercion of target nations.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thesoupoftheday",
                            "body": "If you consider economic sanctions in response to the violation of the civil rights of the Belarussian people by their government \"economic coercion designed to subordinate to [America's] own interest the exercise by the Republic of Belarus of the rights inherent in its sovereignty and thus to secure advantages of any kind\", then sure.  \n\n\nPersonally, I'm not sure how trying to stop a dictator from having his citiczens beaten to death in the street is in the US's interest at the expense of Belarus' sovereignty, but you do you.",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cobol_Engineering",
            "body": "There’s no argument: “it [the treaty] does not impose a legal obligation of military assistance on its parties.” \n\nEconomic assistance was provided as well despite also lacking a mechanism of enforcement.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Amoral_Abe",
            "body": "The Budapest Memorandum is actually a really short document and is extremely straightforward.  Here's the [source document](https://policymemos.hks.harvard.edu/files/policymemos/files/2-23-22_ukraine-the_budapest_memo.pdf?m=1645824948) in case anyone wants to review but I copied and pasted the key points and marked who violated them.  \n  \nTLDR:  US and UK didn't violate the Budapest Memorandum at all.  Russia violated multiple provisions of the Budapest Memorandum.\n  \n1. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and\nNorthern Ireland, reaffirm their commitment to\nUkraine, in accordance with the principles of the CSCE\n[Commission on Security and Cooperation in Europe]\nFinal Act, to respect the Independence and Sovereignty\nand the existing borders of Ukraine.  \n * Signatory countries will respected Ukraine's borders.  \n * US = Pass, UK = Pass, Russia = Fail.  \n2. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and\nNorthern Ireland, reaffirm their obligation to refrain\nfrom the threat or use of force against the territorial integrity or political independence of Ukraine, and that\nnone of their weapons will ever be used against Ukraine\nexcept in self-defense or otherwise in accordance with\nthe Charter of the United Nations.  \n * Don't threaten to use force on Ukraine or use force.  \n * US = Pass, UK = Pass, Russia = Fail.  \n3. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and\nNorthern Ireland, reaffirm their commitment to\nUkraine, in accordance with the principles of the CSCE \nFinal Act, to refrain from economic coercion designed\nto subordinate to their own interest the exercise by\nUkraine of the rights inherent in its sovereignty and\nthus to secure advantages of any kind.  \n * Don't use economic cooercion on Ukraine to get what you want.  \n * US = Pass, UK = Pass, Russia = Fail.  \n4. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and\nNorthern Ireland, reaffirm their commitment to seek\nimmediate United Nations Security Council action to\nprovide assistance to Ukraine, as a non-nuclear-weapon\nState Party to the Treaty on the Non-Proliferation of\nNuclear Weapons, if Ukraine should become a victim\nof an act of aggression or an object of a threat of aggression in which nuclear weapons are used.  \n * If Ukraine is attacked with nukes or threatened with nukes, the US, UK, and Russian Federation promise to take the matter to the UNSC.  \n * US = Pass, UK = Pass, Russia = Fail.  \n5. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and\nNorthern Ireland, reaffirm, in the case of the Ukraine,\ntheir commitment not to use nuclear weapons against\nany non-nuclear-weapon State Party to the Treaty on\nthe Non-Proliferation of Nuclear Weapons, except in\nthe case of an attack on themselves, their territories or\ndependent territories, their armed forces, or their allies,\nby such a state in association or alliance with a nuclear\nweapon state.  \n * Don't attack Ukraine with nukes unless Ukraine attacks you first when allied with nuclear power.  \n * US = Pass, UK = Pass, Russia = Fail.  \n6. The United States of America, the Russian Federation, and the United Kingdom of Great Britain and\nNorthern Ireland will consult in the event a situation\narises which raises a question concerning these commitments.  \n * If something concerning happens, all parties will talk about it.  \n * US = Pass, UK = Pass, Russia = Pass (technically they have also talked... along with attacking).",
            "score": 13
        }
    ]
}