{
    "title": "What are the pros and cons of the Biden administration's proposed capital gains tax increase to a top marginal rate of 44.6%?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \n\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\n\n1. Be courteous to other users.\n1. Source your facts.\n1. Be substantive.\n1. Address the arguments, not the person.\n\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\n\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "cowvin",
            "body": "OP didn't mention one of the most critical parts of the changes:  It ends the step-up in basis loophole!  ( [https://home.treasury.gov/system/files/131/General-Explanations-FY2025.pdf](https://home.treasury.gov/system/files/131/General-Explanations-FY2025.pdf) )\n\nThis is the loophole that allows many wealthy people to never pay any taxes on their stocks because they can just eventually hand it to their children and the cost basis is stepped up to the current price so they never pay any capital gains.\n\nSo yeah, this is an excellent change, too.",
            "score": 34,
            "replies": [
                {
                    "depth": 1,
                    "author": "Starbuck522",
                    "body": "Is that for everyone, or just at certain amounts?\n\n(You linked to a 256 page document)",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "posam",
                            "body": "Reads like it’s mixed with the lifetime gift limit of $5m per person($10m for married couples). It also excludes tangible property up to $250k as well as on property.\n\nSee pdf page 89 about halfway down.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Starbuck522",
                                    "body": "Thanks",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kazr01",
                    "body": "Also would destroy the few remaining family farms",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "snuggie_",
                            "body": "Idk, when people say stuff like this I just feel like: if some tax or whatever will make 99% more money from huge conglomerates and 1% from family businesses. And those family businesses will go out of business if it happens, well maybe those businesses shouldn’t exist in the first place.\n\nFamily businesses are great and we should support them and help them succeed. But at some point we shouldn’t just allow every single, otherwise failing, businesses continue to exist just because it’s small",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sephstorm",
                                    "body": "Tell that to them.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "snuggie_",
                                            "body": "Ok, of course I would. I can’t say what your politics are but often these same people wanting tax cuts and keeping tax loopholes are the ones saying unemployment shouldn’t exist and minimum wage should never increase.\n\n\nWell which is it? We *shouldn’t* change laws that help 100% of only poor people who need help, but we *should* continue laws that help a group of 99% rich companies but that has 1% of a needy family? At least be consistent. You can’t possibly be a sane person and believe both of those statements at the same time if the entire argument is helping the families who need it.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "Just so people are informed, it's a good idea to understand how marginal progressive tax rates work. This [short video](https://www.youtube.com/watch?v=kYeZko1WKHQ) (transcript in the description) explains it pretty well. The upshot is, the top marginal rate is not the rate paid on every dollar earned, and most people don't make enough that any of their income will even reach that rate.\n\nCapital gains are currently taxed at a preferential (lower for most taxpayers) rate. The administration's proposal is to tax long term capital gains as ordinary income for those earning more than $1 million per year in adjusted gross income. From OP's source about the revenue proposals:\n\n> Long-term capital gains and qualified dividends of taxpayers with taxable income of more than $1 million would be taxed at ordinary rates   \n> [...]   \n>  For example, a taxpayer with $1,100,000 in taxable income of which $200,000 is preferential capital income would have $100,000 of capital income taxed at the preferential rate and $100,000 taxed at ordinary rates.\n\nBecause the proposed change targets high earners in this way, it [would affect fewer than 0.3 percent of taxpayers,](https://www.cbpp.org/research/federal-tax/biden-proposals-would-reduce-large-tax-advantages-for-those-at-the-top-address) and only in the years when they sell long-term capital assets for a gain.\n\nA few years back, [we discussed the idea of taxing capital gains as ordinary income](https://www.reddit.com/r/NeutralPolitics/comments/bjujtn/what_are_the_pros_and_cons_of_taxing_capital/) for *all* taxpayers. The top comment there is very informative and strongly in favor of the idea. The current Biden proposal doesn't go so far, as it only applies to the top 0.3% of earners. So, on the surface, this proposal seems well targeted and relatively tame.\n\nAs to whether it's worth it, probably not. It's a safe bet that many high earners will either shift their investments away from such assets or find ways to shelter their gains from the tax, so I'd be surprised if the government ever sees close to the projected revenue increase from this move. And even if it did, $289 billion over 10 years is just 0.3% of the [total projected budgets over the same period.](https://www.whitehouse.gov/wp-content/uploads/2024/03/budget_fy2025.pdf) This seems like a pretty significant shift to the tax code that's easily circumvented, may have some deleterious effects, and doesn't raise a lot of money. There are more effective and efficient ways to increase revenue in the same proposal and my belief is that it'd be better to concentrate on those.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "sephstorm",
                    "body": "So there would be no change in capital gains tax for people below 1million AGI right?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "That's the way I understand the proposal, though it's $500k for individual filers and $1M for couples filing jointly.",
                            "score": 2
                        }
                    ]
                }
            ]
        }
    ]
}