{
    "title": "Have nations around the world been moving away from democracy recently, and if so, why?",
    "comments": [
        {
            "depth": 0,
            "author": "ummmbacon",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gray_clouds",
            "body": "There's a theory that the \"attention economy\" (Social Media etc.) is particularly hard on Democracy.  Algorithms respond to whatever drives up engagement, and factionalizing content is among the most successful kind. When people over-perceive other factions as being threatening, especially within their own countries, they flock to Authoritarian Leaders for safety and stability.",
            "score": 143,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "For those who are interested in learning more about this, can you link to an article explaining this theory?",
                    "score": 31,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sepulchh",
                            "body": "[https://www.cnas.org/publications/commentary/digital-threats-to-democracy-pay-attention](https://www.cnas.org/publications/commentary/digital-threats-to-democracy-pay-attention)\n\nHas some information on this\n\n[https://www.un.org/sites/un2.un.org/files/attention\\_economy\\_feb.pdf](https://www.un.org/sites/un2.un.org/files/attention_economy_feb.pdf)\n\nIf you want to learn more about the concept of Attention Economy in general.",
                            "score": 30
                        },
                        {
                            "depth": 2,
                            "author": "bookwormeg",
                            "body": "2 books I've read about this that I highly recommend:\n\n1) https://www.goodreads.com/en/book/show/55711307\n\n2) https://www.goodreads.com/en/book/show/58950736",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ILikeNeurons",
                    "body": "[**Fix the system**](https://electionscience.org/take-action/volunteer/). [Scientists blame hyperpolarization for loss of public trust in science](https://www.reuters.com/article/us-nobel-prize-usa/respect-for-science-in-jeopardy-in-polarized-u-s-nobel-winners-say-idUSKCN1C81T7), and [Approval Voting](https://en.wikipedia.org/wiki/Approval_voting), a [single-winner voting method preferred by experts in voting methods](http://www.votefair.org/bansinglemarkballots/declaration.html), would [help to reduce hyperpolarization](https://en.wikipedia.org/wiki/Approval_voting#Effect_on_elections). There's even [a viable plan to get it adopted](https://80000hours.org/podcast/episodes/aaron-hamlin-voting-reform/), and [an organization that could use some gritty volunteers](https://www.electionscience.org/) to get the job done. They're already off to a great start with [Approval Voting having passed by a landslide in Fargo](https://www.vox.com/future-perfect/2018/11/15/18092206/midterm-elections-vote-fargo-approval-voting-ranked-choice), and more recently [St. Louis](https://apnews.com/article/election-2020-primary-elections-st-louis-general-elections-elections-cba7eb3251d5479b9375d55db428d429). Most people haven't heard of Approval Voting, but seem to like it once they understand it, so anything you can do to help get the word out will help. If your state allows [initiated state statutes](https://ballotpedia.org/Initiated_state_statute), consider [starting a campaign](https://www.electionscience.org/commentary-analysis/so-you-want-to-run-a-campaign/) to get [your state](https://ballotpedia.org/Ballot_initiative) to adopt Approval Voting. Approval Voting is [overwhelmingly popular in every state polled, across race, gender, and party lines](https://electionscience.org/commentary-analysis/approval-voting-americas-favorite-voting-reform/). The successful Fargo campaign was [run by a full-time programmer with a family at home](https://www.electionscience.org/events/fargo-a-look-back-live-discussion/). One person really can make a difference.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "unkz",
                            "body": "This comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Congracia",
            "body": "The issue with democratic backsliding is that it's very subtle in a way that's hard to measure. I find Little & Meng very unconvincing because they focus on a very particular aspect of democracy. Most political scientists opt for one of two approaches:\n\n- Using subjective measures based on expert opinions like V-dem and Freedom House. While these are subject to some issues, they address these very well through intercoder reliability tests and usage of a wide range of indicators. The V-dem methodological report is worth a read here.\n\n- Using case studies. Qualitative research allows you to go really into depth in a particular case and allow you to highlight particular aspects of the backsliding process. A whole body of such studies that all point in the same direction might give some hints as that there's an ongoing trend.\n\nIn the social sciences, there are no such things as objective measures. Every measure has its advantages and disadvantages and these should be weighed carefully. The quantitative political science community generally prefers the V-dem measures. \n\nBiggest evidence for democratic backsliding trends are the yearly V-dem and Freedom House reports. There's a wide range of proposed explanations in the literature but no consensus on a single aspect (which hardly happens in the social sciences). A good starting point is [Waldner & Lust (2018)](https://www.annualreviews.org/doi/full/10.1146/annurev-polisci-050517-114628). They go over a large number of explanations. The cited by page of this paper on Google Scholar allows you to get a wider feeling of the literature.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackPriestOfSatan",
                    "body": ">  it's very subtle in a way that's hard to measure. \n\nThe post is about \"nations moving away from democracy.\"  I think its also important to ask about individuals and groups moving away from it.  I appreciate you posting the info from Waldner & Lust.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/kstq1wp/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 37,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "> I'd recommend reading Samuel P. Huntington.\n\nWould you please link to it?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "yodatsracist",
                            "body": "He's referring to mid-career Huntington, who developed a \"waves of democracy\" theory/framework. You can start from this Wikipedia page: [Waves of Democracy](https://en.wikipedia.org/wiki/Waves_of_democracy). It's pretty objectively true that waves of democratization happen in regional bursts which are often globally correlated. It's also true that democratic backsliding happens on similar patterns. But the regional patterns seem important. You're likely old enough to remember the anti-regime \"contagion\" of the Arab Spring. The fact that these things do seem able to jump also matters. I think there does seem to be anti-democractic contagion, too — look at the right wing leaders in Europe emulating and networking with each other. There are economic and political structures, but actors act within those structures, and these actors are influenced by others in the system.  \n\nHuntington also came up with the \"Clash of Civilizations\" theory which made predictions which has mostly not held up. It was one of several post-Cold War predictions. Fukuyama's \"the end of history\" thesis is another; Barber's \"McWorld vs. Jihad\" is another; and Fahreed Zakaria's \"Illiberal Democracy\" may be the most prescient. \n\nA lot of what we see does have the trappings of democracy. They have elections. There is a real chance that figures like Orban or Erdogan could in theory be voted out (figures like Putin and Chavez/Maduro, less so). Wikipedia is a decent place to begin here: [illiberal democracy](https://en.wikipedia.org/wiki/Illiberal_democracy). This doesn't explain the *why* illiberal democracies emerge, necessarily, but it does I think help just thinking how to classify them, and to think what are the element that make up actually-existing democracy. \n\nDon't read the late Huntington. His book *Who Are We* is all about how Latinos are destroying the fabric of American identity somehow. It's not a very rigorous book, in terms of actually engaging substantively with the extensive literature on American immigration and American identity.",
                            "score": 34,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "Great! Thanks for the breakdown and references.",
                                    "score": 9
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gol_D_baT",
            "body": "Honestly I think that income gap it's the main driver.\nIn many western nations, who were considered the eralds of democracy, lobbying allowed those were already rich to write law for theirselves, making them every decade more rich and powerfull.\nSource: https://fred.stlouisfed.org/series/WFRBST01134\n\nLoopholes were open by state like Ireland, Netherlands, Cayman and so on to drain away part of tax money that were previously used on sanity, education, infrastructures and everything that made the average citizen live better.\nSource:\n\nhttps://en.m.wikipedia.org/wiki/Corporate_tax_in_the_United_States#/media/File%3AU.S._Corporate_Profits_%26_Tax_Rate.webp\n\nThese kind of topics are barely covered by the media, which are reliant on upper classes money to survive, and most of political debate Is confined in \"culture\" instead that economics were the average citizen hasnt anymore choiches because everything Is decided by \"experts\" living in Ivory Towers without contacts on the average Citizen live.\n\nIf democracies are becoming oligarcies, why choose It? Regimes are less resilient and easier to subvert that flawed democracies.",
            "score": 60,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krprhk0/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ElderKingpin",
                    "body": "Your sources say literally nothing about lobbying and the \"media doesn't tell you anything\" is so hand wavy.\n\n\"Every decade more rich and powerful\" when the past decade the share of money that the top 1% holds stayed the same and we technically aren't even at the peak of it. If I were to even agree with that statement you would need to show that income inequality is a causal reason for right-wing/less democratic governments getting elected.\n[\nNot to mention real median wages have been meaningfully increasing, so it's not like the middle class has been getting robbed:](https://www.bls.gov/charts/usual-weekly-earnings/usual-weekly-earnings-over-time-total-men-women.htm)\n\nThe reality is that lobbying works for :\n\n1. things that the public doesn't care about, or more specifically, doesn't vote on.\n\n2. things that the lobbyists actually have expertise in as that's their purpose. \n\nhttps://fbaum.unc.edu/articles/ELJ-2014-Lobbying.pdf\n\nAnyway, I get a sense that we're trying to just harm rich people instead of advocating for policies and understanding that we can best fund those policies with progressive tax policies, the former has no real purpose other than spite.\n\nIf income gap was the main driver then why are Nordic countries also leaning right?\nhttps://nordics.info/show/artikel/populism-and-the-growth-of-the-radical-right-in-the-nordic-countries",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Gol_D_baT",
                            "body": "The graphic I linked clearly shows that top 1% in the US owns nearly 50% more of the share of total wealth than 30 years ago.\n\nAbout the wages I would like to see for which part of population increased and how much, I cant find the resources anymore but I remember that most of median real average growth was driven by already highest paying positions.\n\nI like to be empirical but come on, 60 years ago a man with an average full time job coulded provide for a full family all by itself, today is almost impossible.\n\nAbout progressive taxation I agree with you, but how can you pass more progressive tax policies ? Richs comfortly brags about they need to be more taxed from their meetings in luxury locations like Davos, while they search for every possible loophole to avoid It.\n\nAbout nordic countries if you've been there the response would be obvious: Immigration. They got lot of immigrants that drained resources out of welfare, some of them refused to integrate and for locals was kind of taboo topic criticize them.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fargason",
                                    "body": ">The graphic I linked clearly shows that top 1% in the US owns nearly 50% more of the share of total wealth than 30 years ago.\n\nMuch more clearly it shows a 30% increase from 23 points in 1990 to 30 points today.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GameEnders10",
            "body": "In my view, I see people saying it's undemocratic whenever a non progressive leader gets elected. Nayib Bukkele for example is incredibly popular after taking on the local gangs and making his country safer. Polls at and won his re-election by around 85%, yet here come articles and politicians declaring him an \"authoritarian\" because he is not progressive and takes on crime.\n\n[https://www.bostonglobe.com/2021/05/08/opinion/nayib-bukeles-creeping-authoritarianism-el-salvador/](https://www.bostonglobe.com/2021/05/08/opinion/nayib-bukeles-creeping-authoritarianism-el-salvador/)\n\n[https://www.latimes.com/world-nation/story/2021-03-01/in-el-salvador-the-president-consolidates-power-amid-fears-of-growing-authoritarian-tendencies](https://www.latimes.com/world-nation/story/2021-03-01/in-el-salvador-the-president-consolidates-power-amid-fears-of-growing-authoritarian-tendencies)\n\nThis is a good one of Ilhan Omar being oh so concerned about the super highly favored president of El Salvador's being illegitimately elected and undemocratic values.\n\n[https://www.dailymail.co.uk/news/article-13043849/Ilhan-Omar-El-Salvador-Nayib-Bukele-murder-democracy.html](https://www.dailymail.co.uk/news/article-13043849/Ilhan-Omar-El-Salvador-Nayib-Bukele-murder-democracy.html)\n\nHere's articles when Victor Orban blocked the flood of African migrants other EU countries were allowing being called authoritarian for it.\n\n[https://www.vox.com/policy-and-politics/2018/9/13/17823488/hungary-democracy-authoritarianism-trump](https://www.vox.com/policy-and-politics/2018/9/13/17823488/hungary-democracy-authoritarianism-trump)\n\n[https://www.newyorker.com/magazine/2022/07/04/does-hungary-offer-a-glimpse-of-our-authoritarian-future](https://www.newyorker.com/magazine/2022/07/04/does-hungary-offer-a-glimpse-of-our-authoritarian-future)\n\nThere's multiple examples, and many articles for each, of the far left journalists and politicians complaining anyone doing the different than their preferences being called \"authoritarian\", even when legitimately elected. Much like the word Nazi, it's becoming meaningless as they just use it politically and not seriously. \"Democracy\" in other countries will often support politicians who do things we disagree with, \"Democracy\" itself is not inherently good, it can also be tyranny by majority.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GameEnders10",
                            "body": "Can you please provide any sources for your Orban comments? Or anything here? Why is Nayib called authoritarian, and they're \"oh so concerned about the recent election\" when he has 85% support or more?",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "themarquetsquare",
                                    "body": "Because [Nayib actively put aside the laws of his own country](https://archive.is/eHHcM), for example for locking people up without anything resembling a trial and with scant evidence. He fired the attorney general who investigated him. He showed up with armed forces in parliament when it didn't want to vote for something he wanted, for chrissakes. \n\nCounter question: ever heard of Hugo Chavez? He was what some would describe as a lefty. He was also called an authoritarian, because he was one. It does happen. \n\nThough y'know, if progressives are not often called authoritarians, that may have a different reason than you think. Like, progressive ideology and authoritarianism not being very compatible.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GameEnders10",
                                            "body": "What do you think is more \"democracy\"? \n\nA leader fighting a corrupt justice system that helped allow violent gangs to terrorize the country?\n\nA leader following the will and approval of 85%-90% of democratic voters to implement a solution they want so they can have a safer and more prosperous country without their kids getting caught up in violent gangs and constantly being under threat?\n\nSerious question. Because I think that would be a complex argument. Is Democracy the will of the people? Or that he took some actions you find illegal, but that democratically were highly supported and effective?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "themarquetsquare",
                                                    "body": ">Is Democracy the will of the people? Or that he took some actions you find illegal, but that democratically were highly supported and effective?\n\nOk, one more time. That is not a contradiction. It is the will of the people. The safeguards to this are written into founding principles. One of them is that everybody needs to adhere to the law of the land, including the president. It is not 'I find illegal' - it actually is. \n\nSure, measures were supported because people support peace. \n\nBut that does not negate the fact that taking the power to just lock people up without due process (including enemies!) is, in the end, actually a threat to the will of the people being done.",
                                                    "score": 6
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krf6xbq/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rotates-potatoes",
                    "body": ">  Nayib Bukkele for example is incredibly popular after taking on the local gangs and making his country safer. Polls at and won his re-election by around 85%, yet here come articles and politicians declaring him an \"authoritarian\" because he is not progressive and takes on crime.\n\n...\n\n> \"Democracy\" itself is not inherently good, it can also be tyranny by majority.\n\nThose thoughts seem to be in conflict with each other.",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GameEnders10",
                            "body": "How so? Democracy at one time enslaved black people in this country, majority were not against. Targeted gays. It can be bad.\n\nDemocracy just means majority. If El Salvador appreciated a hard crackdown on gangs, and post doing so he's perhaps the most popular leader in El Salvador that doesn't make him authoritarian. He's doing democracy as well, but to better ends in my opinion, making his country safer.\n\nMy point being the far left people I am referencing don't really mean other countries are \"moving away from democracy\". They are often democratic. All these articles written about Nayib's crackdown and election being undemocratic, politicians like Omar and the State Department being concerned. The local citizens love him. It is very democratic, they just don't like him doing the opposite of what they want.\n\nOr Russia for example. Putin was re-elected by a good margin. His popularity is higher after the Ukraine war, even liberal parties in Russia are very against our NATO expansion up to Russia. They call that \"harming democracy\" or whatever, which just means its something they don't like even though it is democracy.\n\nSource Putin popularity higher after war started: [https://www.bloomberg.com/news/articles/2022-03-31/russians-embrace-putin-s-ukraine-war-as-kremlin-muzzles-dissent](https://www.bloomberg.com/news/articles/2022-03-31/russians-embrace-putin-s-ukraine-war-as-kremlin-muzzles-dissent)",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SLum87",
                                    "body": "Russia is a horrible example. Putin often uses elections as a facade to project legitimacy, with the results being a foregone conclusion. Anyone who could legitimately challenge Putin will be either disqualified, thrown in jail, or killed. He also maintains complete control over the Russian media landscape, and any dissent could be punished with jail time or death, depending on how politically consequential it is. Just because a country holds elections does not mean it is a Democracy    \nhttps://www.reuters.com/world/europe/would-be-putin-challenger-duntsova-barred-running-election-campaign-team-2023-12-23/  \nhttps://www.cnn.com/2024/02/08/europe/russia-nadezhdin-election-candidate-disqualified-intl/index.html.   \nhttps://www.msn.com/en-gb/news/us/the-russian-opposition-just-lost-its-brightest-star-what-does-it-do-now/ar-BB1iuG89",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GameEnders10",
                                            "body": "Look, multiple things could be true at once. Russia has a terrible history of leaders being much worse than Putin, can feel they got the short end of the stick after cold war negotiations like Putin. They still allow opposition, there's liberal parties in Russia, anti government famous rock bands. I agree though and go too far and the government or people of power will take care of you.\n\nAll that can be true, but these polls/surveys don't just come from Russian media. For example here is a UofC survey showing Putin with high support:\n\nhttps://www.usnews.com/news/best-countries/articles/2024-01-09/poll-russians-still-like-putin-and-back-the-ukraine-war",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SLum87",
                                                    "body": "Your point was that Democracies will do things that more liberal-leaning people will disagree with, but that's just how Democracy works sometimes. Russia, though, is absolutely not a Democracy. The elections are a sham, and any meaningful political opposition is immediately squashed. If the Russian people suddenly decided they didn't support Putin's war and wanted him out, they wouldn't be able to vote him out in the next election. It would require a bloody revolution to force him out, and that's not how Democracies work.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "GameEnders10",
                                                            "body": "Sure, if the people decided they didn't want Putin and he was installed anyways, that would not be a democracy.\n\nHowever, they do. Even foreign surveys support this, not just Russia, Putin has a high approval rating. So it's a democracy. Call it authoritarian but democratic authoritarianism if you want, but still the people support their leader and enough of his agenda to prefer him.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[removed]",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "unkz",
                                                                            "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                                                            "score": 2
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "[deleted]",
                                                                            "body": "[removed]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "SLum87",
                                                                                    "body": "Why do you say North Korean elections are a sham? If someone could poll a large enough sample of North Korean people, and the results showed a majority approval for the ruling party, would you consider it a Democracy?",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "GameEnders10",
                                                                                            "body": "If it was an honest survey from the west or independent country then sure. Will of the people. I don't know that those are possible in NK so unknown.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "[deleted]",
                                                                                                    "body": "[removed]",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "unkz",
                                                                                                            "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "unkz",
                                                                                    "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "Most of this is covered by the sources in your previous comment, but the last paragraph seems to lack sourcing. Would you please add it?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "confusedndfrustrated",
                                            "body": "Is it really necessary to add references to everything? is it possible that the content in the references is misleading?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "nosecohn",
                                                    "body": "> Is it really necessary to add references to everything?\n\nYes. [Rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_rule_2.3A_source_your_facts) is \"the core of our commitment to fact-based discourse.\" It's one of the main reasons this subreddit exists.\n\n> is it possible that the content in the references is misleading?\n\nSure, but dubious sources should be countered with more reliable ones.",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "confusedndfrustrated",
                                                            "body": "What if I want to share my opinion?",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "nosecohn",
                                                                    "body": "You may share your opinion, so long as it's substantive, includes context, and doesn't make any factual assertions without supporting sources.\n\nFor instance, [the comment above](https://www.reddit.com/r/NeutralPolitics/comments/1avg629/have_nations_around_the_world_been_moving_away/krc5ji3/) that started this exchange includes the opinion that democracy can be bad, and explains the types of cases where that is the case.\n\nIf that were posted on its own, the mods wouldn't remove it under Rule 3, because it's not a hot take, bare expression of opinion without context, joke, meme, or off-topic reply. And if it doesn't make any factual claims, we wouldn't remove it under Rule 2.\n\nFor those who are curious, you can read more about [the four rules of commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) in this subreddit. They're not complicated, but they're also not common for internet discussions.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "confusedndfrustrated",
                                                                            "body": "Thank you.",
                                                                            "score": 3
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[deleted]",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "nosecohn",
                                                                            "body": "We kindly ask that you not make more work for the moderators. If you know your comment is going to get removed, please just don't post it.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "confusedndfrustrated",
                                                                                    "body": "Some opinions come from personal experience and not everyone writes a book or blog to provide/create references. If personal experiences are not allowed in a discussion forum, it is almost always going to make more work for the moderator.   \nIn other words - \"Unfortunately that rule 2 will always make more work for the moderators, whether they want it or not.\"",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "nosecohn",
                                                                                            "body": "All I'm asking in response to the user above is that people not post stuff they know is going to get removed. It's like littering when you know some volunteer has to pick up the trash.\n\n> rule 2 will always make more work for the moderators\n\nThere's no denying that. This subreddit relies on heavy moderation, as explained in [our origin story.](https://www.reddit.com/r/NeutralPolitics/comments/4cxvz1/meta_neutralpolitics_origins_and_purpose/)",
                                                                                            "score": 6
                                                                                        },
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Sepulchh",
                                                                                            "body": ">Some opinions come from personal experience and not everyone writes a book or blog to provide/create references. If personal experiences are not allowed in a discussion forum, it is almost always going to make more work for the moderator.\n\n\"There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\" - Rule 2\n\nPersonal experiences in isolation are almost always anecdotal, unless in relation to how an institution or law works and/or is applied.",
                                                                                            "score": 3,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "confusedndfrustrated",
                                                                                                    "body": "Thanks. Goes a long way to explain why moderates are disappearing from both sides. Just in case you don't know..\n\nThere is a concept called as discussion and exchange of ideas before people reach an agreement/middle ground to form a law. And none of this happens in isolation.\n\nNot as neutral platform as I assumed.  \nLeaving the sub... Good Luck\n\nEdit:\n\nI am not against rule,  nor am I saying references are not important, so don't think I am don't like the source rule. I love it. I just don't like the fact that it stifle's people's voice and stops people from sharing their thoughts or occasionally compels the moderators to remove authentic comments to comply with dogmatic rules.",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "GameEnders10",
                                            "body": "The last paragraph I reread, and it's just a summarization and conclusion based on the sources and information above the last paragraph.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "themarquetsquare",
                                    "body": ">Democracy just means majority.\n\nWrong. This is the very narrow definition and not the common parlance (and please don't go quoting the dictionary now). There is a scale that starts there, true, but in its common usage a true democracy comprehends a lot more than that.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "themarquetsquare",
                                                    "body": ">So you're saying the democracy definition needs to be exactly as western minds and governments define it, even if the will of the majority of the people in that country don't support that definition\n\nHuh? What do you mean, supporting a definition? *Words mean things.* I mean, I'm sure you can the meaning of the word 'democracy' up to a vote 'by the people' or something but that... doesn't actually change the meaning of the word 'democracy' into 'ruling by decree is now also democracy' (no matter what North Korea tries to tell you).\n\nDemocracy is a scale, sure - there are stronger and weaker democracies, and people argue about what is more or less democratic continuously. But at its core it means the power lies with the people. What these guys are doing is trying to get the power to be with them and theirs, only.\n\n>they vote for leaders who lead different than we expect it's anti democracy\n\nNo. Again, no. It is not 'lead different than we expect'. It is very specific. Like, Orban took steps to curtail freedom of speech *for everyone*, for example [by putting large fines on 'objectionable content'](https://www.spiegel.de/international/europe/media-law-outrage-hungary-s-orbanization-is-worrying-europe-a-736706.html) which is very vague and determined by a committee directed by Orban.\n\nSuch a measure is, by its very nature, undemocratic. - it takes the power to protest, discuss and engage in politics away from the people. These things are exactly why everyone is always so up in arms about freedom of speech. This is **actual, real censorship** - by a government and everything. Like, 100% that.\n\nMore importantly, Orban [has been governing by decree](https://www.state.gov/reports/2023-investment-climate-statements/hungary/) - meaning, bypassing parliament - since november 2020 (first because covid, then the war, then...who knows) and it's [recently been extended to 2024](https://dailynewshungary.com/the-hungarian-government-has-extended-state-of-emergency-and-compulsary-action/). That's not 'different'. That is plain undemocratic. That is ignoring the rule of law and taking the power to do whatever he wants.\n\nYes, a majority of people can vote in a leader or leaders who then lead undemocratically - it happens all the time. The important question is: is it guaranteed the people can freely and openly campaign and elect someone else if they want to vote them out again?\n\nOh, also: republics have nothing to do with anything. I live in a constitutional monarchy with plenty checks and balances. Different thing altogether. It's the 'constitutional' that matters, not whose face is next to the flag.\n\n([Here you go with sources](https://theconversation.com/how-viktor-orban-degraded-hungarys-weak-democracy-109046), if you need some, so that answers your other question. Quite a few of them here, though they're... not hard to find.)",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[removed]",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[removed]",
                                                                    "score": 6
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "nosecohn",
                                                                    "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\n\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\n\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "nosecohn",
                                                    "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\n\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\n\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "solid_reign",
                            "body": "> Those thoughts seem to be in conflict with each other.\n\nNo it's not.  Democracy isn't \"better\" or \"more fair\", it's the rule of the majority.  Commonly, \"Republic\" is used to add \"protection of the minority\".  But if the majority wants a regime that is anti-people will red hair, and wants to jail all of them, that would still be a Democracy.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GameEnders10",
                                    "body": "Exactly, great summary.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Mellemhunden",
                                    "body": "When is republic ever used in that way?  Republic just.means the head of state is elected by some part of the public.\n\n\nhttps://www.merriam-webster.com/dictionary/republic",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gnarlodious",
            "body": "The built-in weakness of Democracy: https://en.wikipedia.org/wiki/Paradox_of_tolerance",
            "score": 3
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krc8iu5/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krbjti8/) so that we can reinstate it.\r\n\r\nThis comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krcp3do/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krckdxx/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krq199r/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "No-Dragonfruit4014",
            "body": "Sometimes it feels like democracies unravel because a tiny group wants to grab all the power, but other times it's not that straightforward. It's kinda like a mix of everything going sideways - from people not seeing eye to eye, to leaders playing dirty, and even other countries sticking their noses in. So, it's a bit of this, a bit of that - a whole stew of issues making things tough for democracies to stay on track.\n https://freedomhouse.org/article/new-report-authoritarian-rule-challenging-democracy-dominant-global-model",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1avg629/-/krzg0f6/) so that we can reinstate it.\n\nThis comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\n\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\n\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        }
    ]
}