{
    "title": "Where is the Wagner Group today? What role do they play in the Ukrainian war if any post-Prigozhin?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \n\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\n\n1. Be courteous to other users.\n1. Source your facts.\n1. Be substantive.\n1. Address the arguments, not the person.\n\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\n\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.\n\n----\n\n*Note: By the submitter's request, the pre-approval interaction with the moderator is being left in the comments for public viewing.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zombo_pig",
            "body": "I'm going to limit my comments to Wagner *in Ukraine*. [Here's a link to an article on Wagner in Africa post-Prigozhin.](https://www.bloomberg.com/news/articles/2024-01-30/russia-recruiting-africa-army-to-replace-wagner-group?srnd=politics-vp) This may already be a rambling comment; it's a rambling, sprawling topic. I also don't deserve to be the spokesperson on this topic ... but everything else got deleted and I think I can do well enough.\n\nIn Ukraine, [Wagner was officially disbanded.](https://time.com/6290536/russia-wagner-group-disbanded-ukraine/) Members were given the choice of voluntarily moving to other units or move to Belaruse, which was ultimately the same choice but more circuitous. When Wagner were integrated into the Russian army, every assault-capable Russian force was ground down and portions of Wagner had just engaged in history's weirdest mutiny. There were various reasons Wagner was broken apart. So Wagner soldiers ended up all over. Many joined similar groups and there are example of veteran status being leveraged – placement also wasn't purely random. For example, the 'Kamerton' unit of the 'Akhmat Special Forces' somewhat recently fought around the flanks of Bakhmut and is reportedly mostly ex-Wagner. In Avdiivka, the 115th Special Brigade of the Rosgvardia was active, which included many former Wagnerites. There are examples of Wagner veterans of Bakhmut assault squads being given non-Wagner assault squad leadership like was seen in attacks around the Sand Quarry in Avdiivka. Other times, it's totally piecemeal. The Russian military obviously doesn't post its composition publicly, so this is sourced from Telegram channels. Take it with a grain of salt and know it's an anecdotal look at where these soldiers went post-Wagner ... and through a very opaque outside vantage.\n\nSo anyway, no more Wagner. But I think it's worth asking what about Wagner remains beyond the individuals scattered throughout the Russian armed forces. I would lump that response into three parts: 1) PMCs, 2) Wagner's recruiting methodologies, 3) The Wagner assault model as seen in Bakhmut, etc..\n\nSo, PMCs. Wagner was different from other PMCs – it may not be helpful to ask if there are other Wagners out there. Three things happened to make them special. 1) The Russian army failed to break through Ukrainian lines in the Donbas, 2) [Wagner succeeded in Popasna with a paltry 2,000 soldiers in May, 2022,](https://www.newyorker.com/magazine/2023/08/07/inside-the-wagner-uprising) and 3) Prigozhnin leveraged that success into a \"pitch\" of sorts: give me disposable people from prisons and I will repeat Popasna elsewhere. So Wagner was enlarged in Summer, 2022. [By June, 2022, Prigozhin was claiming 25,000 soldiers.](https://www.bbc.co.uk/news/world-europe-66005256) This was Prigozhin's bid to control a private army that could serve as the 'assault engine' of the Russian armed forces, creating breakthroughs and meeting strategic goals while regular Russian forces essentially held ground. This size, role, support were completely unique and not representative of Russian PMCs. The concept was then [tested at Bakhmut](https://www.aljazeera.com/news/2023/5/25/wagner-chief-says-20000-of-its-troops-killed-in-bakhmut-battle) and resulted in the infamous kerfuffle of underperformance and MoD rivalries. Afterwards, there was a reshuffling of how PMCs relate to the invasion of Ukraine. They do exist after Prigozhin's death. For example, [a former Wagner commander founded a PMC named \"Convoy\".](https://meduza.io/en/feature/2023/03/26/armed-to-the-teeth) Gazprom (yeah, *that* Gazprom) has a PMC that's, on paper, supposed to defend gas interests, but now has a unit in Ukraine. But these units are relatively small and always subservient to the MoD. First, soldiers [now sign contracts with both the PMC and the MoD.](https://www.reuters.com/world/europe/putin-backs-push-mercenary-groups-sign-contracts-despite-wagners-refusal-2023-06-13/) Secondly, equipment and supplies are used as leverage over the groups. Finally, they are structured inside of larger Russian formations with limited autonomy. Redut Galaxy is a PMC living under the 1st Division in a recon role. Interestingly, they have responsibilities around recruitment at a higher level than they operate militarily – so much so that [RFE has called them a \"fake PMC\".](https://www.rferl.org/a/russia-ukraine-redut-fake-pmc/32651874.html) So we won't be seeing another Wagner in Ukraine, but Russia still sees value in PMCs: not only can it farm out recruitment, but PMC deaths are not counted, and their participation gives combat experience to PMCs that may have a role abroad, etc.. But for now, in Ukraine, PMCs are being tucked neatly under the MoD.\n\nThe Wagner recruitment model is clearly losing steam, though. Although Wagner advertised all over (on [Pornhub](https://www.rferl.org/a/russia-pornhub-wagner-recruiting-ukraine-war/32321052.html) in [schools,](https://www.vox.com/world-politics/2023/3/21/23622615/ukraine-war-bakhmut-wagner-group-russia) bilboards, etc.) the bulk of Wagner at its height and for its main purpose [came from prisons.](https://www.bbc.com/news/world-europe-62911618) The low hanging fruit on that tree has obviously been picked – Russia isn't creating enough criminals who would like to go to Ukraine to keep pace with need, even though [the practice continues with the Russian army.](https://www.bbc.com/news/world-europe-67175566)\n\nThe type of assault that Russia is leaning into (see: Avdiivka vs. Vuhledar) was popularized at Bakhmut. Russia is only able to effectively take land without catastrophic loss (in the immediate sense – there's discussion to be had about dwindling stockpiles of refurbishable equipment) is based on small group infantry \"reconnaissance in force\" assaults, with tanks, IFVs, etc. used for support rather than the traditional massed breaching role. Russia opens a single focused area of battle at a salient (e.g. Bakhmut, Avdiivka, now likely Robotyne) and it is hammered with indirect fire (now including glide bombs) while Russian infantry die in droves to eventually create a strategically-marginal, usually symbolic victory. Assuming the point is greater than symbolism, I would suggest that the hope is to create an unsustainable long-term situation for Ukraine's defenders, and/or create propaganda points for internal consumption (upcoming Russian \"election\") and external propaganda (wear down Ukrainian support). By all accounts, [Russia has no path to victory in the immediate future without Ukraine's foreign backing falling to pieces.](https://www.wsj.com/world/ukraines-military-spy-chief-says-russia-will-struggle-to-keep-up-the-fight-c6a5b2c5) But Russia is hammering on Ukraine's [manpower weaknesses,](https://www.cnn.com/2024/02/21/europe/ukraine-tough-choices-mobilization-intl-cmd/index.html) and ongoing ammunition shortages.\n\nSo, Wagner is gone but lives on in some ways.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "Hi there /u/TurtleBlaster5678. I'm a mod in /r/NeutralPolitics.\n\nThis is an interesting topic, but the post itself would need some editing to comply with our [submission rules.](http://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_submission_rules) Let me know if you'd be interested in doing that and I can make some suggestions.\n\n----\n\n*Note: Interactions with the moderator(s) will be removed prior to the post being approved, unless you request they be made public. Submissions that remain insufficiently modified after 24 hours may be removed or resubmitted by a moderator in an edited form.*",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "TurtleBlaster5678",
                    "body": "Hi u/nosecohn of course! Happy to edit. \n\nWhat can I do to help?",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "Great! Let's go through it...\n\n> Yevgeny Prigozhin was assassinated by Vladimir Putin\n\nThe linked article doesn't support this claim. In fact, it says:\n\n> The Kremlin has denied it was behind the crash, rejecting widespread speculation that the it was a revenge assassination for Prigozhin’s short-lived mutiny in late June\n\nSo, you could find another source to support the widespread supposition that it was an assassination, or you could just leave out that part of the claim, since it's not entirely relevant to your question. It's your choice. [EDIT: There's a reference to assassination later in the submission that needs similar attention.]\n\n> Since then, very little has been heard about of the Wagner Group in terms of their ongoing involvement in the Ukrainian-Russian war.\n\nIt's difficult to say what has or hasn't been heard by people, especially in a global forum where claims require evidence. I suggest eliminating this.\n\nThe other premise about Africa is good, as are all the questions except the last one:\n\n> Do they still exist at all?\n\nThis can be easily answered with a web search, so you can eliminate it.\n\nWith those three changes, you'll be good to go. Just reply here if you have any questions.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TurtleBlaster5678",
                                    "body": "If the threshold for proof that Prigpzhin was assassinated is the Kremlin admitting to it, then it’s impossible to make that claim.\n\nTherefore, here’s how I’ve edited it, let me know what you think:\n\n* I have adjusted any mentions of assassinations to just “mysterious circumstances”\n* I have removed the line about there being very little mention\n* I have removed the final question about whether they exist at all\n\nIs that sufficient or are there any other changes you suggest?\n\nIf so, I’d like to also request we keep this thread when the post gets posted, per the rules. I believe there’s value in a potential community conversation around what sufficient evidence looks like re, the first point as there are situations where pure 100% proof relies on political actors acting strongly against their self-interest.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nosecohn",
                                            "body": "Yes, that's great. Thank you for those edits.\n\n> If the threshold for proof that Prigpzhin was assassinated is the Kremlin admitting to it, then it’s impossible to make that claim.\n\n> there are situations where pure 100% proof relies on political actors acting strongly against their self-interest.\n\nPlease note that nowhere above did I request \"proof,\" 100% or otherwise, that \"Prigozhin was assassinated by Vladimir Putin.\" I only asked that if you were going to leave the claim in, you provide a \"source to support the widespread supposition\" of such, because the included source did not. Something like either of these would have been adequate:\n\n* [Prigozhin’s Plane Was Targeted By Russia’s Intelligence Agency, Report Says](https://www.forbes.com/sites/siladityaray/2023/08/24/prigozhins-plane-was-targeted-by-russias-intelligence-agency-report-says/?sh=506ea1d6c49f)\n* [How Wagner chief Yevgeny Prigozhin’s death was ‘orchestrated by Putin’s oldest ally’](https://www.independent.co.uk/news/world/europe/russia-ukraine-prigozhin-putin-wagner-b2469030.html)\n\nAnyway, the submission now complies with our rules and I'm happy to approve it. Please confirm that you still want  to include this full exchange.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TurtleBlaster5678",
                                                    "body": "Perfect. Let’s keep the exchange up. \n\nThanks for walking me through the edits!",
                                                    "score": 12
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1aq20tl/-/kqfu9aw/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1aq20tl/-/kqgn6sm/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        }
    ]
}