{
    "title": "How does a House makeup of 217 to 213 Equal a One-Vote Majority for Republicans?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DBH114",
            "body": "Because with a 217(R)/213(D) split there will be 430 voting members of the House. To have a majority of the vote you will need 216 votes. So the R's will have a one vote majority.",
            "score": 252,
            "replies": [
                {
                    "depth": 1,
                    "author": "Soccham",
                    "body": "Should be thought of as “majority + 1”",
                    "score": 99,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "The_Real_Mr_F",
                            "body": "Yes! If one seat flips, it would be 216/214 and the Republicans would still have a majority. Would you call this a “zero vote” majority?",
                            "score": 59,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "EchoRex",
                                    "body": "Yes?\n\nThey can lose zero votes to maintain majority.",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "The_Real_Mr_F",
                                            "body": "That’s still an odd, unintuitive way to phrase it",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "bappypawedotter",
                                                    "body": "Yeah, it's a term that staffers on the hill used that got out but wasn't intended for the general public.",
                                                    "score": 14
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "mkhlyz",
                                                    "body": "Senate Dems between Jan 2021 and the Georgia run-off——50-50 but majority b/c of VP Harris’ tiebreaker",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EchoRex",
                            "body": "Should be thought of as a one vote majority.\n\nAs in they can lose one vote from their block and still have a majority.",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hryipcdxeoyqufcc",
                    "body": "At 217-213, it takes FOUR Republicans to abstain (213-213) or TWO Republicans to flip (215-215) for a measure to fail. ABC is using the latter scenario when they say Republicans can afford to lose up to one vote (via flip) and still force any bill through.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "The_Denver_D",
                    "body": "This is the best answer",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "Nu11u5",
            "body": "If one seat flips it becomes 216-214, still a majority.\n\nIf two seats flip it becomes 215-215, no longer a majority.  Though a vote along party lines would be tied ~~and settled by the speaker.~~\n\nIt's a very specific scenario where all representatives are present to vote and no one abstains, ~~and ignores the role of the speaker.~~",
            "score": 172,
            "replies": [
                {
                    "depth": 1,
                    "author": "Raybo58",
                    "body": "Okay, that makes sense, but feels like strange phrasing. The article phrased it as the one-vote majority existing at the point after Gallagher leaves with the majority of 217. Which seems like a 4 vote advantage to me.   \n\n\nAxios says the same and explains that when this 217 number becomes official, Republicans will only be able to lose one vote for anything they want to pass. But they still have 4 more seats than the Dems at 217. This is what confuses me.  \nhttps://www.axios.com/2024/03/22/house-republicans-mike-gallagher-resign",
                    "score": 49,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "You're right that the phrasing is confusing.\n\nOn the \"4 more seats\" question, the assumption is that we're counting hypothetical defections, not abstentions or absences, so each Republican who switches their vote to side with the Democrats represents a two-vote swing: one less R and one more D.",
                            "score": 42,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Raybo58",
                                    "body": "Yes. It makes sense if you're talking about future PARTY defections to the other side where they officially become members. But the way Axious and several others I've read phrase it is that the 217/213 ratio makes it so R's can only afford to lose one vote on any bill they want to pass or it will fail...\n\n\"Republicans will be able to afford just one defection on any party-line vote when Gallagher leaves — any more would cause a bill to fail.\"\n\nSo the math I'm doing in my head says that the bill would fail with a vote of 216 to 214.\n\nEDIT: Never mind. I get it now. It passes if they have one defection. Any more than one and it fails.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lorberry",
                                            "body": "They can *afford to* lose one vote, or in more verbose terms, a single vote switching sides still leaves them with a majority, so they can lose that vote without any negative consequences (from their perspective, of course).\n\nThey ***cannot*** *afford to* lose two (or more) votes, since that would end in a 50/50 split.",
                                            "score": 12
                                        },
                                        {
                                            "depth": 4,
                                            "author": "captaincarot",
                                            "body": "You know they do not have to leave the party to vote against a party bill right?  Like, you can be a republican and vote against a republican measure and still be a republican.  The one vote means that if Republicans bring forth something to vote on, if 1 republican and all dems vote against it, but every other republican voted for it, it will still pass.  If 2 R vote against it and all Dems do, it fails because it is a tie.  This is why the speaker is such an influential person.  If they know a few people in their party are going to vote against their party's measure, they just do not bring it to a vote.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Totally_Not_My_50th_",
                                                    "body": "> Like, you can be a republican and vote against a republican measure and still be a republican\n\nI mean, that used to be the case. Nowadays if you don't follow along with whatever they say you're likely to get bounced. Just look at what happens to Republicans who don't follow along with the \"wE cAn PrOvE tHe ElEcTiOn Is RiGgEd BuT mY dOg AtE tHe EvIdEnCe\" dumbassery.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "nosecohn",
                                            "body": "Right. You got it on the edit.\n\nThe way the media is phrasing it makes it sound more dramatic.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "supaspike",
                                            "body": "Better phrasing would probably be to say that Republicans have one vote of leeway or a one-vote margin-of-error. Basically, they can afford to have only one vote from their majority go against them and their item would still pass. I agree with you that it is confusing the way it is phrased.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "bullevard",
                                            "body": ">  So the math I'm doing in my head says that the bill would fail with a vote of 216 to 214. \n\n\n Party line is 217 to 213 \n\n\n One defection is 216 to 214 \n\n\n Two defections is 215 to 2015.\n\n\n \"Defection\" implies that the member disagrees with the party and votes the other way.\n\n\nYou might be confused because you are thinking of the republicans voting against something. But since they have the speakership, basically the only bills that will get a vote are ones they are hoping to pass.\n\n\nSo the articles are treating it as 216 to 214 is to attempt to pass a bill and 215 to 215 fails to pass that bill.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "extrakrizzle",
                            "body": "Functionally, it doesn't matter once you start walking through the actual mechanics of a vote.\n\n* Almost all bills are won by simple majority. Winning by 1 vote, 4 votes, or 40 votes are all mechanically the same (though arguably subjectively different in terms of optics/spin).\n* The GOP controls the majority, and therefore the speakership. The speaker sets the agenda and decides what bills to bring to the floor for a vote.\n* Aside from a couple niche exceptions, that means the GOP has the power to only vote on bills it wants to pass — it's pretty rare to see a majority put up a bill they *don't* want to pass, unless they are absolutely sure it will fail anyway.\n\nThey only need to win by 1, so the relevant question isn't \"how many more votes do they have in absolute terms?\" It is: \"how close are they to *not* being able to win by 1 anymore?\" \n\nA single flip from yes to no actually shifts the tally by 2, since you're subtracting from one side and adding to the other. So a 4-seat majority actually results in a tie if just 2 republicans vote no. Leaving 1 vote as the only thing they can afford to lose and still mathematically be able to win by at least 1.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "My big question stemming from all this is how it would affect a motion to vacate. Is my thinking correct that if it comes up for a vote and just five Republicans abstain or vote for someone other than Johnson, Hakeem Jeffries could theoretically end up as Speaker?",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Big-Willingness3384",
                            "body": "There are 430 voting members of the House.  The majority in voting isn't dependent on Party.  If a simple majority is required to pass a bill, that means one more vote than 215, regardless of party affiliations.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Rarvyn",
                    "body": "There’s no tiebreakers in the house. Speaker gets a vote same as anyone else, and if it ties the measure fails.",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "i_want_batteries",
                            "body": "Only if the speaker is also a member ",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ezrs158",
                                    "body": "True! There's never been a Speaker who has not also been a House member, but it's constitutionally allowed.",
                                    "score": 7
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WristbandYang",
                    "body": "Exactly this. If more than one person in the majority doesn’t approve, it will fail.\n\nEssentially, they have a one vote of leeway.",
                    "score": 33
                },
                {
                    "depth": 1,
                    "author": "Churnsbutter",
                    "body": "The Speaker isn’t counted in the 217-213?",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "Yes, the speaker is counted. He gets one vote, just like [every other member.](https://en.wikipedia.org/wiki/List_of_current_members_of_the_United_States_House_of_Representatives)",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nevermind04",
                                    "body": "It is not a requirement that the speaker is a member, and in the event that the majority party selects a speaker that isn't a member, that speaker will not get a vote.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nosecohn",
                                            "body": "Though correct, please link to a source for this.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Nevermind04",
                                                    "body": "I'm sure you'll appreciate that it's exceptionally difficult to source a something that could theoretically happen but never has. Anyway, here's an article on the subject which includes a citation from Article 1, Section 2 of the constitution and a quote from the House Historian, which is endorsed by the Clerk of the House:\n\nhttps://www.nbcnews.com/politics/congress/can-outsider-be-speaker-house-n441926\n\n>The Constitution is silent on that question, saying simply, \"The House of Representatives shall chuse (sic) their Speaker and other Officers.\"\n\n>The Clerk of the House agrees with the office of the House Historian, which says the speaker \"has always been (but is not required to be) a House Member.\"\n\nAs for a speaker chosen in this way not being able to vote, I cite Article 1, Section 2 of the constitution which details how members are chosen. If a person is not a member of the house, being selected as speaker would not fulfill the constitutional requirements for becoming a member of the House, therefore it stands to reason they would also not receive any of the privileges of membership such as voting.\n\n>The House of Representatives shall be composed of Members chosen every second Year by the People of the several States, and the Electors in each State shall have the Qualifications requisite for Electors of the most numerous Branch of the State Legislature.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "nosecohn",
                                                            "body": "Thank you. I was actually only looking for a source on the first part, that the Speaker doesn't have to be a member, but we appreciate you going the extra mile.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Nevermind04",
                                                                    "body": "No worries man, I live for the \"but what if\" discussions about our laws.",
                                                                    "score": 4
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1brnovs/-/kxbzuxy/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "itsthebeans",
            "body": "I think what they mean is that they could only afford to lose one Republican vote and maintain the majority. But it seems like a poor way to phrase it",
            "score": 34
        },
        {
            "depth": 0,
            "author": "sciguyCO",
            "body": "A bill (or other House resolution) requires a majority of votes cast in order to pass: https://www.house.gov/the-house-explained/the-legislative-process#:~:text=If%20the%20bill%20passes%20by,of%20100)%20passes%20the%20bill.\n\nA tied vote is not a majority, and there’s currently a reduced number of people casting votes. So say something is put up for a vote expecting full Democrat opposition and full Republican support. If one Republican switches from “yes” to “no”, then it still passes 216 to 214. If *two* switch then it’s 215 to 215 and does not pass. \n\nSo it’s not exactly that it’s a one vote majority. It’s more like a one **voter** majority, if that distinction makes sense. And absences or abstentions adjust the math a bit more.",
            "score": 20
        },
        {
            "depth": 0,
            "author": "Borne2Run",
            "body": "It also means that if a Republican is on vacation or in the hospital then the majority vote gets shorter",
            "score": 9
        },
        {
            "depth": 0,
            "author": "jadnich",
            "body": "It means they can’t lose more than one vote. They can lose one and it could be 216 to 214, but if they lose two and it is 215 to 215, most bills require 50% plus 1 to pass. \n\nA bill fails if two or more switch sides. But three majority party voters can abstain and the vote will still pass.\n\nhttps://www.house.gov/the-house-explained/the-legislative-process#:~:text=If%20the%20bill%20passes%20by,of%20100)%20passes%20the%20bill.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1
        },
        {
            "depth": 0,
            "author": "orion3999",
            "body": "Aren’t there independents in the house? Meaning that 3 of the 217 are not republicans or democrats.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "There are no independents in the House this session. All [current members](https://pressgallery.house.gov/member-data/party-breakdown) are either Democrats or Republicans.",
                    "score": 6
                }
            ]
        }
    ]
}