{
    "title": "What actually changed upon passage of CA SB14?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BoredAccountant",
            "body": "https://sr12.senate.ca.gov/sites/sr12.senate.ca.gov/files/SB%252014%2520Fact%2520Sheet%2520Final.pdf\n\nCA SB 14 didn't change the law defining what trafficking of a minor is, it changed the seriousness of the crime from being a \"non-serious crime\" to a \"serious felony\", which would make it eligible to count towards California's Three Strikes provisions.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "sephstorm",
                    "body": "So were the modifications that Democrats supposedly added in left in? Because I see no mention of any of them in the final bill or law.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "The [last analysis by the legislature](https://leginfo.legislature.ca.gov/faces/billAnalysisClient.xhtml?bill_id=202320240SB14#) before passage says that the bill:\n\n\n> 1) Adds human trafficking of a minor for purposes of a commercial sex act to the list of serious felonies, except where a person who committed the offense was a victim of human sex trafficking at the time of the offense and the offense did not involve force, fear, fraud, deceit, coercion, violence, duress, menace, or threat of injury.\n> \n> 2) Amends the statutory lock-in date for the Three Strikes Law to January 1, 2024 in order to make human trafficking of a minor for purposes of a commercial sex act a strike.\n\nThe LEGISLATIVE COUNSEL'S DIGEST section at the top of [the bill itself](https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240SB14) confirms that's all it does:\n\n> This bill would include human trafficking of a minor within the definition of a serious felony for all purposes, including for purposes of the Three Strikes Law, except as specified.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "sephstorm",
                    "body": "How interesting. If true it sounds like all the amendments were pulled. If they existed at all. Looking at the comparison of the versions of the bill I can find no reference to the changes claimed by the articles. It seems all of the changes for the most part were in Section 1 which I consider the preamble.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "I think these might be separate bills, or at least separate legislative actions.\n\nThe CBS article you linked to with complaints by the bill's author is from a couple weeks ago, but the legislation referred to above was signed by the Governor and enacted seven months before that. It seems like the more recent action is about solicitation, not trafficking.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1
        }
    ]
}