{
    "title": "Have any U.S. states successfully implemented evidence-based policies around transgender health?",
    "comments": [
        {
            "depth": 0,
            "author": "anarchakat",
            "body": "I absolutely don't have time to individually review the studies methodology in the Cornell link below - but I trust that the conclusions drawn are trustworthy.  \n\n\n>**Overview**  \nWe conducted a systematic literature review of all peer-reviewed articles published in English between 1991 and June 2017 that assess the effect of gender transition on transgender well-being. We identified 55 studies that consist of primary research on this topic, of which 51 (93%) found that gender transition improves the overall well-being of transgender people, while 4 (7%) report mixed or null findings. We found no studies concluding that gender transition causes overall harm. As an added resource, we separately include 17 additional studies that consist of literature reviews and practitioner guidelines.  \n**Bottom Line**  \nThis search found a robust international consensus in the peer-reviewed literature that gender transition, including medical treatments such as hormone therapy and surgeries, improves the overall well-being of transgender individuals. The literature also indicates that greater availability of medical and social support for gender transition contributes to better quality of life for those who identify as transgender.  \n\n\n[https://whatweknow.inequality.cornell.edu/topics/lgbt-equality/what-does-the-scholarly-research-say-about-the-well-being-of-transgender-people/](https://whatweknow.inequality.cornell.edu/topics/lgbt-equality/what-does-the-scholarly-research-say-about-the-well-being-of-transgender-people/)\n\n  \nI came out in 2004, and have known literally hundreds of transgender people throughout the last two decades. Every single person I have known has had their life greatly improved by access to care, and those who continued to suffer poor mental health outcomes either had additional mental health diagnoses or experienced stress not because of the treatment they received, but the challenges of navigating social stigma and concrete material challenges as a result of their identity.   \n\n\nI want trans people to have access to the best possible care, and believe in clear, actionable diagnostic criteria to help avoid people receiving treatment who won't benefit from it. If you survey the words and legislature of those opposed to trans care, it becomes clearly evident that their concerns aren't rooted in an effort to create or improve best practices in order to support good outcomes for trans healthcare, it is instead rooted in an ideological position that trans people literally do not and can not exist, negating the need for treatment entirely. For example:  \n\n\n[https://www.theguardian.com/world/2023/sep/15/project-2025-policy-manifesto-lgbtq-rights](https://www.theguardian.com/world/2023/sep/15/project-2025-policy-manifesto-lgbtq-rights)  \n\n\nIn the 920 page conservative policy document at the heart of the current legislative battle over access to trans healthcare \"Mandate for Leadership: The Conservative Promise\":\n\n>Kevin Roberts, president of the Heritage Foundation, sets the tone with his introduction.  \nComplaining that in Biden’s America “children suffer the toxic normalisation of transgenderism with drag queens and pornography invading their school libraries”, Roberts writes: “Pornography, manifested today in the omnipresent propagation of transgender ideology and sexualisation of children … is not a political Gordian knot inextricably binding up disparate claims about free speech, property rights, sexual liberation, and child welfare. It has no claim to first amendment protection.”  \n\n\nNote that the authors do not speak of Transgender people, they speak only of \"Transgenderism\" or \"Transgender Ideology.\"   \n\n\nI came out before widespread access to trans healthcare was achieved, and largely had to find treatment by paying out of pocket. Despite the massive hardship that was normal for trans people seeking care at the time, that treatment that literally saved my life, and the lives of hundreds of people I have known for the last two decades.",
            "score": 73
        },
        {
            "depth": 0,
            "author": "Statman12",
            "body": "This is just a small note to correct a link. The below phrase in the opening post contains a link to an article from Lancet:\n\n> Scholarly studies have also repeatedly found associations between structural stigma, including restrictive policies, and poor mental health outcomes00312-2/fulltext) among LGBTQ+ folks.\n\nThe link contains a set of parentheses, and Markdown is a bit particular with those. The link below should direct readers to the appropriate article:\n\nhttps://www.thelancet.com/journals/lanpub/article/PIIS2468-2667(23)00312-2/fulltext",
            "score": 20
        },
        {
            "depth": 0,
            "author": "Ineludible_Ruin",
            "body": "Data that comes from studies that only went on for a few years really isn't that reliable. You need studies that have gone on for a decade or so. Furthermore, there are standards for a study itself to be considered a good study, and most barely meet it if even. Most of what you're reading from msm cites such studies typically and uses terms like \"study suggests\" quite often which is terrible. It's also so easy to manipulate data too. Lastly, in the last several years it's even been demonstrated that reputable journals have been fooled by already questionable studies like the dog rape culture study.\n\nhttps://www.nytimes.com/2018/10/04/arts/academic-journals-hoax.html",
            "score": 55,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "monotonyrenegade",
                    "body": "What are you talking about? Studies about trangender well-being related to transition have been going on for 30+ years  \n[https://whatweknow.inequality.cornell.edu/topics/lgbt-equality/what-does-the-scholarly-research-say-about-the-well-being-of-transgender-people/](https://whatweknow.inequality.cornell.edu/topics/lgbt-equality/what-does-the-scholarly-research-say-about-the-well-being-of-transgender-people/)",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "uiemad",
                            "body": "I haven't checked all the studies in your link to see their duration, but his point is that individual studies haven't gone on for 10 years+. Your link doesn't refute that and only says that various studies have been done during the past 30 years.",
                            "score": 42,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Interrophish",
                                    "body": "> but his point is that individual studies haven't gone on for 10 years+.\n\nHis point is wrong then, there's a handful that have. A quick google brought up at least two.    \nhttps://www.psychiatry.org/news-room/news-releases/study-finds-long-term-mental-health-benefits-of-ge  \nhttps://pubmed.ncbi.nlm.nih.gov/36149983/",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cutelyaware",
                                            "body": "It doesn't look that way to me. The study didn't follow anyone and didn't run for any appreciable time. What they did do was use Sweden's extensive medical records on all citizens to correlate gender incongruence with medical signs of outcomes from various treatments. Something you could never do in US states which is what OP was asking for. It is certainly a clever approach to compare historical medical data in this way. I agree that the findings seem rather positive, which is expected, however it also generated some criticism in the medical community regarding the statistical methods used. Specifically,\n\n* Concern 1: The analysis focused on mental health treatment utilization during one specific year (i.e., 2015) rather than during a longer follow-up period, such as before and after provision of gender-affirming treatment.\n* Concern 2: The study did not employ an adequate comparison group.\n* Concern 3: The study did not sufficiently highlight the elevated mental health care needs of transgender individuals seeking gender-affirming care during the perioperative period.\n\nHere is the actual study:\n\nhttps://ajp.psychiatryonline.org/doi/10.1176/appi.ajp.2019.19010080\n\nAnd here is the the response by the authors:\n\nhttps://ajp.psychiatryonline.org/doi/10.1176/appi.ajp.2020.20050599",
                                            "score": 40
                                        },
                                        {
                                            "depth": 4,
                                            "author": "undercooked_lasagna",
                                            "body": "> https://www.psychiatry.org/news-room/news-releases/study-finds-long-term-mental-health-benefits-of-ge\n\nThe mean age of participants in that study was 31.5 years old. Pushback against these treatments is against providing them to children. Even then, the results were far from any kind of revelation. In fact Sweden, where the study took place, has banned prescribing puberty blockers to children for gender dysphoria.\n\nhttps://segm.org/Sweden_ends_use_of_Dutch_protocol",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PennyPink4",
                                                    "body": ">The Society For Evidence-Based Gender Medicine (SEGM) is a non-profit organization that is known for its opposition to gender-affirming care for transgender youth and for engaging in political lobbying. \n\n>It is not officially recognized as a scientific organization by the international medical community.\n\n>r/neutralpolitics\n\nHmmmm",
                                                    "score": 10
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Interrophish",
                                                    "body": ">Pushback against these treatments is against providing them to children.\n\nNo, that's just step one. Step two is adults as well. https://apnews.com/article/florida-transgender-health-care-adults-e7ae55eec634923e6593a4c0685969b2",
                                                    "score": 13
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "uiemad",
                                            "body": "That's awesome! Thanks for the share.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "monotonyrenegade",
                                                    "body": "I don't why people are downvoting you. Redditors can be such blowhards sometimes",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "enzopetrozza",
                                                            "body": "Seems as though the source they are appreciative of is not a scientifically credible one",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Insanity_Pills",
                    "body": "bro what the fuck are you talking about? Phrases like “this study suggests” are the normal standard for academic papers like this. You NEVER want to make an absolute claim about something because you almost never know for sure. Any study that doesn’t use words like “suggests/implies/indicates” is extremely suspicious and probably wouldn’t even get published in a reputable journal.\n\nSo don’t say that the usage of the word “suggests” is terrible when, in fact, it’s the exact opposite.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ummmbacon",
                                    "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Interrophish",
                    "body": "> You need studies that have gone on for a decade or so. \n\ndid you check for them    \nhttps://www.psychiatry.org/news-room/news-releases/study-finds-long-term-mental-health-benefits-of-ge  \nhttps://pubmed.ncbi.nlm.nih.gov/36149983/",
                    "score": 12
                }
            ]
        },
        {
            "depth": 0,
            "author": "undercooked_lasagna",
            "body": "Are any states banning these treatments for adults, or just children? Because the evidence absolutely does not support giving them to children. Numerous European countries, including Sweden, Norway, and the UK, no longer allow hormone or surgical treatments on children, because there just isn't enough evidence to support it.\n \nhttps://www.forbes.com/sites/joshuacohen/2023/06/06/increasing-number-of-european-nations-adopt-a-more-cautious-approach-to-gender-affirming-care-among-minors/?sh=639b0a597efb\n\nhttps://segm.org/Sweden_ends_use_of_Dutch_protocol\n\nhttps://www.nhs.uk/conditions/gender-dysphoria/treatment/",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "anarchakat",
                    "body": "Yes, there have been multiple attempts to extend the ban to younger adults as well:  \n\n\nhttps://www.axios.com/2024/01/10/trans-care-adults-red-states",
                    "score": 27
                },
                {
                    "depth": 1,
                    "author": "Invisible-Elephant",
                    "body": "lupron has been used in precocious puberty for decades and there's plenty of studies showing so. you're linking articles about politics and europe's rightward turn when we're talking medicine",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MikeyTheGuy",
                            "body": "Yes, for PRECOCIOUS puberty, and resumed at the standard age one would start puberty. There are no studies for the long-term effects of delaying the onset of an ordinary puberty using puberty blockers. That is the step that many of those European countries are on right now: interventions for gender distress using puberty blockers is still permitted IF PART OF A STUDY.\n\nUntil those studies are concluded, puberty blockers as a treatment is not recommended due to a lack of understanding of the potential long-term effects, and that is the most prudent and scientific approach to this situation.",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "zzTopo",
                                    "body": "> There are no studies for the long-term effects of delaying the onset of an ordinary puberty using puberty blockers.\n\nWhile this may be true there has been studies on the effects of delayed puberty in general. [Here's a literature review](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8579478/) that's actually trying to make the case there may be more effects than are currently accepted (both beneficial and detrimental) although making no concrete conclusions. But the part most relevant to this conversation is:\n\n>delayed puberty is considered by many to be a benign developmental variant with no long-term consequences. Thus, the mainstay of treatment is an observational, “watchful waiting” approach\n\nIt goes on to discuss how hormone treatments to kick start puberty are often done due to the psychological stress of not developing along with your peers which seems interesting considering the main use of hormone blockers is for much the same reason, psychological distress of not developing along with who you identify as your peers. \n\nObviously there is a wrinkle in that puberty blockers are not included in these studies but it seems reasonable to me that until we have solid evidence there are significant detrimental outcomes to delayed puberty AND that those detrimental outcomes outweigh the alternatives of untreated gender dysphoria that people and doctors should be able to make their own choices based on the evidence available to them.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "Invisible-Elephant",
                                    "body": "idk, [the mayo clinic seems to think you're full of it.](https://www.mayoclinic.org/diseases-conditions/gender-dysphoria/in-depth/pubertal-blockers/art-20459075) and [so do major medical journals on adolescent health care.](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC8496167/) keep being transphobic under the guise of science though. and that's the critical point: even IF these drugs were bad for kids' bones or whatever, i genuinely don't care, because untreated trans kids commit self harm and suicide. i would rather a trans child live with weakened bones, or whatever side effect you fear, than die by suicide before they're old enough to drive, because they were told their humanity was less important than your subjective perception of a medical study's veracity.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MikeyTheGuy",
                                            "body": "Hi. Sorry you're offended Invisible-Elephant, but #1, you're on NeutralPolitics, not worldnews, news, or politics, so you need to chill out with the personal insults. If you can't conduct yourself in a rational manner, then you should refrain from posting (and probably get off Reddit and the internet).\n\n# 2 What you just did is called an \"appeal to authority\" fallacy. The endorsement from those organizations, frankly, does not matter. The reality is that the studies. don't, exist (which is part of why you see European health organizations changing their stance).\n\nBasically all of their recommendations about the efficaciousness and safety of puberty blockers come from organizations like WPATH whose recommendations come from.. themselves. Those recommendations are NOT based on any robust scientific studies or consensus. It's not based off of the studies of prolific scientists in the field who have signed off. It's literally their own intentions and extrapolations based on the aforementioned studies on precocious puberty (which do exist, and do suggest that puberty blockers are safe, again, SPECIFICALLY to delay a PRECOCIOUS puberty until the onset of when an ordinary puberty would occur; NOT FOR DELAYING THE ONSET OF AN ORDINARY PUBERTY).\n\n>i genuinely don't care, because untreated trans kids commit self harm and suicide. i would rather a trans child live with weakened bones, or whatever side effect you fear, than die by suicide before they're old enough to drive, because they were told their humanity was less important than your subjective perception of a medical study's veracity.\n\nAgain, you're being anti-science, and are jumping to conclusions based totally on emotion, not understanding that there is a chance the interventions you are championing will lead to MORE self-harm, suicides, and misery for trans youth (and subsequently, their adult selves).\n\nI am not sure if you're aware, but there has been a report recently released that if you're ACTUALLY good-faith interested in this subject, you should definitely read: [https://cass.independent-review.uk/home/publications/final-report/](https://cass.independent-review.uk/home/publications/final-report/)\n\nIt actually details about the lack of evidence in many areas, and how we might identify, correct, and create effective treatments.\n\nYou don't realize this, but you could very well be the modern equivalent of people recommending lobotomies as treatments. Do you think that medical organizations should have done thorough studies on lobotomies before they were performed on 60,000 people? This could be something very similar; why are you against them doing the studies to find out?\n\nEdit: And you blocked me? Wow you are really immature. My response to your response below:\n\n\"Wow. I'm trying to give you thoughtful responses. \n\n>it's also three great reasons why i am not interested in hearing your opinion any further.\n\nYou do not have the intelligence nor disposition to even discuss this topic. I know you didn't even read my response.\n\nYou're literally being the transgender policy equivalent of a lobotomy supporter. I genuinely hope you feel remorse for the trans kids whose suffering you supported if it comes out that puberty blockers were, in fact, harmful treatments. But I suspect you don't actually care about this issue in the way that you say you do.\"",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Invisible-Elephant",
                                                    "body": "1. i'm sorry you consider being called transphobic an insult. perhaps stop doing that and people will stop noting that you're doing that. but fwiw, randomly accusing people of being offended and irrational doesn't exactly make you appear \"neutral\" either (i.e. your mask is slipping)\n\n2. and bro... you're telling me i'm \"appealing to authority\" because i'm... citing the studies you say don't exist? and then you cite a competing study by the NHS, perhaps the most transphobic major medical provider in the english speaking world, as if this isn't an equal \"appeal to authority\"?\n\n3. and on that subject, i have read the cass report. it doesn't just argue against trans minors receiving adequate medical care; it argues that *trans adults under 25* ought be denied care as well. are you seriously trying to argue the position that transgender adults who can drive cars and vote and serve in the military should not have say over their own medical care either? if you endorse this position, you endorse trans suicide, whether you own that position or not. because i'll tell you, there are plenty of studies showing that trans people without medical support are at vastly higher risk for suicide than the ones who receive it.\n\nwe get it—you're not neutral, you're interested in preventing transgender kids from getting satisfactory medical care. by doing so, you're standing against the publicly endorsed positions of the american academy of pediatrics, american endocrine society, and american medical association. i guess this is just another \"appeal to authority\"—but it's also three great reasons why i am not interested in hearing your opinion any further.\n\nedit - so far mr. \"i am neutral and rational\" has accused me of being (1) offended (2) irrational (3) immature (4) unintelligent. really batting 1.000 here bud. a paragon of neutrality and calm rationality. thank god we have men like you to tell the rest of us how the world really works. god bless.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lilbluehair",
                    "body": "You do know that many of the \"treatments for children\" are things like talk therapy and allowing them to use preferred pronouns at school, right? ",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SuperSocrates",
                            "body": "Of course they don’t know that",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "unkz",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1byxf40/-/kyqf5gd/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": -1
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Statman12",
                            "body": "This comment has been removed for violating [comment rule 4] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\nAddress the arguments, not the person.  The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation.  \"You\" statements are suspect.\n\nIf you edit your comment to comply, it can be reinstated. If you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "unkz",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1byxf40/-/kyrrg3x/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "eniaku",
                            "body": "your subreddit has idiotic rules. remove posts debating on human rights and maybe people won't comment without \"sources\"",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "unkz",
                                    "body": "There are lots of places to \"debate\" topics by simply expressing personal opinions, this isn't one of them.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "eniaku",
                                            "body": "too bad, im not interested in debate or this sub, be a decent human and just delete things that try to normalize debating human rights.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ummmbacon",
                                                            "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "eniaku",
                                    "body": "BTW- the OP specifically created their account to post this. Why would anyone leave this up, as if their intentions are in good faith?!",
                                    "score": -6
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -14,
            "replies": [
                {
                    "depth": 1,
                    "author": "rico_mac",
                    "body": "by ‘obsolete gate keeping’, do you mean longitudinal studies into the effects of medicine used by trans people to assist in their transition?",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cutelyaware",
                            "body": "No, I mean hormones or surgeries where transpeople are required to be judged by a psychologist to likely need or benefit from the treatments whereas cisgender patients wanting the same hormones and surgeries do not.\n\nAlso, there are simply no \"longitudinal studies into the effects of medicine used by trans people\" that I am aware of, but link one that you are aware of and I'll check it out.",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rico_mac",
                                    "body": "I don’t know or have any, I’m not scientifically that literate (literate enough to understand their importance though). I am aware that in this case specifically, there is an absence of research into the long term use of puberty blockers in adolescents and children. that is to say, they can’t safely be proscribed by a doctor on a long term basis - at least that was the medical ruling in the UK recently.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cutelyaware",
                                            "body": "They were never meant for long-term use. Only to allow children to become adults or at least a fair bit more mature so as to make their own informed decisions. If a child thinks they are trans but are not, then that should become clear during the window that puberty blockers can provide.\n\nAnd those blockers are quite safe. Every medication has risks and side-effects and so must be weighed against the risks of doing nothing. Suicide rates among teens is already high, and for untreated trans kids is especially so. The benefits are clearly worth the risk of doing nothing.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "unkz",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1byxf40/-/kyq6ukc/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "notlikelyevil",
                    "body": "Long term studies are right above you.\n\nBut trans people aren't 2 years old, they can make their own decisions.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cutelyaware",
                            "body": "Which studies are those? Provide links.\n\nAlso, transpeople are not free to make their own treatment decisions the way cisgender people are. That's one of the problems.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "unkz",
                                            "body": "This comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        }
    ]
}