{
    "title": "There appears to be a disparity between the Federal minimum wage in the USA and what \"minimum wage\" jobs realistically pay. Why? ",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "> the typical starting wage for fast food jobs in 2024 is about $13/hr\n\nIn the wake of the pandemic, there was a [dramatic labor shortage,](https://www.cnbc.com/2021/11/11/how-mcdonalds-and-wendys-are-dealing-with-fast-food-labor-shortages.html) causing fast food outlets specifically to have a hard time filling positions. That drove up the typical wages of those and similar jobs. \n\nIt's a supply and demand issue. It's not related to the statutory minimum. If there were a surplus of labor, you'd see those wages drop, especially in areas with low cost of living.\n\nSince that time, however, [unemployment has remained low](https://www.bls.gov/charts/employment-situation/civilian-unemployment-rate.htm) and [labor constraints in food services have remained high,](https://www.kansascityfed.org/research/economic-bulletin/labor-constraints-and-strong-demand-are-driving-robust-food-services-inflation/) providing support for the high wages.\n\n> is there anyone getting paid 7.25? If so who?\n\nYes. It's [mostly young people people working part time jobs.](https://www.bls.gov/opub/reports/minimum-wage/2022/home.htm)",
            "score": 122
        },
        {
            "depth": 0,
            "author": "Xechwill",
            "body": "1: Yes. Although the Bureau of Labor Statistics does not seem to have a number for 2023 yet, [141,000 workers were paid exactly the federal minimum wage](https://www.bls.gov/opub/reports/minimum-wage/2022/home.htm). The source also notes that these people are primarily from DC, Louisiana, Mississippi, and Rhode Island.\n\n2) People against raising minimum wage [have varying arguments against raising it.](https://www.investopedia.com/articles/markets-economy/090516/what-are-pros-and-cons-raising-minimum-wage.asp). The most prevalent one is \"workers currently making the minimum wage will lose their jobs if the minimum wage goes up, as their employers will no longer be able to hire them and the business will close. $7.25/hour>$0/hour, so we should keep the wage as is.\" The second most prevalent one (from what I've seen) is \"the states should decide their minimum wage. The federal minimum wage should be a low baseline, as states and regions within those states with very low cost-of-living may not require a higher minimum wage to live comfortably there.\"\n\n3) Unfortunately, this statistic seems to be pretty difficult to find. Wages aren't public information, and companies aren't incentivized to publicly say \"we're paying at or barely above minimum wage!\"\n\nAnecdotally, it is *possible* to live comfortably on minimum wage in some areas. When I was volunteering in West Virginia, I got paid the fedeal minimum wage as a stipend. My yearly income income ($13,502 after federal taxes) was well below the food stamp threshold (130% of the poverty line, or $19,578), so I qualified for food stamps. Due to living in rural West Virginia, my rent was also quite low; only $575 for a one-bedroom apartment. Other government assistance programs allowed me to get a free gym membership and free internet, meaning my monthly expenses were only around $650/month including rent, food, and entertainment. This gave me a surplus of $475/month.\n\nTL:DR Some areas of the country have a much lower cost of living. The federal minimum wage says \"even in those crazy low COL areas, you still have to pay $7.25/hour.\" As such, people can still make the federal minimum wage and have their basic neess met (although you probably have to get government assistance).\n\nNote that personally, I'm in favor of increasing the federal minimum wage. That said, I hope the above summary was neutral.",
            "score": 56,
            "replies": [
                {
                    "depth": 1,
                    "author": "Not_a_tasty_fish",
                    "body": "I'm interested why there are apparently so many federal minimum wage earners in Rhode Island given that the state's minimum wage for 2023 was $13/hr.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Xechwill",
                            "body": "You can legally pay disabled people under minimum wage under the Fair Labor Standards Act, so I wouldn't be surprised if that makes up the majority of federal minimum wage owners in Rhode Island",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "MsAgentM",
                            "body": "How many of those people are technically tipped positions?",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "conception",
                    "body": "Note having government assistance just means people in other areas are paying part of your wages instead of the business. Basically welfare for those that pay minimum wage. If anything your anecdote shows that it’s not possible to live on and should be significantly higher.",
                    "score": 54,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Xechwill",
                            "body": "Well, that's why I'm in favor of raising the minimum wage; I don't think you should have to rely on food stamps if you work full time. That said, it's still possible to live on *because* of that government assistance; the costs are just split between the corporation and taxpayers instead of 100% on the corporations.\n\nAlso, note that this isn't \"basically welfare,\" it *is* welfare. However, it's welfare that people earning $7.25/hour nevertheless recieve, and therefore it is possible for those people to live $7.25/hour while using it. \n\nI don't think defining \"livable wage\" as \"livable assuming no government assistance,\" as that can muddy the waters significantly. For example, ignoring government assistance in that definiion would mean disabled people would have to make ~$1.4K/month more from their salary to have a \"livable wage,\" despite the fact that they already get that money. If we define livable wage as $15/hour, then it'd be insane to tell a disabled person \"taking a job paying less than $23.50 an hour is an unlivable wage for you.\"",
                            "score": 32,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "conception",
                                    "body": "Well we could just change how disabled folks get assistance instead of holding the rest of the country at the same wage for decades.",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Scientific_Methods",
                    "body": "If you rely on federal assistance for food then you are not living comfortably on pay from your job. The fact that you can make minimum wage and still qualify for/need federal assistance is a fantastic argument for raising the federal minimum wage.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "novagenesis",
                            "body": "...or for destigmatizing food assistance and making it available to everyone.\n\n[SNAP is benificial for the economy](https://sph.uth.edu/research/centers/dell/legislative-initiatives/tx-rpc-project-reports/Economic%20Impact%20of%20SNAP_2023.pdf).  In fact, there is an economic argument that it actually [pays for itself](https://stonecenter.gc.cuny.edu/is-the-war-on-poverty-paying-for-itself-new-research-offers-evidence-on-one-front-the-long-term-benefits-of-food-stamps-for-u-s-children/) if you factor in the fact that \"greater resources for mothers during pregnancy and in her child’s first five years of life are especially critical in shaping adult human capital, health, and productivity\".",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lasagnaman",
                                    "body": "No one is arguing against snap. It's absolutely a good thing. But to need it is to declare that the previous amount is not, in fact, sufficient to survive on.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CavyLover123",
                                            "body": "Well, there are actually fairly consistent GOP proposals to cut SNAP.\n\nhttps://www.politico.com/news/2023/11/09/johnson-house-gop-snap-00126341\n\nhttps://www.salon.com/2024/05/13/as-the-american-hunger-worsens-prepare-to-take-a-big-bite-out-of-snap/\n\nhttps://rollcall.com/2016/05/13/gop-wants-to-cut-23-billion-from-food-stamps/\n\nhttps://www.cbpp.org/blog/ryan-budget-takes-big-bite-out-of-food-stamps\n\nPaul Ryan full on suggested that SNAP in general is bad:\n\nhttps://onmilwaukee.com/articles/ryanbaglie",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ummmbacon",
                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cwq6df/-/l5cluu1/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WinnieThePooPoo73",
                    "body": "The fact we have any employers paying people below poverty levels is a glaring indicator that the system isn’t working. Why tf am i, the tax payer, subsidizing the shitty wages of corporations through food stamps? These are mega corporations who are making record profits every year, they can afford to pay their employees more. They just prioritize making as much profits as possible, even if it means some people are paid DEATH WAGES. One of the leading causes of homelessness in America is poverty wages\n\nThey’re Overcharging the same shitty food while paying their employees the same shitty wage. And we the tax payers are made to foot the bill",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "redditsuckspokey1",
                    "body": "Government aasistance shouldn't count towards anything.  It's a handout.  I get gov't ass and I hate it because it doesn't allow me to work for money.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "vargo17",
            "body": "1. Young people who are just starting their careers or working for a little extra cash. \n\n[https://www.bls.gov/opub/reports/minimum-wage/2021/home.htm](https://www.bls.gov/opub/reports/minimum-wage/2021/home.htm)\n\nWe can see from this report that as of 2021 181k people make minimum wage and 910k working below. These are primarily hospitality/ recreational jobs being worked part time by people under the age of 25. With the majority of the workers at minimum wage receiving tips to supplement their income.\n\nIn table 2, We can see a larger number in the South, ( about double other regions), But those are disproportionately in the \"Below minimum wage\" category which means they're operating on the alternate minimum wage for tipped workers.\n\n  \nSo based on that, the only people reportedly making minimum wage are tipped staff largely. (Who may or may not be reporting their tips accurately to begin with and are not reflecting their actual income into the data)\n\n  \n2. It would disproportionately effect small businesses in rural and low income areas by creating larger barriers to entry for the creation of small businesses. A lot of people will espouse the trite saying that \"If a business can't afford to pay it's workers a living wage, then it shouldn't exist. \" The people who say this are largely also going to be people bemoaning the fact that everything in their life is purchased through a large corporation, complain about late stage capitalism and never even realized they strangled the local options in the crib.\n\nAlso raising the federal minimum wage will always be contentious. Universal mandated increased costs will always favor larger, wealthier, established entities. That also applies to states as well. Higher mandates leaves poorer states and regions completely reliant on outside investment and effectively turns poor regions of the country into \"internal colonies\" by regulating that only rich entities from wealthy areas to be able to afford the operating costs and just keep a region sucked dry of any actual investment.\n\nMinimum wage should have always been a state and local issue such that it could be tailor fit for local cost of living.\n\n  \nThere is also a chance that the data is poorly collected. Given the number of tipped staff at minimum wage, and the propensity of tips to be under reported, we could raise minimum wage and not actually have any real effect on the people you're trying to help. They'll just report the new higher minimum wage and keep under reporting any tips they receive.\n\n  \n3. Income Quintiles.\n\n  \n[https://www.taxpolicycenter.org/statistics/household-income-quintiles](https://www.taxpolicycenter.org/statistics/household-income-quintiles)\n\nIf looking at affordability of housing and the cost of living crisis, you can just use median income of the lower 2 quintiles, (40% of US households)",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "Anlarb",
                    "body": "> Young people who are just starting their careers or working for a little extra cash.\n\nLook at your source closer, that only describes 20% of the people making the min wage.\n\nhttps://www.bls.gov/opub/reports/minimum-wage/2021/home.htm\n\nMore to the point, 7.25 is asking the wrong question, given the median wage is $18/hr\n\nhttps://www.statista.com/statistics/185335/median-hourly-earnings-of-wage-and-salary-workers/\n\nWhile the cost of living is $20/hr\n\nhttps://livingwage.mit.edu/\n\nThats over half the workforce underwater.\n\n> it would disproportionately effect small businesses in rural and low income areas\n\nFirst, its an even playing field. Second, rural areas are dominated by large corporations, cities are hotspots where \"one guy who knows the business\" has ample customers to chase if he wants to go solo. 80% of jobs are in cities (and yes, sub-Urbs are part of the city, its in the name).\n\n> Universal mandated increased costs will always favor larger, wealthier, established entities.\n\nA living wage is the backbone of the middle class. If \"getting by\" is an exotic luxury, then you don't have the opportunity to walk away from the table if you are getting a bad deal. You can't negotiate if you can't do that.\n\n> Higher mandates leaves poorer states and regions completely reliant on outside investment and effectively turns poor regions of the country into \"internal colonies\" by regulating that only rich entities from wealthy areas to be able to afford the operating costs and just keep a region sucked dry of any actual investment.\n\nAs opposed to our current posture of eternal bailouts? No, your scheme to pad businesses bottom line through lavish payroll subsidies does not produce any more jobs, that is a function of demand. under no circumstances will mcdonalds clown car 50 people into the back, even if the cost of labor goes to zero, they will hire the precise amount they need and no more.\n\nEmployers are perfectly aware of the situation a lack of a min wage puts workers in, instead of \"ok, if you want to be employed at all, you need to take the minimum\" it is \"in order to be employed at all, you need to accept a wage so low that you will qualify for welfare\".\n\nOh, and if you manage to save up like 2.5k, they cut off your welfare, so put aside any fantasies of saving up to go to community college or starting a business of your own.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "royalhawk345",
            "body": "1. [BLS reports 141,000 earning exactly the federal minimum wage](https://www.bls.gov/opub/reports/minimum-wage/2022/home.htm), but also 882,000 earning below it. This may be people being paid less under the table, service workers not reporting tips, and people exempt from the general minimum wage like prisoners. Most people earning the minimum wage are part time.\n\n2. Raising the minimum wage decreases the number of people living in poverty, increases unemployment, and shifts some wealth to lower incomes. [The CBO has a handy tool with estimated effects of various changes](https://www.cbo.gov/publication/55681)",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "KeyCoyote9095",
                    "body": "I dunno if it actually increases unemployment irl tho but decreasing poverty and shifting some wealth downward is a totally worthwhile offset even if it does and if you loose your job bc everyone is getting paid more is shitty but a new one will nessacarily yield more for the labor produced, right?",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "There's an underlying assumption in the second part of the post that I'd like to challenge a bit, if you don't mind.\n\n> the cost of living alone is still statistically difficult for the typical low wage worker\n\nThe [minimum wage,](https://en.wikipedia.org/wiki/Minimum_wage_in_the_United_States) meaning the lowest wage one can legally pay to, for example, someone with no experience, such as a teenager or a new immigrant who doesn't speak the language, is not set at a level designed to allow that person to afford their own apartment.\n\nAlthough many people understandably [argue the minimum wage should be a living wage,](https://bobbyscott.house.gov/media-center/press-releases/labor-leaders-introduce-bill-raise-minimum-wage) it's not historically understood as a living *alone* wage. It was designed to prevent exploitation of people on the lowest rung of the employment ladder and it assumed they'd be living with family or in some other kind of communal situation.\n\nAs people get more experience, they work their way up the wage scale, eventually getting to the point where they can share an apartment with a roommate or two, but living alone has long been a luxury that only people making at least double the minimum wage could afford. (Note that this is different in rural communities, due to cultural norms and supply/demand issues, but in urban areas, that's how it has been.)\n\nIn 2009, when the minimum wage was raised to $7.25 per hour, a person working a 40-hour week would earn $290 before taxes, or about $1210 a month, assuming 50 weeks a year. \n\nSince you mentioned Pennsylvania, let's take a city like Pittsburgh as an example, which falls in the [middle of the cost-of-living range](https://www.numbeo.com/cost-of-living/region_rankings_current.jsp?region=021) for U.S. cities. A studio apartment there [cost $541 per month](https://www.rentdata.org/pittsburgh-pa-hud-metro-fmr-area/2009) in 2009, or 45% of income. In 2007, the minimum wage was set at $5.85, yielding a monthly full-time gross of about $975. A studio apartment in Pittsburgh [cost $570 per month then,](https://www.rentdata.org/pittsburgh-pa-hud-metro-fmr-area/2007) or 58% of income.\n\nClearly, rents are higher now, but the point is, nobody working a minimum wage job could afford even the smallest apartment back then. It's not a new phenomenon and it doesn't translate to a failure of the minimum wage law to serve its purpose.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Scientific_Methods",
                    "body": "Well you’re wrong that minimum wage is not meant to support a decent living. Roosevelt is the president that established the minimum wage and this is what he had to say about it. \n\nIt seems to me to be equally plain that no business which depends for existence on paying less than living wages to its workers has any right to continue in this country. By \"business\" I mean the whole of commerce as well as the whole of industry; by workers I mean all workers, the white collar class as well as the men in overalls; and by living wages I mean more than a bare subsistence level-I mean the wages of decent living.\n\nSo from the beginning it was meant to provide a decent living for working people.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dedev54",
                            "body": "Our overall goal is to help the poor the most we can, right? I argue setting the minimum wage to pay a livable wage can actually be a net negative to the poor, and we should directly give them welfare instead.\n\nIf we increase the minimum wage, two things happen. First, the pay of people making minimum increase, which is objectively good, and the number of jobs available to them decreases. This is because at the higher wage, it is simply not worth it to pay someone to do certain jobs because paying them would be a net loss. This is a reasonable statement right?\n\nAt some point the number of jobs lost is worse for the poor than the increase in pay. This means the optimal minimum wage that helps poor people the most is not nessicarily a living wage, and in fact the two are completely unrelated, so we shouldn't strive to set the minimum wage to a living wage but rather the one that helps the poor the most.\n\nInstead, we should give welfare directly to the poor to put their income to a higher level, because it gives them money directly without reducing their rates of employment.\n\nBasically, setting a high minimum wage can make people net worse off, because although those who find low pay jobs are better off, there are less jobs overall.\n\nhttps://en.wikipedia.org/wiki/Minimum_wage#Debate_over_consequences",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "Yes, as I said above, it's a living wage, not a living *alone* wage. \n\nIn 1940, 8% of Americans lived in single-person households. It just wasn't a common thing. Today it's 29%.\n\nhttps://thehill.com/policy/healthcare/4085828-a-record-share-of-americans-are-living-alone/",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Joe_Jeep",
                                    "body": "Again, false and incorrect.\n\n[http://docs.fdrlibrary.marist.edu/odnirast.html](http://docs.fdrlibrary.marist.edu/odnirast.html)\n\n\"In my Inaugural I laid down the simple proposition that nobody is going to starve in this country. It seems to me to be equally plain that no business which depends for existence on paying less than living wages to its workers has any right to continue in this country. By \"business\" I mean the whole of commerce as well as the whole of industry; by workers I mean all workers, the white collar class as well as the men in overalls; and by living wages I mean more than a bare subsistence level-I mean the wages of decent living.\"\n\nDecent living has never meant \"living alone\", especially in an age when one working income supporting a family was not just common but the default, so that implies decent living with a family\n\nHow on earth can that be twisted into meaning one single working adult shouldn't be able to live alone?\n\n  \n[https://www.weforum.org/agenda/2020/11/productivity-workforce-america-united-states-wages-stagnate](https://www.weforum.org/agenda/2020/11/productivity-workforce-america-united-states-wages-stagnate)\n\nFurthermore, as shown above, worker productivity is up over 250% since the 1950s, and that leaves out 20 years from the speech\n\nThat's nearly 4x as much revenue per hour worked, with many daily needs becoming less expensive to produce.\n\nThe math indicates individuals should be more wealthy on a per-capita basis, not less.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nosecohn",
                                            "body": "Those are quotes from aspirational and inspirational speeches to promote the policy. \n\nWhat I've tried to provide above is actual data showing that the legislation as written, enacted and updated never allowed a single minimum wage earner to support a household. The math just doesn't work.\n\nEDIT to address your edit: I'm not commenting about what *should* happen or what the desired policy is. Whatever policy methods are used to get there, I would certainly like to see everyone housed without undue burden. My point was simply to correct what I believe to be a common misunderstanding that the minimum wage at some point in the country's history provided enough income alone to support all the expenses of a household based on reasonable budgeting principles. It did not. I don't dispute that housing affordability has worsened over time.",
                                            "score": -1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Scientific_Methods",
                                    "body": "Sure but the minimum wage was meant to support the ENTIRE household as a single earner. So your argument falls even flatter.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nosecohn",
                                            "body": "I don't think the legislation or the math supports that this is what it was meant to do, but I'm comfortable leaving it there. \n\nThe point of these discussions is to give other readers the opportunity to examine an issue from multiple sides, review the evidence, and make up their own minds. I think this chain has provided them with enough information to do that.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Responsible_Media581",
                    "body": "i don't disagree. im more bringing up the example of rents as an extension of my why is the statistic important point. i often see min wage used in memes in comparison to cost of living, and if almost no one is making that low of a wage in 2024 it leads to a lot of non neutral, inflammatory hooplah about nothing. imagine a scenario in which 14/hr WAS enough for a typical single person to afford a private studio but we were still stuck arguing over a ghost of a number called the minimum wage. \n\n\nim not convinced by the replies thus far that the federal minimum wage is not a ghost and could not be raised or abolished with virtually no effect. It seems like the BLS statistics referenced are including tipped workers that do effectively make more. Searching google for jobs in low income/low housing price states like Alabama i did find KFC listed for $11/hr and GNC nutrition listed for $9.50.  I'm not convinced by job perusal that fast food isn't a good marker for the floor for all minimum wage jobs (retail, hospitality etc.) (although California could change that). And i don't forsee nominal wages reversing anytime soon. ",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "There are some good points here. \n\nThe truth is, there's been [a lot of inflation](https://www.in2013dollars.com/us/inflation/2009?amount=7.25) since 2009, but the minimum wage hasn't been adjusted. According to a link in your first source, it was raised 17 times in the 50 years prior to that, which is a little more frequently than once every three years on average. So, the fact that we've gone 15 years without an adjustment is definitely unusual and it would make sense that fewer people are actually being paid that wage now.\n\nOne potential way to eliminate the tipped workers from the BLS numbers is to include only those who are making exactly the minimum, because [tipped workers](https://www.dol.gov/agencies/whd/state/minimum-wage/tipped) are often the only ones allowed to be paid less over the course of a full year. It's not the most solid premise, but perhaps worth exploring.\n\n2010 was the first full year with the $7.25 minimum. The [BLS report for that year](https://www.bls.gov/cps/minwage2010.htm) says:\n\n> 72.9 million American workers age 16 and over were paid at hourly rates, representing 58.8 percent of all wage and salary workers. Among those paid by the hour, 1.8 million earned exactly the prevailing Federal minimum wage of $7.25 per hour.\n\nThat comes out to 2.5% of all hourly workers.\n\nBy contrast, the [2022 BLS report](https://www.bls.gov/opub/reports/minimum-wage/2022/home.htm) says:\n\n> 78.7 million workers age 16 and older in the United States were paid at hourly rates, representing 55.6 percent of all wage and salary workers. Among those paid by the hour, 141,000 workers earned exactly the prevailing federal minimum wage of $7.25 per hour.\n\nThat's only 0.18% of all hourly workers, and the report itself says they're mostly not working full-time.\n\nI wouldn't call this conclusive evidence, but it certainly supports your hypothesis that not enough people are currently being paid the hourly minimum to imply that a moderate increase would have any effect on the broader economy.\n\nI still have my doubts about using fast food service work as a marker. I can think of a bunch of jobs that *should* pay lower than that, but I also wasn't able to find any job listings to prove the supposition.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Responsible_Media581",
                                    "body": "So I looked closer. The 2022 BLS report (https://www.bls.gov/opub/reports/minimum-wage/2022/home.htm) also says right at the top: \"The data are obtained from the Current Population Survey (CPS), a national monthly survey of approximately 60,000 eligible households conducted by the U.S. Census Bureau for the U.S. Bureau of Labor Statistics (BLS). Information on earnings is collected from one-fourth of the CPS sample each month. The CPS does not include questions on whether workers are covered by the minimum wage provisions of the federal Fair Labor Standards Act (FLSA) or by individual state or local minimum wage laws. The estimates of workers paid at or below the federal minimum wage are based solely on the hourly wage they report, which does not include overtime pay, tips, or commissions.\"\n\nMy interpretation of that is people reporting the exact amount of $7.25 may still be making more in tips, and most probably are: \n\nBecause it also says : \"The industry with the highest percentage of workers earning hourly wages at or below the federal minimum wage in 2022 was leisure and hospitality (about 7 percent). About 3 in 5 of all workers paid at or below the federal minimum wage were employed in this industry, almost entirely in restaurants, bars, and other food services. (See table 5.)\"\n\nand\n\n\"Among major occupational groups, service occupations had the highest percentage of hourly paid workers earning at or below the federal minimum wage, at 4 percent. Nearly 3 out of 4 workers earning the minimum wage or less in 2022 were employed in service occupations, mostly in food preparation and serving-related jobs. For many of these workers, tips may supplement the hourly wages received. (See table 4.)\"\n\nThis all supports the tipped position theory. There may be a small amount of workers who are untipped in the food industry who make bare minimum--- cooks, fast food. But if you actually open up those tables you will see the other industries reporting at or below include education, retail, and manufacturing. Unclear what jobs that entails and why they would be below which requires exceptions to the law or illegal pay. The report suggests some survey respondents may be rounding down their wage.   \n\n\nStill  there is no evidence of $7.25 wages perusing 2024 job listings. In current inflationary conditions each year that goes by the wages get farther and farther from the legal minimums, so this 2022 is not even good data now. Mississippi is ranked as having the lowest cost of living (https://worldpopulationreview.com/state-rankings/least-expensive-states). And follows the federal minimum wage. So perusing entry level jobs on zip recruiter in MS what are the lowest paid jobs I can find?....Circle K gas station starting at $13.25. Travel center Cook 11.50. Dental Receptionist $12. Personal care attendent $9.75. Cricket Wireless 12.50. Murphy Gas station $9.25. Oh the winner appears to be Popeyes chicken starting at $8/hr. What they list and what people get hired at is an unknown. But another point there in support of fast food being the floor.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Responsible_Media581",
                    "body": "As for the livability of and lifestyle supported by a minimum wage and what is moral, possible etc. that is a different issue, but also interesting and necessary I think to look at with data. I see a lot of people online say things along the lines of \"my father bought a suburban house and supported our whole family working as a shoe salesman\". This raises some questions 1)is that true? Is that common? 2) was shoe salesman formerly a minimum wage job, or was it potentially more lucrative with large commissions? Historically what have been the entry level \"minimum wage\" jobs? 3)How has the livability of the minimum wage changed over time? (or more to my point, how has the livability of the realistic wage of the lowest wage jobs changed over time)?\n\nThis chart (https://www.reddit.com/r/dataisbeautiful/comments/172eiap/median\\_national\\_home\\_price\\_relative\\_to\\_federal/) suggests home ownership was once much more feasible on a minimum wage, which would suggest that renting was also once much more affordable. \n\nHere is a graph with overall purchasing power (https://www.epi.org/blog/the-minimum-wage-has-lost-21-of-its-value-since-congress-last-raised-the-wage/) which has fallen. This is out of date and it would fall even more.  But as per my key point, it may not be a meaningful figure. \n\nThen the livability of the minimum wage might be better compared with the cost of a lower end apartment than median. HUD uses a number called the fair market rent which is the 40th percentile. (https://www.rentdata.org/lookup). In florida where I live now this site lists a studio at $1048 which seems realistic for a number that is supposed to represent below average. If I were to go out and get a $14/hr job (there are many, state minimum in florida is $12) that would be 44% of my income. Which is doable, but I would need to rent from an individual and not a property management company that checks your paystubs for the 3x amount. I think this is something that has gotten more difficult over time, the corporatization of housing has put up more barriers (personal perception over two decades).",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "I think you're exactly right about the decline of housing affordability and also the ability of a single earner to support a family, though perhaps not on minimum wage. My point above was only that a single minimum wage income was never really enough to afford housing. That is, even if one needed roughly double that income in the past, one might need triple today.\n\nA large factor in that is simply the [decline of housing supply](https://public.flourish.studio/visualisation/11825384/) driving the prices up, with the situation being even worse in [low income housing.](https://www.researchgate.net/figure/Social-and-affordable-housing-demand-and-supply-projections_fig9_289882694) Population growth has been [outpacing housing starts](https://usafacts.org/articles/population-growth-has-outpaced-home-construction-for-20-years/) in the US for at least 20 years.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MaxIsAlwaysRight",
                    "body": ">living alone has long been a luxury that only people making at least double the minimum wage could afford\n\nMind adding a citation for this part? I'm curious what historical range you're describing here.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "I provided links to minimum wage vs. studio apartment prices in an average city 15 and 17 years ago. The further back we go, the harder it is to find specific pricing information, especially about individual housing types in specific areas. \n\nHowever, according to the census department's [table of house prices,](https://www2.census.gov/programs-surveys/decennial/tables/time-series/census-housing-tables/grossrents.pdf) *average* rent in 1940 was $27 and the minimum wage was $0.30, so applying the same formula as above, monthly rent would have been 54% of wages. Using the same data for 1950, rent would have accounted for 60% of minimum wage. In both cases, it's also way over the recommended 33%, but I don't know what studio apartments would have cost at that time, or if they were even common.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [comment rule 2] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) as it does not provide sources for its statement of fact.  If you edit your comment to link to sources, it can be reinstated.  For more on NeutralPolitics source guidelines, see [here] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources).\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "brinerbear",
            "body": "Don't most jobs pay more than minimum wage? How many people actually work for minimum wage? If so why?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Anlarb",
                    "body": "Given that the point of the min wage is that a working person can pay their own bills-\n\nhttp://docs.fdrlibrary.marist.edu/odnirast.html\n\nand the median wage is $18/hr\n\nhttps://www.statista.com/statistics/185335/median-hourly-earnings-of-wage-and-salary-workers/\n\nWhile the cost of living is $20/hr\n\nhttps://livingwage.mit.edu/\n\nThats over half the workforce underwater.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ummmbacon",
                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cwq6df/-/l5a89za/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cwq6df/-/l51mfkn/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jynexe",
            "body": "Pt1: Fundamentals of Economics\n\nIn the introduction to economics (macroeconomics and microeconomics), we learned that the [Washington Consensus](https://en.wikipedia.org/wiki/Washington_Consensus) was the basis for modern economic theory.\n\nDuring this, we learned a lot about how economics is firstly _extremely complicated_ with so many factors for which it is hard or impossible to account. But, the basic math and models tell us that by doing stuff like increasing the minimum wage mandated, we start to see employers hiring fewer employees and the opening of \"Black Market\" jobs (jobs that aren't reported to the government, think everything from when you hire the teenager down the street to be your babysitter and you pay in cash down to shady corporations hiring people abroad to do jobs but not telling the government). \n\nNow, as you can imagine, this has negative effects on society and the government. Less revenue for the government, fewer jobs for the individual. However, this obviously isn't the full story because, without any government intervention, you may start seeing employers exploiting workers. But if they aren't and people feel largely like their wage is fair, minimum wage doesn't need to be increased.\n\nSo! To make a long story short: Because the federal government doesn't feel like it would help or improve anything to increase the minimum wage. They only want to intervene when they need to.\n\nPt2: The Organization of America\n\nIn the US, we organize things differently than many of our contemporaries. This is for a variety of reasons, ranging from our origins to our size. The result is that federal laws and regulations have to be a good idea across the country for them to be a good idea. This is really where the federal minimum wage has problems. The US has _vastly_ different costs of living depending on location. A wage of $100,000/year could be enough to buy a house, raise a family and live comfortably. It could also be so little that you can barely afford rent and have to eat Ramen every night because that's all you can afford while you spiral deeper and deeper into debt as you struggle for even the basics. The difference is location. LA will be different than rural Nebraska. \n\nIf you make minimum wage, say, $15 an hour, this will be far too low for West Hollywood but far too high for rural Nebraska. So, the general thought process becomes... let's just let States figure this one out. So, what states have done is made it so their state minimum wage reflects the minimum cost of living in the state (in theory, in practice, it's hit or miss), then have specific counties or municipalities have a higher minimum wage. For example, California has a minimum wage of $16/hr. However, West Hollywood has a minimum wage of $19.08 (source: https://www.paycor.com/resource-center/articles/california-minimum-wage/)\nIn Washington, the minimum wage is $16.28, but Seattle has a minimum wage of $19.97 (source: https://www.lni.wa.gov/workers-rights/wages/minimum-wage/) \n\nSo, in other words, another reason is that the US is so varied that it makes sense to do what the US was designed to do and have the States handle as much as you can let them, and then the federal government handles the rest.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Anlarb",
                    "body": "> fewer jobs for the individual\n\nMin wage hikes never kill jobs. Plenty of things do, the recessions are generally named after their causes.\n\nhttps://www.dol.gov/agencies/whd/minimum-wage/history/chart\n\nhttps://fred.stlouisfed.org/series/UNRATE\n\n> The US has vastly different costs of living depending on location.\n\nIt is actually rather homogenous, as people and businesses will move for more optimal conditions. Yes, there are hotspots, but we have a half hour average commute because people are fully aware that they may need to commute a few counties over to make their budget work with the job they can get, so it is useful to look at it by metro area.\n\nhttps://livingwage.mit.edu/",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ThatSpyGuy",
            "body": "The market price for unskilled labor is significantly higher than the minimum wage. Implementing a price floor has no effect if supply and demand dictate a market price above that floor.\n\nI would argue that this is a great example of why a minimum wage isn’t even necessary, without getting into whether it is effective or compassionate.\n\nhttps://www.wallstreetmojo.com/price-floor/",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Responsible_Media581",
                    "body": "that is kinda what i thought, which is why the second question. if I was a politician for either a state or the country why would I raise or not raise or abolish the minimum wage? have things just transpired so fast in the last 5 years that they probably will raise it as soon as they get a chance? would raising it be a easy way to make yourself look good optically, competitive with other states and countries, without actually doing anything economically? or would you still encounter resistance and bad optics from people who perceive it would do harm? is it too much effort when it's not pressing, etc? The psychologist side of me wonders what the incentives are , and the research side of me is annoyed people use the minimum wage as a relevant statistic when it doesn't seem that relevant. ",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        }
    ]
}