{
    "title": "What are some good books to get a firm grasp on politics and political history?",
    "comments": [
        {
            "depth": 0,
            "author": "ummmbacon",
            "body": "**/r/NeutralPolitics is a curated space.** \n\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\n\n1. Be courteous to other users.\n1. Source your facts.\n1. Be substantive.\n1. Address the arguments, not the person.\n\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\n\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.\n\nMod Note: I'm approving this as a request for sources, anything other than discussion of books, or why they are good/bad will be removed for R3.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "The_Libertarine",
            "body": "1. ALL of the Federalist Papers (but the ones by Madison are my faves)\n2. The Origins of Political Order - From Prehuman Times to the French Revolution by Francis Fukuyama\n3. [https://encyclopediageopolitica.com/2022/12/13/the-2023-geopolitical-reading-list/](https://encyclopediageopolitica.com/2022/12/13/the-2023-geopolitical-reading-list/)\n\nI hope this gets you started! The list from Encyclopedia Politica focus' a lot on events in the 2000s but I would go to anything written by Mao, Stalin, even Hitler (Mein Kampf) if you want to get into their heads.",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "DDCDT123",
                    "body": "Madison was the better writer for sure. He just has a way…",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Teddiursa22",
            "body": "I unironically believe CGP'S rules for rulers video is a great place to start.\n\n[rules for rulers](https://youtu.be/rStL7niR7gs?si=z0yXym-y3UI4nJgP)\n\nEverything is built of smaller factions, with their own needs.",
            "score": 77,
            "replies": [
                {
                    "depth": 1,
                    "author": "Anonymous3542",
                    "body": "And since OP asked for a book, it just so happens that video is adapted from a book, [The Dictator's Handbook](https://www.amazon.com/Dictators-Handbook-Behavior-Almost-Politics-ebook/dp/B005GPSLHI/ref=as_li_ss_tl?_encoding=UTF8&qid=1478523224&sr=8-1&linkCode=sl1&tag=ytbg-20&linkId=70208af924256b945bfd9e5ee121fba3).",
                    "score": 27,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ebonythrowaway999",
                            "body": "Thanks for the recommendation as this book is right down my alley. 👍 I’m shocked I’ve never heard of it before. I just downloaded it from Amazon.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "JayConz",
            "body": "What type of politics? World politics? And what type of political history? Might help to narrow it down for yourself, since it's an immense subject. Great that you want to learn more though!",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "Moist_Drag8239",
                    "body": "Just edited my post, my bad, thanks!",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JayConz",
                            "body": "No problem!\n\nSo just for starters, I highly recommend \"The Sleepwalkers.\" It's a phenomenal retelling of how WW1 started and of the events that led up to it.\n\nFor the USSR - at least its collapse - I'd recommend the aptly named \"Collapse\", by Zubok. Phenomenal account of how it all ended and recasts traditional narratives in a very refreshing way.\n\nFor modern liberalism (Austrian economics), I'd recommend \"Liberalism\" by Ludwig von Mises.",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrStealYoMom",
            "body": "Regarding where capitalism and socialism/marxism comes from, I would check out \"Two Treatises of Government\" by Locke and \"On The Social Contract\" by Rousseau.",
            "score": 32,
            "replies": [
                {
                    "depth": 1,
                    "author": "Disheveled_Politico",
                    "body": "I had trouble getting through Locke and Rousseau as a poli-sci major in college, I wouldn’t describe them as entry level for a 16 y/o. ",
                    "score": 36,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DDCDT123",
                            "body": "Maybe a book about the history of social contract theory would be a better intro, rather than 18th century philosophy straight to the dome.",
                            "score": 12
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sircumlocution",
                    "body": "I’d add that sources which expound a specific political philosophy aren’t always the best place to find out about the implementation of the same. Honestly, I suggest reading works of history before reading the primary sources because they teach you how to approach sources.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "sugiina",
                    "body": "Very good recommendations",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Moist_Drag8239",
                    "body": "They sound hard but I'll check them out, thanks!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DDCDT123",
                            "body": "I commented above, but I’d suggest a book about those books. I personally enjoy reading the original material, but if you’re looking for somewhere to start, it’s probably better than you have a better idea of their context. \n\nSpecifically, read about social contract theory. The original US constitution was designed with a social contract in mind, but lots of thinkers had different ideas about what what the social contract was and meant for society. Once you’ve got a good grasp on what they’re talking about, you can start exploring the people that responded to Locke and Rousseau, like Marx, and understand their work in context.  \n\nFor example, and this is a way oversimplification that someone could probably nitpick to shreds (it’s been a few years), Locke believed that an individual right to property was essential to the smooth functioning of society because property rights gave way to formal means of dispute resolution (rule of laws), rather than simply violence. Marx believed that accumulation of personal property was the cause of violence in many cases. \n\nThey both make some good points and it’s worth reading, eventually. But don’t bite off more than you can chew :) you’ve got a lot of time to read political theory and philosophy. What is more important is fostering your ability to think critically; that doesn’t mean being a devils advocate all the time, it just means that you should be thoughtful and intentional in your life. Take the world in and be a student of it. Don’t take everything you read as the truth, and learn how to recognize bullshit. Philosophy wouldn’t continue as a discipline if anyone had figured everything out. Socrates was wise because he knew that he did not know it all, and his greatest skill was demonstrating that the people who thought they did, did not.\n\nAlright, I rambled more than I thought. But I appreciate your question because my college discovery of political philosophy and the project of solving collective problems gave my life direction when it had none. You’ve got a five year head start on me, I’m jealous! Cheers.",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "KillAllLobsters",
                            "body": "If you really wish to study politics, start with philosophy.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "JoggingGod",
            "body": "I would recommend Howard Zinns,  People's history of the United States. There's so much you can read and learn about but I think you have to start reading whatever peaks your interest to figure out where you're interested in going. \n\nYou might like standard historical texts, or you might find more narrative pieces more your style.   It's hard to say exactly what you might enjoy as while some might scoff at Chomsky, others might recommend him above everyone else.\n\nYou might also like Biographies of Presidents. They can provide a lot of context around world events without delving too much into complex theories , then you can get a sense of what interests you.",
            "score": 44,
            "replies": [
                {
                    "depth": 1,
                    "author": "SeesEverythingTwice",
                    "body": "Note: I loved this book, but be sure to read the intro and the dis-recommendations in here. Zonk wrote his book as an answer to the way US history is typically taught, not as a standalone history book. Because of that, it leans hard into its bias in order to ‘balance’ out other schools of thought. \n\nAs it’s gained popularity, it’s increasingly recommended without that context as a single volume history book. That being said, I generally think it’s pretty good at balancing out most high school history curriculums, which often lean conservative.",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WorkingCupid549",
                            "body": "My high school American history class used “A Patriot’s History of the United States”, which repeatedly makes reference to Zinn’s book. Patriot’s History is a truly awful and harmful history book, especially when it’s being taught to highschoolers as the “definitive” history of America.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "/u/Moist_Drag8239: Note that Zinn is not only specific to the U.S.(which isn't what you appear to be looking for), but also very controversial. Although it's very much in vogue for history to be viewed through the lens of oppressor/oppressed right now (thanks largely to Zinn), that kind of narrow scope is[ not how most historians approach it.](https://www.jstor.org/stable/43661655)",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "dbhaley",
                    "body": "Piques*",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "bassicallybob",
                    "body": "Zinn’s book is not a good place to start. It’s a good read once you’ve gotten your bases and think you have some sort of grasp on American history and politics, and even then you really have to tolerate and almost appreciate its levels of extreme bias. \n\nThe book itself is as much a step in American history of political thought as the contents of the book, if that makes any sense.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "Dokibatt",
                    "body": "Seconding Zinn.\n\nI also really like [Mark Blythe's ](https://www.amazon.com/stores/Mark-Blyth/author/B001HPJP0S?ref=ap_rdr&isDramIntegrated=true&shoppingPortalEnabled=true) takes on modern politics. They tend to be more economics focused, but he correctly identifies motivations in a way that many others don't, IMO.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "PIK_Toggle",
                    "body": "You need to balance this with Paul Johnson’s “A History of the American People”. Otherwise, you are just reading propaganda.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JoggingGod",
                            "body": "good point.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dmbream",
                    "body": "Absolutely do not read Howard Zinn’s “People’s…” if you want a firm grasp on politics and political history.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "yiliu",
                            "body": "Second this dis-recommendation. Or, well, read it with a huge grain of salt. It's basically myth-making for the purpose of furthering a cause, or a conspiracy theorist's history.\n\nBTW, worth asking this question in (or checking the recommendations of) /r/askhistorians.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ScarboroughFair19",
                                    "body": "Thirded.\n\nOP, R/askhistorians has a curated reading list which will give you insight onto specific topics on history. You'll find this more useful than random general takes on what books are useful",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "dmbream",
                                    "body": "Yup. It’s a very Reddit recommendation… ;-)",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Enthes-Goldhart",
            "body": "Don't focus on politics focus on history (I know this is mildly contradictory) study how each period of history changed into to the next. There are some great map books out there. History is about cultures and how they interacted with each other.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "DDCDT123",
                    "body": "I would say that ones understanding of history is enhanced by an understanding of the prevalent political theories of the day.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "last_word23",
            "body": "Biographies of world leaders are underrated.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "sirmanleypower",
            "body": "If you're interested in American political history at all, I would highly recommend reading all the works of Richard Hofstadter, in particular *The American Political Tradition* and *The Age of Reform*.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Moist_Drag8239",
                    "body": "Thanks! I'll check those out",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jay_D826",
            "body": "I think a really good book to include would be These Truths: A History of The United States by Jill Lepore \n\nWhile it isn’t strictly political, it’s a massive book that covers a significant amount of American history. It gives a perspective that is pretty different from what most history classes will teach but it’s not quite as controversial as books like A People’s History of The United States. \n\nModern American politics evolved from the history of the country and this book gives a good overview of a lot of it.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Libertamerian",
            "body": "It might be more beneficial to you in the long term to learn about logic, critical thinking, and how we form our conclusions first. This can be done from a philosophy (“logic”) perspective where you learn about fallacies, rhetoric, or research methods (eg you don’t always “prove” truth so much as “falsify” a hypothesis). It can also be done from a psychology perspective  like learning about motivated reasoning and how our minds are biased about all sorts of things despite us feeling like we’re rational. \n\nI say this because if you can get a firm grounding in how to ask “good” questions, investigate them, determine how much stock to put into your conclusions, and develop some humility around human limitations, you will be better equipped to learn even from a biased source.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ginaie",
                    "body": "This 💯",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "James_Locke",
            "body": "I think if you want a serious pre-civil war take on the USA you should read Democracy In America by Tocqueville, his predictions about American historical direction are eerie.\n\nFor good information about the idea of what government is and how politics should work, Plato and Aristotle are pretty much required reading if you want to ever understand or think about why we have government at all. The Republic and the Politics and Nichomachean Ethics respectively.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "calebnf",
            "body": "Understanding Power by Noam Chomsky.\n\nMany people that have read it say that it completely changed the way they view government, politics, and the media.  It did for me.  But don't take my word for it.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "MasterDefibrillator",
            "body": "\"understanding power\" and \" what kind of creatures are we\" in particular the section \" the common good\" by Noam Chomsky.    These both give a very comprehensive, broad base, and focus on a lot of the original thinkers, that framed modern political thought.  For Soviet history specifically, from Tsar to Soviet by Christopher Reed is good. For origins of capitalism, I still don't think you can beat wealth of nations by Adam Smith.\n\n\nI'm starting up a little online reading group, if you're interested, let me know.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Rob_Cartman",
            "body": "The Art of War by Sun Tzu. Its a easy read and has been extremely influential in politics.\n\nMarx the man by Thomas Sowell helped me better understand Marx as a person and how that influenced him. There's a audio version on youtube. \n\nThe best source for WW1 history ive found is The Great War youtube channel.\n\nIve recently been watching a youtube channel named \"Setarko\" that covers Russian/Soviet culture, sounds like it might be the type of thing your looking for.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "potusplus",
            "body": "I get where you're coming from, trying to grasp complex political history at 16 is commendable. Start with books like \"History of the World in 6 Glasses\" by Tom Standage for a lighter narrative. For Marxism and Capitalism, try \"The Communist Manifesto\" and Adam Smith's \"The Wealth of Nations\". They're foundational but more accessible. Keep at it and you'll build that power.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Oskie5272",
                    "body": "I'd just like to add that The Communist Manifesto is a pamphlet, it doesn't go into much detail. It's good for a high schooler's first step into socialist thought, but you're far from understanding socialism. Too many conservatives do a half-assed reading of the manifesto and think they understand socialism. Read Das Kapital by Marx and Engels if you want a more thorough understanding of socialism, it's the most important socialist book. Make sure you get a real copy, there's a lot of books on Amazon that advertise themselves as the full thing but aren't. Das Kapital is long as fuck (3 volumes, something like 1500+ pages if I remember correctly) and very dense, so it's not an easy read. Idk your reading level or current level of comprehension of philosophical and political thought, maybe save this for when you're a little older and more familiar with these topics OP",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "potusplus",
                            "body": "Fair yes. Thanks for more context",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RadarTheBoston",
            "body": "Not a book but the Revolutions podcast is quite good. Mike Duncan does very detailed research and gives a really solid overview of all the actors in each of the revolutions covered. Having that detailed and nuanced telling of how a modern nation came to be can be a solid foundation for understanding why a nation currently acts the way it does.  \nIf one of them really interests you, you can also follow up with his source material\nhttps://thehistoryofrome.typepad.com/revolutions_podcast/bibliography.html",
            "score": 2
        },
        {
            "depth": 0,
            "author": "droptrooper",
            "body": "One Nation Under God.  History of the influence of evangelical christianity on american politics over the last century.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "downvotefodder",
                    "body": "Kevin Kruse. An actual historian.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "droptrooper",
                            "body": "His social media presence is pretty funny too",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "OctoberCaddis",
            "body": "Robert Caro’s Lyndon Johnson series and Robert Moses bio (The Power Broker) should be on the list for anyone seeking to learn how many American policymaking processes operate and, in Moses’ case, were created. The Power Broker is also a superb history of New York City from the early to mid/late 1900s.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "EagleOfMay",
            "body": "I'm going to take a different tact then what others are saying/recommending.   IMHO understanding yourself is the first step to understanding why you believe what you believe.   Starting with that premise reading books on philosophy will give you that grounding.    It isn't exactly what you are asking for but it would give a framework for the future reading it sounds like you will be doing.\n\nMy reads have been:  \n\"Revolutionary Russia, 1891-1991: A History\" by Orlando Figes\n\n\"A People's Tragedy\" by Orlando Figes\n\n\"Sapiens: A Brief History of Humankind\" by Yuval Noah Harari\n\n\"The Coming of Third Reich\" by Richard Evans\n\n\"The Cold War: A New History\" by John Lewis Gaddis\n\nNot that you asked but I'm currently reading:  \n\"Germany 1923\" by  Volker Ullrich",
            "score": 4
        },
        {
            "depth": 0,
            "author": "newkid4337",
            "body": "Anything Noam Chomsky",
            "score": 4
        },
        {
            "depth": 0,
            "author": "laborfriendly",
            "body": "My suggestion is to look up a syllabus from a college PoliSci and History course and/or their reading list. \n\nAny book that wants to cover broad swaths of history will not be able to do justice to the intricacies of what was going on and how that contributed to historical and political development. \n\nSome authors try, like with Diamond and *Guns, Germs, and Steel*. But these kind of works will always face severe criticism from specialists. \n\nYou may not be thinking of singular books that cover wide content. So, I say this as a cautionary: \n\nThe only way to create a broader understanding is to look at a broad array of information and sources. \n\nBest place to start would be a university syllabus/reading list for suggestions.\n\nEdit: but let me suggest one thing: Thucydides's *History of the Peloponnesian War*.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Other_Zucchini_9637",
            "body": "The End of the World is Just the Beginning by Peter Zeihan",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "MrMentallo",
                    "body": "His YouTube channel is great too.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MercuryAI",
            "body": "What you have is a *VERY* ambitious goal. Many academics spend their whole lives trying to significantly address one aspect of these things. \n\nFor what it's worth, I recommend the \"very short introduction\" of books\" found on Amazon. It's usually a synopsis written by an academic that covers the basic points of a body of knowledge. Because it's a single author (and not quite a lit review), you will always find people willing to argue.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "TheTalentedMrDG",
            "body": "Great question! \n\nFirst get the Libby App. Any teenager can get a free library card from the Brooklyn Public Library that will let you get tons of free books. If you can, get yourself to an actual physical library too. You can discover a lot just by browsing the stacks. \n\nI recommend these books for a good, general readership introduction to some of these topics. If you're an advanced reader, you might feel comfortable diving into something like \"The Wealth of Nations,\" but it's kind of hard to parse, and it would help to understand the context it was written in.\n\nTalking to my daughter about the economy, by Yanis Varoufakis, is a great way to understand capitalism and its history in the West. The fella who wrote it was a pretty influential Greek minister of finance.\n\nSapiens, by Yuval Noah Harari, is a good general history of people and political thought. \n\nA People's History of the United States by Howard Zinn is a hugely influential book that completely changed the approach to studying history in the US from \"America is great and we should talk about how great it is\" to \"We should talk about how things have gone for poor, indigenous and Black people in America for the past 400 years.\"",
            "score": 3
        },
        {
            "depth": 0,
            "author": "3AMZen",
            "body": "One of the most important political books I've ever read is Naomi Klein's \"The Shock Doctrine: the Rise of Disaster Capitalism\".\n\n\nThe book looks at the global impact of Milton Friedman and his Chicago School of Economics. Friedman's belief that essential government services can be performed better and for cheaper by the private sector has only grown in popularity since the seventies. \n\n\nStudents and disciples of Milton's have been directly involved in conservative governments and military dictatorships across the globe: in South America in the '70s, including at the right hand of Pinochet; in Asia 's. Major entrance into the global markets in the '80s, in post-soviet nations during their redevelopment in the '90s, I'm finally appearing in the west in the forms of privatization, austerity measures, and tax cuts in the 2000s. \n\n\nKlein documents 40 years of cases which show Friedman's practical methods for pushing through unpopular economic decision by preparing plans in advance for times of crises so that when a moment of political unrest or economic uncertainty arises, broad sweeping changes in economic policy can be rolled out with no delay. With case studies spanning decades and continents, it is a great introduction to history of economic uncertainty in the 21st century. \n\n\nKlein is a progressive journalist aunt. It's fair to say that she lays a fair share of the blame for global suffering on the hands of rampant unregulated free markets. She's not s***** or condescending in her writing though, her work is very readable and builds strong arguments.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Disheveled_Politico",
                    "body": "I think The Shock Doctrine makes some interesting points, but it’s extremely biased and I wouldn’t suggest a 16 y/o read it without a more thorough historic and political understanding of the world. \n\nKlein really tries to fit everything into the “Chicago school of economics wants chaos so they can profit” lens, and I don’t think that’s fair. She’s got a pretty dark and conspiratorial view of people in power. Her analysis of historic events lacks a lot of context, and her equating economic pain with literal torture is quite the stretch.\n\nIf I had read that as a kid instead of as a 25 year old I think I’d have a much less nuanced view of the world. Reading it after I had some background make me a little more skeptical of any reactionary (or radical) change during a time of instability. ",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "hiball727",
                    "body": "Preach^^^^",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrFifty-Fifty",
            "body": "The Silk Roads",
            "score": 1
        },
        {
            "depth": 0,
            "author": "absolute_poser",
            "body": "A good podcast is the BBC’s Philosophy in Our Time, which has a lot of political philosophy from an academic view point.\n\nAs for books - I would recommend starting with “The Worldly Philosophers”, which gives a good overview of the relevant history and philosophy related to things like Marxism and Capitalism.  He does get opinionated at times, but this is an issue in nearly all books to some degree or another. If you read this book, you will definitely have a better understanding of political economic theories than the vast majority of adults.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MattNyman",
            "body": "I recently read this book, written by a person with only one view - Christianity in the 1950s.  But the author does a really good job of explaining what the various thinkers were saying before bashing them as inconsistent with his Christian philosophy.  https://www.goodreads.com/review/show/6255610263",
            "score": 1
        },
        {
            "depth": 0,
            "author": "raisedonjive",
            "body": "Start with a couple of YouTube video authors one is called the Great war, and the other one is called Stephen Koktin waiting for Stalin or something like that. Get a mastery of those two and political history and current day politics will fall close to these lines",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Current-Cell-8733",
            "body": "Democracy Awakening by Heather Cox Richardson and American Psychosis by David Corn were a couple of my recent reads and really good. I read Allow Me to Retort last year. Important black perspective.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hiball727",
            "body": "It’s not the exact lane of booking you’re looking for but I really recommend Shock Doctrine by Naomi Klein. \n\nGood to know the underlying economic structures motivating global political decisions.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Usual-Requirement368",
            "body": "Seymour Martin Lipset’s “The First New Nation.” You can buy it online from a used bookstore. It goes into how Democracy became the thing in the 1830s & ‘40s and why. It tells how at that time, the US began pulling toward Democracy and away from “federalism.”",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Particular-Spend8249",
            "body": "Greeks and Romans Bearing Gifts by Carl J Richards",
            "score": 1
        },
        {
            "depth": 0,
            "author": "twot",
            "body": "The Sublime Object of Ideology.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "springboks",
            "body": "The creature from Jekyll island and also diary of an economic hitman. Then watch nick cages lord of war.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Human_Consequence400",
            "body": "Books about Cicero's life, the more things change, the more they stay the same. Politics is a waste of time / energy / focus. Anyone who's good enough to do the job is also wise enough to be nowhere near it, so we end up being \\[somewhat\\] ruled over by a gaggle of turds.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "neunflach",
            "body": "The Blowback podcast does not directly answer what you're asking for, but I found it enlightening as a young person to understand mechanisms of power in relatively recent American history, through an entertaining and admittedly leftist lens. This opened a door of thinking for me to lead to seeking more targeted books and authors of interest. They focus on one key event per season.\n\n[https://en.wikipedia.org/wiki/Blowback\\_(podcast)](https://en.wikipedia.org/wiki/Blowback_(podcast))",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DeusExMockinYa",
            "body": "A lot of recommendations here concern political theory but not as much concerning the study of politics.\n\n[The American Congress Reader ](https://www.goodreads.com/book/show/4981416-the-american-congress-reader) is a collection of essays, organized by topic, that explores the Constitutional and historical context of the American Congress; elections and the negative rational behavior they produce; policymaking and agenda-setting; and the relationship between Congress and the other major stakeholders (i.e. the other branches of American government as well as lobbyists and special interests).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ubix",
            "body": "I would like to suggest that you start with some of the basic tools you might need to analyze political speech. Rhetoric and rhetorical discourse, propaganda techniques and a history of journalism will help to understand why things are written the way they are, what an author might intend with their article, and how frequently propaganda techniques are used in today’s journalism.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ebonythrowaway999",
            "body": "People have been giving you some good recommendations, but other recommendations are way too specialized and/or abstruse for a 16-year-old reader (even a very smart one like you seem to be, OP).\n\nFor a very readable overview on politics in general, I'd suggest *50 Politics Classics* by Tom Butler-Bowdon. The author takes what he thinks are the 50 most important political books/treatises and summarizes them in a very digestible and entertaining fashion. I'd also recommend the author's related book *50 Economics Classics*.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Happygar",
            "body": "Vision of the Anointed by Thomas Sowell.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "limache",
            "body": "If you want to understand why we have the problems we have today economically, this book will explain the history. \n\n[A Brief History of Neoliberalism](https://www.amazon.com/Brief-History-Neoliberalism-David-Harvey/dp/0199283273?dplnkId=abec353e-8bcc-4f32-991c-d925e06b5e45&nodl=1)\n\nNeoliberalism--the doctrine that market exchange is an ethic in itself, capable of acting as a guide for all human action--has become dominant in both thought and practice throughout much of the world since 1970 or so. Writing for a wide audience, David Harvey, author of The New Imperialism and The Condition of Postmodernity, here tells the political-economic story of where neoliberalization came from and how it proliferated on the world stage. Through critical engagement with this history, he constructs a framework, not only for analyzing the political and economic dangers that now surround us, but also for assessing the prospects for the more socially just alternatives being advocated by many oppositional movements.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SENsationals02",
            "body": "If you want to understand power in semi-modern politics and how it has been employed, I’d recommend Master of the Senate by Robert Caro. Great read about the US Senate, but definitely not a general knowledge book.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Soosietyrell",
            "body": "Fwiw- I’m abt 60 with a BA in Polisci and a Masters in Ed, with a minor in History.  And I love Russian History.  Still finding things to read that impact my perspectives!!!!\n\nFirst book came to mind - It’s an old book  - Morgenthaus “Politics Among Nations”- helps with 1800s forward.  It really helped me understand up to WW1\n\nWould also say to read sources like Karl marx actual book and Paine’s The Rights of Man, as well as Lockes Two Treatise on Govt.  Also Adam Smiths Wealth of Nations.  Even Spark notes/ cliff notes on these would be helpful!\n\nAs for Russian History…. Find  a text book called “ Russia and the Soviet Union” - it’s old but solid. Also for more modern history Pasternsks “Dr Zhivago”, while a novel, provides context to the impact of WW1, and the actual Civil War that followed the revolution.  Then Solzhenitsyn’s “Gulag Archipelago” really nails the reality of the purges.  \n\nI am currently reading Scott’s works on the French Revolution and Napoleon as well.  Scott was alive during that time, so it’s an interesting perspective.   The Revolution in the US and France sort of started the fire of non king led nation states outside of England.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "liquorandwhores94",
            "body": "If you were interested in learning about US foreign policy and intervention I can't recommend the podcast Blowback highly enough. Season one about the Iraq war and season 2 about Cuba will help fill in your knowledge that you won't have much context on given your age. (It completely changed my perspective and I'm 29).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PyrricVictory",
            "body": "Grand Old Party by Lewis Gould covers the formation of the modern Republican party from the 1850s through 2003.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "wokka7",
            "body": "Not really what youre asking for but 1984 is a great political commentary and much lighter reading. Could be a nice break from the denser stuff. Also Animal Farm",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ginaie",
            "body": "Aside from book recommendations, I think the best advice I can add is to question and understand the background and beliefs of any author or content creator. Even history books will contain bias based on the period it was written in, the author themselves and their own perspective in the world. To understand their motivations and their own background helps you get a good sense of is this a fair analysis of the events or is their view potentially skewed. Then maybe find an author who writes about the same topic but from a different perspective.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mtsnowleopard",
            "body": "An Afro-Indigenous History of the United States by Kyle T Mays\n\nSettler colonialism is the dominant political force across the globe. It's a framework that contains all other political dynamics. \n\nThe best way to get an understanding of settler colonialism is to listen to the people most acutely affected by it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ConsitutionalHistory",
            "body": "[https://uwpress.wisc.edu/books/0362.htm](https://uwpress.wisc.edu/books/0362.htm)\n\n[https://www.goodreads.com/en/book/show/43361](https://www.goodreads.com/en/book/show/43361)\n\n[https://www.penguinrandomhouse.com/books/106260/american-scripture-by-pauline-maier/](https://www.penguinrandomhouse.com/books/106260/american-scripture-by-pauline-maier/)\n\nWhile I appreciate your interest and enthusiasm in becoming a member of the learned electorate there is no 'one book' to learn all you need to know.  The study of our history, politics, and culture is a journey.  That said...I've read the above three and can highly recommend them as good jumping off points on Constitutional history, American cultural history, and the philosophy behind the Declaration of Independence.\n\nGood luck...j",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PerformanceActual685",
            "body": "Howard Zinn Peoples History of the United States.   A must have!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RevampedZebra",
            "body": "Michael Parentis Blackshirts and Reds",
            "score": 1
        },
        {
            "depth": 0,
            "author": "profundacogitatio",
            "body": "For a good grounding in US politics, I recommend following the same philosophical thread that led to the country's founding.    \nHobbes, Leviathan.   \n\nLocke, Two Treatises of Government.   \n\nRousseau, The Social Contract.  \n \nThe Declaration of Independence.  \n\nThe preamble of the Constitution of the United States (this is a very short but very important piece of political writing)\n\nI'm also personally fond of John Stuart Mill, On Liberty. Written in 1859, it captures themes that are still influential in US and British politics.\n\nI have less to offer on Russian politics. If you read Marx, please also seek material on how that theory played out in actual implementation in early Soviet Russia, post-WW2 China, and Cuba.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DonHohnson",
            "body": "If you read \"Rage\" by Bob Wodward followed up by his 8 hour audiobook. You will understand our situation were in",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ifixart56",
            "body": "This is an ignoble recommendation dripping of cynicism, and probably college level (when I HAD to read them): The Prince by Machiavelli and The Trial by Franz Kafka. You’ll know what someone means when they refer to someone as Machiavellian or Kafkaesque (esp government, insurance and court system)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FridayB_",
            "body": "Just want to add to the great suggestions here by recommending you follow up your reading with a quick search on what others believe was left out of that specific book. \n\nFor example, there was a right wing book on American history with a chapter claiming to be a gathering of all essential documents to understand the civil war. Primary sources, Seems great. \n\nThe problem is, the list of documents notably excluded the Declarations of Causes for Secession of all 5 states that wrote them. \n\nWhy publish a book of comprehensive documents to better understand the civil war without the documents that explain the literal reasons given for the civil war? Well, because all 5 documents mention upholding slavery as a reason, if not the main reason, for seceding. One even mentions the states anger with northern states for exercising their own states rights to not return escaped slaves, completely disproving the idea that the civil war was “about” states rights in the first place.  https://www.battlefields.org/learn/primary-sources/declaration-causes-seceding-states\n\nIt’s not always what’s said, sometimes what is not said paints the clearest picture.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "reluctantdemon",
            "body": "If you are a huge fan of lists, you are welcome to head to the r/AskHistorians wiki and browse their book catalogue, but you'd get bored halfway through your first book anyways, so don't bother. Being well-informed isn't all that it's cracked up to be. What are you even going to use this information if you not going to run for government? You are not in the position to change anything, and your well-informed, carefully considered vote is just going to be cancelled out by some subliterate moron's anyways. Is it worth sinking hundreds of hours to become more of a nerd? If you just want to impress your friends, read The Economist, watch whatever political podcast strikes your fancy and parrot their views. Much better use of your time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Disheveled_Politico",
            "body": "This book is long, but I found it accessible and interesting: \n\nThe Cold War: A World History by Westad\n\nIt isn’t chronological overall, it breaks conflicts and national interests into what are essentially sub-plots. For example, you get the Vietnam War from colonial French Indo-China to (I think) post Chinese intervention over like 40 pages and then it goes to South Africa, or Czechoslovakia, or Cuba, etc. \n\nBut, it gives you a good understanding of the interests at play, the motivations of leaders, etc. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ResponsibleLion",
            "body": "For a rundown of *modern* US politics (i.e. the two-party system of Democrats and Republicans and the way each party leans on various issues), I highly recommend:\n\n***What You Should Know About Politics . . . But Don't*** (5th edition)\n\nI'm glad it got recently updated (as of Jan 2024) because the past 4 years have been a whirlwind of changes",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hotplasmatits",
            "body": "Chip war by Chris Miller. So much of what's happened since ww2 has to do with the US protecting its cpu manufacturing pipelines.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jadnich",
            "body": "If you are interested in the current US political climate, the book “The Red and the Blue” by Steve Kornacki was extremely enlightening.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ThePegLegPete",
            "body": "While it's more topical/current in some sense and I actually dislike the guy, think he's a blowhard, there's some interesting stuff in Peter Zeihan's The Beginning of the End of the World.  It gives a lot of historical context on present situations with future predictions.  Just don't take it as gospel. \n\nI recommend it because it is easy reading for a 16 year old.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "indycishun1996",
            "body": "People’s History of the United States by Howard Zinn",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Oh_My_Monster",
            "body": "Other people have great recommendations so I'll add a fun one. [America the Book by Jon Stewart](https://a.co/d/9LZcZaw)\n\nIt's satire but still informative",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Thepants1981",
            "body": "Guns, germs, steel.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "That book has a number of issues that Political Scientists, Anthropologists and Historians have pointed out\n\nhttps://www.reddit.com/r/AskAnthropology/comments/1rzm07/what_are_some_of_the_main_anthropological/",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Thepants1981",
                            "body": "Yeah. It’s a bad take, I just like the idea of people reading it to generally center their political compass away from falsehoods. I certainly don’t think it should be cannon. My bad for not being more specific in my recommendation.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "leaf_fan_69",
            "body": "1984 is a good starting point",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Moist_Drag8239",
                    "body": "Already read that but thanks",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DockPockers",
            "body": "Political order duology - Francis Fukuyama. This goes over the evolution of various public institutions and does a great job of giving you the tools to not be swayed by whatever TikTok you saw that day",
            "score": 0
        },
        {
            "depth": 0,
            "author": "fazer0702",
            "body": "😆😆😁🙉2🐦🕊️🌎🐫 ťrfțtcgřdř years old and t is a little eearřrtr call řêtd op of sþ. P ŵèêer every",
            "score": 0
        }
    ]
}