{
    "title": "What are valid arguments for and against enacting right to disconnect laws?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gashgoldvermilion",
            "body": "In my opinion, the best argument for right to disconnect laws would be found in the very nature of employment agreements. An employment agreement, in the simplest terms, is an agreement between two parties, in which one party agrees to a particular kind of work and commitment of a particular amount of time, while the other party agrees to provide compensation for that work and time. The work, time, and compensation should all be as clearly defined as possible. If the employee does not have a right to disconnect, then that means that the time commitment required by the job is not clearly defined, and the employee is not able to properly gauge what level of compensation is commensurate to the nature of the job.",
            "score": 74,
            "replies": [
                {
                    "depth": 1,
                    "author": "hiptobecubic",
                    "body": "What i dislike about framing it in terms of what the employer does rather than what the employee does is that it restricts people's ability to decide what they want to do with their time. I am salaried, not hourly, and I have coworkers around the world. We have a policy of expecting people to protect their own time and disconnect themselves when they don't want to be contacted. This works great imo. If I'm sitting around at home and think of something, i can send it. If you're interested you can read it. If you aren't, you'll read it when you reconnect. As long as people are getting their jobs done we don't much care. \n\nI realize the situation is different for people working hourly or in the kind of job that is primarily about cranking through a backlog of tasks that aren't particularly creative, but that's kind of the point.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gashgoldvermilion",
                            "body": "I'd be fine with the law not applying to salaried employees, as long as there is a reasonable salary threshold for making employees overtime-exempt. Not sure if you are in the U.S. or not, but have only just recently begun getting our overtime-exemption salary threshold back to a reasonable number.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hiptobecubic",
                                    "body": "Is your main concern that people might take a salaried job thinking it's strictly 9-5 and then be trapped somehow?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "gashgoldvermilion",
                                            "body": "Something like that, although I think in practice it's often a little more complex. If the employer and employee aren't clear from the beginning regarding expectations for the employee's availability outside the standard office hours, then there is often a creeping effect, where works starts to gradually intrude more and more into the employee's personal life. And by the time the employee realizes that they need to establish firmer boundaries, they are already in a position where doing so will mean coming off as uncommitted or not willing to be a team player or some other nonsense.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "hiptobecubic",
                                                    "body": "I see. Yes that is a risk i agree, although i think any time the employee does anything whatsoever that isn't spelled out in their contract they take on the same risk.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PrivateFM",
                    "body": "That's a really good point. How would you respond to the views of some that right to disconnect provisions are best enshrined in such individual agreements rather than being legislated for all workers across the nation considering how different workplaces/industries have varying requirements?",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LordSwedish",
                            "body": "Chiming in here, I don’t see how that makes any sense unless the intention is to trick workers into signing away their free time.\n\nTrying to tell your bosses that you don’t want to give it “110%” or whatever can be really hard, this law ensures that the most desperate can’t be taken advantage of and manipulated as easily.",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "MoiMagnus",
                            "body": "If a country has any kind of \"minimal wage per hour\" or \"maximal number of hours worked by day/week/etc and mandatory holidays\", then while those hours of \"available and connected\" are not actually hours of \"full work\", they are still hours that ought to be regulated following the same logic, as \n\n* they corresponds to some amount of time given away from the worker's life (so maybe a minimal wage per hour where the workers must be available/connected, obviously an order of magnitude lower than actual working hours), \n\n* and a mental charge pending on them (so maybe a guaranteed time per day/week/year where the workers has a right to disconnection, for the sake of their mental health).",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "gashgoldvermilion",
                            "body": "I do think that enshrining such provisions in individual agreements would be ideal. I just don't know if there's enough incentive for employers to do this voluntarily, especially for lower wage work. As with most labor law issues, it boils down to how much trust to give to employers vs. how much to aid workers with the arm of the law. Workers often find themselves with very little bargaining power compared to employers, so I tend to generally be in favor of laws that, in my view, tip the power scales towards a better balance between employees and employers.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "SuperSocrates",
                            "body": "That it’s nonsense and would only be used to exploit workers",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mtarascio",
                    "body": "The clause has been covered by 'reasonable overtime'.\n\nThis is shoring up that wording but of course there will be some ambiguity, but that's for the workplace ombudsman and courts to work out.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "rotates-potatoes",
            "body": "The for/against is going to come down to whether one sees disconnected time as a health/safety issue (like the right to a workplace without greased, electrified stairs) or as a negotiated aspect of employment (like starting at 8am). \n\nI suspect all arguments will boil down to somewhere on the spectrum between the two. A middle ground like \"no more than X hours/week\" or \"from 11pm - 6am\" would be analogous to minimum wage laws or PTO laws: the belief that society should set some boundaries but allow negotiation above that level.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "Trodamus",
                    "body": "I vehemently disagree with the latter since it is tantamount to placing labor rights as negotiable. \n\nWould you have it as “a negotiated aspect of employment” that you work an extra unpaid “volunteer” day?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PrivateFM",
                            "body": "But aren't the rights of an employee in a specific workplace meant to be negotiated on? While it's universally agreed that workers should have rights, doesn't the wage they desire also depend on defined parameters that would ensure optimal productivity? Including the extent to which they can ignore contact from their employer?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PrivateFM",
                    "body": "In both scenarios, is it ideal for both parties that there be stipulations in an employment agreement on the specific points of contact for urgent matters during off-hours?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MyPacman",
                            "body": "That is not related to a right to disconnect, that is On Call.  On Call will have different requirements that are very clear.  If you are on call and you get a call, you are paid, you usually get an extra stipend for being on call too.\n\nThis doesn't apply to right to disconnect where the boss is just calling cause he has a printer problem and knows you can fix it, or he just had a thought and wanted to share it with you, or wanted to ask you to work tomorrow (and yes, I don't consider this a reasonable call, especially if they are calling outside work hours)",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PrivateFM",
                                    "body": "But assuming that an employer has a predilection for vexatious calls in the middle of the night, shouldn't it be decided between them and the employee whether those calls are reasonable? Doesn't enacting a right to disconnect assume immediate malice on such behavior and impose an unfair standard on most employers?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        }
    ]
}