{
    "title": "If a country has the terrain and climate conducive to producing illicit drugs, is that a form of \"resource curse\"?",
    "comments": [
        {
            "depth": 0,
            "author": "Autoxidation",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "unkz",
                    "body": "> these states don't have the ability to effectively enforce taxes on the production of illicit drugs.\n\nI don't think this is true.  The Taliban have forced a 95% reduction in opium poppy cultivation -- if they can stamp it out almost entirely, they would find it much easier to tax it.\n\nhttps://www.unodc.org/unodc/en/press/releases/2023/November/afghanistan-opium-cultivation-in-2023-declined-95-per-cent-following-drug-ban_-new-unodc-survey.html\n\n> Opium poppy cultivation in Afghanistan plunged by an estimated 95 per cent following a drug ban imposed by the de facto authorities in April 2022, according to a new research brief from the United Nations Office on Drugs and Crime (UNODC).  \n\n> UN officials noted that the near-total contraction of the opiate economy is expected to have far-reaching consequences and highlighted the urgent need for enhanced assistance for rural communities, accompanied by alternative development support to build an opium-free future for the people of Afghanistan.  \n\n> Opium cultivation fell across all parts of the country, from 233,000 hectares to just 10,800 hectares in 2023. The decrease has led to a corresponding 95 per cent drop in the supply of opium, from 6,200 tons in 2022 to just 333 tons in 2023.\n\nAnd it sounds like there's quite an arbitrage available here.  If they lost $1 billion/year in revenue, a lot of money that could be converted to taxes -- even at an aggressive 50% tax on the excess profit, that would be $500m in the Taliban's coffers.\n\n> Many farmers turned to cultivating wheat instead, with an overall increase of 160,000 hectares in cereal cultivation across the Farah, Hilmand, Kandahar, and Nangahar provinces. Though wheat cultivation may alleviate food insecurity to some extent, the crop generates much less income than opium – farmers in the four provinces lost around US$ 1 billion in potential income in 2023 by switching to wheat.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This is an interesting response.\n\nPer Rule 2, would you mind editing in some souces to support the assertion about the wide geographic range of poppy production, the implication that Colombia is a \"failed state,\" and a the definition of \"Georgist land value taxes\"? Thanks.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Autoxidation",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cn9q12/-/l36lz3z/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Vaadwaur",
            "body": "Apologies for a slightly indirect [source](https://reliefweb.int/report/afghanistan/decision-plant-poppies-irrigation-profits-alternative-crops-afghanistan) on the topic, but in Afghanistan specifically poppies are appealing because they require WAY less water than most crops do. And since they deal with a naturally dry climate, the somewhat obvious happens.",
            "score": 2
        }
    ]
}