{
    "title": "Who is protesting at US university campuses and what are their goals?",
    "comments": [
        {
            "depth": 0,
            "author": "Statman12",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tb1969",
            "body": "College Protester demands vary by school and group but the most consistent demand is that the college institution divest the endowments from Israeli companies and institutions over Israeli human rights violations in Gaza.\n\nhttps://www.washingtonpost.com/education/2024/05/03/campus-protest-origins-demands-divest/",
            "score": 194,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "Thanks for this. From that article:\n\n> Such divestment can be complicated when a university’s financial relationship to a targeted company is not direct but through an investment in an index fund.\n\nIndeed, [index funds](https://www.investopedia.com/terms/i/indexfund.asp) are diversified, making them safe and extremely popular, but it would be possible for any well-educated investor to avoid them and make targeted investments instead. The issue comes up when any institution's investing guidelines mandate low risk investing with the highest possible yields. It's hard to beat index funds for that.\n\n> “Divestment is a rallying cry that is nationally resonant,” said Nick Wilson, a 20-year-old Cornell student involved in the protests. “We don’t want our tuition dollars going to the research and development of weapons” that may be used against Gazans.\n\nIs it tuition dollars or endowment dollars that are going towards these investments? My understanding is that tuition dollars get spent entirely on education. In a university like Harvard, tuition revenue doesn't even cover operating expenses and [the endowment has to make up the difference to the tune of 37%.](https://finance.harvard.edu/files/fad/files/fy23_harvard_financial_report.pdf) (PDF, page 6) It's less at Columbia, with [only 12% of the budget supported through the endowment,](https://www.columbia.edu/content/financial-overview) but even so, all the tuition dollars are spent on operating expenses. They're not going to investments.\n\n> the most consistent demand is that the college institution divest the endowments from Israeli companies and institutions\n\nMy understanding is that the demand for divestment is complicated by the fact that\n[38 states](https://www.jewishvirtuallibrary.org/anti-bds-legislation) have [anti-BDS laws](https://en.wikipedia.org/wiki/Anti-BDS_laws#Anti-BDS_laws_in_the_United_States) on the books. The list includes not just states with Republican legislatures, but also Democratic strongholds like New York and California, where many of the protests are taking place. \n\nThese laws have passed with overwhelming bipartisan support, so reversing them would be a monumental task for the protesters. But without achieving that, university administrators are often barred from making any moves towards divestment, even if they wanted to. \n\nIn those cases, it's hard to see how the protesters' demands are reasonable or even well-informed, but perhaps I'm missing something. What do the protest groups say about cases where their demands of university administrators conflict with state law?",
                    "score": 70,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "samudrin",
                            "body": "Anti-BDS laws are anti-Democratic and should be repealed on 1A grounds. \n\nhttps://www.aclu.org/press-releases/third-federal-court-blocks-anti-bds-law-unconstitutional      \n\nThere are index funds that screen out weapons manufacturers and return similar gains to the SP500.\n\nhttps://www.google.com/finance/quote/ESGU:NASDAQ?sa=X&ved=2ahUKEwjy2ZKZyfqFAxUFFzQIHS0AC44Q3ecFegQIFxAc&comparison=INDEXSP%3ASP500EW \n\nAIPACs influence on US foreign policy and now domestic affairs cannot be overstated. AIPAC contributions:\n\nhttps://www.opensecrets.org/orgs/american-israel-public-affairs-cmte/summary?id=D000046963",
                            "score": 64,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "Highly relevant information. Thanks for providing the links.",
                                    "score": 22
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "postal-history",
                            "body": "> Is it tuition dollars, or endowment dollars that are going towards these investments? \n\nThe students are aware that the investments are part of the endowment and not taken from their tuition. Many universities acknowledge at the institutional level that their choice of investments ought to represent the values of the university as a place of learning populated by faculty and students, and have looked in the past to students to hear opinions on how to direct endowment funds. Some quotations from Brown University students' overview statement [Brown Divest Now](https://drive.google.com/file/d/1J3VLPCRi7qvMkdcWqj-2HPwR9C1Oq1uL/view):\n\n> [Brown's Advisory Committee on Corporate Responsibility in Investment Practices] served to represent and articulate the Brown community’s moral expectations when it comes to how our endowment is invested. (p.2)\n> \n> “[Divestment] is a critically important and strong statement by the University community...\" (quotation from Brown President Ruth J. Simmons on a past decision to divest from Sudan in 2006; p.1)\n\nThe fundamental issue raised by the Brown protesters is that the university endowment's Advisory Committee already endorsed divestment in 2020. The current president rejected the committee report in 2021 and refused to bring it to the university corporation, which has been the cause of protests ever since. (p.37, footnote 9) A vote of 90% of graduate students and a supermajority of the student council have called on the corporation to implement the committee's decision. (p.22)\n\nFor Brown students, the objective of the encampment protest was simply to force the president and the corporation to agree to a vote. Last week, they reached such an agreement and dismantled their encampment. ([NPR report](https://www.npr.org/2024/05/01/1248403491/at-brown-university-protesters-and-administrators-reach-deal-to-end-encampment))\n\nI have no knowledge of the position of students in other states so can't comment on anti-BDS laws.",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "Excellent information. Thanks!\n\nIt seems like the students at Brown have well-defined, achievable goals.",
                                    "score": 12
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Mainah-Bub",
                            "body": "Many investment professionals would say that “targeting” investments is a bad strategy, though. (That’s one of the [core tenets](https://www.bogleheads.org/wiki/Bogleheads%C2%AE_investment_philosophy) of the [Bogleheads](https://www.bogleheads.org) line of thinking.)\n\nBut this brings up a host of secondary questions, including: what exactly defines a company that has ties to Israel? Is it any company that has a physical presence in the country? Agreements with the government? Customers in that country? (Does Google / Microsoft / Apple / other large American multinationals that do business in almost every country in the world count?)\n\nAnd honestly, an index fund won’t have a major stake in any single company (that’s kind of the point). [Here’s an overview of VTI](https://www.investopedia.com/articles/investing/122315/vti-vanguard-total-stock-market-etf.asp), one of the most popular index investment vehicles, which includes more than 3,700 stocks. As a result, I don’t think there’s a big chance that divestment would have a meaningful impact on the company in question. Divestment from said funds would largely be symbolic, which, sure, but it feels like a weird goal to use as your primary demand.\n\nI mean, if Columbia had 50% of their endowment planted in Raytheon stock, that would make sense. But I’m not sure the general public understands how this kind of investing typically works.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "justahominid",
                            "body": "> Is it tuition dollars or endowment dollars that are going towards these investments? My understanding is that tuition dollars get spent entirely on education. In a university like Harvard, tuition revenue doesn't even cover operating expenses and the endowment has to make up the difference\n\nThis is complicated from the fact that money is fungible. On paper, it can be separated out into various inputs and outputs and trade certain money from one to the other. In practice, if an entity has a certain amount of money coming in (e.g., combined funds from tuition and endowment) and a certain amount of money going out, does it really make a difference which money comes from where? At the end of the day, decisions have to be made based on cumulative totals on both sides (in and out), and things can get fuzzy in order to make the desired outcomes happen.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "aCuRiOuSguuy",
                            "body": "Some demands are much more reasonable. For example, MIT's students simply demand the university to divest from the IDF. This should be a much more morally conscious decision.",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dokibatt",
            "body": "I don't have time for a long post. I'll edit later if I remember. \n\nSeveral universities including Brown have agreed to meet and vote on the protestor demands. What you make of this may depend on your level of cynicism. \n\nThis article does a decent job of summarizing both the demands and agreement. \n\n[https://www.npr.org/2024/05/07/1249368151/gaza-college-protest-deal-brown-rutgers](https://www.npr.org/2024/05/07/1249368151/gaza-college-protest-deal-brown-rutgers)\n\n>\"We thought the best way to sustainably deescalate the situation was to actually talk with our students,\" Northwestern President Michael Schill [told WBUR's *Here and Now*](https://www.wbur.org/hereandnow/2024/05/02/northwestern-campus-protestors). \"We have a good sustainable agreement which provides a number of things that the students wanted and that we wanted to do.\"\n\n>Northwestern's agreement, for instance, permits peaceful demonstrations — though no tents — through the end of classes on June 1, gives students representation on an investment committee and pledges to bring Palestinian students to campus, [among other commitments](https://www.northwestern.edu/leadership-notes/2024/agreement-on-deering-meadow.pdf).",
            "score": 6
        },
        {
            "depth": 0,
            "author": "fractalfay",
            "body": "Zadie Smith has an [excellent article in the New Yorker](https://www.newyorker.com/news/essay/shibboleth-the-role-of-words-in-the-campus-protests) detailing what’s going on, problems with it, use of language by protestors, and she avoids taking a stance one way or the other. Strategies and response seems to vary by state. Palestinian Student Alliance has been active on college campuses since the 90s, and their presence seems to grow in the aftermath of significant conflicts.",
            "score": 29
        },
        {
            "depth": 0,
            "author": "Sorrymomlol12",
            "body": "I haven’t seen many concise arguments for why they are protesting at all. In fact my sister asked me the other day why students are randomly supporting a terrorist group. \n\nSo real quick, the October 7 Hamas attack killed around 1,200 people and 253 people were taken hostage. This includes 764 civilians killed (36 children) while the remaining were Israeli military. \n\nhttps://tennesseelookout.com/2024/02/20/the-most-tragic-victims-in-the-israel-hamas-war-are-those-who-have-no-say-in-it/\n\nSince October 7th, Israel has killed 34,535 Palestinians and there may be an additional 10,000 under rubble. This includes more than 11,000 women and 13,800 children. \n\nhttps://www.npr.org/2024/02/29/1234159514/gaza-death-toll-30000-palestinians-israel-hamas-war\n\nSo there is a huge mismatch between deaths of Israeli and Palestinians especially among women and children (36 Israeli children and 13,800 Palestinian children in 7 months, and counting) \n\nAdditionally, Gaza is surrounded by a wall and the two borders crossings are closed. Israel has 1 border and has closed it (because war) and Egypt is worried about Hamas among refugees sneaking into Egypt and moving the Palestine/Israel problem and turning it into an Egypt/Israel problem if Hamas attacks Israel from Egypt. \n\nhttps://www.npr.org/2023/12/12/1218388766/egypt-israel-gaza-palestinians-hamas\n\nSo for now, the 2 million people in Gaza are stuck there. Women and children who would be refugees fleeing violence are instead part of the death count. \n\nKilling children is a war crime. The US gives Israel military aid which has people upset and I would argue is the root of the protests. \n\nColleges invest their money in the stock market including companies currently profiting by the US support of Israel in this war. Students hope that by pressuring colleges to remove stocks/investment in these companies (divesting), they can make profiting from the war unprofitable for companies as their stocks dip. Colleges have a lot of wealth and power, and students hope to twist their university’s arm into divesting from companies like Boeing will pressure these companies to stop building weapons that may be used to kill Palestinian women and children. \n\nhttps://time.com/6974063/divestment-explained-campus-protest-israel/\n\nThere’s a whole host of unanswered questions for me, like why protest colleges and not the US government directly?  But I suppose colleges are smaller fish to debate and colleges like Brown are negotiating divestment with students as a direct response to the protests. \n\nhttps://www.theguardian.com/world/article/2024/may/04/universities-allow-student-campus-protest-encampments\n\nEdit: this comment is a great write up about why it’s so hard to pinpoint “who started it” and why the most important thing may instead be “what’s are we going to do about it in the future”, hopefully less killings on both sides. \n\nhttps://www.reddit.com/r/NeutralPolitics/s/coDRWpbE0D",
            "score": 39,
            "replies": [
                {
                    "depth": 1,
                    "author": "boredtxan",
                    "body": "are any outside parties validating the death tolls?",
                    "score": 30,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "postal-history",
                            "body": "The IDF and Israeli intelligence officials both believe the Gaza Health Ministry death toll to be reliable.\n\nhttps://www.newarab.com/news/israeli-intel-confirms-gaza-health-ministry-stats-reliable\n\nThe Gaza death toll has also been affirmed by the US:\n\nhttps://www.wsj.com/world/middle-east/u-s-officials-have-growing-confidence-in-death-toll-reports-from-gaza-b3b5183a?st=arejzgntqzb3py3&reflink=desktopwebshare_permalink\n\nAs well as the UN:\n\nhttps://english.almayadeen.net/news/politics/un-affirms-accuracy-of-gaza-ministry-of-health-death-toll-fi",
                            "score": 33
                        },
                        {
                            "depth": 2,
                            "author": "TurkeyFisher",
                            "body": "Yes, by both [Johns Hopkins](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(23)02713-7/fulltext) and [The London School of Hygiene and Tropical Medicine](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(23)02640-5/fulltext) using bombing reports and satellite imagery: [https://time.com/6909636/gaza-death-toll/](https://time.com/6909636/gaza-death-toll/)",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "Those first two links seem to be the same and they're both broken. Would you please review and revise them?\n\nSame thing in your other comment in this thread.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TurkeyFisher",
                                            "body": "That's weird, they are working from me and were copied directly from the Time Magazine article. I relinked them manually, so hopefully that fixes it. Either way, the same sources are available in the Time Magazine article.",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "boredtxan",
                                    "body": "thank you for validating the data.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1clf4ix/-/l2wxg2j/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Sorrymomlol12",
                            "body": "I would actually argue that it is well known that Hamas committed war crimes on Oct 7 but I had told my sister for the very first time last week that Netanyahu has committed war crimes (she doesn’t follow politics at all really). \n\nShe knew about the hostages, she knew about the Hamas killings, she had no idea that Netanyahu had committed a single war crime. She was very annoyed at the student protests and was confused why anyone would side against the Israelis after the Oct 7th attack. She genuinely did not know tens of thousands of Palestinian children had died and continue to die. \n\nBoth sides have committed war crimes. Specifically the children are the victims. One started it and brutally killed 36 children, but the other side continues to commit war crimes and has killed 13,800 children and counting. And the US is funding the ongoing violence. And they can’t escape either. There is no excuse as to oopsie kill that many children. \n\nHamas is a terrorist organization and shouldn’t be funded, but Netanyahu probs shouldn’t be funded until there’s some sort of ceasefire and the Egypt border open/ (or other option) for women and children to escape. It’s complex but I can understand from an empathy perspective how that many dead children is something people want to end.",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ClockworkJim",
                                    "body": "You're incorrect and stating Hamas started this. Israel started this with the Nabka decades ago. They have been continuously oppressing and occupying Palestinians for decades.",
                                    "score": -25,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nosecohn",
                                            "body": "Please edit in a source for this claim, per Rule 2.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Statman12",
                                    "body": "This comment has been removed for violating [comment rule 2] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) as it does not provide sources for its statement of fact.  If you edit your comment to link to sources, it can be reinstated.  For more on NeutralPolitics source guidelines, see [here] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources).\n\nIf you have any questions or concerns, please feel free to message us.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": -1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "H_E_Pennypacker",
                    "body": "Why protest colleges? Because it’s their (and their family’s) money that they are paying to the college, that is going to Israeli companies. That is the protestors’ position.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "OldLegWig",
                    "body": "this rationale presumes that the deaths from the surprise terrorist attack  are equivalent to collateral damage from retaliatory action wherein the terrorists have a [long history of using their civilian population as human shields](https://amp.theguardian.com/world/2023/oct/30/human-shield-israel-claim-hamas-command-centre-under-hospital-palestinian-civilian-gaza-city). are you suggesting that Israel should retaliate until they have killed the exact same number of people as the losses they suffered on October 7th and then stop? would the same logic hold true for the number of [rapes](https://www.vox.com/world-politics/24093631/un-israel-october-7-sexual-violence#:~:text=Based%20on%20its%20findings%2C%20the,subjected%20to%20sexual%20violence%2C%20too) and [hostages](https://www.bbc.com/news/world-middle-east-67053011.amp)?",
                    "score": 24,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SeesEverythingTwice",
                            "body": "Israel has already [taken more hostages](https://www.hrw.org/news/2023/11/29/why-does-israel-have-so-many-palestinians-detention-and-available-swap) and there have been plenty of [reports of sexual violence](https://amp.cnn.com/cnn/2024/02/20/middleeast/israel-hamas-un-investigation-sexual-abuse-intl) against Palestinians. \n\nNo, the idea is not to retaliate to the exact number, obviously. The idea is a proportionate response that seeks to avoid killing civilians. When Israel does things like [attacking hospitals](https://www.nytimes.com/2024/04/02/world/middleeast/gaza-al-shifa-hospital.html?smid=nytcore-ios-share&referringSource=articleShare&sgrp=c-cb) and [aid centers](https://amp.cnn.com/cnn/2024/03/05/middleeast/israel-fire-palestinians-aid-northern-gaza-intl), it seems like they are doing very much the opposite. When [mass graves](https://www.aljazeera.com/amp/news/2024/4/25/signs-of-torture-as-nearly-400-bodies-found-at-gaza-hospitals-mass-graves) are found of hundreds of civilians in restraints, Israel isn’t even trying. \n\nIsraeli officials have also been [pretty nakedly clear](https://apnews.com/article/israel-palestinians-south-africa-genocide-hate-speech-97a9e4a84a3a6bebeddfb80f8a030724#:~:text=TEL%20AVIV%2C%20Israel%20(AP),a%20charge%20that%20Israel%20denies) with their goal to wipe Gaza off the map. \n\nObviously the violence by Hamas is reprehensible but it doesn’t give Israel license to massacre civilians as they see fit.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OldLegWig",
                                    "body": "as mentioned (and cited) earlier, Hamas' defense strategy of using human shields (including hospitals, as cited in the Guardian article) contributes to civilian casualties. i'm not sure how one judges what is \"proportional\" to a terrorist attack that largely targeted young concert-goers and families, but i'd be interested to see some examples of where such a constraint was placed on a country for a similarly heinous attack.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TurkeyFisher",
                                            "body": "Human shields might contribute to human casualties, but there are increasingly reports of IDF soldiers murdering civilians ([source](https://www.bbc.com/news/articles/cw07wgrwzywo)), and even luring civilians out of buildings using drones that broadcast cries for help, only to shoot anyone who emerges ([source](https://www.middleeastmonitor.com/20240418-israel-using-drones-to-broadcast-cries-for-help-in-gaza-to-lure-shoot-palestinians/)), and with the lockout of journalists from Gaza there is likely more we don't know about. It's not just about whether the response is proportional, but what the actual goals of the Israeli government is. If their goal is to get the hostages back, they could have taken the deal offered by Hamas yesterday. If their goal is actually \"[complete victory](https://www.pbs.org/newshour/world/defiant-netanyahu-declares-israels-goal-is-complete-victory-in-gaza-after-un-court-ruling)\" as Netanyahu has stated, presumably continuing the siege and famine on Rafah until Hamas surrenders, then as an American Jew I find that a completely unacceptable level of response and far beyond being \"similarly heinous\" to what Hamas did on October 7th.\n\nHamas, who's leadership resides in Qatar, cannot be defeated this way ([according to an EU diplomat](https://www.politico.eu/article/eu-josep-borrell-israel-hamas-military-means-munich-security-conference/)). It would appear to me that Israel wants Gaza bulldozed, but even if they succeed in the genocidal act of doing so, the children who survive this conflict will likely turn into radical extremists, as we've seen happen so many times previously, so I question even the efficacy of their strategy, beyond it's immorality.\n\nIsrael is also risking dragging Iran into a war, which would be nightmarish scenario for Iran, Israel and the US.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "SeesEverythingTwice",
                                            "body": "I think the other reply to this does a good job explaining that there are clear instances of civilians dying when they're not human shields. Can you give any examples of that happening in this conflict that doesn't come from the IDF? Particularly at a rate that explains the number of civilian casualties? That's not to say it doesn't happen - I'm just curious because I know it's happened in the past. \n\nIn terms of a 'proportional response', I'm not sure about other countries operating under this constraint, but that doesn't mean it's a bad standard. I think most people agree that the US used more force than necessary in invading the middle east. I suppose you could argue that protests against that war was people attempting to place that same constraint.\n\nI'd also push back on the identities of the victims of October 7th having to do with 'proportional responses', especially when civilian deaths are involved. What happened that day was clearly horrific and a tragedy, but when invoked in discussing the magnitude of response, I worry that it just paves the way for civilian death on the other side, which is also horrible. By that logic, what is to stop Palestinians from seeing massacres at hospitals and aid sites and deciding on their own response? Where would it end?",
                                            "score": 0
                                        },
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "OldLegWig",
                                                    "body": "Hamas is overwhelmingly supported by the Palestinian people and [3/4 Palestinians agree with the October 7th attack](https://www.reuters.com/world/middle-east/poll-shows-palestinians-back-oct-7-attack-israel-support-hamas-rises-2023-12-14/). Attackers on October 7th [included Palestinian militant groups and civilians working in concert with Hamas](https://flashpoint.io/blog/israel-hamas-war-military-and-terrorist-groups/). UN employees had direct involvement in the October 7th attacks. [\\[1\\]](https://www.reuters.com/world/middle-east/un-palestinian-refugee-agency-investigates-staff-suspected-role-israel-attacks-2024-01-26/) [\\[2\\]](https://www.nbcnews.com/news/un-workers-played-direct-role-oct-7-hamas-attack-israeli-intelligence-rcna136201) [\\[3\\]](https://www.cnn.com/2024/02/16/middleeast/israel-allegations-unrwa-october-7-intl/index.html)\n\n  \ni'd also like to point out that you are using twitter and instagram as your sources and i'm using reuters, cnn, and msnbc. LOL",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Zhadow13",
                                                            "body": "They are literal videos of Israeli officials , does it matter where it's from?\n\nIm also using \"Times of Israel\" to show Israelis themselves critize how Bibi backed Hamas, but u seem to have ignored that part 〽️",
                                                            "score": -1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "SeesEverythingTwice",
                                                            "body": "I don’t believe there has been any evidence to support the claims that the UN employees were involved in October 7th other than Israel’s claims. \n\nYour first source also specifies that the war in Gaza has raised the level of support of Hamas. It seems pretty circular to claim civilians support them, attack said civilians and raise their level of support, and then point to the resulting number. \n\nNot to deny that there is indeed support, but given Hamas’ authoritarian nature, I don’t believe it’s exactly fair to hold citizens accountable in this way.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "OldLegWig",
                                                                    "body": "> Your first source also specifies that the war in Gaza has raised the level of support of Hamas. It seems pretty circular to claim civilians support them, attack said civilians and raise their level of support, and then point to the resulting number.\n\nis it circular logic? it strikes me as prejudiced to assume Palestinians can't distinguish between a terrorist attack targeting civilians and collateral damage suffered during retaliatory violence.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "SeesEverythingTwice",
                                                                            "body": "I’m not assuming that? From the source you gave:\n\n“the ensuing Gaza war has lifted support for the Islamist group both there and in the West Bank”\n\nTo me, that implies their support was lower before the war. Sadly I think violence breeds violence and both sides are going to have folks become resentful and radicalized in years to come.\n\nIt seems to me more like both sides are cavalier with civilian lives and the losers are the people of Israel and Palestine",
                                                                            "score": -1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "OldLegWig",
                                                                                    "body": "civilians were intentionally and primarily targeted on October 7th. you are drawing an extraordinarily egregious false equivalency between the motivations of the two sides. it's quite obvious that if Israel wanted to wipe Gaza off of the map, they are more than capable of doing so and would have accomplished it long ago, but they don't. It's also clear that if Hamas had the capability to do the same to Israel, they absolutely would.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "nosecohn",
                                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAs you can see from the link above, Instagram isn't a qualified source in this subreddit and Twitter may only be used to verify statements made by the account holder. After you've replaced those sources, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1clf4ix/-/l33cnch/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NeutralverseBot",
                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message={url}) so that we can reinstate it.\n\n^((mod:vs845)^)",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NeutralverseBot",
                                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message={url}) so that we can reinstate it.\n\n^((mod:vs845)^)",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Autoxidation",
                                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1clf4ix/-/l302ikw/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TurkeyFisher",
                                            "body": ">However, the protestors are glorifying Hamas and celebrating and encouraging killing of Jews\n\nSource? \"From the river to the sea\" does not count, as it is clear the protestors are not intending to call for the killing of Israeli's when they say it ([source](https://www.cbc.ca/news/world/from-the-river-to-the-sea-palestine-1.7033881)).\n\n>3. Hamas casualty figures are Hamas casualty figures\n\nWhich have been verified by both [Johns Hopkins](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(23)02713-7/fulltext) and [The London School of Hygiene and Tropical Medicine](https://www.thelancet.com/journals/lancet/article/PIIS0140-6736(23)02640-5/fulltext) using bombing reports and satellite imagery: [https://time.com/6909636/gaza-death-toll/](https://time.com/6909636/gaza-death-toll/)\n\n>5. What rules of engagement are IDF following? Do they kill any women and children they can lay their hands on?\n\nYes, they are. There are increasingly reports of IDF soldiers murdering civilians ([source](https://www.bbc.com/news/articles/cw07wgrwzywo)), and even luring civilians out of buildings using drones that broadcast cries for help, only to shoot anyone who emerges ([source](https://www.middleeastmonitor.com/20240418-israel-using-drones-to-broadcast-cries-for-help-in-gaza-to-lure-shoot-palestinians/)), and with the lockout of journalists from Gaza there is likely more we don't know about.\n\n>That is not the same as deliberate genocide\n\nWhat is Israel's goal then? If their goal is to get the hostages back, they could have taken the deal offered by Hamas yesterday. If their goal is actually \"[complete victory](https://www.pbs.org/newshour/world/defiant-netanyahu-declares-israels-goal-is-complete-victory-in-gaza-after-un-court-ruling)\" as Netanyahu has stated, and that means a siege on Rafah and doing nothing to prevent the now ongoing famine, then how do they achieve that without deliberate genocide?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "tiankai",
                    "body": "Killing civilians is not a war crime if they are being used as shields, and using them as shields is a war crime, which Hamas does\n\nFor those seething with downvotes [here is an article from Al-Jazeera](https://www.aljazeera.com/news/2023/11/13/what-is-a-human-shield-and-why-is-israel-using-the-term-in-gaza)\n\n> The use of human shields is forbidden by Protocol I of the Geneva Conventions and is considered a war crime as well as a violation of humanitarian law.\n\n\n> The presence of human shields does not render a site immune from attack. While they are protected people according to the laws of war, the military assets they shield can still be legitimately targeted.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SeesEverythingTwice",
                            "body": "There is plenty of evidence showing that Israel is intentionally targeting civilians, which I mention [here](https://www.reddit.com/r/NeutralPolitics/s/ZQPwXzoigC). \n\nAs [mass graves](https://www.reuters.com/world/middle-east/mass-graves-gaza-what-do-we-know-2024-04-25/) are uncovered in violation of international law, then it’s pretty clear these aren’t the result of being human shields.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tiankai",
                                    "body": "I’m not saying they aren’t. I’m saying killing civilians is not always a war crime especially in the context of this conflict",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SeesEverythingTwice",
                                            "body": "Fair - my bad for jumping to that conclusion. I think I’ve seen that used to hand wave some of the numbers, so a bit of a kneejerk reaction",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "parabox1",
                    "body": "Awesome write up, i will still side with Israel sine they did not start things, war is awful and I wish they had a better way to take our hamas with out killing so many people. \n\nBut is a war and hamas is to blame for the death and destruction they put on their people.",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Toopad",
                            "body": "As another commenter stated, setting the starting date of this conflict on October 7th is unfair considering the Nakba (1947-49) killing 15000 and displacing 750000.\n\nhttps://www.aljazeera.com/amp/features/2017/5/23/the-nakba-did-not-start-or-end-in-1948",
                            "score": -10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "That's the whole problem with basing \"blame\" for any conflict on who started it... it depends completely on when you set the starting point. \n\nJewish settlers began [arriving in Ottoman Palestine](https://en.wikipedia.org/wiki/History_of_the_Jews_and_Judaism_in_the_Land_of_Israel) a generation before the Nakba and the Palestinian national movement arose in response, initiating a persistent campaign against the Jews and the first large-scale riots, forcing many to evacuate. Maybe that was the start.\n\nThe current conflict is happening in the Gaza strip, which didn't even exist as a separate entity during the Nakba, so maybe the Suez crisis, which precipitated the 1967 war that separated Gaza, can be blamed as the start.\n\nOr maybe it goes all the way back to the Muslim conquests of the 7th century or the Jewish-Roman wars of the 1st century that began a long period of violence, enslavement, expulsion, displacement, forced conversion, and forced migration against the local Jewish population.\n\nWe could pick dozens of points in history to be an originating event, which is why \"who started it\" gets us nowhere. \n\nBut if we accept the root causes as nationalism, sectarianism, tribalism, racism, and the general tendency for humans to band together to kill each other, then it doesn't really matter what start date you set. The cause of these conflicts isn't what we do or when we do it, it's who we are and who we want to be.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DeusExMockinYa",
                                            "body": "What starting date would justify the genocide that Israel is perpetrating?",
                                            "score": -3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "GerryManDarling",
                                    "body": "Your point seems to suggest that the violence on October 7th is justified because of what Israel did in the past. I understand your position, and you think past violence justify current violence, which is fair. But, if we say violence is okay, we also have to accept the consequence of the violence, like the death of hundreds of thousands of innocent women and children.\n\nIt's like saying you want to choose \"trial by combat\", but then getting upset when your opponent hit you. Let's think about who chose this path. Only about [15% of Israelis are in favor of their current government led by Netanyahu](https://www.reuters.com/world/middle-east/only-15-israelis-want-netanyahu-keep-job-after-gaza-war-poll-finds-2024-01-02/), but [around 70% of Palestinians support the Hamas leadership](https://apnews.com/article/israel-hamas-palestinians-opinion-poll-wartime-views-a0baade915619cd070b5393844bc4514). If we think the leaders are the ones who lead to these conflicts, it looks like the Palestinian side has more responsibility for the current situation than the Israeli side.\n\nYou might say Israel's reaction is disproportionate and without due diligence, which I totally agree with. But, Israel's reaction was also something we could have predicted. It's like if you poke a bear and then it attacks you, did the bear go too far? Maybe. But was poking the bear a good idea in the first place? If you think poking the bear was necessary, then it wouldn't make sense to be upset about the bear's reaction.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NeutralverseBot",
                                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message={url}) so that we can reinstate it.\n\n^((mod:vs845)^)",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NeutralverseBot",
                                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message={url}) so that we can reinstate it.\n\n^((mod:vs845)^)",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Silent-Entrance",
                    "body": "34,000 number is from Hamas, and it is not specified how many were Hamas members",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sorrymomlol12",
                            "body": "No it’s not. [This](https://www.reddit.com/r/NeutralPolitics/s/gRpOU7yivK) comment better shows all the international organizations that believe those numbers are the most accurate.",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "informat7",
                            "body": ">isreal receives trillions of American tax dollars\n\nIsrael does not revive trillions of tax dollars.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "Statman12",
                            "body": "This comment has been removed for violating [comment rule 2] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) as it does not provide sources for its statement of fact.  If you edit your comment to link to sources, it can be reinstated.  For more on NeutralPolitics source guidelines, see [here] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources).\n\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -4
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Statman12",
                    "body": "This comment has been removed for violating [comment rule 2] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) as it does not provide sources for its statement of fact. If you edit your comment to link to sources, it can be reinstated. For more on NeutralPolitics source guidelines, see [here] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). \n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ramerhan",
            "body": "For anyone living back in the 'nam days, how similar was it?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "There are some parallels in the goals and attitudes of the two parties: students on a moral crusade outnumbered by those representing the establishment. However, 1968 was more widespread and intense.\n\nThe current protests are on about 50 campuses and the largest ones involve a few thousand protesters, per the link in my submission. From that we can calculate roughly 100,000 to 150,000 participants nationwide, plus maybe another 50,000 daily protesters in other countries. That's not counting individual marches and rallies.\n\nThe 1968 anti-war protests in the US were part of a larger, [global protest movement](https://en.wikipedia.org/wiki/Protests_of_1968) for civil rights and against state power. The goals of the movement had broader public support and it was also much more [violent.](https://time.com/5106608/protest-1968/)\n\nColumbia student protesters were joined by 1000 faculty members, and they literally held people hostage. Draft offices were attacked. There was a riot at the 1968 Democratic National Convention. MLK, Jr. and RFK were both assassinated that year. It was a tumultuous time.\n\nA major driver of the conflict was that the US had conscription. Amercans' sons, brothers, husbands and fathers, disproportionately from minority communities, were being drafted to fight overseas in a war many came to see as pointless. By the end of 1969, there were already about [40,000 casualties](https://www.archives.gov/research/military/vietnam-war/casualty-statistics) on the US side.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "fractalfay",
                    "body": "I don’t understand why people sleep on the [Gulf War protests.](https://en.m.wikipedia.org/wiki/Protests_against_the_Iraq_War) They were absolutely massive and involved millions of people, and events were organized with pictures and video shared on Indymedia sites. The USA was largely perceived as justified in their response to Afghanistan post-9/11, but Dubya had virtually zero allies when he decided to stretch it into a second Gulf war. The protest in Portland was so large is took three hours for it to full pass through the city. The pro-Palestine events don’t have much in common with either movement.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "glitch83",
            "body": "There’s a lot to unpack there op. I’m most curious about WHO is at these protests. It’s clear students are to some degree but mayor Adams in New York said specifically that 40% of those arrested were outside agitators. It’s easy to mix up the comments and statements as well as the muddle the message when almost half of the protestors aren’t even saying the same thing. \n\nhttps://www.yahoo.com/news/almost-half-protesters-arrested-were-171430869.html\n\nDoes anyone have any leads who ELSE was asserting themselves?",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "SeesEverythingTwice",
                    "body": "Has Adams provided any evidence to this claim yet? The ‘outside agitator’ argument has a long history of being used to discredit student protests, so I’m a little wary of taking his word for it.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "glitch83",
                            "body": "It’s hard to know. What we do know is that 40% we’re not students at CUNY or Columbia. We don’t really know if they agitated or just peacefully participated. The number seems legit though.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SeesEverythingTwice",
                                    "body": "Having a number of folks I know who’ve gone to protest and support students at our nearby school, I guess I’m just hesitant to think non students are anything more than community members or alumni who are sympathetic.\n\nI suppose the potential is there for bad actors but not sure that that number indicates that without further evidence, especially in a city that has a young, left-leaning population of recent college grads.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Autoxidation",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1clf4ix/-/l2vob5m/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Statman12",
                    "body": "This comment has been removed for violating [comment rule 2] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) as it does not provide sources for its statement of fact.  If you edit your comment to link to sources, it can be reinstated.  For more on NeutralPolitics source guidelines, see [here] (https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources).\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Statman12",
            "body": "> Who are the people behind this movement and the counter movement?\n\nOne aspect I've seen which is (or perhaps better stated, \"may be\") related to this question is that the president of an Iranian university had reportedly offered scholarships to students expelled over pro-Palestinian protests. A [local NBC](https://mynbc15.com/news/nation-world/iranian-college-to-offer-scholarships-to-expelled-us-student-protesters-report-says-iran-shiraz-university-mohammad-moazzeni-anti-israel-pro-palestine-middle-east-conflict-columbia-ucla) has covered it. \n\n> Mohammad Moazzeni, the head of Shiraz University, reportedly argued this week such protesters are being treated too harshly by police. This approach by American officials, he reportedly claimed, indicates a global collapse.\n> \n>> \"They exert a lot of violence in order to contain this raging movement and have even threatened to expel the students from universities and hinder their employment in the future, and such autocratic methods show the decline of global arrogance,” Moazzeni said, according to PressTV.\n> \n> Shiraz University will also accept expelled professors, Moazzeni reportedly added.\n\nI'm not sure if this indicates that Iran is behind the student protests, or just taking advantage of the situation to disparage the US. There are a number of entities, including Hamas, Hezbollah, and the Houthi rebels, with [alleged ties to Iran](https://en.wikipedia.org/wiki/Iran_and_state-sponsored_terrorism#List_of_entities_with_alleged_ties_to_Iran). I'm curious if they are also working behind the scenes to connect with, encourage, or support the pro-Palestinian protests.",
            "score": -9,
            "replies": [
                {
                    "depth": 1,
                    "author": "TurkeyFisher",
                    "body": "I don't think that indicates Iran is behind the student protests at all, any more than Israel's stated support of the counter protests means Israel is behind the counter protests. What does it even mean for them to be \"behind\" the protests? Like they're paying the protestors to protest? What indicates there is anything going on behind the scenes? Why is it hard to believe that the protests are organic?",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "> Why is it hard to believe that the protests are organic?\n\nIt's not impossible, but the protests are simultaneous across more than 50 campuses and are using many of the same tactics at the same time. There's also the fact that [half of those arrested at a couple of the campus protests were non-students.](https://www.npr.org/2024/05/04/1249188864/nyc-columbia-city-college-gaza-protests-palestinian-campus)\n\nThe Reuters article I linked in the submission says the [Students for Justice in Palestine](https://nationalsjp.org/) is one of the organizers of the protests and they have a map on their site of \"Gaza Solidarity Encampments\" at various universities. The group was [founded in 2001](https://www.nytimes.com/2016/08/07/education/edlife/middle-east-conflict-on-campus-anti-semitism.html) at the University of California, Berkeley, and has been promoting divestment policies since then. It didn't suddenly spring up in response to the current war. \n\nSJP certainly could have used the opportunity to further their cause, but there is [ample evidence](https://www.newyorker.com/news/annals-of-education/how-a-generation-is-being-politicized-on-palestine) they're organizing the protests, including by circulating a tool kit in the immediate aftermath of October 7th calling the Hamas attacks “a historic win for the Palestinian resistance.”\n\nThat same article includes unsubstantiated accusations that Hamas funds SJP. Attempts by at least [one other news organization to follow the money](https://www.nbcnews.com/news/us-news/s-palestinian-protests-us-rcna143666) have been relatively fruitless as well, so we really don't know how they're funded.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FridayB_",
                                    "body": "Non students are among protestors because colleges have previously invited non student protestors/ stated they were welcome, politicians have made them feel welcome (https://twitter.com/GregAbbott_TX/status/1137875109362974724), and because there is often no where else for those non student protestors to protest. With that said, where else would your run of the mill, average person like me go to add my voice to this issue? I don’t know any community organizers personally, I can’t organize a whole off campus protest myself, but since I’m allowed to protest amongst the protestors already protesting, why shouldn’t I go and why would that be suspicious?",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "SeesEverythingTwice",
                                    "body": "Having been involved in some protesting as a student, social media makes student organizing easier to coordinate than ever. Groups are often in communication and once one school strikes a match, as Columbia did, it’s very easy for other schools to follow suit.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Statman12",
                            "body": "> Why is it hard to believe that the protests are organic?\n\nIt's not hard to believe this, and I did not suggest that it was. My comment did not assert with any degree of certainty that must be a connection. As I said:\n\n> I'm not sure if this indicates that Iran is behind the student protests, or just taking advantage of the situation to disparage the US.\n\nMy point was to bring up a piece of information which I thought was interesting and might suggest a potential connection. Not a certitude, but a possibility (and two explanations of the information -- intentional/planned, or opportunistic).",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TurkeyFisher",
                                    "body": "It just seems a bit conspiratorial.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Statman12",
                                            "body": "To some degree, though as noted I'm not claiming certainty here. And I don't think that floating the possibility of foreign actors being or trying to be involved is all that conspiratorial. For example, the [Department of Treasury sanctioned multiple Iranians](https://home.treasury.gov/news/press-releases/jy0494) for attempting to influence the 2020 US election:\n\n> Between approximately August 2020 and November 2020, state-sponsored Iranian cyber actors executed an online operation to intimidate and influence American voters, and to undermine voter confidence and sow discord, in connection with the 2020 U.S. presidential election.\n\nIran [attempted to meddle in the 2022 midterm](https://www.cnn.com/2023/12/18/politics/china-russia-iran-cuba-2022-midterm-election-meddling/index.html) as well.\n\nSo I don't think it's particularly far out to suggest that Iran sees this as an opportunity to try to meddle with the 2024 election, or just to sow discord within the United States in general. The question in my mind is whether Iran was in any way an instigator or is just commenting to support or further discord (or even if the university chancellor is acting entirely individually).",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TurkeyFisher",
                                                    "body": "Sure, that's fair. I guess the question becomes to what degree Iran's influence campaign is relevant here, since it can so easily be used as a cudgel to de-legitimize the sincerity of political activity. Especially since it seems pretty much every government including our own runs online influence campaigns at this point ([source](https://www.foreignaffairs.com/articles/united-states/2020-06-21/cia-interferes-foreign-elections))- Israel certainly has been running an influence campaign of their own ([source](https://www.politico.eu/article/israel-social-media-opinion-hamas-war/)), but bringing that up in other REDACTED mainstream news subreddits has gotten people banned.\n\nEDIT: added sources",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "NeutralverseBot",
                                                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message={url}) so that we can reinstate it.\n\n^((mod:vs845)^)",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "TurkeyFisher",
                                                                    "body": "I have added sources",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "nosecohn",
                                                                            "body": "Thanks. The comment is restored, but please edit out the reference to another subreddit. We don't allow that here.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "TurkeyFisher",
                                                                                    "body": "Done, though I don't see that in the rules?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "nosecohn",
                                                                                            "body": "It's in the FAQ at the bottom:\n\n> we ask that you remove the references to the other subreddit\n\nHowever, you're correct that it's not explicity about comments like yours, even though removing those is a long-standing practice of the moderators here. \n\nThanks for pointing that out. We'll look into updating the rules to make it more clear.\n\nETA: It's also in the [source rules:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources)\n\n> The following source types are never permitted in submissions or comments:\n\n> * Reddit posts and comments",
                                                                                            "score": 2
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "There's precedent for something similar. In 2016, a group of Russia-linked Facebook accounts secretly helped [organize at least 60 politically divisive marches, protests, and rallies on U.S. soil,](https://www.vanityfair.com/news/2017/10/how-russia-secretly-orchestrated-dozens-of-us-protests) in an apparent attempt to deepen political discord. At least one event was [attended by thousands of people.](https://thehill.com/policy/technology/358025-thousands-attended-protest-organized-by-russians-on-facebook/)\n\nAlso, per Rule 4, please don't address other users directly with \"you\" statements in /r/NeutralPolitics.",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "Statman12",
                            "body": "Between my initial comment and the subsequent replies, I think that the rationale for why one might suspect Iran could be interested in cultivating unrest in the USA has been established fairly well. This includes but is not limited to Iran trying to interfere or sow unrest in the USA previously. And also note that I made no claim of certainty that Iran \\*created\\* the protests. I explicitly and intentionally identified two potential avenues, one of which was Iran simply being reactive to take advantage of the situation and try to highlight the protests.\n\nThat doesn't mean it's proven for this case (nobody has claimed such), nor that anyone must agree with the thought, but I think it's sufficiently established as reasonable. As another example, a recent [New York Times article](https://www.nytimes.com/2024/05/02/business/media/campus-protests-russia-china-iran-us.html) discusses precisely this concept:\n\n>As protests over the war in Gaza have spread across the United States, Russia, China and Iran have seized on them to score geopolitical points abroad and stoke tensions within the United States, according to researchers who have identified both overt and covert efforts by the countries to amplify the protests since they began.\n\nAnd regarding possibilities of success, in the past the [FBI commented on ISIL/ISIS radicalizing westerners via online channels](https://www.fbi.gov/news/testimony/isil-online-countering-terrorist-radicalization-and-recruitment-on-the-internet-and-social-media-). And a [report by START at University of Maryland](https://www.start.umd.edu/pubs/START_PIRUS_UseOfSocialMediaByUSExtremists_ResearchBrief_July2018.pdf) (START is a research center concerning terrorism headquartered at UMD) discussed the use of social media for recruiting/radicalizing people. It has risen dramatically over the years. For example, figures 1 and 2 highlight that from 2003 - 2010, social media accounted for roughly 26 percent of radicalization, with 73% having no social media radicalization. From 2011-2016 that basically flipped, and only 27% had no social media radicalization, while for about 73% social media played a primary or secondary role.\n\nSo I don't think it's unreasonable to consider that Iran might be able to run online campaigns to encourage unrest or protests. Again, not proven, but proof-of-concept is there, rationale is there, and past history is there. I don't think this is really a stretch.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "unkz",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1clf4ix/-/l2x1fxx/) so that we can reinstate it.\r\n\r\nThis comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "jafomofo",
                            "body": "do you seriously think these are organic student protests? This is one of the major groups organizing protests and you think its a stretch that they are aligned and supported by Iran? \n\nhttps://adalahjusticeproject.org/",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "jafomofo",
            "body": "same left leaning groups that use every widspread protest to build support against a democratic US plus some mission specific groups focused on palestinian issues. Funding comes from the same groups that fund every oppositional group in the US, Gates foundation, Soros' open society, Pritzker group, etc... Politico has a write up on it recently https://www.politico.com/news/2024/05/05/pro-palestinian-protests-columbia-university-funding-donors-00156135",
            "score": -16
        }
    ]
}