{
    "title": "More Recommendations on Neutral resources on Israel/Palestine Conflict",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ummmbacon",
            "body": "The main issue you are going to run into is that most sources have a bias, and really you can counter that by reading a range of sources. \n\nThere are some that do a better job of it like: \n\n*Arabs and Jews in Ottoman Palestine: Two Worlds Collide* by Dowty, which is also more recently published. \n\nHe also has a book called *Israel/Palestine* however it was published in 2005 and updated in 2012 with the second edition. Mark Tessler's *A History of the Israeli-Palestinian Conflict* with the second edition coming out in 2009.  \n\nA good book set on the history of Zionism is *The Origins of Zionism* and then, *Zionism: The Formative Years* both by David Vital.\n\nOther books I would suggest:\n\n* *Land and Power: The Zionist Resort to Force, 1881-1948* by Anita Shapira\n\n* *1948* by Benny Morris\n\n* *Righteous Victims* by Benny Morris\n\n* *A History of Palestine* by Kramer\n\n* *Palestine in Transformation* by Scholch\n\nYou can also look over the /r/AskHistorians reading list for it:\n\nhttps://www.reddit.com/r/AskHistorians/wiki/books/middleeast#wiki_israeli_and_palestinian_history",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hardlydent",
                    "body": "Yup, one of my backgrounds is in Poli Sci, but I figured I wouldn't beat a dead horse since the whole sub is called \"neutral politics\". \n\nOh wow, this is great! I'm going to take a look at these, thanks!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "I haven't read it, but I've heard good things about [*Too Much Promised Land*](https://www.amazon.com/Much-Too-Promised-Land-Arab-Israeli/dp/0553384147/), which is about the peace process.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hardlydent",
                    "body": "Ah, cool, I'll check that out as well. Thanks! I've been trying to find the most fact-based, non-slant books as much as possible. I know it can be a tricky process and there isn't going to be something without some slant, but just as much as possible.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Over_n_over_n_over",
                            "body": "I'm commenting so I remember to check this out",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rixyvr",
                                    "body": "Or simply add to your Good Reads account right now ;)",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sorrymomlol12",
            "body": "Cannot recommend this enough! It’s a look at Netanyahu and the US presidents throughout the decades starting at Clinton. It’s PBS and as neutral as they come, and every single president is criticized. It’s also a great background on Netanyahu from a historical context (his early days in politics, his rise to power, his campaign promises etc). Really provided the context needed to understand the conflict from a neutral source. \n\nhttps://youtu.be/6-vzy4tYfaI?si=tbDTNBEgAJl6kctw",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hardlydent",
                    "body": "Oh woah, I didn't know PBS would do that. Yeah, this seems great, thanks!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Hardlydent",
                    "body": "Just watched it. Man, this is depressing. I need something happy and nonsense now.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sorrymomlol12",
                            "body": "Right? Like both sides are very genocidy and anti-negotiation. Hamas is bad, Netanyahu is actively doing a lot of child murder, and it seems like there’s genuinely no good actors to root for. Maybe the Israeli citizens who are protesting for Netanyahus removal? Who will lead Palestinians to a peaceful future, can I root for them? \n\nThe only 2 things I sort of seem to know is that women and children should be allowed to flee Gaza and a ceasefire will lead the less child death. The kids man… 13,000+ is so many… \n\n[This](https://www.reddit.com/r/NeutralPolitics/s/VRuQLgG0qD) was a write up I did (with sources) on the college protests, but the first part of the history was my quick summary of the documentary. \n\nAnd [this](https://www.reddit.com/r/NeutralPolitics/s/2kZ60uIoaG) is not my comment, but rather another really good one about why it’s so difficult to pinpoint the “who started it” argument. \n\nSorry I brought your day down but while it’s depressing it’s so good for understanding the US and Israeli relationship.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Hardlydent",
                                    "body": "I'm gonna read through your stuff when I'm in a better mood. I'm a bit too sensitive to this stuff, which is probably another reason I left Poli Sci years back. Like, kids dying is just .... Fuck.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}