{
    "title": "Is the starvation in North Korea intentional or is it because of sanctions and a lack of resources?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yamiyam",
            "body": "Your source touches on the why directly:\n\n>North Korea's chronic food insecurity is the product of decades of economic mismanagement and the internal and external policies of the incumbent political regime. Throughout its history, North Korea has pursued the understandable goal of national food security through an economically irrational policy of self-sufficiency.\n\n> inauspicious natural conditions, reliance on imported inputs such as oil used as a feedstock to produce fertilizer domestically, fertilizer imported directly from China, or donated by South Korea\n\n>leaving the system vulnerable to disruptions to input supply emanating from global market conditions and diplomatic conflicts, in addition to the vicissitudes of weather\n\nTLDR:\n\n1. inauspicious conditions make it hard to grow food\n\n2. The regime is incompetent and bad at making friends \n\n3. And they’re a low priority for foreign aid for a variety of reasons. \n\nAll of which sucks for the locals. \n\nhttps://www.sciencedirect.com/science/article/pii/S2667111522000263",
            "score": 145
        },
        {
            "depth": 0,
            "author": "ZooSKP",
            "body": "The best answer is \"yes\"?\n\nWhile we cannot know if the Kim regime actively decides to starve certain people or groups and feed others or if the process of food allocation is more emergent from an opaque political process, it is clear that the Kim regime could acquire more food for its people of it chose to.  North Korea is not a case of a nation impoverished purely because of it is cut off from tlmost of the rest of the world.\n\nLet's begin with North Korea's - I'll abbreviate the countrybto DPRK - DPRK's military spending.  The CIA Fact Book published, for 2021, a [list of countries by estimated military spending](https://www.cia.gov/the-world-factbook/about/archives/2021/field/military-expenditures/) as a percentage of GDP.   The DPRK est8mate is 20%-30%.  The same estimate for South Korea (hereafter, ROK) is 2.64%, for the USA 3.73%, China 1.7%, Iran 2.1%, India 2.6%.  The [NATO alliance guideline](https://www.nato.int/cps/en/natohq/topics_49198.htm) for defence spending is 2%.  This is to show the DPRK is an extreme outlier in terms of its resource allocation priorities.\n\nAside from GPD estimates, the DPRK maintains essentially modern [nuclear weapons and ballistic missile programs](https://www.cfr.org/backgrounder/north-korea-nuclear-weapons-missile-tests-military-capabilities) while it [lacks night lighting for its civilization population](https://www.38north.org/2023/04/a-fresh-look-at-north-korea-at-night/).\n\nLogically, if the DPRK economy refocused away from defense to either food production or anything tradeable, there would be more resources available to either eat or trade for food.  Of course, DPRK can't trade very much because they are under [heavy international sanctions](https://www.cfr.org/backgrounder/north-korea-sanctions-un-nuclear-weapons), but those sanctions are in place, at least formally, because of their excessive military and the threat that they pose to nearby ROK and Japan.  Note that the sanctions regime is international and includes actions by the UN Security Council (see previous source), which required the acquiescence of comparatively DPRK-friendly Russia and China, thiugh the DPRK can likely still trade extensively with Russia and China and so has access to markets and food imports that way.\n\nOf course, the Kim regime sees the excessive spending on advanced weapons as necessary to ensure its survival, which is sort of true, because if they didn't have weapons ready to level Seoul but continued to operate as they do, then the US, ROK and Japan would love nothing more than to topple the Kim regime.  On the other hand, if the DPRK reduced its weapons portfolio and operated like a more normal country, its existence might be more tolerable to the rest of the world, but the Mr. kim wouldn't be running the DPRK the way he likes.  So, is the DPRK starving because sanctions?  Not exactly, but the regime's spending policy causes the poverty and sanctions while the spending policy is to some extent reactive to DPRK's conflict with the rest of the world.",
            "score": 61
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Whobeye456",
            "body": "It seems to be a combination of mismanagement and a lack of support from their allies. [Link to the Wikipedia article](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://en.m.wikipedia.org/wiki/North_Korean_famine%23:~:text%3DEconomic%2520mismanagement%2520and%2520the%2520loss,to%2520effectively%2520curtail%2520the%2520disaster.&ved=2ahUKEwi1tqqMze2FAxUJpIkEHTThA70QFnoECA0QBQ&usg=AOvVaw3_lNlLnVgW3NETpz7--3xs).\n\nWhile the U.S. had access to the country diplomatically, it was estimated that between 300,000 to 800,000 people were starving to death [annually ](https://www.google.com/url?sa=t&source=web&rct=j&opi=89978449&url=https://www.washingtonpost.com/wp-srv/inatl/longterm/korea/stories/famine082098.htm%23:~:text%3DWashingtonpost.com%253A%2520Korea%2520Special%2520Report%26text%3DBEIJING%252C%2520Aug.,in%2520the%2520isolated%2520Communist%2520country.&ved=2ahUKEwjAvZ-Uze2FAxV2l4kEHal0D7MQFnoECAMQBQ&usg=AOvVaw3GSJfF4-8B9CQdHBLxQpZ6).\n\nThis last part would be mere conjecture on my part. It is likely a combination of a lack of resources, despite the up tick in imports and a belief that the proletariate are there for the enrichment of the ruling class . Combined with the ruling party's need to appear (both internally and externally), affluent and well nourished. It would be similar to how many oligarchys in the past have opperated. When times are tough and as food becomes scarce, the people with the power hoard what is available and let the populace suffer the consequences.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "LookDense9342",
            "body": "it’s really late for me so please excuse the typos and messed up timeline but i got hyperfocused on this topic a few years ago. what i gathered it’s a mix of government, resources and allies! most of the stories you’ll hear about starvation are from the later half of the 20th century. so this is a bit of what happened. \n\nDuring the war, SK and the US dropped bombs on waterways, dams, farms, factories, etc which limited their resources. later, the CIA would also sit on the chinese border and trick desperate people into destroying their livestock (this is from personal accounts, no actual documents on this i don’t think). north Koreans would try to travel to china for food, where CIA agents would offer bags of rice in exchange for cattle tails. people would go and cut off their cattle’s tail, get the food, but now their cattle is basically useless; no tail, messed up balance. what farming they COULD do must now be done without the help of [cattle](https://books.google.com/books/about/Immovable_Object.html?id=7_r_DwAAQBAJ&source=kp_book_description). \n\nthen when the USSR fell they basically couldn’t trade with anyone (other than china i think?) because of different trading organizations (?). NK needed oil for what little factories and farming equipment they had. but they couldn’t get it from Russia anymore. the [US blocked](https://books.google.com/books/about/Immovable_Object.html?id=7_r_DwAAQBAJ&source=kp_book_description) oil from coming into the country. without oil they could only rely on farming by hand and their factories were basically shut down. \n\nso they were bombed by the US, denied oil, livestock useless. they couldn’t manufacture much without oil, they couldn’t farm much without oil or livestock. then came the natural disasters.\n\nanother thing is that they would not ask for help much. Jimmy Carter said himself that the US did everything they could to ruin the economy of the [north](https://m.youtube.com/watch?v=KTS3XR3z49o) (kinda iffy source, that’s my bad). there’s a lot of factors! i just wanted to add some that i didn’t see here",
            "score": 8
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -5,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        }
    ]
}