{
    "title": "Separatism vs. balkanization",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Adventurous-Bat-9254",
                    "body": "In Canada it is too complex for a two sentence reply.  But while separation of Quebec from Canada was probably the optimal condition in context of 100 years ago, now it is difficult to say that it would be beneficial.  Likely the economic conditions would be worse but the sense of independence would improve.  But the disruption to the economic connections and social basis would be huge.  In Quebec, many of the northern indigenous people have no desire to separate, and much of the hydrological resources are within their lands.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "Per Rule 2, would you please edit in links to sources for these three factual claims?:\n\n> separation of Quebec from Canada was probably the optimal condition in context of 100 years ago\n\n>  In Quebec, many of the northern indigenous people have no desire to separate\n\n> much of the hydrological resources are within their lands.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This is an informative comment. However, per Rule 2, factual claims require sources in r/NeutralPolitics. As someone with apparent knowledge of the topic, it should be a simple matter to edit in links to articles supporting the history as spelled out here. Thanks in advance for doing so.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "I don't have an answer to your specific questions, but there are some related concepts that are worth exploring.\n\nThe \"[consent of the governed](https://en.wikipedia.org/wiki/Consent_of_the_governed)\" is a bedrock principle of modern democratic systems. Separatist movements can arise when a group feels the state is exercising power over it without their consent. Under that paradigm, a government that wishes to deter separatism, and the potentially resultant balkanization, needs to ensure that the distinct groups under its control have a sense that they are consenting to be governed.\n\nWhen those groups have lost that sense, questions arise about whether there is a natural \"[right of secession.](https://digitalcommons.law.ggu.edu/cgi/viewcontent.cgi?article=1018&context=annlsurvey)\" (PDF) In the US, a brutal war was fought over the [Confederate States'](https://en.wikipedia.org/wiki/Confederate_States_of_America) claim they had a right to secede over slavery.\n\nFinally, [this paper](https://openyls.law.yale.edu/bitstream/handle/20.500.13051/6378/06_23YaleJIntlL1_1998_.pdf?sequence=2&isAllowed=y) (PDF) argues that the current systems for determining who has a right to sovereignty are outmoded and outdated.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1
        }
    ]
}