{
    "title": "What's the status of the bail reform movement in the US and what's the evidence supporting alternatives to cash bail?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "astrobeen",
            "body": "[Here is an article after 90 days of no cash bail policy in Illinois](https://chicago.suntimes.com/2023/12/29/24018920/illinois-first-state-to-eliminate-cash-bail-how-it-is-working)\n\nSome highlights from the article:  \n\nIllinois’ historic pretrial reform has largely passed its first test, with no major scandals and no immediate impact on crime trends. Implementation has been mostly smooth as well, although uneven.\n\nIn Cook County, the change was supported by leaders and was an extension of reforms already in place. But officials in smaller downstate counties have been stretched thin by the requirements of the new system.\n\nThree months is not enough time to determine the impact the new system is having on crime rates, but he and his team are hitting the road soon to see how the law is playing out throughout the state.\n\nOne thing they have seen already, though, is the elimination of bail has driven down jail populations across Illinois. The amount of that decrease in jail population varies by the size of the county.\n\nIn some of the smaller, more rural jails, where historically people might have been held for offenses that are not detainable, the decreases in the jail populations have been larger than in some of the larger jails, where the majority of people held in jail are those charged with more serious offenses.\n\nSo, no spike in crime but a decrease in jail populations.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Rich-Distance-6509",
            "body": "My main lesson from this sub is that politics without opinions is incredibly boring",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1bj52c5/-/kvrgdfd/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 3
                }
            ]
        }
    ]
}