{
    "title": "What are the pros and cons of an upper-house? What's the best way for an upper-house to function?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ramblingmac",
            "body": "For the US: \n\nAt its heart: Experience and stability.\n\nThat plays out in multiple ways; but the general idea is that lower houses are more susceptible to populism, are quicker to react to trends and closer to the populace; meanwhile the upper chamber provides a balancing slowness of stability and experience.\n\nhttps://www.senate.gov/about/origins-foundations/idea-of-the-senate/1787Federalist62.htm",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "postmaster3000",
                            "body": "That claim is revisionist. The Federalist Papers explained clearly why the senate exists. Each state, at the time, saw itself as a sovereign entity. The smaller states did not want to cede their sovereign power to the larger states. Had they not received this guarantee, they would not have joined the union. The constitutional process was also designed such that removing that guarantee would not be possible without the assent of many of the smaller states.\n\nYou might counter that the smaller states were also slave states, and that the underlying reason for the Senate was to preserve slavery. However, that’s what the three-fifths compromise was about.\n\nEdit: this post restates part of the argument laid out in [the article cited](https://www.senate.gov/about/origins-foundations/idea-of-the-senate/1787Federalist62.htm) by the grandparent to this post.",
                            "score": 19
                        },
                        {
                            "depth": 2,
                            "author": "davemoedee",
                            "body": "That isn’t what that link says. Was white supremacy up for debate when  the constitution was written? \n\nWhat you linked does not support your claim about the founding of the Senate. If you are going to make a claim about the reason the Senate was created, maybe provide a link that supports your claim.",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fargason",
                                    "body": "In a sense it was.  It was really force in under great contradiction to the Declaration of Independence that first and foremost established equal rights:\n\n>We hold these truths to be self-evident, that all men are created equal, that they are endowed by their Creator with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness.\n\nhttps://www.archives.gov/founding-docs/declaration-transcript\n\nUnfortunately, by the time of the constitutional convention the voice of the founders that signed the Declaration of Independence was greatly diminished as it made them a high priority target during the war.  Despite being a such a self-evident truth, equal rights was left out of the US Constitution.  That contradiction wouldn’t be fixed until the Republican Party was established who were conservative beyond the Constitution, but to the founding documents as well.  This commitment can be seen in the official party political platform after the Civil War:\n\n>We recognize the great principles laid down in the immortal Declaration of Independence as the true foundation of Democratic Government; and we hail with gladness every effort toward making these principles a living reality on every inch of American soil.\n\nhttps://www.presidency.ucsb.edu/documents/republican-party-platform-1868\n\nA powerful commitment they would eventually fulfill in the Fourteenth Amendment as they even used similar wording to that founding document.\n\n>No State shall make or enforce any law which shall abridge the privileges or immunities of citizens of the United States; nor shall any State deprive any person of life, liberty, or property, without due process of law; nor deny to any person within its jurisdiction the equal protection of the laws.\n\nhttps://www.archives.gov/milestone-documents/14th-amendment#",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "yoberf",
                                    "body": "> Was white supremacy up for debate when the constitution was written?\n\nSerously? The 3/5ths clause is evidence that white supremacy was definitely up for debate. The US Senate give 2 seats to each state, regardless of populaiton. The slave holding states were less populous. They wanted the 3/5ths clause for power in the House and 2 seats per state for power in the senate.\n\nHere's the basic facts. It would take a whole essay to explain how to read between the lines of the offical documents and I don't have time to dive into the Federalist Papers.\nhttps://en.wikipedia.org/wiki/Connecticut_Compromise",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "davemoedee",
                                            "body": "That’s my point. White supremacy was already baked in to the constitution.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ramblingmac",
                            "body": "Your response dives into a deep side topic.\n\nSuffice it to say; the two are not mutually exclusive and does not make the above a myth.\n\nModern examples of that design divide between reactive populism (lower house) versus slower stability (upper house) can be found in comparing the speed at which the house republicans moved into lock step with Trump’s populism, versus the senate republicans slower adoption of the same.\n\nhttps://www.politico.com/news/2021/03/03/post-trump-gop-divide-house-senate-472858",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "ummmbacon",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cw3py1/-/l4v98w3/) so that we can reinstate it.\r\n\r\nLink does not support claim\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Johnny_Lawless_Esq",
                            "body": "I'm all for exposing white supremacy in society, but this is nonsense. As someone else said, the federalist papers gave the explicit rationale for the Senate.\n\nIs the Senate one of the factors that facilitated the entrenchment of white supremacy? I think you can absolutely make a case that it was. But just because it might have contributed to that doesn't make it an explicitly white supremacist institution.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "slothbear13",
            "body": "As an American, I cannot comment on the benefits or disadvantages of a House of Lords as the concept is truly alien to me. I encourage any advocates or opponents of such a house to explain your thoughts.\n\nRegarding Republican forms of government, the United States invented the Senate because the writers of its Constitution felt the House of Representatives disproportionately gave states with larger populations more control over the federal government. A Senate not based on population size would encourage balance of power. They also had a longer term length (6 years) than Representatives. When the Senate was first established, democratically elected State governors appointed Senators. After many, many years of quid pro quo widespread corruption, Americans began to democratically elect their Senators.\n\nBesides passing laws, each chamber has a different set of powers. For example, the Senate is the only body who can declare war, considered an elite power reserved for the most responsible and less democratic institutions (them and the President). But the Senate cannot levy new taxes. Only the House can levy new taxes as they were definitionally supposed to be \"closest\" to the people and served only 2 year terms.\n\nSo, TL; DR: when done right, a bicameral legislature in a republican form of government encourages additional separation of powers. In theory, this continues to assist in preventing dictatorships and corruption. However, it also is one of the reasons why the United States is so conservative compared to the rest of the world and why \"progressive\" change takes such a long, long time. The UK House of Commons sometimes does sweeping changes in a way we'll never see here; their head of government is in the controlling party and unless there's a strong opposition government, they have often done whatever they want, and quickly (for better or for worse).\n\nhttps://www.senate.gov/about/origins-foundations/senate-and-constitution/seventeenth-amendment.htm",
            "score": 10
        },
        {
            "depth": 0,
            "author": "bangonthedrums",
            "body": "In Canada we have an unelected Upper House (the Senate). The idea when it was first instituted was that it would be a chamber of “sober second thought”. If the senators aren’t always campaigning for reelection, the thinking goes, then they will analyze legislation dispassionately before approving it\n\nWhat happened in practice was that each PM would simply fill up any vacancies (senators are appointed for an unlimited term, with mandatory retirement at 75) with members of their party to ensure that their legislation would pass mostly unhindered. This made the senate effectively useless\n\nIn 2014, Justin Trudeau, the leader of the Liberal Party kicked out all of the Liberal senators from his caucus. This meant that all the former Liberals were now independent senators. In late 2015, very shortly after becoming Prime Minister, he implemented a new process of selecting senators, where any Canadian can apply or nominate someone to become one. The nominees are then considered by an advisory board and candidates are put to the PM for appointment. In theory, this process should remove any political bias from the appointment process and lead to a more representative mix of people, professions, origins, and opinions on the senate. \n\nThe advisory board is made up of a former chancellor of the University of Ottawa, a former mayor of a city in northern Alberta, and a former justice of the Quebec superior court. Additionally, there are advisory boards for each province which work with the federal one to help select senators (each province is entitled to a set number of senators, and one of the requirements of senatorship is that they must live in the province they represent). The resumes of the board members are quite impressive, and the members span the political spectrum\n\nhttps://www.canada.ca/en/campaign/independent-advisory-board-for-senate-appointments/members.html\n\nWhether this new process has actually led to less partisanship and more political legitimacy is a matter of opinion, I suppose. \n\nConstitutionally, there is nothing stopping a PM from appointing whomever they wish (barring the few legal requirements for senatorship) but Canadian governance is heavily rooted in a tradition of precedent, so hopefully the procedure will continue in the future under other governments.\n\nEmmett MacFarlane, professor of Canadian Politics and Constitution at the University of Waterloo, in his book _Constitutional Pariah_, argues that while the new process has worked well for the current government, under a future one those appointed senators may be less likely to bow to governmental objectives:\n\n> Most of the senators appointed since 2016 appear to be people who could comfortably sit on the centre-left part of the political spectrum. If there is a lack of ideological diversity - whether it results from self-selection bias among those applying to the [appointments] process, the advisory board’s shortlisting process. or the prime minister’s final selection - it is a legitimate object of concern. And it raises the the prospect that the Senate might become obstructionist in the face of a more conservative government, something that will threaten its legitimacy if it begins defeating or unduly delaying legislation on ideological grounds.\n\nhttps://emmettmacfarlane.substack.com/p/beware-predictions-of-a-senate-created\n\nThere have been many ideas over time of how to reform or abolish the Senate due to its unelected status (and therefore perceived lack of political legitimacy), but the Canadian constitution is notoriously hard to amend. The new process is likely the most straightforward way to even attempt to modify the senate under the current constitution, but it still remains to be seen whether this process will survive a future government at all",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Same_Border8074",
                    "body": "That was an interesting read! New Zealand had a similar issue to what Canada had prior to 2014. We had a [Legislative Council ](https://en.wikipedia.org/wiki/New_Zealand_Legislative_Council) which operated as our upper-house, but all members were all appointed by the Prime Minister of the Government of the day. Of course what transpired was that the Legislative Council would never oppose decisions made by the House of Representatives and it effectively became useless. This was so true that in 1951, both the HoR and Legislative Council voted to remove the Legislative Council (They became nicknamed the [Suicide Squad](https://en.wikipedia.org/wiki/Suicide_squad_(New_Zealand))). It was meant to be a temporary change in order to adopt a better system of appointment.. but I guess we never got around to it so in 2024 we are still unicameral.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "kindaneutralobserver",
            "body": "Honestly the best advice I can give is to read around the topic. I am not hugely widely read on the topic, but I found *Reforming the House of Lords: Lessons from Overseas* by Prof Meg Russell to be a really helpful in understanding some of the nuances of the topic - some of the circumstances have changed since the book was released (in 2000!) but the analysis is still sound and that doesn't change once the institutions change. \n\nhttps://academic.oup.com/book/4213\n\nBelow, I've tried to very narrowly answer your questions because each one of them could be a university thesis and the topic as a whole is an entire field of academic study. You'll be able to tell I'm British because I talk about the House of Lords a lot.\n\n1. Upper houses usually (but not always) bring a different perspective to that of the lower chamber, such as through a different partisan, geographic or demographic makeup. This can be useful for widening the debate, hearing perspectives that would otherwise not have been heard, which can lead to better scrutiny of government and legislation. But depending on institutional setup and political culture, you can also get legislative gridlock if both chambers disagree. And if you think that the lower house is more likely to be acting on the behalf of the majority of voters (since that's usually the function of a lower house in a bicameral system), then it can seem fairly undemocratic  if the lower house doesn't eventually get its way.\n2. There isn't a single best way of selecting members of an upper house because not all upper houses serve precisely the same function. In Germany, the Bundesrat is made up of delegates from state governments (not legislatures) and that helps make it a forum for the interests of the various states (but it's also contingent on lots of other institutional and cultural factors). In the UK, the House of Lords is mostly appointed (save for the 92 remaining hereditary members and the 25 Church of England bishops) and the chamber does a very good job of legislative scrutiny (but is again hugely contingent on institutional and cultural factors including conventions of prime ministers appointing from both their own party and the opposition parties, and the fact that constitutionally the House of Commons has primacy and so the House of Lords can't stop legislation, only delay).\n3. Again, this depends on what the function of the upper chamber is. If the membership forms some kind of 'counter-representation' where they actively represent different voices (like in the Bundesrat) then they'll need to serve short-ish terms since effectively they are representing (some of) the people in a similar way to how members of the lower house are. But if they serve a scrutiny function, then serving longer and gaining more experience might be a bigger priority - the House of Lords is often praised for being a repository of expertise, and so it makes more sense to keep them around (it's not uncontroversial though - there have been some proposals to introduce a term length or an age limit (eg the Canadian Senate has an age limit of 75)).\n4. Deadlocks an be prevented either by having a rule that one chamber eventually gets its way over the other, or by having a rule that you go to an election if the chambers can't agree. In the UK, if the House of Commons and House of Lords disagree and neither budge, then after one year, the Commons gets its way. In practice, the Lords will usually only oppose on the same basis once, so the 'ping pong' (yes, it's referred to as ping pong) process is almost never fully drawn out, but also the government is just less likely to put forward legislation which is likely to be voted down in the Lords, so the effects of this system can't be fully seen in the voting record. Australia meanwhile has the 'double dissolution' wherein if the chambers can't agree, it triggers an election to sort things out, followed by a joint sitting of both newly-elected chambers.\n5. Personally, I like the upper chambers of the UK, Australia and Germany, although I also don't mind a unicameral proportionally elected parliament like NZ or the Nordic countries. For various reasons, I think a lot of countries miss the mark on upper chambers - eg the US, Canada, France, Italy, Poland, Romania even if they might have a lot of conceptual similarities with systems I like (eg the UK and Canada both have chambers appointed by their respective prime ministers, and the US and Australia both have directly elected politicians that ostensibly represent the interests of states), but small-ish institutional differences as well as intangibles like political culture can make a big difference.\n\nIn terms of the article you cited proposing a second chamber for NZ, it reads very much like an exercise of being all things to all people since it doesn't really lay out specifics. As an outsider, I'm sceptical of the value of an upper chamber to NZ, in large part because I'm a bit sceptical of how much additional value an elected or appointed upper chamber can provide when the lower house is already elected using PR.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "> Reforming the House of Lords: Lessons from Overseas by Prof Meg Russell\n\nWould you please edit in a link to it?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kindaneutralobserver",
                            "body": "Done!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "Thanks.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        }
    ]
}