{
    "title": "In countries with declining birth rates, what specific economic and political effects have been seen?",
    "comments": [
        {
            "depth": 0,
            "author": "ummmbacon",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GuyOnTheMoon",
            "body": "South Korea's demographic crisis offers a stark example of the immigration tightrope walk. With one of the world's lowest birth rates, the country faces crippling labor shortages in manufacturing and construction. Migrant workers are lured by these opportunities, but unscrupulous employers exploit their vulnerability. Wage theft is rampant, leaving migrants unpaid and trapped in a foreign land with language barriers and a legal system that often seems stacked against them.\n\n[As of 2022, Korean employers owed 122.3 billion won (US$88.7 million) in back pay to their foreign employees](https://english.hani.co.kr/arti/english_edition/e_national/1138769)",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wanderhoden",
                    "body": "You would think this cautionary tale would eventually come back to bite them as immigrants would become more hesitant to come (I.e. horror stories of migrants working in Saudi Arabia), but I'm guessing the opportunities/desperation  still outweigh the very real risks.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "funkiestj",
            "body": "The Ezra Klein Show podcast dedicated an episode to this topic interviewing a subject matter expert.\n\n[https://podcasts.apple.com/us/podcast/birthrates-are-plummeting-worldwide-why/id1548604447?i=1000649683423](https://podcasts.apple.com/us/podcast/birthrates-are-plummeting-worldwide-why/id1548604447?i=1000649683423)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Th3_Hegemon",
            "body": "An obvious one in the United States is the [Social Security funding shortfall](https://crsreports.congress.gov/product/pdf/IF/IF10522). There simply are not enough people paying into the system to support an increasing population of elderly and retired people, under the current structure anyway. There are other support networks and systems that will experience similar strain across the globe. Interestingly, high unemployment is linked with low birth rates [(Link)](https://www.businessinsider.com/birth-rates-and-unemployment-2015-5), which feels intuitive to me, as economic hardship leads to a decrease in the ability to pay for children. Of course we are currently experiencing extended periods of low unemployment, but it's probable that's related to the pandemic, which led to many early retirements and more than a million surplus deaths, lowering the labor pool substantially. But a shrinking labor pool may be offset by the rise of automation and AI technologies wiping out whole career fields, guess we'll have to wait and see which force is stronger.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "That source projects a funding shortfall 10 years from now, a circumstance that has been pretty common throughout the history of Social Security. I specifically asked about current effects, because there's a lot of hyperbole out there about the future.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Redditspoorly",
                            "body": "Source? Since we're on a subreddit requiring evidence for every assertion and you've presented none",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "funkiestj",
                                    "body": "demographics do impact social security funding.\n\n[https://www.cbpp.org/research/policy-basics-understanding-the-social-security-trust-funds](https://www.cbpp.org/research/policy-basics-understanding-the-social-security-trust-funds)\n\n>Social Security is largely a “pay as you go” program, meaning **today’s benefits are funded primarily by the payroll taxes collected from today’s workers**. For over three decades, however, Social Security collected more in payroll taxes and other income than it paid in benefits and other expenses, and the Treasury invested the surplus in interest-bearing Treasury securities, ultimately reaching a total of $2.9 trillion in trust fund reserves. In 2021 Social Security began redeeming those reserves to help pay benefits. Payroll taxes from current workers will continue to pay for the bulk of benefits. The trust fund reserves will make up the difference between income and costs until the reserves are depleted. At that point, Social Security’s income will still be able to pay roughly 80 percent of promised benefits — even in the unlikely event that policymakers fail to act.",
                                    "score": 12
                                },
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "I don't agree completely with the commenter above, but there is evidence for a persistent \"Chicken Little\" type of media campaign about Social Security. Here I'll summarize a couple of my own comments from a [discussion](https://www.reddit.com/r/NeutralPolitics/comments/13hd68z/what_exactly_does_privatizing_social_security/) we had last year about privatizing Social Security:\n\n----\n\nThe system has been [sustained for 88 years,](https://en.wikipedia.org/wiki/History_of_Social_Security_in_the_United_States) through many turbulent economic times, and has never failed to pay out the contracted benefits, even as those benefits have increased dramatically.\n\nThe [panics about insolvency that come up every few years are completely fabricated](https://www.ueunion.org/political-action/2013/phony-crisis-the-money-is-there-for-social-security) for political purposes. As demographics and economic realities shift, the Congress needs to adjust the contributions and funding mechanisms, but they always do. As projected, the system [went \"cash negative\"](https://www.ueunion.org/political-action/2013/phony-crisis-the-money-is-there-for-social-security) this year, which means that **if** Congress fails to act, the SSA could have a [shortfall to pay benefits around 2034.](https://edition.cnn.com/2023/03/31/politics/social-security-benefits-decrease/index.html)\n\nI'm quite a bit older than the average Redditor, but this is about the 12th fake \"social security is going broke\" panic I've witnessed in my lifetime. I remember people saying the same thing back in the mid 1980s, both before and a few years after the [1983 Social Security reforms.](https://www.ssa.gov/history/tally1983.html) And before that, there were the [1977 reforms,](https://www.ssa.gov/history/notchfile3.html) passed under the cloud of similar \"doom and gloom\" rhetoric. \n\nIt seems to come up every election year as a political tactic to scare working age voters into thinking their contributions are being mismanaged, and the press eats it up every time.",
                                    "score": 8
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1chx329/-/l26ajdk/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        }
    ]
}