{
    "title": "What concerns drive the US restriction on allowing Ukraine to use American weapons in Russia?",
    "comments": [
        {
            "depth": 0,
            "author": "nosecohn",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "orccrusher99",
            "body": "To avoid provoking Russia, escalation into WW3. The purpose of the arms are self-defense, attacks on Russian soil could be seen as aggressive (in Putins perspective). \n\nFrom the article itself:\n> helping Ukraine defend itself \n\nFrom alternate [article](https://www.reuters.com/world/europe/ukraine-shouldnt-use-us-arms-inside-russia-us-general-says-2023-05-25/) \n> Milley said restrictions on U.S. support to Ukraine following Russia's February 2022 invasion was aimed at ensuring Kyiv's self-defense against Russian forces inside Ukraine.\n> \"Why is that? Because we don't want - this is a Ukrainian war. It is not a war between the United States and Russia. It's not a war between NATO and Russia,\" Milley said.",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "MannieOKelly",
                    "body": "Which seems very odd since the Russians observe no limitation on attacking wherever they please, including mostly civilian targets.",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "But they haven't deliberately attacked any NATO countries yet, even though they're [warning NATO to stay out of the conflict.](https://www.reuters.com/world/europe/putin-warns-west-russia-nato-conflict-is-just-one-step-ww3-2024-03-17/)",
                            "score": 33,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ummmbacon",
                                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cpadhw/-/l3mmqdk/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ummmbacon",
                                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cpadhw/-/l3mlegu/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Hazzman",
                            "body": "That are in Ukraine, but if Russia started targeted outside of Ukraine the US would likely respond accordingly.\n\nYou understand the nuance right?",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ThePretzul",
                                    "body": "This is Reddit, we don’t do nuance here.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "MannieOKelly",
                                    "body": "The analogy is that China, N Korea and Iran are supplying Russia with weapons to use to attack Ukraine in Ukraine. That's the equivalent of us providing weapons to Ukraine to use to attack Russia in Russia.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nosecohn",
                                            "body": "It seems like Russia is the clear aggressor here, though.\n\nThe Ukrainians didn't mass forces and cross the border; the Russians did. So I'd argue that the weapons supplied to Ukraine are for self-defense, whereas the ones supplied to Russia are de facto offensive weapons.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "MannieOKelly",
                                                    "body": "Agree. I was saying I don’t see how the us providing weapons for attacking military targets in Russia is any escalation from what Russia‘s allies have been doing.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ummmbacon",
                                                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cpadhw/-/l4coqcv/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ummmbacon",
                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cpadhw/-/l3q9rm1/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RafayoAG",
                    "body": "I've never understood the prevention methods of \"provocation\". They've used them after WW2 yet we're already in or close to bWW3.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jynexe",
            "body": "So, there is definitely a level of not wanting to escalate, however, something I didn't see mentioned:\n \nThe US may, in the future, WANT to escalate (likely in response to something Russia does) and this gives an easy way to escalate without having to send over new equipment. \n\nEverything within the spoiler below is purely an example, these things have NOT happened and this shouldn't be taken as likely to happen.\n\n>!E.g. say Russia assassinates a prominent Ukrainian figure in the UK. The US wants to retaliate, so they authorize Ukraine to make a certain number of strikes against Russian targets in some western oblasts, let's just say 20. They have to authorize each strike though. Then, Russia attacks a Ukrainian city with a nonlethal chemical weapon. To retaliate, the US allows more strikes into Russia that they still have to approve, but this time there are significantly more, say 50. The purpose of this is to convince Russia to stop doing things the US dislikes as the US doesn't really have much to leverage in terms of pressuring Russia to not do something again.!<\n\nSo, giving the Ukrainians an artificial limit allows that limit to be lifted if they ever want to retaliate for something. There's a concept called \"[The Escalation Ladder](https://thestrategybridge.org/the-bridge/2022/9/1/reconstructing-the-ladder-towards-a-more-considered-model-of-escalation)\" that shows how countries tend to escalate conflict. The link provided shows a modern take on it. What the US is doing is effectively adding new rungs to the escalation ladder that can be used later.",
            "score": 31,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lurkingdone",
                    "body": "I’m kind of skeptical about this take. The US is trying to give them armament in order for them to defend themselves and push out an invader. They can’t do that very well without modern arms. The rules/conditions are there to demonstrate our intentions for their use, and so that everyone on the world stage knows that we are trying to help them protect themselves and not sanctioning any out of borders action on their part. Adding grey area motives, like pre-positioning offensive capabilities, just feeds into Putin’s bad faith or paranoid viewpoint of NATO as some predator pacing the bars of the fence just waiting to break through and hurt Russia, instead of it being a defensive organization.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jynexe",
                            "body": "Okay, this could just be me being dumb, but how does this feed into an image of NATO being predatory?\n\nIn my mind, this shows that the US and NATO want to limit possible escalation but also have more ways to retaliate against Russia for doing bad things. It's putative rather than purely defensive, but putative measures are usually taken from a defensive stance, not an offensive one. In any scenario of escalation, it is Russia doing something wrong or bad to which NATO responds\n You need some way of escalating without boots on the ground or nuclear war, as more types of weapons are sent, the number of ways to retaliate to Russian misdeeds shrinks. And, inevitably, if there are no more ways for NATO to escalate without boots on the ground, Russia will exploit this by doing whatever they want. Allowing and approving limited strikes allows for a perpetual way of punishing Russia without causing out-of-control escalation. \n\nNow, I don't have access to NATO war planners, but usage of the escalation ladder is commonplace in NATO discussions. The inherent concern with any escelation ladder is \"What do we do when we reach the top? How do we prevent out of control escalation?\" Well, this provides a solution\n\nAlso, to be totally clear, this isn't the only reason for NATO to do this, as with most ideas on complex topics, there are many reasons the idea or decision occurred. The two major ones here are probably the base \"To prevent escalation\" at, say, 50% of the reasoning, then \"To allow perpetual retaliation\" at 40%, and a bunch of more minor reasons in the last 10%.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lurkingdone",
                                    "body": "My point wasn’t that it IS predatory, but that any take outside of ‘we are giving them arms so they can defend themselves’—that, instead, there is an actual interest and secondary intention to use those arms offensively outside their borders—feeds into Putin’s bad faith or paranoid view on the situation: that NATO is more than a defensive alliance, but one with offensive aims and an eye on destroying Russia itself. This, as the thread began, was about the US restriction on weapons to not be used in Russia, and what those concerns were. Your comment raises a theoretical premise whose shadow very much resembles the one cast by the bogeyman Putin’s uses to portray NATO to his people, and beyond. Anyway, that is why I am skeptical: there may be some in the wargaming crowd who have this idea in their heads. But sometimes a cigar is just a cigar. We’re giving them the arms they need to defend themselves, we don’t want them to use them beyond their own borders, full stop.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ExceptionCollection",
            "body": "There are concerns about our tech being stolen by the Russians.  [https://www.stimson.org/2024/ukraine-risks-revisited/](https://www.stimson.org/2024/ukraine-risks-revisited/)\n\nThere are concerns that if Ukraine crosses over to Russian soil the Russians will retaliate with nuclear weapons.  [https://www.politico.eu/article/russia-dmitry-medvedev-ukraine-counteroffensive-russia-invasion-war-nuclear-weapons/](https://www.politico.eu/article/russia-dmitry-medvedev-ukraine-counteroffensive-russia-invasion-war-nuclear-weapons/)\n\nThose are the two big ones.  I think we can reasonably add that there is a concern that it would be seen as unacceptable by the world community, a change from self-defense to attack would reduce the likelihood of future support.  That one's my own personal thought, though, not one that is substantiated elsewhere.  Of course, that mostly applies to *actual armies*.  Saboteurs and Partisans seem to be fair game.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cpadhw/-/l3q9hdd/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CatAvailable3953",
                            "body": "Didn’t realize you had to list your sources. Sorry",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "darexinfinity",
                    "body": "This isn't even remotely on-topic",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cpadhw/-/l3oofjl/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        }
    ]
}