{
    "title": "I'm trying to make a somewhat comprehensive collection of news sources to have a global perspective, please suggest additional or alternative sources!",
    "comments": [
        {
            "depth": 0,
            "author": "ummmbacon",
            "body": "**/r/NeutralPolitics is a curated space.** \n\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\n\n1. Be courteous to other users.\n1. Source your facts.\n1. Be substantive.\n1. Address the arguments, not the person.\n\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\n\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.\n\nEdit: Hi All,\n\nI'm approving this as a request for sources, please keep it civil in the comments, off-topic comments will be removed.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "unkz",
            "body": "https://ground.news/ is a pretty good source of alternative perspectives.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "oaklandskeptic",
                    "body": "Agreed, I was skeptical of their platform at first but it's become a daily check-in for broader narratives and easily missed events. ",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "solid_reign",
            "body": "Animal Político for México is a much better news source.  Western perspective is pretty much driven by the NY Times.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "Sir_Digby83",
            "body": "https://www.reuters.com/article/us-russia-media-idUSBRE9B80TF20131209/\n\n> MOSCOW (Reuters) - Vladimir Putin tightened his hold on Russia's media on Monday by dissolving the main state news agency, seen by hawks as too liberal, and creating a new outlet to improve Moscow's image under a more conservative editor.\n> \n> The abolition of RIA Novosti, as well as international radio station Voice of Russia, and establishment of a news agency to be called Rossiya Segodnya (Russia Today) is part of efforts to strengthen the president's authority after protests against him.\n\n\nRT is Russia propaganda.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "markzzy",
            "body": "Anything \"Western\" will have similar biases, and narratives tend to be the same. I'd try a few more objective sources like AllSides.com as well.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "ZingZangMingMang",
                    "body": "NPR is probably as close to center as you can get in the US.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "RhodesianOG",
            "body": "Jeune Afrique is an okay source, though they don’t always break news as fast as others.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "EldritchCleavage",
            "body": "There are German papers worth including such as Die Welt, tageszeitung, and DeR Spiegel magazine (not always reliable, but interesting). Then Corriere della Sera for Italy. \n\nI think weekly magazines are useful for a broad sweep of news from Africa eg African Buisness. Also Africa Confidential and African Report. There is Safari on YouTube covering Nigeria too.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "GoodByeRubyTuesday87",
            "body": "Deutsche Welle (Basically the German version version of BBC)\n\nFrance 24 (Basfially the French version of BBC)\n\nBoth of them have good YouTube content, The Debate on France 24 is a good daily panel show.\n\nFor American based news Bloomberg is my top go to, I know it gets associated with business but they do all news as well, similar to Wall Street Journal, except I’d argue higher quality.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "J_Adrian_Zimmer",
            "body": "That's a pretty good list.  You might consider [DW.com](http://DW.com) from Germany over Le Mond merely because it is not behind a pay wall.\n\n  \nOf course you are aware of the NY Times.  Why not have it on the list?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "JapanesePeso",
            "body": "Bruh why tf would you even bother reading RT? It's a literal propaganda outlet.\n\nJust get a sub to a normal newspaper like the Wall Street Journal. There's barely enough time in the day to read real news much less read a bunch of fake propaganda BS.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Over_n_over_n_over",
                    "body": "I like seeing what Russians believe, or are at least supposed to believe",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Glif13",
                            "body": "Sorry to tell you, but you won't. RT is propaganda for export, not for internal audiences. \n\nIt's not intended to inform you about the Russian perspective. It aims to discredit criticism about Russia and promote narratives that help the government's current goals.\n\nYou won't be able to learn about actual legislation that Russia passes the mechanics of its political system, or what's your actual point.\n\nTo find what Russians believe you are better looking at Levada Center.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Over_n_over_n_over",
                                    "body": "Fair point. It's not as if I spend any time, I see RTs headlines quickly every once in a while but it's so blatantly ideological it's not interesting to actually read much.\n\nI visited Mexico City earlier this year and there were RT signs everywhere.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nosecohn",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cid0rf/-/l2knohv/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "> It's a literal propaganda outlet.\n\nHi, can you provide a source for that (as per our guidelines)?\n\nThanks!",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sir_Digby83",
                            "body": "https://www.reuters.com/article/us-russia-media-idUSBRE9B80TF20131209/\n\nMOSCOW (Reuters) - Vladimir Putin tightened his hold on Russia's media on Monday by dissolving the main state news agency, seen by hawks as too liberal, and creating a new outlet to improve Moscow's image under a more conservative editor.\n\nThe abolition of RIA Novosti, as well as international radio station Voice of Russia, and establishment of a news agency to be called **Rossiya Segodnya (Russia Today)** is part of efforts to strengthen the president's authority after protests against him.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ummmbacon",
                                    "body": "Mind replying to the OP with that? Thanks",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "JapanesePeso",
                            "body": "You need a source for the state newspaper of Russia being biased? No offense but what are you even doing modding a politics sub? They are a literal mouth piece for Putin. \n\n\nTheir factual reporting is rated as \"Very Low\":\n\n\nhttps://mediabiasfactcheck.com/rt-news/",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ummmbacon",
                                    "body": "> You need a source for the state newspaper of Russia being biased?\n\nYes, as per our guidelines, this applies to all statements of fact. \n\nhttps://www.reddit.com/r/NeutralPolitics/wiki/guidelines\n\n>No offense but what are you even doing modding a politics sub?\n\nHave you managed to read our guidelines? I've been a mod here for over 11 years and this has always been the policy. It is really the reason d'etre of our existance as a political sub.",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "The source requirement ensures that moderation decisions are not made based on that particular moderator's knowledge or opinion the topic. I assure you the mod you're replying to knows what RT is. That doesn't obviate the need for a [source.](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources)",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}