{
    "title": "What's the evidence for and against the effectiveness of the Southern border wall in the United States?",
    "comments": [
        {
            "depth": 0,
            "author": "ummmbacon",
            "body": "**/r/NeutralPolitics is a curated space.** \r\n\r\nIn order not to get your comment removed, please familiarize yourself with our [rules on commenting](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules) before you participate:\r\n\r\n1. Be courteous to other users.\r\n1. Source your facts.\r\n1. Be substantive.\r\n1. Address the arguments, not the person.\r\n\r\nIf you see a comment that violates any of these essential rules, click the associated *report* link so mods can attend to it.\r\n\r\nHowever, please note that the mods will not remove comments reported for lack of neutrality or poor sources. There is [no neutrality requirement for comments](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_neutral-ness) in this subreddit — it's only the *space* that's neutral — and a poor source should be countered with evidence from a better one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PolicyWonka",
            "body": "1. The wall has [flood gates](https://www.reuters.com/article/idUSL1N3AC241/) that must be kept open during the wet seasons due to flooding. Otherwise, buildup of debris risks destroying the wall.\n\n2. The wall actually divides [private property](https://www.texastribune.org/2023/03/17/texas-border-wall-landowner/) in the US, so there are additional gates that are kept open so private landowners can access their property on the other side of the wall.\n\n3. This one I’m not 100% certain of, but migrants only need to be on US soil to claim asylum. Since the border wall is built on US territory and *not* directly on the border, migrants would legally be able to claim asylum without crossing the wall in theory. Pretty sure this is why Texas installed those floating death traps in the Rio Grand.\n\n4. Maintaining a 2,000 mile long wall isn’t feasible. The wall is [breached more than 10 times per day](https://www.cato.org/blog/border-wall-was-breached-11-times-day-2022-2) as of 2022 numbers. That is to say that the CBP finds sections of the wall cut out nearly a dozen times per day. This includes a section [large enough that migrants drove vehicles thru the wall](https://www.youtube.com/watch?v=fSbsgA615lo) at one point.\n\nClearly not effective and not sustainable IMO.",
            "score": 183,
            "replies": [
                {
                    "depth": 1,
                    "author": "benigntugboat",
                    "body": "The wall also presents significant issues for the migratory patterns of wildlife that have territory on both sides of the wall.      \nhttps://defenders.org/wall#:~:text=Wildlife%20affected,habitat%20extending%20southward%20into%20Mexico.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PolicyWonka",
                            "body": "I think you mean the wall causes significant issues for wildlife, not prevents significant issues.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "benigntugboat",
                                    "body": "Edited, thank you!",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "barto5",
                                    "body": "*presents",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "benigntugboat",
                                            "body": "That was the intention, thanks!",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GalactusPoo",
                    "body": "5. An unmanned wall is useless because ladders exist.",
                    "score": 62,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tomdarch",
                            "body": "It was demonstrated that ladders are not needed to climb it:\n\nhttps://www.wsaz.com/content/news/Rock-climbers-scale-replica-of-border-wall-as-quickly-as-13-seconds-563010361.html\n\nAnd a quick search will turn up lots of videos of people climbing over the actual barrier without ladders. But ladders certainly make it even easier to simply climb over.",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GalactusPoo",
                                    "body": "Yep! I'm all for a strong border and I think most people generally are (we can treat immigrants like humans in the process), but a fucking unmanned, unwatched, poorly constructed and designed \"wall\" isn't a solution... it's a political talking point for rubes. \n\nI don't know how many times I've had the Buoy conversation with my fellow (dipshit) Texans. A mile of floaties in the river isn't going to stop someone that *walked from Guatemala.* They're just going to walk around them. \n\nPolitical Theater is all the Wall and subsequent Wall-Adjacent \"solutions\" are. But yaknow... Texas... Abbott and Cruz are fundamentally just TikTok influencers.",
                                    "score": 24
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Buck_Thorn",
                            "body": "And cutting torches, as shown in the CATO document.",
                            "score": 9
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 54
                                },
                                {
                                    "depth": 3,
                                    "author": "Sepulchh",
                                    "body": "Much more effectively monitored, it has a 150 meter zone with motion sensors and remote controlled machineguns, it's also patrolled by land and air constantly, even tanks drive along it. It's also only like 60(?) km long (37miles). The cost is something around 1.1 billion dollars, and the US-Mexico border is roughly 53 times the length. It took them 3.5 years to complete the 60km section. They have spent an average of 240 million dollars a year in maintaining it since 2014.\n\nIf the US is willing to put that type of investment into a fortification on the border, and willing to actually shoot trespassers on sight, then sure it could work I guess. \n\nIsrael is also, despite the cost and measures taken to make the wall unbreachable, increasing the active manning of it in light of the october breach.\n\n[https://english.alarabiya.net/News/middle-east/2023/10/11/The-Iron-Wall-What-is-the-Gaza-Israel-fence-](https://english.alarabiya.net/News/middle-east/2023/10/11/The-Iron-Wall-What-is-the-Gaza-Israel-fence-)\n\n[https://www.timesofisrael.com/on-both-sides-of-gazas-border-the-idf-is-remaking-security-from-the-underground-up/](https://www.timesofisrael.com/on-both-sides-of-gazas-border-the-idf-is-remaking-security-from-the-underground-up/)\n\n[https://www.migrationpolicy.org/article/rapid-proliferation-number-border-walls](https://www.migrationpolicy.org/article/rapid-proliferation-number-border-walls)",
                                    "score": 26
                                },
                                {
                                    "depth": 3,
                                    "author": "painfulbliss",
                                    "body": "Or the wall to Egypt",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "ummmbacon",
                                    "body": "This comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Esc_ape_artist",
                    "body": "https://www.politifact.com/factchecks/2018/aug/24/kevin-mccarthy/mostly-true-visa-overstays-account-half-all-people/\n\nAlso, this article examines how many people are in the US illegally after entering legally.  The rough estimate is over 40%, but it is based on old data.  The current opinion is that it may be higher because:\n\n> Alex Nowrasteh, an immigration policy analyst at the libertarian Cato Institute, told PolitiFact Virginia in 2016 that while estimates of undocumented immigrants have been stable since 2007, the number of people entering illegally across the southwestern U.S. border has \"collapsed.\"\n….\n\n\n> Finally, with the decline in illegal border crossings, it’s fair to estimate that visa overstayers now account for an increasing share of the country’s undocumented population.\n\nSo we can build a big, expensive wall that is only partially effective and still not prevent a large amount of illegal immigration.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "boredtxan",
                    "body": "not effective would mean more people get in with the wall than without...\n\nit's more accurate to say not worth the resources invested if the breach rate is high enough.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Scientific_Methods",
                            "body": "No, not effective would mean not having the desired effect.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "parabox1",
                    "body": "That is interesting I never knew those issues had been a thing. I know people climb it and some sections can be jacked up. \n\nOther than more people guarding it are there any other solutions that could work better. \n\nPersonally my uneducated thoughts was if the build a wall long enough it forces people to apply at legal check points and do things correctly.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hotcakes",
                            "body": "They come because of demand for labor. The US employers resist any legal means for them to work because they like the cheap labor and if they had legal status they would have the protection of American labor laws. Each time reform is attempted the employers make sure it goes nowhere. They like to be able to hold their employees “illegal” status over them to avoid paying fair wages and workers comp. As long as there is demand people will continue to migrate and there is no barrier that could stop them.",
                            "score": 35,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Whatttno",
                                    "body": "Please don't call it reform. What some people want is to make illegitimate migrants legal. It isn't fair to the peoples who did things right. They spent a lot of time and money. Its not right to ignore that.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Epistaxis",
                                            "body": "> It isn't fair to the peoples who did things right. They spent a lot of time and money. Its not right to ignore that.\n\nYou could make this argument against any good thing that improves quality of life. Free automatic tax processing isn't fair to the people who spent a lot of money on Turbotax. Public schools aren't fair to the people who spent a lot of time to educate their kids themselves. Curing cancer with immunotherapy isn't fair to the people who did things right and suffered through surgery and chemo.\n\nIt's natural to feel \"aw man, if I'd been just a little bit later I could've had the next big thing\" sometimes in this fast-moving world, but as long as time keeps flowing consistently forward we have to grapple with the fact that we can only make policy that improves the future and not the past.",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Amishmercenary",
                                                    "body": ">You could make this argument against any good thing that improves quality of life. Free automatic tax processing isn't fair to the people who spent a lot of money on Turbotax. Public schools aren't fair to the people who spent a lot of time to educate their kids themselves. Curing cancer with immunotherapy isn't fair to the people who did things right and suffered through surgery and chemo.\n\nIsn't the delineating factor that none of the options you mentioned are illegal? \n\nA better parallel would be if someone committed fraud to steal money - people who earned money legitimately are entitled to be upset over that, no?",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Interrophish",
                                            "body": ">It isn't fair to the peoples who did things right.\n\nyeah like how the banning of slavery was unfair to the slaves who spent a lot of time and money escaping to the North to earn their freedom. pick a better point to make",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Amishmercenary",
                                                    "body": "Is equating the banning of slavery to not applying immigration law a remotely fair comparison? There is not a single first world countries that has Open Borders, they all have some form of way to legally immigrate.",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ragnel",
                    "body": "It would be interesting to see if people were giving birth on the US territory on the south side of the wall.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PolicyWonka",
                            "body": "I would suspect no one is doing that. Ignoring the conditions obviously not suited for giving birth, there’s the real issue of determining citizenship.\n\nIt’s much easier, and safer, to give birth in a US hospital. It establishes irrefutable proof that your child is a US citizen. In fact, the prior administration was [de facto stripping Americans of their citizenship](https://www.washingtonpost.com/world/the_americas/us-is-denying-passports-to-americans-along-the-border-throwing-their-citizenship-into-question/2018/08/29/1d630e84-a0da-11e8-a3dd-2a1991f075d5_story.html) by claiming that they were not born in the US.\n\nMuch easier to surrender to authorities and give birth in a safe environment.",
                            "score": 8
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Insightseekertoo",
            "body": "From what I remember, the only parts of the wall being worked on under Biden were repairs to existing pieces that needed to be fixed. Well, I was wrong there was a nomial 20 mile new addition.  \n[https://www.nytimes.com/2023/10/06/us/border-wall-biden.html](https://www.nytimes.com/2023/10/06/us/border-wall-biden.html)  \n\n\nThat being said, the effectiveness is highly contested. This paper has a couple of interesting graphs that demonstrates the rates of illegal entries compared to the wall locations. If you look at the dates when Trump was driving to expand the wall and repairing parts, a decrease could be seen, however, that did not continue as time progressed.   \n[https://www.cato.org/blog/border-wall-didnt-work](https://www.cato.org/blog/border-wall-didnt-work)  \nWhy it did not stay low, is not clear, but there are plenty of hypotheses.",
            "score": 51,
            "replies": [
                {
                    "depth": 1,
                    "author": "micmea1",
                    "body": "I imagine a drop could have been because of an increased presence of U.S border control. But the border runners eventually figured out where work was being done and how to circumnavigate it.",
                    "score": 36
                }
            ]
        },
        {
            "depth": 0,
            "author": "RagingAnemone",
            "body": ">On the other hand, [this CATO piece](https://www.cato.org/blog/border-wall-didnt-work) claims the wall didn't work and [border apprehensions have increased](https://borderoversight.org/2024/03/28/border-patrol-migrant-apprehensions-at-the-u-s-mexico-border-october-2011-april-2020/) since it was built.\n\nHow is border apprehensions increasing an indicator that the wall didn't work?",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "towishimp",
                    "body": "Because presumably it would do what it was designed to do and *stop people from crossing the border?*",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pentamir",
                            "body": "More apprehensions can mean that more illegal immigrants are being caught, as in, the wall is working as intended.",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "Is that the intended purpose? I've actually heard it both ways: that it's intended to keep people out and that it's intended to push people towards areas that are more easily monitored. It's not clear to me which is really the primary purpose.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "parabox1",
                                            "body": "I assumed it was to funnel people",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheStealthyPotato",
                                                    "body": "I haven't heard that before. Do you have any links to pro-wall politicians who say this is the intended goal?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "parabox1",
                                                            "body": "No but I was MIL Leo and it just seems like a clear tactic. Something all my friends would talk about who are also MIL.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "TheStealthyPotato",
                                                                    "body": "It would be a good tactic if you still wanted to let people in. I don't believe that is the intention of the GOP who push to build the wall.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "parabox1",
                                                                            "body": "It’s not the public opinion. But the GOP needs cheep labor for the shit jobs. \n\nThink about it \n\nPicture a custom home builder of brick or log homes \n\nThe electricians who do the wiring \n\nThe copper smiths and wood workers who do the finish work \n\nNow picture the roofer. \n\nIf you pictured a cash under the table Hispanic dude you’re not alone. \n\nGOP needs cheap labor.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "pentamir",
                                            "body": "I don't know. That's why I wrote that it \"can\" mean that. Honestly maybe it's both? As in, it's long term purpose is to be a deterrent but obviously in the short term people are going to keep coming and get apprehended until the deterrent starts working.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Amoral_Abe",
                                            "body": "In theory it would be both.  You tend to get a lot of hyperboles from both sides.  \n  \n* Republicans voters will claim that the wall will keep people out along with providing border security with more funding.  \n * This argument was largely derailed by their willingness to vote down a bill for border security at the behest of Trump for political points.  \n* Democrats will claim that a wall is easily beaten by a longer ladder.  \n * This argument doesn't seem to make much sense as most migrants aren't walking around with ladders and any wall could be overcome with a large ladder but people still build them because they do have security value.  \n  \nIn reality, a border wall would provide a roadblock for people coming in.  It slows people down and if properly manned will prevent people from scaling it.  This would likely force people to go to checkpoints or work with organized groups to get smuggled in through tunnels, boats, or specific points.  Either way, the flow of people are being funneled towards specific locations which makes managing and blocking off access easier.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "SuperSocrates",
                                    "body": "Shouldn’t the wall, if working, prevent them from needing to be caught in the first place?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pentamir",
                                            "body": "That depends on a variety of factors. The wall is build on US territory, so even if you're on that side of the wall, you're already trespassing if you've crossed the border, regardless of whether you've reached the wall. The other thing is \"wall as a deterrent\" - it's not going to deter people the instant you build it. If I put a speed trap on a highway, its main function is to be a deterrent... But in the first few months a lot of people will get fined because they didn't yet know about the deterrent. ",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheStealthyPotato",
                                                    "body": ">  Ifl put a speed trap on a highway, its main function is to be a deterrent... But in the first few months a lot of people will get fined because they didn't yet know about the deterrent.\n\nYour analogy presumes that immigrants will go back and forth across the wall before they realize the wall is there. Seems like a poor analogy.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "pentamir",
                                                            "body": "Well at first they're gonna keep coming, yes. Trying to see if there's a way through. It's not just women and children, it's the cartels too. Drug smugglers. They'll try to see how secure the wall is, what's the best way across, etc. It's not reasonable to assume that immigration will stop the minute you build a wall. ",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "TheStealthyPotato",
                                                                    "body": "> Well at first they're gonna keep coming, yes.\n\nAnd they will continue to keep coming. If someone can get through the border wall immediately after it's put up, it's not going to magically stop people later.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "pentamir",
                                                                            "body": "They can get apprehended though. That's why that number can go up and not necessarily signify that the wall isn't working. \n\nAgain, I say \"not necessarily\" because, like in my earlier comment, I'm only commenting on the possibilities. I don't know if it's working or not.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "micmea1",
                            "body": "I mean I don't think the US government is dumb enough to think that a wall is going to make desperate people give up. But the fact that the presence and constant maintenance of the wall means more border security and more people caught in the act. I mean its not like the Chinese built the great wall and wiped off their hands saying \"that'll do.\". The wall was manned.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TempAcct20005",
                                    "body": "I don’t know if the Great Wall of\nChina is the gotcha you think it is",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "micmea1",
                                            "body": "I mean it was more about the strategy. You don't just build a wall and leave it.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "boredtxan",
                            "body": "what if it's designed to decrease *undetected* border crossing more so that border crossing in total?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "ReturnOfBigChungus",
                            "body": "Only if you view it as the only method of deterrence. As part of a broader suite of deterrent tools it *might* still play a role in increasing border security. I’m not necessarily saying that is the case, but it’s hard to judge its real effect in isolation. All else being equal, having a wall makes it more difficult, but clearly the mere presence of a wall is not a real deterrent.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "WaltKerman",
                            "body": "It's supposed to slow people down and filter them to specific areas to make apprehension easier.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CaseyAshford",
                    "body": "The presented data visualizations also show that the known successful illegal entries has increased. \n\nThe article says \"The Trump wall has not stopped immigrants from coming illegally, nor has it stopped them from successfully entering illegally.\".",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "kid_dynamo",
                    "body": "Because if the wall stopped them they wouldn't be in us territory to be apprehended, surely?",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RagingAnemone",
                            "body": "A wall could force them to a particular path which would make them easier to spot and/or apprehend.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kid_dynamo",
                                    "body": "It could, or if apprehension is increasing that means more people are getting in post wall. Doesn't really say much for the wall right?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "boredtxan",
                                            "body": "if we aren't catching people does that mean the are being blocked or that getting in is easy....?  see how this works",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "CarpeNivem",
            "body": "When you say \"effective\" what is it that you're asking whether the wall does? It sure as hell doesn't prevent Visa overstays, [which is how most illegal immigration happens](https://www.npr.org/2019/01/16/686056668/for-seventh-consecutive-year-visa-overstays-exceeded-illegal-border-crossings).",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "_YikesSweaty",
                    "body": "It’s not 2019 and that isn’t even close to true right now.\n\nhttps://www.washingtonpost.com/immigration/2024/02/11/trump-biden-immigration-border-compared/",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JudgeGroovyman",
                            "body": "What data makes you think that?",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ummmbacon",
                                            "body": "This comment has been removed for violating [//comment rule 1:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Be courteous to other users.  Name calling, sarcasm, demeaning language, or otherwise being rude or hostile to another user will get your comment removed.\r\n\r\n\r\nThis comment has been removed for violating [//comment rule 4:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n>Address the arguments, not the person. The subject of your sentence should be \"the evidence\" or \"this source\" or some other noun directly related to the topic of conversation. \"You\" statements are suspect.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Amishmercenary",
            "body": "I think almost all of the available evidence shows that modern border walls are incredibly successful at significantly impacting and lowering illegal immigration across the board. Most of the counterexamples I've seen are by critics who point out walls that are either undermanned or underfunded, or don't have reliable data.\n\nIn contrast, if you look at some of the most successful border walls, they decrease illegal immigration by 90%+\n\n[https://en.wikipedia.org/wiki/Israeli\\_West\\_Bank\\_barrier](https://en.wikipedia.org/wiki/Israeli_West_Bank_barrier)\n\n[https://en.wikipedia.org/wiki/Hungarian\\_border\\_barrier](https://en.wikipedia.org/wiki/Hungarian_border_barrier)\n\n[https://en.wikipedia.org/wiki/Syria%E2%80%93Turkey\\_barrier](https://en.wikipedia.org/wiki/Syria%E2%80%93Turkey_barrier)\n\n[https://globalchallenges.ch/figure/fact-sheet-the-israeli-west-bank-barrier/](https://globalchallenges.ch/figure/fact-sheet-the-israeli-west-bank-barrier/)\n\nSpecifically looking at Israel's west bank barrier, it has been incredibly effective at lowering illegal immigration by 90%+, and cost a fraction of what it would cost the US in terms of a percentage of GDP to solve such a large issue. \n\nIndeed, even when the US has tried putting up barriers in certain areas those areas are avoided by illegal immigrants, per historical research.\n\n[https://econ.uic.edu/wp-content/uploads/sites/283/2020/06/Fenced\\_Out\\_0622\\_2020.pdf](https://econ.uic.edu/wp-content/uploads/sites/283/2020/06/Fenced_Out_0622_2020.pdf)\n\nThe fact is, most of the arguments against the effectiveness of a border wall are derived from conjecture and \"what if\" scenarios, not from real, recent historical data. \n\nWith the use of modern technology like infrared lighting to detect large groups of people, border walls would be incredibly helpful to CBP in funneling large groups of migrants to certain areas (As people have mentioned, areas of the wall that are constantly attacked and destroyed with tools). Even the CBP agents on the ground support a wall. \n\n[https://www.cbp.gov/newsroom/video-gallery/video-library/walls-work](https://www.cbp.gov/newsroom/video-gallery/video-library/walls-work)\n\nAgain, the goal isn't to completely stop illegal immigration- it's to significantly decrease illegal crossings. Through the use of politics to dissuade potential crossers, physical barriers to physically stop or slow large groups, and technologically-empowered CBP, the border crisis can be easily properly addressed- it's just about getting the support to put out the resources to do so.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "lokujj",
                    "body": ">  In contrast, if you look at some of the most successful border walls, they decrease illegal immigration by 90%+\n\nCan you point to where that 90% figure comes from? I searched your links and did not find it.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Amishmercenary",
                            "body": "I’m on mobile, but if I recall it’s in one of the sub links. If you can’t find it there, here’s another report on the topic that actually lists the number higher- a 99% decrease.\n\nhttps://www.documentcloud.org/documents/3439941-Staff-Report-Securing-Israel-Lessons-Learned",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lokujj",
                                    "body": "Your link is a report from [Ron Johnson](https://en.wikipedia.org/wiki/Ron_Johnson#Immigration) ([press release](https://www.hsgac.senate.gov/media/reps/chairman-johnson-releases-report-on-israeli-homeland-security-and-applicable-lessons-for-the-united-states/)), and it refers to the Sinai border (*not* the West Bank). It lacks a primary source, but it seems to be the Israeli government -- specifically Netanyahu. [PolitiFact](https://www.politifact.com/factchecks/2017/feb/13/ron-johnson/border-fence-israel-cut-illegal-immigration-99-per/) rates his statement \"Mostly true\", although it questionably cites his report as the source for verification. [Wikipedia](https://en.wikipedia.org/wiki/Egypt%E2%80%93Israel_barrier#Effects_on_illegal_entry) seems to provide alternative sourcing, with a similar conclusion, and there are some related news articles.\n\nThat covers the Israel-Egypt border. How about Hungary, Syria-Turkey, and the West Bank? Is there similar evidence?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Amishmercenary",
                                            "body": "Oh good point. Here’s the sources you asked for :\n\nWest Bank was 92% effective: https://m.jpost.com/israel-news/article-732948\n\nAnd decreased terrorist attacks by 80% https://www.theunitedwest.org/2023/09/24/irli-report-border-walls-work-in-israel-and-would-work-in-u-s/\n\nHungarys was 99% effective https://s4c.news/2018/11/02/__trashed-3/\n\nI’ll try to edit this comment when I get a chance with an exact number for Turkey’s wall.\n\nEDIT: It looks like Turkey hasn’t released any official figures, but feel free to use Israel’s other 99% decrease in illegal immigration as an example in liu of that.",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NeonSeal",
                    "body": "Good points here but I’m also not quite convinced this will work at scale. The border walls you mentioned are magnitudes of order smaller than the US-Mexico border, even considering impassable terrain. \n\nAt this scale, maintenance and funding become far more important.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Amishmercenary",
                            "body": "I don’t see why maintenance and funding wouldn’t scale linearly. When taking GDP into account the cost of a US wall would be lower in comparison to Israel’s wall as a percentage of their GDP/annual spending.0",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NeonSeal",
                                    "body": "Idk what you are estimating the cost of a US wall to be. But a full wall across the entire southern border with proper maintenance and staffing is going to be a hell of a lot more expensive than whatever we have now.\n\nAnd it will require a massive hiring increase for border patrol guards, massive urban planning,  architecture, and engineering effort. You have to plan routes for estimated migrant crossing flow, set up safe entry points, increased volume of legal services, maintain the wall in a variety of climates and terrains. And all of this across 2000 miles. This would be an unprecedented effort and would require buy-in from multiple executive agencies coordinating together.\n\nYou have to coordinate the DoJ, DoHS, DoI, and more. You have to make sure the ecological impact is negligible, no concerns for endangered wildlife, proper emergency service availability, legal challenges in every state, etc.\n\nIt would be a bureaucratic challenge at minimum, and isn’t a problem that can be solved really by saying “just throw more money at it”. That’s how you wind up with just another government project wound up in red tape that is a tax-payer money sink.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Amishmercenary",
                                            "body": "Most estimates I’ve seen for a border wall are around 25B, but let’s just make it an even 30B.\n\nhttps://www.politico.com/story/2018/03/19/border-wall-democrats-respond-470687\n\nThat would make up less than a half a percent of the US’ annual spending, and would be going back to the American people in the form of jobs of contracts. \n\nAgain, it sounds like the arguments against a border wall are rooted in conjecture, not historical data. Of course the government would have to work with the states- they already do so on a daily basis. All the services you’ve mentioned already work with the states to deal with the current border crisis, and they’ve had to work overtime since we have unprecedented illegal immigration crossings into the US. \n\nWith a modern border wall you’d have far less crossings, more control over who enters the country, and at the end of the day you’d probably have far less border guards- since crossings will be funneled into high traffic areas, CBP will be able to concentrate on a few high traffic areas, rather than overseeing thousands of miles of un-barricaded land.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NeonSeal",
                                                    "body": "Yeah, maybe 30B annually: https://www.bloomberg.com/news/articles/2013-03-13/sealing-the-u-dot-s-dot-border-would-cost-an-additional-28-billion-a-year\n\nEstimates vary so widely because no one is even clear on what the requirements are of this wall. Is it going to be solid concrete? A large gate? What exactly is going to be built? Who is going to build it? Where is it getting built? \n\nIn reality all that link you shared proves is that the wall will cost AT LEAST 25B. That’s the money congress approved for it so far. There are so many unknowns. \n\nOne example is how will Native American nations react to a wall being built through their land? US law allows free travel through the border for tribal governments. How do you think that is going to fly for them when a 30 ft concrete slab goes up restricting their freedom of movement on their land? Not an easy legal challenge to resolve.\n\nhttps://www.brookings.edu/articles/the-wall-the-real-costs-of-a-barrier-between-the-united-states-and-mexico/\n\nThere are also probably thousands of animals with natural migratory patterns crossing the border. are we ready for all the challenges to the Endangered Species Act, migratory bird treaty act, coastal zone management act, clean water act, etc\n\nThe problem is bigger than construction and personnel cost. There are huge hidden costs that will arise and be paid for decades.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Amishmercenary",
                                                            "body": "I don’t think any of that speaks to the EFFECTIVENESS of a border wall though, does it? It’s just conjecture over cost of maintenance and implementation.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "NeonSeal",
                                                                    "body": "I guess not directly. But it is relevant because cost-effectiveness is still valid. Like is it really “effective” if we spend a trillion dollars on the wall? At that point it could be the best border wall ever but would cause problems elsewhere. Financial sustainability and project management is critical for project effectiveness.\n\nI only brought this up bc the root comment was comparing the US wall proposal to smaller walls in Israel, Syria, and Turkey. But those are much smaller walls and don’t face the same challenges as they would in the US.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Amishmercenary",
                                                                            "body": "Again, if conjecture is the only criticism that one can make of the border wall, and not based on actual evidence, then suffice to say it seems like a modern border wall’s effectiveness is backed by historical evidence, while criticism is rooted in conjecture.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "NeonSeal",
                                                                                    "body": "I don’t think it is just conjecture. They are practical challenges that have to be navigated if a wall will be built, and they WILL come up, and they WILL be expensive.",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Amishmercenary",
                                                                                            "body": "I guess I’m just not really concerned about the pricetag if it’s essentially a rounding error in terms of the annual budget.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Epistaxis",
                    "body": "> Again, the goal isn't to completely stop illegal immigration- it's to significantly decrease illegal crossings. \n\nThis is a crucial distinction. [People crossing the border without authorization \"typically\" wait to be apprehended and indicate they are seeking asylum](https://www.factcheck.org/2024/02/breaking-down-the-immigration-figures/), at which point a large fraction of them are released for legal temporary residence in the US for the duration of their asylum review process. That duration is years because the process has a backlog of three million cases. If asylum is approved, people who entered the country without authorization become legal immigrants; if not, they are ordered to be deported.\n\nSo by preventing illegal crossings, a border wall would effectively block both legal and illegal immigration. Another view of the issue would be: why is it so difficult for refugees to enter the country legally that they'll risk their lives and cross the border illegally just to apply for asylum? Or, why is the asylum process so slow that migrants without valid refugee claims will risk their lives and cross the border illegally just to live in America for a few years, or use that time to disappear? Or, why is it so hard to immigrate legally that anyone would abuse the asylum system in the first place?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Amishmercenary",
                            "body": ">[People crossing the border without authorization \"typically\" wait to be apprehended and indicate they are seeking asylum](https://www.factcheck.org/2024/02/breaking-down-the-immigration-figures/), \n\nI don't see any evidence that this is true, since a minority of asylum cases are actually approved. Illegal immigrants are better off just illegally crossing, and moving to a sanctuary city/state where they won't be deported.\n\n[https://en.wikipedia.org/wiki/Sanctuary\\_city](https://en.wikipedia.org/wiki/Sanctuary_city)\n\n[https://www.wral.com/story/fact-check-what-percentage-of-immigrants-are-granted-asylum-in-the-u-s/20640989/](https://www.wral.com/story/fact-check-what-percentage-of-immigrants-are-granted-asylum-in-the-u-s/20640989/)\n\n>So by preventing illegal crossings, a border wall would effectively block both legal and illegal immigration.\n\nA border wall wouldn't preclude people from using Ports of Entry to apply for asylum. [https://en.wikipedia.org/wiki/Port\\_of\\_entry](https://en.wikipedia.org/wiki/Port_of_entry)",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Epistaxis",
                                    "body": "> I don't see any evidence that this is true\n\nI already linked the source that summarizes another for the figure of three million asylum cases pending (as of last November). For comparison, the same source also estimates \"about 4.2 million\" migrants who've either been apprehended or escaped into the country after crossing illegally. So asylum request is indeed a \"typical\" next step after unauthorized border crossing.\n\n> A border wall wouldn't preclude people from using Ports of Entry to apply for asylum. \n\nHere we're on the same page: what force is pushing asylum seekers away from legal ports of entry more strongly than the wall is pushing them there?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Amishmercenary",
                                            "body": "Pending asylum cases aren’t the same as actually successful ones though? Again there’s no reason for illegal immigrants to risk the high likelihood of their asylum case being denied when they can just immigrate illegally and be protected by sanctuary states- otherwise we would be seeing all illegal immigrants use this loophole.\n\nThe goal of a wall would be to significantly impact all illegals immigrants, asylum seekers would then be forced to actually only go through ports of entry, rather than breaking the law by not going through ports of entry.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "_YikesSweaty",
                    "body": "It’s amazing that redditors are unsure if physical barriers impede motion. Getting through or around a wall is obviously harder than walking over open ground.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Amishmercenary",
                            "body": "Agreed. Even DHS agrees that walls work- [https://www.dhs.gov/news/2018/12/12/walls-work](https://www.dhs.gov/news/2018/12/12/walls-work)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PhantomFuck",
                    "body": "Correct answer and great write-up!",
                    "score": -3
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cr63jv/-/l40dqi2/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MininimusMaximus",
            "body": "**I. Summary**\n\nFrom the research below, my conclusion is that objectors to border walls are not basing their objections on the efficacy of border fences which have proven extremely effective when manned. Manned should be understood as a euphemism to mean \"when combined with the use of physical force or violence to repel illegal immigrants\".\n\n**II. Factual Analysis**\n\nBorder walls have proven extremely effective when manned, as can be summarized from the available authoritative studies from the extreme difficulty of individuals crossing the Berlin Wall during the Cold War, to the extreme reduction in net-illegal migration from Morocco to Spain from the construction of the Cuerta wall (and its later doubling in size). Edina Lilla Meszaros, [Barbed Wire, Border Walls and the 'Art' of Fencing out Migrants and Refugees: An Assessment of the EU and American Bordering Practices](https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3489076), 18 RES. & SCI. TODAY 75, at 78, 82 (2019).\n\n**Cueta Fence and Walls Severely Dropped Morocco to Spain Immigration.**\n\nThe Cueta \"fences met the expectations of their builders, as from 2005 until 2013/2014 they have managed to keep away major flows of immigrants, instead forcing them to choose more perilous routes through the sea.\" *Id*. These fences were reinforced in 2005, manned by agents with thermal goggles, CCTV, and other devices. *Id*. Most immigrants did not choose sea travel because its perilous nature so they remain where they are. *Id*.\n\nHowever, while the wall was extremely effective, attempts at breakthrough ended in death and western nations have developed a policy against killing illegal immigrants, thus Spain modified its side of the wall to remove a layer of razor wire, increase height of less dangerous parts of the wall to more safely deter immigration *Id*. at 84. However, Morocco put up the Razorwire on its side of the wall, using money granted to it by the EU. *Id*.\n\n**Hungarian/EU Border Fences Severely Dropped Immigration from 764,033 in 2015 to 5,869 in 2018.**\n\nIn 2015 there was an extreme rise of migration into the EU from the Western Balkans Route. *Id*. at 83. Hungary received \"174,400 first time asylum applications\" but only determined that \"545\" claims were valid, that almost all were economic migrants. *Id*. Germany received 441,800 asylum applications, but with its much laxer standards at the time, admitted 148,215 qualified, but over two thirds were baseless. *Id*.\n\nIn response to the influx of \"economic migrants who came to Europe for financial benefits\", Hungary, Germany, Austria, Greece, and Macedonia all built border walls and nations adopted policy changes to Asylum procedures and Criminal Codes to deter immigration. *Id*. at 84-85. Illegal immigration along that route is down to 5,869 as of 2018. *Id*.\n\n**Excellent Study Shows Usage and Effects of Walls**\n\nDavid B. Carter & Paul Poast, [Why Do States Build Walls? Political Economy, Security, and Border Stability](https://www.jstor.org/stable/26363882), 61 J. CONFLICT RESOL. 239 (2017) is an extremely good read on this subject. Largely, we see walls for either military reasons or when a wealthier nation borders a poorer nation. There are border walls in every continent except South America, and there is a really cool table spanning pages 249-250 that shows all of the various walls built by different nations. The authors, like the author of the previous studies, critique human cost of walls.\n\nBut they do not challenge their effectiveness.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "MininimusMaximus",
                    "body": "**III. Other Considerations**\n\nThe United States is much lighter on regulation than the EU and one of the biggest challenges we have is that illegal immigrants are actually able to secure work in our country. 44% of farm workers are illegal immigrants.  [https://www.farmworkerjustice.org/wp-content/uploads/2022/06/NAWS-data-fact-sheet-FINAL.docx-3.pdf](https://www.farmworkerjustice.org/wp-content/uploads/2022/06/NAWS-data-fact-sheet-FINAL.docx-3.pdf) . \"\\[I\\]n other migrant-heavy sectors, the share of illegals is... smaller (typically about a fifth).\" [https://www.compactmag.com/article/an-epidemic-of-exploitation/](https://www.compactmag.com/article/an-epidemic-of-exploitation/) . Because EVerify is not used, employers of illegal immigrants get a workforce they can exploit and expose to danger, such as the current milkbourne virus H5N1. *Id*. They also lower wages for lower skilled employees. *Id*. It is more attractive to come to the US because people can actually work here once they get in, even if the conditions are awful.\n\n**IV. Conclusion**\n\nWalls are effective when they are manned and properly. The better arguments against walls focus on human rights angles or globalism as a desirable philosophy. There is strong evidence that walls combined with physical force are a deterrent.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "We appreciate the references, but can you please add links? For books, you can usually find them on books.google.com. Thanks.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MininimusMaximus",
                            "body": "Sure thing! Added the SSRN link for one journal article and the JSTOR link for the other.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "stoopidjonny",
            "body": "Probably would be more affordable and effective to shore up the Darien Gap. It is only 40 miles wide and half a million US-bound immigrants pass through there annually. https://www.newsweek.com/panama-president-mulino-darien-gap-immigration-1897694",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Minister_for_Magic",
                    "body": "In the densest, most inaccessible, most inhospitable jungle environment on the planet? Good luck with that",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stoopidjonny",
                            "body": "Probably easier since there probably are places that are impassable, so you can concentrate resources in even smaller areas.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nosecohn",
                                    "body": "There's a reason it's called the Darien \"gap.\" It's so inhospitable and resistent to development that it's [the only gap in the Panamerican Highway](https://www.cntraveler.com/story/the-60-mile-darien-gap-leaves-the-pan-american-highway-forever-incomplete) that runs from the southern tip of Argentina all the way up to Alaska.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ummmbacon",
                                                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cr63jv/-/l4fkats/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ummmbacon",
                            "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cr63jv/-/l3xf8f0/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\r\n\r\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\r\n\r\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cr63jv/-/l40fwoc/) so that we can reinstate it.\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ummmbacon",
                    "body": "This comment has been removed for violating [//comment rule 3:](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules)\r\n\r\n> Be substantive. NeutralPolitics is a serious discussion-based subreddit. We do not allow bare expressions of opinion, low effort one-liner comments, jokes, memes, off topic replies, or pejorative name calling.\r\n\r\n\r\n\r\n\r\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ManonFire63",
            "body": "The Border Wall is like a band aid.  It won't quite stop the bleeding.\n\nThe major issue is that the US gives free stuff to people who break the law.  Given the US stopped giving free stuff to people who break the law, there would be a lot less to deal with on the Illegal immigration issue.  In the 1990's, a lot of the illegal immigrant issues were due to migrant workers not going home.  The situation has become worse.\n\n*Plyler v. Doe*Plyler v. Doe, for example, allowed for Illegal Immigrant children to receive US public education.  That was back in 1982.  Given people didn't feel comfortable, in the US, after breaking the law, many of them would not be in the US.\n\nThe Law, that is immigration law, it is not handled the same for everyone.  Given someone came here on a student visa, they wouldn't get away with a lot of the stuff people arriving, lately, from South America have been getting away with.\n\nLink: [When Might I be Deported as Foreign Student in the US](https://www.devorelawgroup.com/when-might-i-be-deported-as-a-foreign-student-in-the-united-states/#:~:text=These%20deported%20students%20now%20face%20a%20five-year%20visa,to%20enter%20the%20United%20States%20in%20the%20future) from Devore Law Group\n\nAre certain Universities not giving scholarships to Illegal Immigrants like Obama and his Dream Act?  Free stuff to law breakers.  Not applied evenly.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -7
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nosecohn",
                    "body": "This comment has been removed for violating [//comment rule 2](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_comment_rules):\n\n> If you're claiming something to be true, you need to back it up with a [qualified source](https://www.reddit.com/r/NeutralPolitics/wiki/guidelines#wiki_sources). There is no \"common knowledge\" exception, and anecdotal evidence is not allowed.\n\nAfter you've added sources to the comment, please reply directly to this comment or send us a [modmail message](https://www.reddit.com/message/compose?to=/r/NeutralPolitics&subject=Comment%20removal&message=https://www.reddit.com/r/NeutralPolitics/comments/1cr63jv/-/l3yainr/) so that we can reinstate it.\n\n\n\nIf you have any questions or concerns, please feel free to message us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutoModerator",
                    "body": "Since this comment doesn't link to any [sources,](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_sources) a mod will come along shortly to see if it should be removed under [Rules 2 or 3.](https://www.reddit.com/r/NeutralPolitics/wiki/index#wiki_rule_2.3A_source_your_facts)\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NeutralPolitics) if you have any questions or concerns.*",
                    "score": 1
                }
            ]
        }
    ]
}