{
    "title": "[Adam Stern] \"There is understood to be skepticism within a selection of the sport’s stakeholders regarding the validity of Andretti’s claims that he did not bring the situation to the attention of Congress.\" - @RACERmag",
    "comments": [
        {
            "depth": 0,
            "author": "Apennatie",
            "body": "Anyone got this in simple English?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CallMeFierce",
                    "body": "They're saying they don't believe Andretti when he claims they didn't go to Congress first.\n\n\n*edited for clarity",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chevyzaz",
                            "body": "Why the double negative? So they think he did go?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CallMeFierce",
                                    "body": "You're right, I wrote that in a confusing manner. Just edited.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "chevyzaz",
                                            "body": "Ouuuh makes more sense now. Thanks for clarifying",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ItsTomorrowNow",
                            "body": "Why would Congress go to Andretti first?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CallMeFierce",
                                    "body": "Congress members can see a situation and understand it's politically expedient for them to intervene. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "whimsical_trash",
                                            "body": "See: Ticketmaster after the Taylor Swift snafu",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ItsTomorrowNow",
                                            "body": "Oh right, makes sense, an election year probably helps too I suppose.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "masterpierround",
                                                    "body": "There were 7 senators who signed the letter. Of them, 2 were from Indiana, where Andretti is a huge deal, 2 were from Michigan, where GM is a big deal, one was Klobuchar, who's been on a huge anti-trust kick lately, one was Mike Lee, who likely just signed on because he leads the committee, and one was Alex Padilla, who i have no idea why he signed it.\n\nBut 4/7 senators represent areas directly involved.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FSUfan35",
                                                            "body": "> Klobuchar\n\nIs she also the one leading the charge on the Ticketmaster/live nation anti trust thing right now? Who are also part owned by Liberty Media.\n\nShe could have gone to other senators that would have an interest in getting andretti on the grid",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "masterpierround",
                                                                    "body": "I'm not sure, I know it was her home state that passed a law requiring all fees to be disclosed up front, and she's [been pushing a similar law federally](https://www.klobuchar.senate.gov/public/index.cfm/2023/12/klobuchar-introduces-bipartisan-legislation-to-reform-live-event-ticketing-system) so she's definitely involved to some extent. The lawsuit itself was filed by the DOJ, which is part of the executive branch.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "FSUfan35",
                                                                            "body": "[Yea seems like she's been involved for a while](https://www.klobuchar.senate.gov/public/index.cfm/2023/10/klobuchar-requests-pricing-transparency-update-from-live-nation-ticketmaster)",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "mhcranberry",
                                                                                    "body": "She's the chair of the senate committee dealing with anti trust stuff.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Jorel_Antonius",
                                    "body": "General elections for congress are in November.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "solk512",
                                            "body": "Congress doesn’t have “general elections”, please don’t comment on things you don’t understand.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "edfitz83",
                                    "body": "Congresspeople from the Detroit & Ohio areas, where GM is?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CoachRyanWalters",
                                            "body": "Detroit yes. Ohio does have some factories but unsure if they are in those reps areas",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "squaler24",
                            "body": "Is that a surprised? Why would congress be the first to approach? Andretti clearly reached out for them to do something.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Disastrous-Beat-9830",
                                    "body": ">Why would congress be the first to approach? Andretti clearly reached out for them to do something.\n\nI think the implication is more that GM went to Congress rather than Andretti.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Roddy-the-Ruin",
                                    "body": "No, it isn't surprising. But Mario said that congressmen reached out to him after seeing the Red Bull showrun in D.C..",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "squaler24",
                                            "body": "Don’t believe that. \n\nUS congress can’t make two steps without tripping on each other first. They got more pressing things to worry about. Specially with general elections in less than 6 months.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mhcranberry",
                                                    "body": "If GM called someone and said, hey, can you take a look at this, they absolutely would set up a meeting, in part because of the elections in 6 months.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Lobsters4",
                                                            "body": "This.  Elections are coming up...... not to mention that eyes are on Liberty Media anyway for the Live Nation/Ticketmaster anti-trust case.  Liberty Media has been under the microscope for AWHILE.",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "edfitz83",
                                                    "body": "They spend more time re-naming post offices then working cooperatively on constructive legislation.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "masterpierround",
                                    "body": "There's a hotly contested election, and pandering to the American legend being unfairly oppressed by the European racing series plays well to voters. Plus half of the congresspeople to speak out either represent metro Detroit or the State of Michigan, so they're always on the lookout for ways to appeal to GM/Ford workers. Not to mention they stay on top of automaker/worker issues because a significant chunk of campaign contributions comes either from GM/Ford itself or from the UAW. Both the UAW and GM want this deal to happen.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "killer_corg",
                            "body": "Oh I read it as the opposite, stakeholders are skeptical that Andretti didn’t go to congress and congress came to him",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Roddy-the-Ruin",
                                    "body": "They are saying the same thing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "killer_corg",
                                            "body": "> they don't think Andretti didn't go to Congress first.\n\nAh i guess i got confused by that part, just sounded odd in my head",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Formulafan4life",
                    "body": "Congress does investigation. \n\nAndretti says: “that’s totally their own initiative”\n\nF1 says: “we’re not so sure”",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Apennatie",
                            "body": "Exactly the response I needed, thanks",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "joaopaulofoo",
                    "body": "people involved believe that Andretti was the one who seek the congress intervention in this case, and wasn't the congress who approached Andretti as he claims.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DepecheModeFan_",
                    "body": "Mario said congress started their investigation by themselves and he wasn't involved.\n\nF1 believes Andretti went to politicians and asked them to investigate it to help their cause.\n\nBasically.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Snoo_87704",
                            "body": "(1) Does it matter?\n(2) Is F1 a bunch of middle schoolers afraid of being narced on?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DepecheModeFan_",
                                    "body": ">(1) Does it matter?\n\nWell it clearly does to F1, they're taking it very personally and hate Andretti more.\n\nDoes it matter in terms of legally/morally/fans opinions ? probably not.\n\n>Is F1 a bunch of middle schoolers afraid of being narced on?\n\nF1 is a bunch of cocky billionaire's who think they can get away with anything they want and need a reality check. Andretti is happy to go to war and good for them.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "BighatNucase",
                                    "body": "If Mario lied about it - of course it matters. The fact he felt the need to lie would on its own prove it matters.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nn4260029",
                    "body": "It appears there are wonderings within certain factions of the four-wheeled motorracing brotherhood regarding the sequencing of actions undertaken by Andretti vis a vis inquiries undertaken by a well known government body, focusing on which of the events that unfolded took precedence over which and resulting in skepticism that the Washington DC body of influence would initiate their involvement in the matter without being nudged to do so by the second party in this proverbial tango of power.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "GFYGOPMODS",
                    "body": "The headline is poorly written!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Snoo_87704",
                    "body": "Probably was General Motors.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "joaopaulofoo",
            "body": "considering the legal battle going on between the US government (with bipartisan support) versus liberty media over the ticketmaster/live nation monopoly. \n\ni could see members of the congress from both sides approaching Andretti to push another monopoly case against Liberty Media, making their live nation case even stronger. repeat offences is taken into consideration when judging anti-consumer practices.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "dinosaursandsluts",
                    "body": "You know you fucked up when the coalition coming after you is bipartisan.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BowlerCertain8305",
                            "body": "Everyone likes music and everyone has fucking hated ticketmaster for 2 decades. One thing we can all agree on in the US",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "NYNMx2021",
                            "body": "No, you just didnt pay the right people lol. Look at the congress critters that blocked price controls on pharmaceuticals. Extremely bipartisan, look at donors and the reason why is clear. Thats all it ever is",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "URZ_",
                    "body": "Congress is not the ones prosecuting Ticketmaster.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "APR824",
                            "body": "Correct but they, meaning one of the congressional committees, can ask the DOJ to consider this in their prosecution of Ticketmaster/Live Nation.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "clingbat",
            "body": "I'm sure he didn't. He probably went to GM and said can you do something to force the issue and GM lobbyists or someone high up the chain talked to the right people in Congress and told them, go to Mario for more info. \n\nIn that entirely believable if not likely scenario given GM has MUCH more weight with Congress, Mario isn't lying here, technically anyway.\n\nPeople seem to keep forgetting about GM's involvement here, which is frankly more impactful than Andretti. You think they are going to sit on the sidelines and let Liberty dictate to them whether their entry is legitimate? If you believe that, you don't know how things work in the US.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "jimfaz",
                    "body": "This is the answer.  GM is using its political connections.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Disastrous-Beat-9830",
                            "body": ">GM is using its political connections.\n\nAnd Andretti. The popular dynasty of successful racing drivers going to Congress to take on the big, greedy promoters is a much better story than a giant corporate megalith taking on a smaller (but still sizeable) corporation.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "clingbat",
                                    "body": "The difference is Andretti may be able to get a few old Congressmen on TV bitching about the situation to get air time.\n\nGM (and all very large US corporations to be fair) has the ability to actually move a decent chunk of Congress into tangible action of some sort through sizable political donations through random PACs masked by Citizens United and calling in favors. They are very different levels of influence.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ParkerPetrov",
            "body": "At the end of the day does it matter? It only matters who contacted who if you know you did something wrong. Liberty Media is not worried about Andretti going to congress or congress going to Andretti if they thought what they did was all on the up and up and would stand up to the scrutiny of the courts and federal regulators.\n\nThe fact that they are worried, concerned, and upset about all this just means what most of the internet and anyone casually watching already knew. Liberty Media's arguments weren't in good faith, and they had no intention of letting them in in 2028 or at any point.\n\nSo now Liberty Media is looking at having to fight two anti-trust cases instead of just letting Andretti in and in the absolute worst case of letting andretti in is they would have to increase the prize pool a few million to appease existing teams. Instead they are looking to have to spend orders of magnitude more then that in legal fees to defend a decision that on paper with the reasoning they have is pretty hard to defend when you're stuck using only what they have already stated as the reasons Andretti/GM  weren't allowed. As they wouldn't be able to enter in new data. It would be the existing argument they released as to why Andretti was denied.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "mhcranberry",
                    "body": "This is what's interesting to me: this is the part of the story they're going to fuss over? We don't actually know the details of the numbers and arguments they had internally but the PR from that side this whole time has been... a bit awkward when Andretti's going all in, daylight.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Psych_Crisis",
                            "body": "I suspect it's a complex interplay between the European (and quite Eurocentric) members of F1 leadership and the American owners of FOM. I'd forgive any non-American for thinking that Americans don't want their government to use power to regulate businesses, and hence for thinking it would be an embarrassment for Andretti to be known to have gone to Congress about the matter.\n\nWhere they're wrong is that this is *sports* we're talking about. We Americans may disagree about who must or must not have babies or use drugs, and who's allowed to use public money to build playgrounds, but sports is the battleground that we picked to argue over who's allowed to be *male and female*. Yeah. We don't mess around when it's sports on the line. Sports fairness *über alles*. This is what we have a government *for*.\n\n/s but only kind of.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mhcranberry",
                                    "body": "Agree. Sports is how WINNING and MONEY happen. It's how we process community traumas, it's how we pay for higher education, it's our social lives. It's how we introduce risk and group identities into our boring ass lives. Like you, only sort of kidding.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thisbeetheverse",
                                            "body": "This is kind of the plot line of *Demon Copperhead* lol",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "brush85",
                    "body": "It matters because you dont want to work with people you cant trust. Liking them is of aero consequence but trusting them...that matters",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "xnvtbgu",
                            "body": "Toto and Christian are bastions of trust?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rieusse",
                                    "body": "For FOM? They’ve worked with them for decades now, there is absolutely a degree of trust that exists there. No question about it",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Disastrous-Beat-9830",
                    "body": ">At the end of the day does it matter?\n\nIt kind of does, because if Andretti is lying, then that suggests someone else is the driving force behind this.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ParkerPetrov",
                            "body": "Well I was specifically referring to the fact of does it matter in that liberty media either violated anti-trust law or they didn't. It doesn't matter if Andretti tipped them off to investigate this or if us governments investigations into livenation and ticket master prompted them to look into this issue (which is honestly most likely) or it was another reasoning.\n\nAs legally speaking, the FTC/DOJ will investigate this to see if there is a violation. If LIberty Media did nothing wrong then it shuoldn't matter as their hands are clean. A person only cares if they did something unethical or illegal from an anti-trust standpoint. As they would want some kind of vengeance.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "morgaine125",
                    "body": "This is incorrect.  Having to defend against an antitrust investigation/proceeding is expensive and time-consuming even if the action is ultimately meritless.  So even if LM were certain that it would be meritless, it would raise reasonable concerns about doing business with Andretti (and GM) if they had to worry that Andretti/GM would try to get LM hauled before Congress every time they disagreed with LM’s decision making.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rieusse",
                    "body": "Nonsense. If someone makes a false police report against you, you’d be upset even if you did nothing wrong because it’s going to cause you no small amount of trouble and bad press. And this person that made the report actually wants to have a business relationship with you - what are the chances you’d enter into one willingly?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "rafaxd_xd",
            "body": "Dear American Elites, all I want is an 11th F1 team. Thanks.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "TurboNoodle_",
                    "body": "And uhh, livable wages if you have time after that.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Whycantiusethis",
                            "body": "Affordable healthcare if you're feeling nice",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SkeletonGamer1",
                                    "body": "If you were feeling charitable, affordable housing",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "killer_corg",
                                    "body": "some help with inflation would be pretty cool too, not too sure what that would entail but hey id like it",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "No-Expert763",
                                            "body": "I love how every country blames their president for inflation, despite it happening literally everywhere.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "drakanx",
                                            "body": "maybe stop spending $7-8T every year...on top of the national debt that increases by $1T every 100 days.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "APR824",
                                                    "body": "Impossible, another trillion added to the Defense budget right now because of your comment",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rieusse",
                    "body": "Only a full works team please. Thanks",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Little-Green-Truck",
            "body": "Given my understanding of the lobbying process in the US, Andretti could be technically truthful, but also aware that someone in government relations familiar with congressional offices was reaching out with his interests in mind. I would imagine GM would have enough lobbying power to have a guaranteed meeting with the right people, and might have promised to share intel to enhance the Ticketmaster investigation.\n\nETA that this meeting also probably happened months ago, given the fact that so many legislators' offices are involved in the letter. This is just lobbying 101 in the United States, for better or for worse. Personally I hope this DOJ lawsuit is successful at the very least.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Spiritual_Designer50",
            "body": "I bet that they technically didn’t go to congress first, but someone they paid did on their behalf",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CallMeFierce",
            "body": "I think the paddock underestimates how popular the Andretti family is with elites in the United States. There's also the fact that GM is involved, and clearly only interested in partnering with Andretti. Finally, Liberty is already under a ton of scrutiny! They're about to have an antitrust lawsuit launched against them outside of F1.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "a_talking_face",
                    "body": "GM being involved is probably bigger than Andretti's involvement. GM is the biggest auto manufacturer in America.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CallMeFierce",
                            "body": "Yes, you're right in a broader picture. GM makes it easy for these Congressional representatives to justify intervening. But I also do know that the Andretti family is well known and well liked by a lot of the DC elite. People have been paying attention to this issue.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mhcranberry",
                                    "body": "Literally all someone from GM would have to do is mention a concern at a cocktail party to the right person and they'd set up a meeting with Mr. Andretti the following Monday with the Rep. I don't see why people in this chat are surprised by this.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "shartshooter",
                                            "body": "Look at how many \"people\" are accusing Andretti of lying. Zero reason to ignore having an Andretti/GM partnership in F1....almost like those already in F1 want to maintain their monopoly.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "solk512",
                                            "body": "Yeah, this shit isn’t hard for the well connected.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Jorel_Antonius",
                                    "body": "This! Also Andretti is very very popular with Boomers to early melenials. Very common saying when someone is driving fast when your riding along is \"slown down Mario!\"",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ParkerPetrov",
                            "body": "You can't underestimate the fact that U.S. government is full of people who would have grown up watching Mario and Michael Andretti race. They aren't just nobodies. In the terms of racing they would be the biggest names of their respective era's. If you're of hte boomer era, Genx, or a early to mid millennial. You're very aware of who the Andretti's are. \n\nThe F1 basically in current terms walked up to Taylor Swift and slapped her across the face, and threatened to box her out of the music industry and then walked away. Thinking nothing was going to happen.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MyCarHasTwoHorns",
                                    "body": "I grew up liking the Andrettis but that Taylor Swift comparison seems wide of the mark to me. By a wide wide margin.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "canibanoglu",
                                    "body": "You can not only underestimate that, you can completey discard it. What a load of nonsense ypu have produced",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "montyzac",
                                    "body": "So whilst I guess some of that probably has some meaning to US people. Not entirely sure it does to the rest of the world though. \n\nHowever, surely the US government has other actually meaningful issues to deal with rather than this?\n\nHow difficult was it to get the issue about the water in Flint addressed to your government? Why was this so easy? \n\nThat's what I guess the rest of the world doesn't understand.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MyCarHasTwoHorns",
                                            "body": "What would you like the senate committee that deals with antitrust issues to have done to resolve the Flint crisis?",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "solk512",
                                            "body": "This is fucking stupid thing to say. Extending their support on this issue in no way prevents them from doing other shit. You’re acting like if only they weren’t distracted cancer would be cured or some shit.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "mhcranberry",
                                            "body": "The US government does many things all at once every single day. This effort actually involves very few people, who all are working on multiple things-- it's not like they're hiring a whole office. This is all work being done by lawyers and analysts and stuff now that the case has been referred to the DOJ and FTC, not by the elected officials. Even then, it was likely largely managed by their staff, because everything is.\n\nAnd the Flint water issue was municipal and state government, not federal.\n\nThis is a priority because, as is mentioned at least 20 times every thread, it's an election year, GM is involved, and it's literally the job of the Senate Antitrust Committee to address concerns of anticompetitive behavior, especially when there's already an active antitrust case against Liberty Media.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "canibanoglu",
                                                    "body": "With all the shit going on in the world and in the US, this is a priority? I sometimes wish Liberty never got involved with F1, a completely absurd level of silliness has ensued",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mhcranberry",
                                                            "body": "Once again: the US government does many things every day, often multiple things at the same time! It's quite large. Many people. Also there are those who say antitrust law and dealing with corporate malfeasance is... kind of important in the US right now. Your opinion may differ.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "canibanoglu",
                                                                    "body": "And once again: with all the shit going on, this is a _priority_?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "solk512",
                                                                            "body": "Anti-trust is a massive priority. That ball has been rolling the entire Biden administration and this is just another piece.",
                                                                            "score": 1
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "mhcranberry",
                                                                            "body": "It is one of many priorities addressed every day. It's not like this one is take precedence over other things. The Senate literally just signed a letter on this and handed off the work. That's it. How much do you know about how government works? ... oh my god I can't believe I'm having this conversation again. Someone stop me. \n(Edited to clarify)",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "canibanoglu",
                                                                                    "body": "You literally said it’s a priority in the message I replied to. That’s it.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "REO_Jerkwagon",
                    "body": "The lawsuit was filed this morning.   Thank fucking god, LiveNation is the worst.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CallMeFierce",
                            "body": "I don't understand how F1 stakeholders can't conceptualize that the US federal government is who already has it out for Liberty Media.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "REO_Jerkwagon",
                                    "body": "Right?  I'd think Liberty would be kissing Andretti's ass to get him IN to F1, rather than keeping him out, just to help get the regulatory bodies off their backs.   \n\nAs you mentioned, the Andretti family is royalty here in the US.  Multiple times in my life I'll be driving really fast and someone will make a snarky comment like \"who are you, Mario Andretti?\"",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "masterpierround",
                    "body": "Not to mention the fact that the Andretti deal would likely be good for both GM and the UAW, who collectively hold a ton of sway over the battleground state of Michigan. The election makes politicians even more likely to involve themselves.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "canibanoglu",
            "body": "I’m very curious how all the indignant people here would react if a European team tried to get into NBA and when turned down involved the European congress.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "mhcranberry",
                    "body": "If the NBA broke EU law in EU jurisdiction to do it? Illegal is illegal. Have at 'em! I have no loyalty to the NBA, are you kidding me? And I say this as a lifelong fan of a team playing tonight.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "EverSn4xolotl",
                    "body": "Does the NBA not have any clear rule on the geographical place that a team must be from? If not then sure, go ahead.\n\nPeople aren't pissed specifically because Andretti is being denied, but because it's being decided completely on a whim and clearly with money as the sole reason.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "elodie_pdf",
            "body": "Does it matter? I just hope Liberty gets their shit rocked by the American authorities for anti-competitive practices. It’s so obvious to everyone what they’re doing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Suspicious-Mango-562",
            "body": "Who cares who asked who first. GM has flexing power and Liberty seems to think they can make up BS reasons and make things personal and get away with it. With the DOJ going after them now for Livenation/ticketmaster they would be happy to lump in the way F1 is run as well to make their case that it’s an anti competitive culture that pervades the company.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DepecheModeFan_",
            "body": "He probably did start it. I don't believe that all these politicians who sound like they never watched an F1 race before suddenly were outraged the second they hear about Andretti's rejection.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "WanderBadger",
                    "body": "Most of the politicians involved either represent the state that Andretti is based out of (Indiana), the state GM is based out of (Michigan), or are on the Senate anti-trust committee.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "mistled_LP",
                    "body": "I don't think they care about F1, though I imagine they certainly know Andretti, but they do care about what they see as an American business being rejected from competing. It's not like it hasn't been in the news. Someone from GM mentions that the FIA are causing them and Andretti a problem, and the ball is rolling. They don't have to care about F1 as a sport to care about problems their donors are facing.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "solk512",
                    "body": "“Oh it’s clear they aren’t real fans like I am, nothing but a bunch of posers and plastics who just saw shit on Netflix and don’t love the sport like I do!!”",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DepecheModeFan_",
                            "body": "You realise the statement made by those senators had factual errors right ? ones that F1 fans would probably notice.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SommWineGuy",
                    "body": "He likely didn't.  Now GM on the other hand....",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "solk512",
                    "body": "I love how folks who don’t understand these members of Congress keep posting like they do.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "modularpeak2552",
            "body": "ok and? i don't see why this matters in the grand scheme of things.(also yes im biased)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SommWineGuy",
            "body": "Even if he did go to them, so what?  Don't gatekeep him for bullshit reasons and there's nothing the US legal system can do.  They brought this on themselves.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "brush85",
            "body": "F1 bullies him...congress bullies him. Man, poor fella",
            "score": 1
        },
        {
            "depth": 0,
            "author": "James_Vowles",
            "body": "Well of course Andretti went to Congress, can't see a situation where the reverse happened tbh. Even in an election year this is not a big deal to win over voters.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "solk512",
                    "body": "Ever heard of GM?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "JBrewd",
            "body": "My wife who has only a very passing knowledge of motorsports in general, and is more keen by far on the dirt oval near our house than F1, asked me a question about the whole thing. If she knows about it, certainly Andretti wouldn't have to be the one to bring it up to people who regularly take handsome donations from GM.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ThandiAccountant",
            "body": "FOM I suspect have plenty to skewer Andretti should they have need/be given the platform. The lack of apparent concern suggests they have a few rounds in the chamber to fire.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DepecheModeFan_",
                    "body": "There's no concern because they don't say anything, they don't make public statements, they keep their mouths shut to ensure this subject gets as little attention is possible.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ParkerPetrov",
                    "body": "liberty Media/FOM would not have their highest ranking official say \"Mario, I want to tell you that I will do everything in my power to see that Michael never enters Formula 1\" if they had bullets to fire and logical arguments as to why Andretti/GM is not allowed.\n\nThats the kind of statement that sinks your anti-trust case to courts and regulators as its indefensible.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ThandiAccountant",
                            "body": "Quite the story that, sounds a lot like BS to me or something at the v least they’d be unable to substantiate.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "myersjw",
                                    "body": "It sounds cartoonishly made up",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mhcranberry",
                                            "body": "To be fair, a loooot of F1 stories sound cartoonishly made up when you think about it.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ParkerPetrov",
                                    "body": "I mean the two weren't in a sealed room. Mario was talking to other people based on the recounting of the incident and was interrupted. Meaning there are witnesses who are also not coming out and saying that didn't happen.\n\nmario isn't dumb. he wouldn't say it if it wasn't true as he literally just left meeting with the government. If it goes to court he will have to testify to that under oath as will the other people in the room who heard the statement. How many people do you think are going to risk going to jail  for lying under oath to the United States of America for let me check my notes...a personal vendetta to keep andretti's out of f1 by Greg Maffei?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ThandiAccountant",
                                            "body": "Personal vendetta?!? Lol, it’s all just noise bud - not to be taken seriously. Some mud throwing is all. A simple denial renders it he-said-she-said; after which they can return to discussing the facts of Andrettis submission, instead of silly soap opera plot lines.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SommWineGuy",
                    "body": "They clearly have nothing, hence the bullshit reason for denying them entry.  If they had anything they'd have already used it.  They're fucked.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "RulerofKhazadDum",
            "body": "Liberty media is in such a hard place in US. They are facing heat from Congress members on Andretti and Ticketmaster is being sued by DOJ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Firecrash",
            "body": "Ignoring the American fans, I must say andretti is looking kinda sad at this point :')",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "solk512",
                    "body": "More bullshit Euro gatekeeping.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Alfus",
                    "body": "Andretti is still a more promising and respecting name in motorsport than Haas is.\n\nImage you having a team going downwards after being one of the big teams in a major motorsport series, both owners simple don't give a penny and to make it worse everyone involved in the team (including the drivers) does know barely anything of the door would be closed soon or not.\n\nYes, that's Steward-Haas Racing currently in the NASCAR Cup series.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "killer_corg",
                            "body": "> Image you having a team going downwards after being one of the big teams in a major motorsport series\n\nThis has happened over and over with different names. I mean Williams used to be one of the best, SHR was one of the better teams in the past but fell and are looking like they will kill off the team completely. It’s natural for teams to come and go.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DepecheModeFan_",
                    "body": "Well of course they would be. Mario is going to die of old age wishing he could have seen the Andretti name on the F1 grid once more.\n\nIt's tragic and so, so wrong.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "jaysvw",
            "body": "Congress is too busy fighting imaginary culture wars to give two fucks about Formula 1.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SommWineGuy",
                    "body": "Nah, they're already going after Liberty Media for Ticketmaster, they'd love to hit them with this too.",
                    "score": 1
                }
            ]
        }
    ]
}