{
    "title": "[Kleine Zeitung] Red Bull also wants Sergio Perez for 2025: “He is our first choice”",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "[The **News** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_news) is reserved for submissions covering F1 and F1-related news. These posts must always link to an outlet/news agency, the website of the involved party (i.e. the McLaren website if McLaren makes an announcement), or a tweet by a news agency, journalist or one of the involved parties.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FewCollar227",
            "body": "Tldr; Sergio Perez aims to perform well in Monaco, where he won in 2022. Despite some challenges in Italy, his season start has been satisfactory, according to Helmut Marko of Red Bull, who confirmed Perez as the top choice for a 2025 contract. An extension for Perez could impact other drivers' moves, with Carlos Sainz likely considering Audi over Mercedes. Rumors also suggest Yuki Tsunoda might seek opportunities outside of Red Bull due to limited advancement prospects.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dont_hate_the_8",
                    "body": "TLDR for the TLDR, Checo is doing well, Red Bull wants him for next year.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tallguygeorge",
                            "body": "TLDR for the TLDR for the TLDR, Checo new contract",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "perwoll148",
                                    "body": "TLDR for the TLDR for the TLDR for the TLDR, Checontinues.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dachfrittierer",
                                            "body": "can you summarize that for me?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dudeitsmason",
                                                    "body": "👍🇲🇽🏎️",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Blitzay",
                                                    "body": "MAND!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Dibabi",
                                                            "body": "Kan korter",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "RCuber",
                                                    "body": "CRB",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "SatchBoogie1",
                                                    "body": "You didn't listen!... Could you repeat the question?",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "ihavenoyukata",
                                                    "body": "max5wdc",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "DavidBrooker",
                                            "body": "Chequeo",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "needmilk77",
                                            "body": "TLDR of today's r/formula1:\n\n-RB wants Ricciardo for 2025\n\n-RB wants Perez for 2025\n\n\nSo.... Verstappen out??",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ekeryn",
                                                    "body": "Where is the Ricciardo post? I need it for hopium reasons I cannot explain",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "needmilk77",
                                                            "body": "https://www.reddit.com/r/formula1/s/OP2mjtTzN1",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Piedro92",
                                                    "body": "Yeah man. Dude's washed. Lost 100% more tot non red bull drivers than last year already.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Standard-Pickle4277",
                                            "body": "\nTLDR for the TLDR for the TLDR for the TLDR for the TLDR, Checo",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "cheezus171",
                                            "body": "Se queda",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "KrombopulosMAssassin",
                                            "body": "TLDR for the TLDR for the TLDR for the TLDR for the TLDR, ✅o▶️",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "slabba428",
                                    "body": "Drivers talk to other teams to goad their team into a higher payday to keep them on; teams can also do the opposite, and say they don’t really need a change, to goad other drivers into a lower payday.\n\nTLDR; nothing is signed, and nothing is known, Monaco is too early for them to commit since Monaco is when he fell apart last year",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "VonGeisler",
                            "body": "Except only 1 year. Checo wants two year.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "frankyfrankwalk",
                    "body": "I know Marko may have said it's satisfactory but that guy seems to change his mind like a kid choosing his favourite food...if Checo doesn't perform this weekend I could see them maybe getting more interested in changing up. Especially now that races are actually looking competitive this season and they seem like they're gonna be facing a challenge in the constructors.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Shaddix-be",
                            "body": "Monaco is a confidence-track, maybe that plays a role.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mark-haus",
                    "body": "So I think that basically puts Sainz in Audi/Sauber next year",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Known-Reporter3121",
                    "body": "I did not know Sergio won a race",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mar33n",
            "body": "\n\n# Red Bull also wants Sergio Perez for 2025: ‘He is our first choice’\n\n>Ahead of the Monaco Grand Prix, the driver carousel in Formula 1 is once again a big topic. Red Bull Racing wants to make a decision before the summer break.\n\n>After his underwhelming performance in Imola, Sergio Perez wants to have his say again in Monaco. The Mexican won the race in 2022 and definitely feels at home on the street circuit. Despite the turbulence in Italy, Perez does not need to put himself under any pressure this season, as the number two's start to the season was absolutely satisfactory for Red Bull, says Helmut Marko. That is why Perez is also the first choice for the second cockpit at Red Bull Racing for the 2025 season, the motorsport consultant revealed ahead of the Monaco Grand Prix. ‘Talks are ongoing and Checo is still our first option. We want to have clarity on this before the summer break, although we are certainly not putting ourselves under any pressure.’\n\n>A contract extension for the Mexican could set the famous ball rolling. Should Perez sign with Red Bull, a highly coveted position in the driver line-up would be lost. Carlos Sainz would then probably only have the option of joining Mercedes or Sauber. At the Silver Arrows, however, the Spaniard would probably only be offered a short-term contract. It therefore seems increasingly likely that the three-time GP winner will opt for the long-term and lucrative offer from Audi and drive alongside Nico Hülkenberg at Sauber next season before Audi takes over the racing team as the works team from 2026.\n\n>\n\n>Recently, rumours of Yuki Tsunoda's departure have also repeatedly surfaced. According to media reports, the Japanese driver is rumoured to be looking around as he does not see any opportunities for promotion at the Bulls. ‘He is of course also part of the talks,’ reassures Marko, who thinks a lot of the Japanese player. ‘In general, we have several options in his contract to tie him down for several years.’\n\n\n\n(Tranlated with [Deepl)](https://www.deepl.com/translator)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MrMSUK",
            "body": "Horner: It's settled. I want Ric, team wants Checo. Lock them in.\n\nMax: dude where's my car.\n\nHorner: ...",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BB307X",
                    "body": "Maxi, it’s Toto..",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "NotClayMerritt",
                    "body": "Horner just consolidated his power at Red Bull after the misconduct stuff. He’s been one of the lone allies of Checo for the last year. If Checo stays, that’s Horner’s call",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DarthShaveHer",
                            "body": "The article specifically mentions Marko being pleased with Checo. I get what you’re saying, but to be honest Checo would’ve been good whether either Marko/Horner consolidated power.\n\nThe only thing standing in his way is wanting longer contract, and Horner’s love for Daniel. It’s a good thing for Checo that Yuki has been performing. It’s a two birds one stone thing, Daniel’s stock lessens and Yuki realistically won’t ever be considered for the seat.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FewCollar227",
            "body": "It does feel like they trust Checo. And keeping him will make sense as he already understands the team dynamics.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DubiousLLM",
                    "body": "Yeah the only contention is the length of contract. They are offering 1 year, and he of course wants multi year to secure his future.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FewCollar227",
                            "body": "I understand him. Top teams don't see checo in their line-up from 2026 which involves Ferrari, Mercedes & McLaren. Maybe they can make 1+1 and the condition will be if Checo scores this many points or finishes in the particular position in WDC then he will continue another year. What is the prime reason to not accept the 2 year proposal by RBR?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DubiousLLM",
                                    "body": "I guess they want to keep an option open for any reason for new regs.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "CandidLiterature",
                                    "body": "The main reason would surely be that he could completely crumble into a pile of rubbish. His current performance is already looking like it could actually cost them the constructors if things keep on this current track.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FFX13NL",
                                            "body": "We have been hearing that for the last 3 years tbh.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "whoTookMyFLACs",
                                                    "body": "Well they lost the WCC in 2021, he lost P2 in 2022, they had an insurmountable car performance gap in 2023, and now all of those predictions might start coming true if McLaren's recent form is here to stay.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Foreign_Owl_7670",
                                                            "body": "With THAT car last year, he was very close to losing P2 again.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "whoTookMyFLACs",
                                                                    "body": "Not just the performance gap either, there were 3 other teams (Aston Martin, Ferrari, and McLaren) swapping places as 2nd best throughout the year with their high peaks where they took a lot of points from the others and low lows where they lost it all.\n\nIf any of them had been a consistent #2, it would've been a slam dunk P3 or P4. At the end of the year, the driver who was driving the ~3rd best car all year ended up finishing P3, which is crazy.",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HankHippopopolous",
                                                                    "body": "The only reason he didn’t lose P2 in the drivers standings was because Ferrari, Mercedes, McLaren and Aston all took turns being the second fastest team and all took points off each other. \n\nHe was lucky there was such a fight going on behind Red Bull because his performances were woeful last year.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "DeLoreanAirlines",
                                                            "body": "2021\n\nWe can get the WCC and close the gap in the WDC with a couple Red Bull DNF’s - Darth Toto /s",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "JayBee58484",
                                    "body": "He's a second driver same situation with Bottas he's just there till a genuine talent comes along. It's kinda always been this case with second drivers",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Steef-1995",
                                    "body": "Sainz, Lawson, Tsunoda or Stroll. A lot of big names that that are potentially really strong second drivers",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "chriscwjd",
                    "body": "I also wonder if they don't want what the fans want, a better (or any) fight between the Red Bulls which can lead to undesirable situations! With Max's form they haven't really needed Checo anywhere near the front, let alone playing rear gunner (although credit to Checo, he did do this once when it mattered).",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "carefreebuchanon",
                            "body": "Marko has reiterated as much multiple times, even when speaking about Lando Norris. I've always been interested in knowing how serious their alleged contract offer even was for Norris. I think everyone just assumes it was as good or better than what McLaren has given him.\n\nI think their ideal #2 is Checo's talent level or whereabouts, but they'd probably prefer more consistency if it were available. Checo has a lot of experience working with the team at this point though, so I'm sure that adds to his case.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "silly_pengu1n",
                            "body": "\"(although credit to Checo, he did do this once when it mattered).\"\n\nalso so many cases where he didnt when it mattered, so idk about that argument. Does 1 time make up for all the times he didnt? For RB it apparently does",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "chriscwjd",
                                    "body": "It wasn't an argument, I just wanted to give credit where credit is due. Agree it doesn't make up for his overall Red Bull form!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "silly_pengu1n",
                                            "body": "you said he did when it mattered, but all the other races mattered too, just because it wasnt the last one doesnt mean it matters more somehow. This isnt 2014",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "chriscwjd",
                                                    "body": "Yes good point.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Tomach82",
                            "body": "1st and 6th every weekend might lose them the constructors now though",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sir_Dovk",
                                    "body": "1st and 6th is worth 31 points.\n2nd and 3rd is worth 33 points.\n\nI really don’t see checo blowing the constructors for redbull this year. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Tomach82",
                                            "body": "We are talking about Perez getting a contract for next year",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "silly_pengu1n",
                    "body": "\"It does feel like they trust Checo\" - i really just dont understand why when everything we have seen in the last 3,5 years indicates that he isnt good enough to help Max. At this rate he isnt even good enough to help secure the WCC next year.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nxngdoofer98",
                            "body": "Yep, Bottas was the better number 2 in 2021 and if they ever get in another close title fight again, the same thing will happen.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cooperjones2",
                                    "body": ">Yep, Bottas was the better number 2 in 2021 and if they ever get in another close title fight again, the same thing will happen.\n\nTbf that was Bottas' second try as a helpful #2, in 2018 he came 5th in WDC but did help secure the WCC",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nxngdoofer98",
                                            "body": "yeah he did struggle in the first couple of years but after that he was pretty good",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "steveCharlie",
                            "body": "Have you seen the other people that tried driving an RB besides Max? It went way worse.\nWe have multiple people talking about how difficult to drive it is.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "fluvicola_nengeta",
                            "body": "If he repeats his last year's performance they might lose it this year, even. It's too soon to tell, of course, but it seems that McLaren has arrived as is capable of putting up a fight. If Ferrari moves forward and then Checo gets stuck in a fight with the 4 drivers from these two teams, I'm not sure Verstappen will be able to outscore everyone for the WCC again on his own. There's a real chance he won't go on a ridiculous win streak again this year, the gap narrowed considerably. But we'll see what happens, it's still a bit early in the season to affirm anything for certain.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TopBandicoot125",
                    "body": "I'm convinced it's because Horner can count on his backing in a team that is clearly not comfortable with him as TP. There is no other logical reason to extend someone as bad as him. He finished behind both of the Mercs in Imola ffs, with Russell even 2 stopping. Embarrassing, and RB will likely pay for it by losing the constructors next season.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Mulligantour",
                    "body": "It does in this comment section, but wait until we get to another one where he is apparently a shit driver and easily beatable by Tsunoda.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Novae224",
            "body": "I like Checo, but i’m so bored with him in that redbull seeing him underperform most of the time",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "JayBee58484",
                    "body": "There really isn't much in the pipeline for RB at the moment other than Yuki. Could they snatch up another young driver yes but I don't see that happening anytime soon.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheKingOfCaledonia",
                            "body": "Literally any driver would join them",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JayBee58484",
                                    "body": "In terms of who RB seems willing to pick up. Of course anybody would join them that's common sense but RB doesn't want anybody as we've seen time and time and time again",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "fluvicola_nengeta",
                            "body": "Hell, I'd love to see Yuki have a go at that thing. He's unquestionably fast, and maybe being trusted with the big seat might actually humble him into discipline and mental control. People underrate him a lot based on his results, often ignoring the fact that he has had quite a bit of mechanical failures and been shafted a lot with team strategy and team orders when Gasly was around.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JayBee58484",
                                    "body": "Me too I wish RB wasn't so unwilling to commit to him in a top seat. With his luck he'll probably have to leave before he ever sees an opportunity",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ProfessorCunt_",
                                            "body": "I might be in the minority here, but Yuki doesn't really seem to be that quick. Lawson performed just as well as him, but as a rookie with no preparation mid-season. \n\nPlus Yuki absolutely does not appear to be a team player based on what we saw in Bahrain. Which explains why Red Bull is choosing to stick with Perez unfortunately",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Shaddix-be",
                            "body": "Hadjar seems to have found his mojo again, but he obviously needs a year at the junior team. \n\nAnd then there's Lawson of course. Makes sense to retain Perez and let the B-team fight it out for 2026.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cheezus171",
                    "body": "You'll be bored until 2028 there, when Max leaves. There won't be a competition until then, because there isn't a driver who is available for Red Bull good enough to provide competition.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "isaacburton",
                            "body": "Surely there’s a middle ground though similar to what Bottas was in Mercedes.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JayBee58484",
                                    "body": "Bottas was a placeholder till Russell moved up the ranks",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "cooperjones2",
                                    "body": "Take off the rose tinted glasses. Bottas was never a real challenger to Hamilton, the two times someone challenged Hamilton with Bottas as a teammate, Bottas ended 5th and 3rd.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "elementzer01",
                                            "body": "Nobody is expecting a real challenger, just someone who can come 2nd every race instead of 6th.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "cooperjones2",
                                                    "body": "> Nobody is expecting a real challenger\n\nThat's a bold faced lie. Literally read Checo threads.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "cheezus171",
                                    "body": "Bottas wasn't driving against Max. Max beat Hamilton convincingly, so he would also beat Bottas more convincingly.\n\nAnd just FYI, Bottas also had utterly shit moments. One season he lost not only to both Ferrari cars, but also a Red Bull. In the best car.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lobo98089",
                                            "body": ">Max beat Hamilton convincingly\n\nMax won the WDC, and deservedly so, but in no world did he beat Hamilton \"convincingly\". It was a very close fight between two drivers on the same level.  \n  \nBottas also has 10 wins, 20 poles and 58 podiums in his 5 years at Merc, while so far Perez has 5 wins, 3 poles and 29 podiums in his 3.25 years at RB.  \nBottas had the undisputed fastest car with no challengers for 1,5 seasons (in 2017 and 2018 Ferrari was equally fast, 2019 Merc was dominant for half the season, 2020 the whole season, 2021 RB was equally fast), while Perez already has 1,5 seasons in the undisputed fastest car (2023 and the second half of 2022).  \nIf you are talking about consistency, Bottas had a streak of 103 consecutive Q3 appearances, while Perez needs a recovery drive what feels like every 3rd race.\n  \n  \nYes, Bottas also had pretty bad races every so often, but Perez didn't even manage to get *half* of the points of Verstappen last season, while driving in one of the most dominant cars of all time.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Novae224",
                            "body": "It would be less boring if someone else got a try, even if they failed",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "UB_cse",
                            "body": "It would still be exciting to see Riccardo, sainz, yuki, albon, Norris etc in the car instead of Perez even if we are 97% sure it wouldn’t be a fight.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RTwhyNot",
            "body": "Is this because Carlos isn’t the biggest team player?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SeraCat9",
                    "body": "I wonder how much of it is because of Jos vs Sainz Sr. They may just want to avoid a repeat of Torro Rosso.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "deJessias",
                    "body": "At least Carlos knows how to drive better than Checo",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RTwhyNot",
                            "body": "Absolutely",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "wing3d",
                                    "body": "Yet he will go to Williams.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Jacinto2702",
                            "body": "The only way to settle who is better and set it on stone is to send both to Haas.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ValleyFloydJam",
                    "body": "As in won't just be a bystander, probably.\n\nThey should be moving on for Perez as it's not like he's just consistently behind Max and Carlos being available should make it an easy call, instead they just wanna keep Max sweet.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "goodfriend_tom",
            "body": "\"He's our first second choice\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SWSIMTReverseFinn",
            "body": "Man I don't know. The only reason he performed \"well\" was because Red Bull had a massive gap. I feel like Perez will get obliterated when Mclaren and Ferrari are close behind.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SommWineGuy",
                    "body": "Like he has in Imola and Miami.  Like he will this weekend.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cheezus171",
                            "body": "He was on pace with Max most of the race in Miami. People will never be satisfied I swear...",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SommWineGuy",
                                    "body": "If he isn't on the podium or at least top 5 he's failed.  Period.  The car is too good for anything else. \n\nIf he doesn't make it to Q3 he's failed.  The car is too good for anything else. \n\nThere's at least 10 drivers on the grid who would do a better job in that seat.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cheezus171",
                                            "body": "> If he isn't on the podium or at least top 5 he's failed.  Period.  The car is too good for anything else. \n\nHe was 4th FYI. The car was worse than McLaren and about equal to Ferrari in Miami. He lost to one McLaren, one Ferrari and Max. That's not a failure. He lost to 3 elite drivers in equal or better cars, and noone else.\n\nYou seriously have to rid yourself of the notion that the Red Bull is dominant. It's not anymore. And if even Max in it is basically equal in performance to another competitor, that means it's not even the best, let alone dominant.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Mechant247",
                                                    "body": "When they were dominant he looked shit and when they aren’t as dominant he looks ever worse, that’s about it",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "cheezus171",
                                                            "body": "The goalposts shifted quickly LOL \n\nAmd you know what the funniest part is? Perez had a good sprint, then finished the race 7 seconds and 2 places behind Max. He got shit ratings and everyone said he failed. Sainz had a shit sprint, and then finished 7 seconds and 2 places behind Leclerc. He got good ratings and the public didn't even bat an eye.\n\nAdd that to the fact that people want to see Sainz specifically replace Perez, and you see exactly what the problem is... Perez is simply held to a much higher standard than any other driver on the grid, and then people complain when he doesn't meet that standard.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Mechant247",
                                                                    "body": "Of course he’s held to a higher standard, he’s in the best car? No one gave a shit when he was at racing point despite them actually having a really good car in 2020 \n\nYou’re in the best car and can’t even get into Q3, move the goalposts anywhere and it’s not going to look much different",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "cheezus171",
                                                                            "body": "You completely missed the point.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Mechant247",
                                                                                    "body": "You aren’t making any point, you’re just defending Perez and making excuses about the car. Why bother?",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "SommWineGuy",
                                                    "body": "The car was better than Ferrari and McLaren.  You could argue that on the hards the McLaren had better performance. \n\nRed Bull is still dominant, just not to the extent that it was.\n\nCheco has never belonged in that seat.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hazaskull",
                                                            "body": "Dominant is Mercedes 2014-2020. \n\nThis year's Red Bull is nowhere close to that. Mercedes regularly had a margin of over a second a lap if they wanted to. Even last Year's RB didn't have that much. If Checo is subpar for just a few tenths a lap he's not getting second place. We'll have to see but it could be that McLaren is now nearly level with RB depending on the track and might even be better on some. Lando was apparently already not excluding a championship this Year in the media. I am looking forward to an exciting rest of the Year.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "SommWineGuy",
                                                                    "body": "I am also looking forward to an exciting rest of the year.  McLaren do seem have closed most the gap and Ferrari are also getting closer.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cheezus171",
                                            "body": "7 seconds, not 15 lol what the hell are you talking about \n\nMax didn't have any proper damage, he said he didn't feel any, and it didn't show up in laptimes\n\nAnd he was pretty much always on pace once the drivers separated a bit. You can never be completely on pace if you start a few meters apart and there are drivers between two cars. On most of the laps he was on pace.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheHopper1999",
                    "body": "I feel like marko's statement will age like milk, the other teams are in the ball park, Perez would have been solid 6th in Miami had Piastri and Sainz not done there thing, Imola was tragic and this is the start of the slump Perez experienced last year. If they lose constructors because of this it will look very stupid.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ChefBoiJones",
            "body": "Signing Devris, signing Daniel, shelving Lawson, promoting albon too early, keeping checco… red bull used to be a cut throat but effective operation in the drivers market but lately they’ve been making objectively bad decisions one after the other",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "JayBee58484",
                    "body": "I think their issue is they keep looking for Verstappen #2  when they shouldn't be.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SleepinGriffin",
            "body": "These teams are boring as shit.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "clingbat",
            "body": "Ugh",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dragonpuncha",
            "body": "Are we going to end with?:\n\nRed Bull: Max, Checo\n\nFerrari: Leclerc, Hamilton\n\nMercedes: Russell, Ocon\n\nAston: Alonso, Stroll\n\nMcLaren: Lando, Piastri \n\nAudi: Sainz, Hulkenberg\n\nWilliams: Albon, Bottas\n\nAlpine: Gasly, Zhou\n\nRB: Tsunoda, Lawson \n\nHaas: Bearman, KMag\n\nNot as crazy a grid as predicted a few months ago, but seems almost likely now. Antonelli will get a year more in F2 to get more experience.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "MRudd-music",
                    "body": ">Alpine: Gasly, Zhou\n\n>RB: Tsunoda, Lawson \n\nFrom alot of reports these 2 lineups are unlikely",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Alfus",
                            "body": "In the Japanese media there was some talk about Tsunoda to Alpine...\n\nI don't want to say that it can happen but it would be somewhat comical if Alpine ends up with Gasly and Tsunoda in 25 and 26 at least.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "The_Chozen_1_",
                                    "body": "Alpine really want to keep Gasly and Ocon but they're also looking at other options just in case like Yuki, Bottas etc",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Alfus",
                                            "body": "I don't think that Bruno Famin is fully honest, his whole position switched within a few months and he clearly hints now that he *doesn't* need a French driver.\n\nPersonally I think the situation is like this:\n\n- If Ocon leaves, Alpine stays with Gasly and another driver.\n\n- If Ocon stays, Gasly would be axed by another driver.\n\n- If both leaves, Alpine would likely arm for 1 \"veteran\" driver and 1 rookie.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "The_Chozen_1_",
                                                    "body": "Haven't they always said they don't need a French driver?\n\nWhat also suggest that Gasly will be the one who will be kicked out? Auto Hebdo were reporting that they had already offered both Ocon and Gasly extensions.\n\nWhy kick Gasly from a performance standpoint?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Dragonpuncha",
                            "body": "I think Tsunoda will stay since RB is doing good and he hopes to get a decent seat for 2026. Ric I think will just fade away again after being clearly beaten over the season.\n\nAlpine just seems lost since their juniors aren't doing so hot right now, so taking Zhou is like a \"Fine for now, I guess”, pick for them. \n\nI don't think they want to lose both drivers and they really want a frenchman in there, so if Ocon leaves they'll do a lot to keep Gasly I imagine.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FSUfan35",
                                    "body": "I thought I saw that Ric is locked into RB or Reb Bull next year",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bigcitydreaming",
                                            "body": "Source?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FSUfan35",
                                                    "body": "I can't find where I saw it. Maybe I got got, my apologies",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "houseofzeus",
                                            "body": "They are both on deals that end this year.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "JayBee58484",
                                            "body": "High level of copium whoever wrote that. Locked in despite getting thoroughly outperformed by yuki",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FSUfan35",
                                                    "body": "I can't find where I saw it but it said that was in his contract.  I looks like I got got by whereever i saw it",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "MrDaniel95",
                                    "body": "I think that RB is a dangerous seat to be in if they don't intend to move you to RedBull in the future, they will sooner than later be tempted to move younger drivers in.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kkraww",
                    "body": "seems that sainz wants williams instead of audi",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dragonpuncha",
                            "body": "That sounds like madness.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kkraww",
                                    "body": "https://www.motorsport.com/f1/news/williams-in-advanced-talks-with-sainz-over-2025-f1-deal/10614477/",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dragonpuncha",
                                            "body": "I saw it, still sounds like madness, lol.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Winstonwill8",
                                                    "body": "I saw it and was like 'has he lost his mind?'",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "markhewitt1978",
                    "body": "Latest rumour is Sainz doesn't want Audi and is looking to Williams. \n\nAlso think Antonelli will be in at Merc. \n\nExpecting Zhou to be out entirely.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dragonpuncha",
                            "body": "Well, you gotta mix and match your rumours, lol. Sainz going to Williams would be so stupid to me. \n\nGoing from having a great season with the second best team right now, to the worst team on the grid, where he might well get beaten by Albon since he is much better ingrained in everything at the team. Sounds like potentially a huge fall from grace for his career.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FSUfan35",
                                    "body": "He's kinda out of options at this point if he wants to be on the grid next year.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dragonpuncha",
                                            "body": "Seems like Audi still wants him.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FSUfan35",
                                                    "body": "But they are not on the grid next year and won't be dictating Sauber's lineup",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Dragonpuncha",
                                                            "body": "Audi accelerated their plans a few months ago and bought out all of Sauber early. So yes, they will be doing that.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FSUfan35",
                                                                    "body": "Ah my mistake",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "markhewitt1978",
                                    "body": "Agreed it would be madness. The only thing that makes any sort of sense is if it is a one year deal and going Red Bull in a year.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "alex404b",
                                    "body": "Williams before Mercedes????",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Jamba42O",
                    "body": "I don't think Magnussen is going to stay in formula 1",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "xNickel",
                    "body": "Alpine will promote Doohan of Ocon leaves",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "martythemartell",
                    "body": "Yeah I think this is the one, these are the pairings I expect based on the most verifiable info and just general perceptions of where each team and driver fits",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "TVRoomRaccoon",
                    "body": "I’m still convinced Antonelli is Merc’s top choice (assuming they can’t get Verstappen, obviously.)",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dragonpuncha",
                            "body": "I don't think Verstappen wants to touch them with a 10 foot pole right now, lol.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TVRoomRaccoon",
                                    "body": "Agreed 😂\n\nBut I do think that makes Kimi their top pick",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dragonpuncha",
                                            "body": "In recent interviews Wolff have just been saying that they might have put too much pressure on him, etc. I think Merc realises that taking an 18 year into their seat with that little experience in top feeder series, might be a little too much. And Ocon might be willing to go for 1+1 just to get away from Alpine.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "yayhindsight",
                    "body": "I have a worry that rb will keep Daniel to keep the sponsors happy, and Yuki will be without a seat. Hope I'm wrong!!!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "SommWineGuy",
                    "body": "Sainz has said no to Audi and is looking at William's.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mlp851",
            "body": "Just seems like they’ve  decided that keeping Max happy is their only priority when it comes to their driver lineup. Bringing in a better driver could cause some tension. Personally I think Perez is incredibly lucky to be in that seat, he’s a waste of a fantastic car. \n\nAs incredible as Max is, a driver deserving of a top seat should still be able to beat him in a straight fight or come close at least a few times a season. If Max has even a somewhat clean weekend he beats Perez by a big margin 100% of the time which is just not good enough.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "afkPacket",
            "body": "As a Ferrari fan, I am thrilled at the news",
            "score": 1
        },
        {
            "depth": 0,
            "author": "brush85",
            "body": "Come on, Chrissy...be bold",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dennis3282",
            "body": "I mean, they can't say anything else. Imagine the fallout if they said \"Checo is our fourth choice for 2025\".",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Derfaust",
            "body": "God that's boring",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kakarot__9000",
            "body": "Good for him.   \nAll I want is for him to be consistent in his performance. Even if it means a P3 (or better)  in all race weekends.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Autpcorrectbpt",
            "body": "Congratulations Ferrari/McLaren on winning 2025 WCC",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FreshStaticSnow_",
            "body": "We thought this silly season was gonna be fireworks but it's just been a dragged out, frustrating snoozefest.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Disastrous_Narwhal46",
                    "body": "It’s not summer break yet lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "pinerw",
            "body": "I mean… yeah. They don’t really have a better option right now. \n\nI still don’t think Yuki is quite ready for a top seat, and seeing as how Danny Ric currently has a third of Yuki’s points, if you’re not giving it to Yuki you really shouldn’t be considering him either. Lawson’s waiting in the wings and definitely deserves a seat somewhere, but dropping him in the shark tank next to Max is about the worst thing they could possibly do to his career. They could try to bring in Sainz who definitely has more upside potential than Checo, but everybody knows what that seat is and Sainz quite reasonably has larger ambitions than serving as Max’s wingman.\n\nApart from Imola and perhaps Australia, Checo’s been perfectly fine this year. One bad race isn’t a slump, so there’s no real reason to think he’s taking a nosedive now, or to look elsewhere for next year.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nonchalanthoover",
            "body": "\\_IF\\_ McLaren consistently are taking 1-2 podium spots as they have the last two races, I will be seriously shocked if this opinion stands. I'm not talking about beating Max, all they need to do is keep getting higher on the podium than Sergio. Also the discussing about 'a better weekend in Monaco were he's been successful' is total garbage, he binned it in Q3 last year and started going deeper on a European leg of pain.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "xLeper_Messiah",
                    "body": ">Also the discussing about 'a better weekend in Monaco were he's been successful' is total garbage, he binned it in Q3 last year and started going deeper on a European leg of pain. \n\n\nOh it was even worse than that, he binned it in *Q1* last year then proceeded to get lapped by Max twice after playing bumper cars with half the grid. \n\n\n2022 was when he binned it in Q3, and \"coincidentally\" managed to secure pole",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "StolenRocket",
            "body": "Who else can they trust to make Max feel so safe he can literally forget there's a second driver?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "flagboulderer",
            "body": "Fucking WHY?\n\nIn that car you should never really be out of the top 5 or 6. Checo sucks as a no #2.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Big_Brief7847",
            "body": "Sergio Perez is a great no.2 driver for the dominant red bull car. But any driver on the grid (maybe not top5 drivers cause the might challenge Max) who is willing to be a team player and won’t cause issues in team politics would be a great no.2\n\nThat’s was their looking for, not a second Max Verstappen, and it’s why Sainz even if he was performing very well, would struggle to get signed.\n\nHowever, if the red bull is no longer the dominant car, then things change. If finishing 15s behind your teammate no longer gets you 2nd place it’ll look a lot worse.\n\nPerez needs to perform his best in these next few races but what’s even more important for his future is the overall performance of red bull. Perez is not on the level of the other drivers in the top cars and if they get close enough his position will start falling fast even if he’s not particularly underperforming.\n\nIt’ll be very interesting to see whether red bull go back to dominating in the next few races, or if keeping Perez as their no.2 seems like it will hurt their chances at constructors",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nn4260029",
                    "body": "This is why I don’t understand this move. Last year, probably the most dominant season ever, Checo barely achieved second in the WDC. Logic dictates that if RBR is less dominant, Checo will end worse than second. Surely there is a driver available who is more likely than Checo to achieve second while not threatening Max?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AggrievedGoose",
                            "body": "I'm not sure second in WDC is a prize that the teams really care about? They will have plenty to cheer about if the are WDC and WCC champions.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nn4260029",
                                    "body": "The second place itself wouldn’t mean too much (although a one-two in the WDC and winning the WCC is a nice combination). \n\nBut what I mean is that the WCC (and the prize money that goes with it) will be more in danger with a second driver like Checo who, with a less dominant car, will regularly achieve only midfield results.\n\nAlso, with a less dominant car, Max could surely use a second driver who’s within under/overcut range to protect him against strategies of teams who do have two drivers at the front.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AggrievedGoose",
                                            "body": "Agreed. I just think RBR isn't too concerned about whether Checo gets P2 or something else as long as they are winning WDC and WCC.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RickkyyBobby",
                                    "body": "No, but the point still stands. Checo barely made P2, when his teammate fucking CRUISED to P1, with barely 0 races having him even challenged for the win.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "SommWineGuy",
                                    "body": "And if they keep Checo they'll struggle to win the WCC.  They might lose it this year.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "gomurifle",
            "body": "Keep Max happy. Keep the big Mexican Market happy. Everyone with RedBull interests wins. ",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "clingbat",
                    "body": "RB energy drink market share in Mexico before Perez joined: 65%\n\nRB energy drink market share in Mexico now: 67%\n\n\nI don't really think the Mexican market matters big picture, he hasn't changed their main business at all there.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Cody667",
                            "body": "This. What Checo brings that appeals to teams is the Carlos Slim money, that's pretty much it at this point.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "clingbat",
                                    "body": "Yes he's a pay driver with more talent than the other pay drivers. Always has been, people just like to forget.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Mandujano33",
                            "body": "Its not just that number, but ok Im gonna play that game.. 2% in a sugar drink market is a lot... specially with an expensive one, there are other brands surging also from high sport guys like \"canelo\" Alvarez... also, maybe that 2% with Checo is not that important as -8% without him.. the backlash the team and Max got when they had the big beef involving families was really big.. Before that MAx was high in latin american market and he still cant recover after that, he still get some chants and \"booos\" in American soil. \n\nI personally have bought a lot of merchandise in last 3 years but only like 2 redbulls (one the champions special edition) and one in a bar.. nothing more.. I love Checo and the team, but not for that Im gonna drink that thing..",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "clingbat",
                                    "body": "There's zero evidence the 2% is because of Perez though... or F1 at all.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Justthetip1996",
            "body": "Boooooooo",
            "score": 1
        },
        {
            "depth": 0,
            "author": "crazydoc253",
            "body": "They have already signed him",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aayjayemm",
            "body": "If Red Bull are going to keep dominating for years to come, I hope someone else gets the seat purely for my sanity's sake. First time in probably 17/18 years watching that I am not giddy with excitement when coming up to a race weekend.\n\nIn all honesty, I don't think anyone can truly compete with Max at the moment, but it would be nice to actually see that confirmed in one way or another.\n\nSergio is a nice guy and I loved when he came onto the scene with Sauber, and he put in some stellar drives with Force India/Racing Point. But anyone who truly thinks he is doing a good job is just lying to themselves.\n\nThe only reason I have seen is that they have a good dynamic and Red Bull wouldn't want to mess that up. Why not save yourself a salary and just run 1 car if that's the case, as it is practically the same outcome (Max won WCC by himself last year. Maybe this year too, although hopefully McLaren can get in the mix).\n\nMerc domination was at least somewhat interesting from 14-16 due to Ros/Ham, so I'd like something at least close to that. Not likely anyone would get as close as Rosberg did, at this moment in time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SinistrMark",
            "body": "I have a feeling he is the #1 Merchanise seller in all of F1.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "spell_RED",
            "body": "As a RB fan, I actually hope that he will end up costing the constructors for them. Dude has had top car for 4 years now and continuously sucks ass, its so boring to watch only 1 car performing.\n                                      \nEveryone talked shit about Bottas at the time, but he was always killing it on quali AND always close enough in the race to help with the strategy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "optitmus",
            "body": "This is such a lame move, dude is getting immediately exposed as soon as other teams get close but let's give another year again. Hopefully it costs them the championship",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ADP10_1991",
            "body": "Perez confirmed #1 driver at RB",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MyNameIsVigil",
            "body": "Makes sense, always has. He’s going to score reasonable points while never threatening Max, and he brings good sponsorship.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Risbob",
            "body": "Can’t believe that Tsunoda is not even an option considering his last two seasons.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AggrievedGoose",
                    "body": "They must still be worried about his temper vs. Max. That drive-by on Ric earlier this year did not help his case.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hazaskull",
                            "body": "Hard to believe they'd really be worried about such things.\nCould be other reasons. Maybe the Honda-connection is too strong and they figure he'll be more loyal to them than to RB or maybe him and Horner don't get along well enough or maybe him not bringing sponsor money is a factor. Given his good performance it has to be some secondary thing.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Amat-Victoria-Curam",
            "body": "For now.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Skeeter1020",
            "body": "How boring.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SommWineGuy",
            "body": "If they lost the WCC this year they'll regret that.",
            "score": 1
        }
    ]
}