{
    "title": "Ask r/Formula1 Anything - Daily Discussion Thread",
    "comments": [
        {
            "depth": 0,
            "author": "TheForBiddenHB",
            "body": "Probably really dumb stat if you can even call it that, and correct me if I’m wrong but I think Sainz, driver number 55, has finished P5 5 times in a row (if you count sprints) since the 5th event in China, and he is currently 5th in the driver’s standings. He started this streak with a P5 in the sprint shootout in China, and the race weekend where he had his 5th P5 finish in a row (Imola), he qualified P5 too. \n\nNow that’s consistency.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Humble-Ad-8912",
                    "body": "I like these kinds of things with numbers. Now all he needs is shift this strategy to 5 wins and then 55 total.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "ceceeparker",
                    "body": "Fascinating to know. Thanks for sharing!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "RosebudWhip",
            "body": "Can someone explain to me in simple terms why no top team seems to want Carlos? To me who knows nothing about these things, he appears consistent, marketable and is obviously capable of topping the podium.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SyuusukeFuji",
                    "body": "They have other plans/priorities.\n\n\nMercedes: Toto Wolff believes that their junior Andrea Kimi Antonelli is the next Verstappen tier driver. He thinks that if he does not give him a Formula 1 seat as soon as possible, he might lose him to someone else.\n\n\nRed Bull Racing: Accordind to ESPN, they want Sainz, but for very little money compared to Audi. Sainz's management has been working for more momey. Why don't they run for Sainz? They value their cars not crashin eachother and probably think that many other Checo style midfielders will be willing to drive for them.\n\n\nFerrari: For them it was more about what Lewis represented and the staff that could be attracted by having him in the team.\n\n\nMcLaren: Has a clear leader in Lando and strong partner in Piastri. Like a younger Leclerc and Sainz pairing.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RosebudWhip",
                            "body": "Thanks for the answer!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cafk",
                    "body": "He is out of Ferrari, as Ferrari signed Lewis.  \nMercedes has hyped Antonelli, so it looks like he is a candidate as a replacement for Hamilton.  \nPerez/Lawson/Ricciardo/Tsunoda are potential candidates for Red Bull seats - for now, as log as Max is there, they need someone reliable to guarantee the team a top 5 position for the WCC. And CashGrab is slowly returning to a junior training program.  \nMcLaren & Astons drivers are fixed for now, so they're likely not shopping for new drivers at the moment.\n  \nSainz was a Red Bull driver, initially loaned to Renault/Alpine as part of Red Bulls early exit from Renault engine deal and it's possible his management made mistakes using Sainz as bargaining chip to extend his Red Bull contract, meaning he had to leave o e way or other.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RosebudWhip",
                            "body": "Ok thanks!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "hipnosister",
            "body": "No weekend warmup on F1TV or am I just blind?",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Preganananant",
                    "body": "It was still in the schedule a few days ago, seems to be gone now for me as well.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "generalannie",
                    "body": "Oh it's missing for me now as well. Strange... Maybe it's just an error because they had to add the F2, F3 and PSC practices on Thursday.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ceceeparker",
                    "body": "No weekend warm-up because of F2/F3/PSC broadcast. \n\nSource - [this comment](https://www.reddit.com/r/F1TV/comments/1cypk54/comment/l5b2ufg/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) on r/F1TV",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ceceeparker",
                    "body": "Update - According to [Laura Winter's Instagram story](https://imgur.com/a/aL4HDgr), weekend warm-up has not been cancelled.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "307south",
                    "body": "Came here to ask the same. After reading that it's cancelled, I feel cheated.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "denbommer",
            "body": "maybe it's just me, but this season, it seems like having DRS is not a guaranteed way to overtake?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "cafk",
                    "body": "Once you break out of the slipstream/dirty air, with or without DRS - you still need enough grip, speed and power to complete the overtake.  \n  \nAnd it's not a new issue, DRS trains (cars with DRS enabled stuck behind someone barely fast enough to defend against an attack) have regularly occurred since it was introduced.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "fameboygame",
            "body": "Has Feeder series been in Monaco before? I simply can’t remember, and F3 practice rn looks like a major mess. So much obstruction",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Affectionate_Sky9709",
                    "body": "F2 and F3 do split quali, because they deem it too many cars. So there are two session with the grid split by car numbers (car numbers are already sectioned off by team placement last year (winning team gets 1&2 in F2, and 1/2/3 in F3. Generally drivers are placed experienced first, then rookie.\n\nAnd then the results from the two sessions are zippered to form the grid, with the fastest overall taking pole. So pole is a little random which isn't ideal to me.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fameboygame",
                            "body": "Thank you!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "tvxcute",
                    "body": "f3 raced here last year for the first time in a few years. i wish they could remove it, there's just way too many cars for how narrow it is. f1 is already pushing it, f2 is worse, f3 is just dangerous.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rustyiesty",
                    "body": "Most of the time yes, IIRC even Stirling Moss won the F3 race in Monaco",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "SyuusukeFuji",
                    "body": "Yes. For many years.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fameboygame",
                            "body": "Damn.\n\nI’m kinda new to feeder series, so I guess I never had a chance to watch em!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Samsonkoek",
                    "body": "Yes but changes have been made to quali because of the mess, GP2 2011 caused that.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DarkShadowdSpirit",
            "body": "anyone know the FASTEST LAP in f1 history? (any circuit, can be practice 1-3, qualify, sprint, etc.) Include Circuit, Year, Driver plz",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "CoachDelgado",
                    "body": "0:53:377 in Q3 at the 2020 Sakhir Grand Prix on the Bahrain Outer Circuit, set by Valtteri Bottas in the W11. That was the weekend that Hamilton had COVID and was replaced by Russell, Mercedes forgot how to pit-stop, and Checo got his last-to-first win.\n\nUnless you mean fastest as in *fastest*, in which case it's Lewis Hamilton at the 2020 Italian Grand Prix, also in the W11. His time in Q3 was 1:18.887, giving him an average speed of 264.362kph. This was the Grand Prix where Gasly got his first win.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Kuchenblech_Mafioso",
                    "body": "2020 Sakhir on the modified Bahrain circuit. Well below a minute",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "generalannie",
            "body": "With all the Andretti news, I keep seeing people refer to them as a GM works team. However I don't think they are one, as far as I know GM still hasn't signed up as a new engine supplier. So if they'd want to join in 2026 (or later) they'd have to be a customer team to one of the other engine manufacturers. Have I missed something? Has GM actually signed up as engine manufacturer?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "cafk",
                    "body": "> However I don't think they are one, as far as I know GM still hasn't signed up as a new engine supplier.  \n  \nGM missed the initial deadline for 2026 - [they only got granted an PU supply entry for 2028](https://news.gm.com/newsroom.detail.html/Pages/news/us/en/2023/nov/1114-cadillac.html), which is why FoM \"politely\" [said they're open for Andretti reapplying for 2028](https://corp.formula1.com/formula-1-statement-andretti-formula-racing-llc-application-to-participate-in-the-fia-formula-one-world-championship-summary-and-conclusions-of-commercial-assessment-process/).  \n  \n> We would look differently on an application for the entry of a team into the 2028 Championship with a GM power unit, either as a GM works team or as a GM customer team designing all allowable components in-house.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "generalannie",
                            "body": "Thank you very much!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "avlas",
            "body": "when did the Monaco tradition of starting on Thursday end?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "cafk",
                    "body": "[When F1 & FIA agreed to reduce the weekend down to 3 days in 2022](https://www.bbc.com/sport/formula1/58656259), with Monaco having to pay money to host the race like all others, as well as not being allowed special concession for ascension day weekend.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "aintnohalfstppn",
            "body": "Any Christian Horner harassment updates?  There's more news on him getting permission to build a pool!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "cafk",
                    "body": "The last update was in March, with the employee, who caused the internal investigation, allegedly considering a civil suit against Red Bull GmbH & the UK based Red Bull Technologies or its subsidiary Red Bull Racing.  \n  \nBased on this it was expected a new barrister to be conducting a new round of interviews, but nothing has been published/rumoured since.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "rapturaeglantine",
            "body": "Incoming dumb question, am in the US, have Fubo, and I love cringing through the grid walk every race.  I can't find Grand Prix Sunday on ESPN anywhere, is it wrapped up into the ABC race coverage?  I usually just watch on Fubo, do they air the grid walk elsewhere?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "D0BBY_is_a_free_elf",
                    "body": "I noticed that as well. I think you are right that it is wrapped into the ABC race coverage. ABC coverage is currently scheduled to start 90 minutes before the race, which is the timeframe that Grand Prix Sunday would normally occupy.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rapturaeglantine",
                            "body": "That is what I was thinking, it looked like the ABC programming block started early.  Gotta get my fix of Brundle and/or Ted bungling around the grid menacing folks lmao",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FermentedLaws",
                    "body": "Here's the U.S. coverage networks this weekend:\n\nFriday FP1/FP2: ESPN2\n\nSaturday FP3: ESPN3\n\nSaturday Quali: ESPN2 \n\nSunday Pre-show/Race: ABC/ESPN+\n\nCanadian Grand Prix in 2 weeks will be generally the same, with pre-show and race on ABC.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rapturaeglantine",
                            "body": "Thank you, friendo!  Monaco is my favorite race of the year, so I want to be sure I don't miss a thing :D (edit, misspelled Monaco)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Angie-P",
                    "body": "may i ask why dan at RB and not Yuki?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "User-K549125",
                            "body": "Their favouritism is pretty clear. Also Marko said Ricciardo is not available next year (i.e. not to other teams).",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Honourstly",
                    "body": "Looks good",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gaius_Octavius_",
            "body": "[The US government has officially sued Liberty Media.](https://apnews.com/article/justice-department-live-nation-ticketmaster-antitrust-lawsuit-df9b552d127e1494db13e3cd625787a8)\n\nIt is over their other business holdings but that certainly can't help their Andretti case.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cultjam",
                    "body": "About time.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "shaggymatter",
            "body": "Tune in to the porsche cup practice, sees a wet track.\n\nGoes to check the weather for the rest of the weekend....  disappointed with no* more rain predicted",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DangerousTrashCan",
                    "body": "More rain? Weather.com says pretty much 0%.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "shaggymatter",
                            "body": "Sorry it typed now instead of no*",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Helpful-Papaya-1992",
            "body": "Has anyone ever purchased clothing from Enchante? what were your thoughts on the quality? Is it decent stuff or is it a scam?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Browneskiii",
            "body": "If Andretti has the cars, drivers etc etc, what's stopping them from showing up to a race? I get that it's not sustainable, but this is a complete hypothetical situation. \n\nAre there any particular rules that don't allow it?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "PassTimeActivity",
                    "body": "They wouldn't have the security clearance for one. Can't race without being let into the paddock.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "D0BBY_is_a_free_elf",
                            "body": "I remember reading back when FOM denied their application that FIA could get Andretti cleared to race without FOM's approval, but they wouldn't be able to be shown on the broadcast. I can't imagine something like that bringing any good to anyone though.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "zmazebowl",
            "body": "Hello, I recently received the \"get your name on the chequered flag \" from the Chinese grand prix as a birthday gift. I was wondering if anyone had any photos of the flag where you can clearly see the names or know where I could get such photos. Thanks",
            "score": 1
        },
        {
            "depth": 0,
            "author": "am0ral",
            "body": "is there a weekend warmup for monaco?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "edfitz83",
                    "body": "there are 3 practice sessions, 2 friday and 1 saturday",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "am0ral",
                            "body": "sorry, should have been more specific. the weekend warmup program  that the the F1TV crew puts on",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FermentedLaws",
                                    "body": "Yes, it was delayed. It is out now.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bootarms",
            "body": "If Andretti races in 2026, Yuki Tsunoda may be a sensible decision. Honda engines are already the most logical option for 2026 and 2027 as they will utilize their American facilities. Honda also has a vested interest in keeping Yuki on the grid. While he will likely be safe at RB for 2025, the doors to RBR and better teams are shut. A seat at Andretti would be up for negotiation.\n\nThe interesting part of this is the Lawrence Stroll factor. He does not want Andretti on the grid and has pushed for a 10 team limit. To what extent could Honda use their new partnership to curb his objections if it means securing a seat and a customer team for two years?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "QFC",
            "body": "If KMag or any drive gets a race ban for penalty points, do their points reset after the race ban? Can a teams reserve drive take part while the primary drive servers their ban?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hehetird",
            "body": "Why do people say that Ricciardo made bad career decisions, in particular leaving Alpine for McLaren? If he hadn’t had his decline (which nobody would’ve predicted after 2020), he’d have been competing for podiums in his 3rd year of his contract and this year for wins. You can’t say his decisions were wrong, it’s just that he declined at the wrong time. Alpine are absolute shite now too.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "djwillis1121",
                    "body": "Yeah at the time it seemed like a great move. Ricciardo had one of the best seasons of anyone on the grid in 2020 and McLaren was a team on the up. No-one would have predicted the outcome at the time",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "SunGodnRacer",
                    "body": "A lot of fans just want to dunk on him for some reason. He never made any enemies on/off-track, one of the cleanest drivers throughout his career, and a really outgoing, fun personality. Still people chose to ignore his pre-2021 career. He is arguably the best driver to not win a championship since 2010, and was a constant threat to Mercedes even in their dominant years. Some say him moving to Renault was a bad move, but I think 2020 was the best season of his career. He's not as bad as his McLaren stint, as he has high moments much regularly (Mexico, Brazil, Miami), and seems to be constantly improving since Japan. While it looks bleak, I would not be surprised if he stays on the grid next year",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "rcanbian",
            "body": "Started watching the 2007 season.....seeing rookie Hamilton take it almost immediately to 2x WDC Alonso was absolutely thrilling. It makes people saying he's a car merchant even more frustrating. To think he was so close to winning WDC as a rookie, too.",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "IHaveADullUsername",
                    "body": "Hamilton was wild to watch in his younger years. He’s tempered his aggression quite a bit since then and also Merc’s switch to endless braking systems in ‘14 hampered quite a lot of his late braking magic. He used to send some wild moves.",
                    "score": 1
                }
            ]
        }
    ]
}