{
    "title": "Williams in advanced talks with Sainz over 2025 F1 deal",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "[The **News** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_news) is reserved for submissions covering F1 and F1-related news. These posts must always link to an outlet/news agency, the website of the involved party (i.e. the McLaren website if McLaren makes an announcement), or a tweet by a news agency, journalist or one of the involved parties.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AlexTheMacedonian",
            "body": "Reminds me of that meme with the boxer who wants to fight but drinks water instead\n\n\"I'm going to fight for a Red Bull contract\"\n\n\"Damn that Williams is good enough\"",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "neurogeneticist",
                    "body": "“I’m going to fight for an F1 seat”\n\n“Damn that ~~Ferrari~~ ~~Red Bull~~ ~~Mercedes~~ ~~Audi~~ seat got hands, Williams will do”",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "space_coyote_86",
                            "body": "Sainz to move to USA to drive in Indycar NXT series.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "revitbitch",
                                    "body": "i would give my right leg to see carlos in indycar",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Blapstap",
                                            "body": "Why? Wouldn't your right leg be way more useful than sainz in indycar?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DinoKebab",
                            "body": "\"Sainz Signs With Haas\"",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Wooden_Breakfast7655",
                                    "body": "This right here. I’m waiting.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AlexTheMacedonian",
                            "body": "Brilliant",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jesteratp",
                    "body": "I think the meme is that he wants to fight, and then it's him on the stool after the round going damn they got hands. The fight happens but we don't see it",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CenturionRower",
                    "body": "It will be if they lock in Newey. Don't forget there are rumors about him being offered ownership. He already made them a top contender in the 90s and IMO, at WORST they become solid midfield competitors.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "myth-ran-dire",
            "body": "I have more faith in Williams than whatever team Sauber has in place right now. Even if Audi will transform them into front runners it will not happen overnight.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Roddy-the-Ruin",
                    "body": "I can understand his logic tbh. (Not that I agree with it.)\n\nEither he goes to Sauber (Audi) or goes to Williams, from competitive point of view, nothing will change for next year. He will be trundling at the back of the grid.\n\nBut, imo, this news mean that he simply believes Audi engine will suck in 2026 and Audi will continue to be backmarker in 2026; whereas Williams with Mercedes engines could be in the upper midfield. Which would give him one year to show what he is made of. If he beats Albon and scores good points in that *\\*upper midfield car\\*,* he may find another chance in a top team.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "the_godfaubel",
                            "body": "Keep in mind that Carlos will be 32 at the beginning of the 2027 season. Even if a Williams stint goes well, a long term opportunity to compete for a WDC will likely have passed without striking gold. If he can't get a Red Bull seat and Mercedes is out on him, Sauber is really his only realistic chance at getting a WDC even if it is slim.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "minyhumancalc",
                                    "body": "Drivers have longer careers nowadays and there's no reason to suggest Sainz can't perform at his current level (or better) within the next 5-10 years. He's improved his racecraft a lot since joining Ferrari and there are plenty teams that could see him as an asset for at least until the 2030s.\n\nHe could return to Ferrari once Lewis retires or Aston once Alonso retires. Red Bull could also open at somepoint and be an in for him. Mercedes could even open if Russell or Antonelli move on.\n\nI don't *really* see why Williams makes more sense than Audi looking from an investment level, but trusting Mercedes engines is a solid idea in theory so I get it",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CandidLiterature",
                                            "body": "Sauber are somehow worse than Williams. Which considering Williams haven’t even been able to bring 2 cars to each GP is quite the achievement. Obviously Audi will bring investment with them but their starting point will need to just be the ditch the current team has managed to slide into. It has got to take them years to drag themselves out of it. Unlucky to be Carlos right now I guess - unfortunate to be dropped while in the form of your life with no good seat actually open.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "slabba428",
                                            "body": "You’re right, but the only worry is being stuck in a backmarker degrades your stock as a driver regardless of your ability, Danny Ric and Bottas are prime examples. DR has almost twice as many wins as Leclerc but he and McLaren mixed like water and oil, now he’s struggling to stay in the game, Bottas had a longer Q3 streak than Red Bull Racing among his other achievements with merc and after a couple years in the Alfa he is also looking like he could struggle staying in F1 soon. I think there’s a Stoffel Vandoorne joke in here somewhere too",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "quaifonaclit",
                                                    "body": "Losing to your teammates will do that to Ric.\nAnd yes the Merc was the class of the field for years.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "AsheronLives",
                                            "body": "Once Alonso retires, lol.  Is that even a possibility?  I was thinking he might be the first driver to be 3x the age of the youngest F1 driver.  Or the first to have grandchildren older than new F1 drivers.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "slabba428",
                                    "body": "Younger drivers have some better reaction times sure and they can set a fast lap but 30-35 is by no means old, it is most peoples’ peak years, you don’t just need fast reaction time to win a WDC you need a fully developed brain with the wisdom/experience to know when/where/how hard to push when it comes to the big picture ie. the full 24 races",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "the_godfaubel",
                                            "body": "It's not old by any means, but to think that every driver is like Fernando Alonso and Lewis Hamilton in continuing to be top level drivers on the wrong side of 35 is also wishful thinking. Seb fell off a cliff and so did Kimi. Schumi wasn't the same either. Of course they have flashes in performance, but those were also greats of the sport that won at least one WDC. Even Hulk was once considered a future WDC level talent but he also had a few years away from being full time in the sport so he isn't as worn down. Carlos isn't at their level",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "slabba428",
                                                    "body": "I am probably just projecting but i think that F1 fans need to cool it on the young drivers. Theres always so much clamor for the next 18 year old prodigy but i just dont think F1 should be filled up with people not old enough to drink yet. Not to be old man yelling at clouds but hopefully it makes sense",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "brilliant_bauhaus",
                            "body": "Man if he can't show teams what he's got at Ferrari then what's even the point? He's done everything asked of him and until Lando he was the only person in 2 years to beat max and get P1. If I was Vasseur and liked Carlos as much as he seems to I would be trying to talk him up to all the TPs. He's a great second driver, smart, intuitive in the car when it comes to strategy calls. He's at his peak and he deserves to be fighting in a good car alongside another good driver. But if he can't do that I wish he would take the Audi and use that brain to help build a great car around him. \n\nIf Lawrence Stroll didn't love Lance as much as he did he should be pouncing on Sainz.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Firefox72",
                    "body": "I don't. No ammount of James Vowles sweetalking that i could listen for hours has convinced me Williams are serious in any way as a project that wants to return to the top. They lack the staff, they lack the facilities and i don't think Dorilton is serious in investing into either of those.\n\nThey literally regressed in performance this year.\n\nI'l trust a German powerhouse with decades of success across various racing series that literally bought the team and is developing an engine for it much much more. The past few German works teams have a pretty decent record of elevating teams including Sauber.\n\nBMW elevated Williams from 5th in the WCC with 3 podiums to 3rd with 3 podiums in a year. Made them 4 time race winners with 5 aditional podiums in 2 years. Pushed them to 2nd in the WCC in 3 years with a much more consistent podiums and made them title challengers in 4.\n\nBMW took Sauber from 8th in the WCC to 5th with 2 podiums in a year. Propeled them to 3rd in the WCC with 2 podiums in 2 years and made them race winners and consistent podium challengers by the 3rd year.\n\nMercedes made the Brackley team competitive in 3 years and then a dominant force in 4.\n\nObv this is not 1:1 because of different eras and the cost cap but i'd still trust a German car manufacturer project more than i trust a team owned by an investor firm.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "laboulaye22",
                            "body": ">I don't. No ammount of James Vowles sweetalking that i could listen for hours has convinced me Williams are serious in any way as a project that wants to return to the top. They lack the staff, they lack the facilities and i don't think Dorilton is serious in investing into either of those.\n\nYou are wrong about Williams and Dorilton (I think!). It will take many years but they are committed and have a plan in place. Claire Williams did a podcast recently where she briefly touched on this and the sale of the team (starts around the 21m mark): [https://www.youtube.com/watch?v=UudMP6AMjdY](https://www.youtube.com/watch?v=UudMP6AMjdY)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fvcktankies",
                                    "body": "Claire Williams sort of has to say that Williams was handed over into good hands, since she was the person who's overseen selling the team. I'm not saying she's not being honest about the matter, just that there's a conflict of interests.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "jaysvw",
                                    "body": "Dorilton is an investment firm.  They aren't going to put a penny more into Williams than is absolutely necessary to protect that investment.  Dorilton told Claire what she wanted to hear.  They aren't in the business of burning hundreds of millions chasing RedBull or Ferrari for a WCC.  They are waiting until they think F1 is at its peak, then they'll sell to the highest bidder, its their whole business model.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Krisosu",
                                            "body": "Dorilton is just an anonymity layer for Peter de Putron, who is ostensibly a petrolhead. He could be treating it like any other investment, coldly selling it whenever the time is right, but there's no reason to believe that of him than any other owner/team. de Pultron could decide to put more money into it.\n\nWilliams' ownership situation isn't particularly different from other teams except in that their owner deeply appreciates his privacy.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "hoxxxxx",
                                                    "body": "thanks this is the kind of insider talk i come here for",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Mrc3mm3r",
                                                    "body": "Source on Peter de Putron being the owner?",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Lonyo",
                                            "body": "Williams is one of the teams which asked for additional budget cap to spend on CapEx, so the team literally asked for the ability to spend more money than the budget cap allowed.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "jaysvw",
                                                    "body": "Maybe, but they can't get the resources to fix what they have now.  Dorliton bought them 4 years ago and its as big of a dumpster fire as its ever been.  They bought it for $200ish million and are sitting on huge profits.  They aren't going to kill their margins by building a wind tunnel so that Williams can be 6th instead of 9th.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TharixGaming",
                                                            "body": "haven't they spoken about how, because of the budget cap, they cannot fix their infrastructure because that's money that doesn't go to building the car? they have the resources for it, the rules don't allow them to spend those resources.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "laboulaye22",
                                                            "body": ">Dorliton bought them 4 years ago and its as big of a dumpster fire as its ever been.\n\nThey now have a TP who is willing to make the tough decisions short term to the greater benefit long term. I think you might be surprised. Anyway, I'm not just basing my opinion on what Claire said. I have been bullish on Williams since the end of 2021. Many years of work ahead of them but they are in the best position they have been in for a loooooong time.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Lonyo",
                            "body": ">\"Mercedes made the Brackley team competitive in 3 years and then a dominant force in 4.\"\n\nThe Brackley team which had just won the WDC... They managed to \"make it\" competitive. And it took 3 years even then.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Celebratory911Tshirt",
                                    "body": "You're clearly a newer fan lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FormulaF30",
                                            "body": "Definitely lol",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Firefox72",
                                    "body": "The 2009 launch car was essentialy a Honda works team operation with a Mercedes engine straped onto it. \n\nBut Honda left and by end of 2009 Brawn had fallen off pace wise and barelly had any budget left. The W01 was essentialy a minimaly developed 2009 car. While its true that Mercedes technicaly took over a WDC team it hardly paints a full picture of the situation. \n\nMercedes was pretty much starting a new in setting up their own works operation.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LePaxton",
                            "body": "This! I get why people are not sold on the whole Sauber / Audi thing right now but holy smokes is Williams getting overrated. Obviously Vowles is on of the best in what he does but for now, the whole Williams project is nothing else than really good sounding promises. The whole hype stems from Vowles' eloquent and calm way of talking. He is just an incredible salesman. It will take quite a bit longer for Williams to catch up. Audi and Sauber just don't seem to give a damn about hyping up anything so people tend to forget that this will be a works team with a tailored engine from 2026 onwards.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cheeersaiii",
                                    "body": "I don’t think Sauber will be beating Williams until 2030, and sounds like Carlos has the same opinion",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "poopellar",
            "body": "Who would have thought that the hottest seats right now are with the traditionally two slowest teams, Haas and Williams.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bedaryellow",
                    "body": "Williams is not *traditionally* slow",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dent13",
                            "body": "It's been 7 years since they weren't a backmarker, I'm going to bet a lot of fans aren't used to anything but them being at the back.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BrandonJTrump",
                                    "body": "Consistent front running by Williams is almost 20 years ago. I even remember the days before Frank Williams was successful, pre ‘79.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "space_coyote_86",
                                            "body": "The walrus-nosed FW26 is 20 years old now. The car that got their last win with BMW. 2003 was the last season that they won more than one race.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Jacinto2702",
                                    "body": "Yeah... But us veterans still remember that glorious Spanish afternoon when Maldonado crossed the line in first place after fending off Alonso and we will never forget it.   \n\n\n\nBasically because that's the only Williams' win I have watched live, I was a sniffing glue toddler when Montoya and Ralf were there, and I was born in the second half of the 90s, so never got the chance to watch Mansell and Prost win with them.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Firefox72",
                                    "body": "And even before that they werent exactly setting the world allight in the post BMW era bar a few flashes mostly delived by Rosberg when still there and then that 2012 season.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CoercedCoexistence22",
                                            "body": "Selective memory much\n\nThey finished third in WCC in 2014 (and would've been second without the corpse of Massa at the wheel of one of the cars), third in 2015 (ahead of Red Bull) and were solidly midfield in 2016 and 2017",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Kolec507",
                                                    "body": "Yeah, that period was so much better for them than a single weird win in what overall wasn't a great V8 era (or 2012 season) for Williams.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "tkcom",
                                    "body": "Their Martini days were eons ago.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CaptGeechNTheSSS",
                                            "body": "Miss those liveries though",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "climbing2man",
                                    "body": "Yep",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "fluvicola_nengeta",
                                    "body": "Ah, but they're a different kind of backmarker now! They went from \"disgraced tractor\" to \"sometimes is there\", it's a huge improvement!",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ScottyDontKnow",
                            "body": "They been bad since Drive to Survive started which is probably how a lot of fans learned about F1 recently.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "TopBandicoot125",
                            "body": "On average since last century they're probably upper midfield. Not bad, who needs RB..",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "charlierc",
                            "body": "Yeah but 1997 isn't recent anymore",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "brotatoavocado",
                            "body": "Past performance means nothing, Williams is slow as fuck right now with no signs of changing and that’s all that matters lol",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Roddy-the-Ruin",
                    "body": "I mean Haas has actually got a good car in their hands. Williams currrently has likely got the worst car on the grid.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FSUfan35",
                            "body": "I dont know if Sauber is going to score a point this season.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "LePaxton",
                                    "body": "Bold thing to say when they could already have scored a couple if it wasn't for bad pitstops and the engine blowing up in China. Yes they are far from good but on some tracks they were the fastest of the backmarkers. Also they have reached Q3 this season. The Williams is clearly the slowest right now but let's see how everything pans out towards the end of the season.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FSUfan35",
                                            "body": "At some point the bad luck stops becoming bad luck and is just the team.  And quali pace doesnt always translate to race pace.  Car could be good in quali and completely shit in the race",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LePaxton",
                                                    "body": "The pit stop issues are clearly on them. But the car showed glimpses of great race pace on multiple occasions this season. Something i haven't really seen from Williams for example. Sauber was pretty quick in China and would probably have scored a point before Bottas' engine blew up. That's just bad luck. They were also pretty good in Japan, Bahrain and Australia. The pit stops just often ruined their races. But this issue should be fixed now so there is no reason why they could not score a point now if they continue to have race weekends where they are pretty much in the mix for the title of \"best of the rest\".",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FSUfan35",
                                                            "body": "Ehhhh i think thats optimistic to be considered the best of the rest.  They're pretty clearly behind Haas and RB.  Alpine is seemingly getting better. Bottas highest finish this year is a p14 and Zhou was p11 in bahrain and then his next highest is p14 as well.  Albon has multiple p11 and a p12 with a car that is 15kg overweight.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Wondur13",
                                    "body": "Thats a ridiculous thing to say, theres hasnt been more than one team to not score a single constructors point in a season 2014, and half those years no team was without a point. Needless to say, the not worst team in f1 right now is going to get a point",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "motojack19",
                                            "body": "I've re read this a couple of times and it's making my brain hurt",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Spraynpray89",
                                                    "body": "Why? It's not not easy to not understand. The person clearly does not not know how to not explain things not clearly.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "motojack19",
                                                            "body": "🤣😭",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "rydude88",
                                                    "body": "Yeah i was hoping it wasn't just me",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "CandidLiterature",
                                            "body": "Great so which 10 cars are they going to beat to get one?",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Lonyo",
                                            "body": "Well if there hasn't been MORE than one team to score 0 points clearly Sauber can't be one team to score 0 points! Makes complete sense!\n\nAnd when you are so far back you need to get very lucky to get any points. And if the luck goes one way rather than the other, it's fairly easy Sauber could score 0 points even if another car is slower.\n\nNot to mention Williams having 11, 11, 12 as their best three results while Sauber have a single 11th, and then 14, 14, 14, 14. If Sauber aren't the worst team, their performance certainly isn't reflecting that because their best finishing positions have been even worse than Williams, which means even lower chances to get points than Williams.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "NuclearCandle",
                            "body": "Funnily enough it was the reverse last season. Shows how fluid the lower end of the grid is.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "hoxxxxx",
                            "body": "i nearly fell out of my chair when hulk put that car to the top",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Firefox72",
            "body": "I just fail to see how this is a good move for Sainz.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "khryslo",
                    "body": "Beggars can’t be choosers. RB and Mercedes are allegedly not interested in him, so it looks like backmarkers is all he has left.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SWSIMTReverseFinn",
                            "body": "Yeah, but Williams? I rather shoot my shot with a new works team.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "laboulaye22",
                                    "body": "2026 driver market will light up again and there will be a more clear picture of the competitive ranking. It's a gamble, sure, but we also don't know what he knows that we don't.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cheezus171",
                                            "body": "The real problem will appear if he doesn't convincingly beat Albon.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "KrifeH",
                                                    "body": "we’ll get to see how good Alex actually is",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "khryslo",
                                    "body": "The truth is that we don't know what Audi is offering him, or if they are offering him seat at all. One day the team can promise him the world and the next day announce someone else as their new driver without any warning. He's not in a position where he can snub Williams. He has to negotiate with absolutely everyone, no mater how bad the prospects are.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Firefox72",
                            "body": "But he has a choice which i think is clearly the supperior option. Like i'm sure he can get a short 2 year contract from Audi if he wishes. He's the hotest prospect on the market and i'm sure Audi would want him. And a contrat like that would give him a chance to see if openings Mercedes or Red Bull open up. \n\nIf Audi suck he's gonna be driving at the back but with Williams he's gonna be doing that anyways as is.\n\nLike instead of taking a punt on a works team with a lot of potential he's choosing a backmarker team with much less potential.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Intrepid-Ad4511",
                    "body": "They are powered by Merc which some folks are saying will be the top engine come 2026 along with Ferrari. No idea how competitive the Aston Honda would be, and RBPT is anyone's guess. This is a team with less politics and he can possibly aid their development and perform to the car's limits and jump to a better seat in 2027. \n\nThis is just my knee-jerk conjecture in between copious tears and ugly crying.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "supersonicflyby",
                            "body": "Remember, Williams has been using excel sheet to track part development.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Formulafan4life",
                            "body": "2026 three way title fight between McLaren, Ferrari and Williams. (I’m on high levels of hopium)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "404merrinessnotfound",
                                    "body": "If two of mercs customer teams are in a title fight and they are not, they might as well pull out of F1 right there and then",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Formulafan4life",
                                            "body": "Yep. Merc out after 2030. Toto Wolff and Ineos will take over the team and Merc will stay as a engine supplier.\n\n(I can look into the future)",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Intrepid-Ad4511",
                                    "body": "GIMME SOMMA THAT!!!",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "mshell1924",
                            "body": "I'll have what you're having 😭",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "markhewitt1978",
                            "body": "Tbf it's Toto saying Merc will be the best.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Keanu990321",
                            "body": "Honda's engine is said to be really good.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "hoxxxxx",
                            "body": "eh it's good to stay in f1 no matter the team so who knows it may be the best move for right now",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BX293A",
                    "body": "A seat is better than no seat, and if RB and Merc aren’t available, his choices might be Williams or Audi,\n\nWilliams……well we have a cooler color scheme!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Stalkedtuna",
                    "body": "Stays in f1. A team that has been making consistent improvements. A team that has had their system completely overhauled. Plus in terms of car development a ln albon sainz combo is very strong. Ngl if I was Carlos I'd be picking Williams over Saub-audi",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cheeersaiii",
                            "body": "Exactly… stay on the grid, then he’s an excellent option for anyone higher up needing a driver next year or 2 if Williams dont claw back any points. which Red Bull Merc even Mclaren or Aston could all be looking at, and he would be top of the queue over Albon Ocon Gasly",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "spicykitas",
                    "body": "It’s better than unemployment if he keeps turning down other offers.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Fit-Lifeguard-6937",
                    "body": "What other option does he have? So he wins 2 races in 2 years, that’s not a lot of bargaining, yes he’s a good driver but far from consistent over the last few years.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ICumCoffee",
                    "body": "If it’s for only 1 year then It’s better than taking the year off. But this is **one of prospect**",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Codyqq",
            "body": "No no, that's supposed to be Bottas seat",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Roddy-the-Ruin",
                    "body": "Bottas could be in the running for Alpine seat which Ocon could vacate for Sauber or Haas.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SirDigbyChimkinC",
                            "body": "Bottas going home to Williams is a nice story. Bottas slowly losing the will to drive at Alpine is not.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "NightNo423",
                            "body": "I'd rather he cycle more than be stuck in the Alpine.\n\n\nHeck, he'd probably do better lap times on the bicycle..",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "gideon513",
                                    "body": "He might be if they implement the pedal upgrade to the Alpine",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "simonsail",
                            "body": "If Sainz goes to Williams then I think there's a good chance one (or more) of Bottas, Ocon and Gasly don't have a seat next year which seems kinda crazy!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "slip-slop-slap",
                                    "body": "> Bottas, Ocon and Gasly\n\nToto needs to get his head screwed on straight. Any of these would be a better option than Kimi",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BBIQ-Chicken",
                    "body": "Bottas can sit on his push bike",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "gregghead",
            "body": "That’s a hell of a lineup and a coup by Vowles. Sainz must have a lot of faith in their vision for 2026.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Formulafan4life",
                    "body": "Sainz - Albon is way too good for a backmarker team. I’m almost forcing myself into believing Vowles is on to something because how the hell would he be able to have such a driver line up at Williams?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CandidLiterature",
                            "body": "I guess it’s what happens when RB won’t clear out their underperforming driver, AM have Stroll blocking a seat and Mercedes are just holding a seat clear for presumably the second coming of Christ… Both Alex and Carlos would be more deserving of those seats but for a variety of reasons, they’re not on offer. Just sucks.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pokemongofanboy",
                                    "body": "> Mercedes are just holding a seat clear for presumably the second coming of Christ\n\nLol lol lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sammyGG00",
                                            "body": "That kid is gonna be mid as fuck. Toto is going crazy",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Street_Mall9536",
            "body": "Spanish drivers 🤝 epic career moves",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Maria_in_the_Middle",
                    "body": "Orrr maybe Williams is the traditional path of Ferrari #2s. Barrichello, Massa...",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "JayBee58484",
                    "body": "Nobody knows career destruction better than Spanish drivers",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Choice_Awareness",
                            "body": "it’s because of the discrimination they face",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mtarascio",
            "body": "This would make me a sad operator.\n\nDue diligence would be talking with everyone though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BigSkyFace",
            "body": "Low key pretty up for this. Would be interesting to finally see just how much Albon has improved from his Red Bull days up against someone we’ve already seen succeed elsewhere",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "toothybrushman",
                    "body": "Agreed. Latifi and Sargeant have been extremely mediocre comparisons.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JimClarkKentHovind",
                            "body": "I am *begging* the dear lord for Albon to out-qualify Sainz on every single attempt and we just realize Albon is better relative to Sainz than Leclerc is\n\nlike in my heart I believe they'd be pretty close with Sainz having just a slight edge but what I *want* is for Albon to be one of the best drivers on the grid without question because he just seems like a rad dude and I like his cats",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "No_Noise9",
            "body": "I wonder if Sainz ever thinks about holding out on signing the Ferrari contract and allowing Lewis to swoop in and take his seat, causing him to look for another team, and then not wanting to go to Audi, then finding out Merc and Red Bull aren't interested, leaving him to consider Williams.\n\nHe must think about this right?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Luckless_Rabbit",
                    "body": "They would’ve dropped him even if he signed a new contract with Ferrari.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "tnellysf",
            "body": "Man, Carlos deserves a good car, I don’t want him at the back of the pack.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DubiousLLM",
                    "body": "He doesn’t want 1 year deal, so he is in this situation right now.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "VallcryTurbo75",
                            "body": "And Sauber/Audi is offering 1y?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "emeybee",
                                    "body": "Sauber/Audi isn't very far up the pack from Williams",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "DubiousLLM",
                                    "body": "No I meant the top teams. Audi is probably offering 3+ years easily. But it seems he doesn’t want to take risk with Audi engine?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "tnellysf",
                            "body": "As he shouldn’t, he’s a good driver that should get multiple years in a good car. I think he’s done great at Ferrari. There’s just only so many spots in the good cars, and I’m bummed we won’t be seeing him competing for a while. IMO, he deserves it over Checo, and whoever Merc chooses, but I know that’s not how it works.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JayBee58484",
                                    "body": "He deserves it over Checo but he'll be just another Checo to Max therefore a 1 year is the most hell get.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "simonsail",
                                            "body": "Checo hasn't won a race or been on pole in over a year. I'm not sure of the last time he out qualified Max either, but that's gotta be going on for a year now too. \n\nI just can't honestly believe that Carlos would be as far away as that.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GrazzieRegazzi5",
            "body": "I'm sorry, they're what now?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Realistic-Reception5",
            "body": "He and Alex could be the appendicitis team",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dragonpuncha",
            "body": "This seems like the biggest mistake. James Vowles can make all the spreadsheets in the world, Williams is not going to be anything other than a backmarker or at best a midfield team. \n\nAudi is a risk, but at least they are planning to invest and hire like one of the top teams.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hack874",
                    "body": "I don’t think it makes a difference. The absolute earliest Audi will be competitive is 2030, and even that’s unlikely. \n\nHe could just kill it at Williams for 2-3 years and use it as leverage to get an established top seat.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dragonpuncha",
                            "body": "That's way too pessimistic. They are getting special exception in the cost cap rules that allow them only count 150.000 euros as 100.000 for salaries because they are in Switzerland. This allows them to hire 300 extra people immediately and they will be building facilties as well. \n\nThey will take a step forward in a few years, the question is just how much.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Firefox72",
                            "body": ">\"The absolute earliest Audi will be competitive is 2030, and even that’s unlikely.\"\n\nThis is such a gross hypebole.\n\nThere is a new aero and engine generation coming in literally 2 years. They can realisticly be competitive at least at the front of the midfield in less than 2 years time.\n\nWhy on earth would it take by 2030 for them to get competitive? Its quite likely that by that point were gonna be seeing another aero tweak which could again shuffle the order a bit.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Hack874",
                                    "body": "They’re a full year behind everyone else in the engine development, which is a huge deal. James Key said they won’t even be a “final product” until 2027, which is encouraging. If they’re smart they’ll go the Mercedes route and invest the majority of their efforts into the 2030 regs.\n\nPlus if they actually had a chance to compete before then, Sainz would not be turning them down (possibly in favor of freaking Williams, lol).",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Intrepid-Ad4511",
                                    "body": "You have to look at where Stake is at. And they will be making an F1 engine for the first time - versus Ferrari, Merc, Honda and Renault (and RBPT). I was initially gung ho about the prospects but it does not look very promising or exciting. They will not be competitive till atleast 2028 or 29 is my feeling based on what I have read in these forums.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "CandidLiterature",
                                    "body": "Look at how long it took Mercedes to drag the literal championship winning car they inherited back to the top after only 1 year of poor investment. \n\nThe Sauber is a far worse car, the team they have are much less decorated and there’s now a cost cap. It seems like madness to think they’ll be doing anything worth watching anytime soon.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "CanaryMaleficent4925",
                                    "body": "How much coping do you on a daily basis to think fucking sauber is going to suddenly compete for wins ",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FSUfan35",
                            "body": "Hey audi could nail the regs............",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JimClarkKentHovind",
                    "body": "if I'm not mistaken, his whole thing was *deleting* the spreadsheet",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "flintey360",
            "body": "Sainz must be scared of Hulkenberg or something just throwing away his career...",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Maria_in_the_Middle",
                    "body": "I like Sainz but I did think of this. At least Audi will be a works team with money so I don't understand the logic with Williams. So I wonder if one factor is he has been beaten by Hulk before, being just matched by Hulk next year who was from a backmarker team would just end his career.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ma1vo",
                            "body": "Wouldn’t the same be true if Albon beats him? In Sauber they will both be new to the team, but Albon surely has a small advantage since he has been with the team for so long? Maybe Sainz doesn’t rate Albon too highly.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "hayleybts",
            "body": "Rough operator",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jacinto2702",
            "body": "Bruh...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "glowingmug",
            "body": "Oh no. thought Bottas was gonna pair with Albon, hope he gets a seat.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SWSIMTReverseFinn",
            "body": "Yeah, there's no talking up this move. This is pretty terrible for him.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Disastrous-Beat-9830",
            "body": "This is either genius or stupid and I can't tell which.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Machful",
            "body": "Something must have happened with the Audi deal then. Seems insane to go for Williams over a works team.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mshell1924",
            "body": "I'll be rooting for Sainz wherever he goes 🥲",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Zingggbot5000",
            "body": "Man, that sucks. Imagine getting out of a Ferrari and into a Williams.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Formulafan4life",
                    "body": "Now imagine it is the 90’s",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JayBee58484",
                            "body": "You sound like a Cowboys fan lol",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Zingggbot5000",
                                    "body": "For the longest time!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "No-Student-9678",
                    "body": "Imagine saying that in the 90’s",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ICumCoffee",
            "body": "Parkour….",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Economy_Link4609",
            "body": "Albon: Alright I'm signing this deal to know I'll be the clear #1 at this team and be prioritized to lead\n\nSainz: Hold my beer",
            "score": 1
        },
        {
            "depth": 0,
            "author": "x99kjg",
            "body": "Tbh, listening to Vowles explain something incredibly boring, but using big words in his calm demeanour would be enough to tempt me to sign.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "JayBee58484",
                    "body": "Man can really make a turd in the toilet inspiring and informative. Too bad they can't build a car",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NotClayMerritt",
            "body": "Checo - Red Bull\n\nSainz - Williams\n\nAntonelli (even after Toto yelled at media for putting pressure on Kimi even though nobody has done that except fro him) - Mercedes\n\nWhich leaves a very spooky conundrum for Ocon, Gasly, Zhou, Bottas, K-Mag. 5 drivers fighting for only two realistic seats at Audi and Haas.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "jestate",
                    "body": "And the Alpine seats.  If Kimi is the only new joiner next year then there'll be only one departure.  Unless you mean the Alpine seats aren't being fought over and will simply go to whoever is left... 🤣",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ma1vo",
                    "body": "If the lineup changes you suggested goes trough then this would probably happen\n\n- Occon to Sauber\n- Bottas to Haas (with Bearman)\n- Gasly stays in Alpine\n\nNot\tsure who grabs the last Alpine seat, they might gamble on Doohan or give whoever looses their seat at VCARB a shot (Lawson will surely be in VCARB next year?).\n\nKmag will probably not get another chance unless Haas suddenly decides they want to keep him. Zhou is probably also out unless his sponsors is a deciding factor for a team that struggles with money. Zhou + Gasly sounds like a good lineup for Alpine to be honest, but I think the will probably consider other drivers before him.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "natte-krant",
            "body": "What the hell is Williams cooking?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "xanlact",
            "body": "Weren't they in advance talks with Bottas?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "newontheblock99",
            "body": "I feel for the guy, he has demonstrated he deserves to be in a competing car and to get kicked to Williams is a slap in the face. I understand that Vowles is trying to build Williams up but that’s gonna take time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Woullie_26",
            "body": "He turned down Audi for this???",
            "score": 1
        },
        {
            "depth": 0,
            "author": "blubarrac00da",
            "body": "Why not replace Dani Ric? RB seems more promising than Williams.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CrippleSlap",
            "body": "So where does Sargeant end up? /s",
            "score": 1
        },
        {
            "depth": 0,
            "author": "UnicornLoveFeathers",
            "body": "Who will get the second Mercedes seat? Mercedes seems to not want good talent like Newey or Sainz. Didn’t toto say that he wants to wait one more year with Kimi? If not Sainz, it has to be Kimi",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SaintSeiya_7",
            "body": "Wondering what Bottas and his 25 min coffee chat is thinking right now. But I suppose he'll just pick whichever seat Sainz refuses between Williams and Sauber.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fast_Sparty",
            "body": "What if Albon is overrated and Sainz goes to Williams and starts competing for podiums?\n\n(A man can dream!)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "No_Sun_2121",
                    "body": "We actually dont know how good Albon has been, he had by far the easiest teammates for the past 3 years",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Formulafan4life",
                            "body": "I think Sainz is better. Not by an insane amount but enough to make the difference between P9 and P13.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "alexisthemovie",
                                    "body": "P9 to P11 alone is the largest 2 position gap in the field. That's the top 5 teams minus Stroll or one other unlucky driver on any given weekend. There is actually a decent amount of past data to judge the two as they've both been Max's teammates, and both were in good cars in 2020 with equal points results. In my opinion, they are at a similar level.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Swiss-ArmySpork",
                    "body": "Albon is overrated.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Novae224",
            "body": "Williams seems to be cooking something….\n\nIdk, Newey hasn’t confirmed where he’s gonna go… i would love to see him go to Williams tbh",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Technical_Walrus_961",
                    "body": "Newey to Williams is the only way this is a good move",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ma1vo",
                    "body": "Newey will end up at Ferrari or Aston Martin",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Novae224",
                            "body": "We’ll see",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "plant_here",
            "body": "if they crash next year, who gets the car?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Eggplantosaur",
            "body": "I was expecting Sainz to Alpine at this point (if he lands a seat at all, that is). I'm not sure if Williams is much better though. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Coles_singlet",
            "body": "Well, he clearly doesn't convince top teams to sign him over other prospect so it's probably second half of the grid or out for him. Mercedes and Red Bull are clearly looking for someone out of the current grid, he can't relive the bromance with Lando, Ferrari just got rid of him and Aston Martin is locked. The only other choice is Audi, but I wouldn't be too surprised if they rather try bring back Seb from retirement to have a strong German line up.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gutster_95",
            "body": "This is crazy. But also kinda get the logic. \n\nBut Audis contract should be way more lucrative than Williams. I kinda think that this is a negotiation tactic by the spanish camp",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Personal-Theme803",
            "body": "Sign that contract, amigo!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheMineA7",
            "body": "RB please hire Sainz man. Yall buffoons",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ya_Got_GOT",
            "body": "Get Sainz and then Newey doooooittttt",
            "score": 1
        },
        {
            "depth": 0,
            "author": "realgamergirlTM",
            "body": "This could be a good time to sign on. Williams is shit this season, but he doesn’t have to drive this season, and in the upcoming seasons they have a lot of potential. Vowles punted this season to create a modern factory and they have funding. With a smart driver like sainz giving good feedback they could be something.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NendoroidAshe",
            "body": "Inject this into my veins",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Rennie_Burn",
            "body": "Carlos is what 29? Plenty of years left in him yet... No doubt Vowels has a good plan in place to convince Albon to stay, and now potentially Sainz for the second seat... That's a pretty nice driver line up going into the new Regs in 26... \n\nIf Williams can keep pushing forward under Vowels direction, there is huge hope for them with two very very good drivers...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheRoboteer",
            "body": "The fact Williams might have a choice of either Sainz or Bottas for the seat next to Albon is pretty amazing as a fan of the team.\n\nWould seem to spell doom for Sargeant though. I don't see how anything he does short of somehow winning a grand prix or suddenly staring to whitewash Albon could make him a more attractive prospect than those two",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LGCGE",
            "body": "If an Audi works team with VW backing is on the table and Sainz chooses Williams, he’s a dumbass.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Desperate-Speaker608",
            "body": "if he goes to williams i will cook and eat a dog shit pie.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dogdadstudios",
            "body": "Mama Mia that’s not where I think he was looking.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "No-Student-9678",
            "body": "Damn Carlos what a fall from grace. Literally a month ago we were expecting Red Bull or Merc to sign you up.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "johnabc123",
            "body": "If he picks this over a team that will soon be Audi I don’t know what to say lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ChewieSkittles53",
            "body": "So what will Valterri do now",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Wilber420",
            "body": "First we had Kompany to Bayern, now Sainz to Williams? What’s happening?!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "thewizard579",
                    "body": "Rob Edwards to Barcelona",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "jopperfromkwangya",
            "body": "this is so stupid my god.\n\nhis manager sucks big time and needs to be fired.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "heyarkay",
            "body": "Poor Carlos. Good for Williams.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mood683",
            "body": "What",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Legitimate-Tadpole95",
            "body": "It's bizarre that one of the top 6? drivers in F1 is having to play pass the parcel like this when there are drivers who merit a place on the grid far less than Carlos. Is there any team he is not talking to?  I hope for his sake that he knows far more what is going on behind the scenes and is simply letting the rumour roundabout spin around. I'm beginning to dislike Ferrari for what they have done to this guy - all in the name of Ferrari marketing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DepecheModeFan_",
            "body": "It's absolutely insane that someone as good as Sainz is having to decide which backmarker to drive for. Meanwhile his replacement is losing to Russell, who himself is inferior to Leclerc.\n\nSo, so wrong this whole thing.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Okurei",
                    "body": "F1 teams are run on data and common sense, and not what reddit incorrectly thinks a driver is. It seems to work, strangely enough.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DepecheModeFan_",
                            "body": "If that were true and the data was all that mattered, pay drivers wouldn't exist. And as I say, Lewis is losing to Russell, surely if they looked at Data they'd have went for him, not Lewis.\n\nImo Lewis' move to Ferrari wasn't motivated by his driving ability, it was motivated by what we're seeing now, it's been the catalyst for a perception that Ferrari are on the up which is helping them to attract new talent. His reach in terms of brand value and social media also is a significant boost to a brand like Ferrari and recoups a lot of what he costs.\n\nSainz got booted because Lewis has a bigger rep basically and it doesn't feel right. His on track performances (only 6 points behind Leclerc in 2023, only 2 points behind in 2024 if you exclude Jeddah where he didn't race) absolutely did not warrant being dropped and being stuck in a backmarker team.\n\nAnd I don't care what anyone says, it's just so wrong on Carlos. He did not deserve any of this, him and Charles were a great team.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "martythemartell",
                                    "body": "Lewis to Ferrari was announced before this season began, when Lewis had just finished P3 in the championship while Russell languished at P8. Driver contracts are not decided on a few weeks of performance, and in any case Lewis is already back to beating Russell this season like he did in the last. So your notion that the “data shows that Russell is better than Hamilton” is based on an insignificant number of races at the start of the season and is not reflective of reality.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DepecheModeFan_",
                                            "body": "> So your notion that the “data shows that Russell is better than Hamilton” is based on an insignificant number of races at the start of the season and is not reflective of reality.\n\nRussell beat Lewis in 2022 and was significantly better in the latter stages of 2023 in addition to 2024.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "emeybee",
                                    "body": "Blasphemous rumours...",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rcanbian",
                    "body": "His replacement is a 7x WDC, for fuck's sake, statistically the most successful driver of the sport of all time. Just last year Lewis was beating George soundly. I don't know what's going on right now, but there's still the chance of Lewis half-assing it since his car is shittier than he's used to and he already has one foot out the door. \n\nI love Carlos, but you people are hyping him too much. He's brainy but he just doesn't have the raw speed that the greats have.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "silly_pengu1n",
                            "body": "\"His replacement is a 7x WDC, \" well his replacement will also be 40.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Winstonwill8",
                                    "body": "Who placed 2nd with a worse car last year. \n\n\nHamilton has won WDCs at both his teams - Carlos has only won GPs at one of his teams out of 4/5. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sorryIdontwantto",
                                            "body": "*3rd but yeah, definitely the best result he could get since Max and Perez clearly had a better car",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Winstonwill8",
                                                    "body": "Oh lol I forgot Checo, my bad 🫣",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "flintey360",
                                    "body": "You guys continue to make the same mistakes doubting Lewis... 😂 I almost question whether you guys have even seen him in his prime or McLaren days, even last year.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "silly_pengu1n",
                                            "body": "time will tell and i am pretty sure leclerc will beat lewis easily",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "rcanbian",
                                                    "body": "I think there's a possibility that Charles can beat Lewis, but we're comparing him to Carlos. To think that Lewis is a downgrade from Carlos is just incredibly insane and honestly showcases how shortsighted you'd have to be.\n\nEven now at his worst season, Lewis almost got pole in the wet despite his tractor of a car. Do you see Carlos doing that? Highly doubt it.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "S-duct",
                    "body": "Sainz is overrated af though. N1 driver at midfield and backmarker teams is where he belongs.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SNDWVE",
            "body": "Wasn’t he the only non-Red Bull driver to win a race in over a full calendar year? How is that not worth anything?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hapless_Buffoon",
            "body": "such a waste of talent",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sparcey",
            "body": "Carlos is too good of a driver (and too hot) to be passed around like a hot potatoe like this",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Takis12",
            "body": "What does advanced talks mean?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Zavii_HD",
            "body": "Would rather see a Sainz to Andretti announcement 👁👁",
            "score": 1
        },
        {
            "depth": 0,
            "author": "302w",
            "body": "As much as I like Vowles and the new Williams direction, I’m not sure I’d pass up a works Audi seat for them. I guess it would have to be a long term contract at Audi so he can reap the rewards of coming on at ground level, though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BioDriver",
            "body": "Just let Andretti in ffs. Sainz can go there with whoever and we get more cars on the track",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "corruptbiggins",
                    "body": "Andretti would be an even bigger gamble than Audi. Guaranteed back marker",
                    "score": 1
                }
            ]
        }
    ]
}