{
    "title": "\"Mercedes is no longer interested in signing Adrian Newey... Apparently, James was willing to tender his resignation, which was also rejected by the top management of the company, and the future must come through Allison's experience.\"",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "[The **News** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_news) is reserved for submissions covering F1 and F1-related news. These posts must always link to an outlet/news agency, the website of the involved party (i.e. the McLaren website if McLaren makes an announcement), or a tweet by a news agency, journalist or one of the involved parties.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Starxgamer12",
            "body": "Brain drain killed this team. James wanted out and was denied. This is the first I’ve heard of Simone Resta going to Merc. Lewis’ decision to leave makes more sense every day.",
            "score": 1910,
            "replies": [
                {
                    "depth": 1,
                    "author": "sophia_az",
                    "body": "And Russell continues his mission in driving a shitbox",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "madewithgarageband",
                            "body": "George is the resident expert at milking a shitbox for every drop of performance it has",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "futurechiefexecutive",
                                    "body": "True. And honestly, Mercedes is his only hope at winning a WDC. Red Bull, Mclaren, and Ferrari look set with their #1 drivers for the next 2-3 years. There is no place where Russell can build a team around him. His hope should be that Mercedes comes back swinging in 2026.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BadAtNameIdeas",
                                            "body": "Ferrari isn’t gonna have an open seat until LH retires, and no one who wants a genuine chance at winning a championship is gonna partner up with Max while he’s at the peak of his ability and focus.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Pretend_Pension_8585",
                                                    "body": "Almost anyone would partner up with max if they didn't have to be a #2 driver, and I suspect there is a good half the field who would think they might be able to beat max even while being #2",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FerociousVader",
                                                            "body": "People forget the arrogance of racing drivers. George, Charles, Lando absolutely believe they're faster than Max.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ConspicuouslyBland",
                                                                    "body": "I don’t think Lando believes he’s consistent faster than Max. He’s been coached by Max in virtual racing.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "slip-slop-slap",
                                                    "body": "> Ferrari isn’t gonna have an open seat until LH retires\n\nHonestly only see Lewis doing two years at Ferrari and then calling it quits",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "nsfbr11",
                                            "body": "I will eat a set of intermediates if Russell ever wins a WDC. Won’t ever happen. Even if Merc wins a WCC while he drives them them, Russell won’t. Hold me to it.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Hartzler44",
                                    "body": "And then crashing as he pushes past his limit",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "throwaway164_3",
                                            "body": "And blaming Bottas and Alonso after",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AbandonedOrange",
                                                    "body": "George didn't blame Alonso for his crash",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "BeforeWSBprivate",
                                                            "body": "I’m sure he didn’t sling any shit with the stewards, not his team on his behalf.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Zwaylol",
                                            "body": "This surely doesn’t sound like any other top drivers…",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SoothedSnakePlant",
                                                    "body": "It was Verstappen for like, the first 4 years of his career lol",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Shitposternumber1337",
                                                            "body": "Yeah except Verstappen was doing sick things in a TR, I can’t thing of anything notable George did in Williams apart from the one 2nd place quali at the cancelled Belgium GP and crashing into the person who’s seat would be taking and then blame them for it.\n\nHonestly out of Max, Charles, Lando and himself, hell even include Albon in that list and George is still the least impressive out of the 5 of them imo",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MaybeNext-Monday",
                            "body": "George “The Shitbox Whisperer” Russell",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "DinoKebab",
                            "body": "At least it looks fast though.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "CrippleSlap",
                            "body": ">And Russell continues his mission in driving a shitbox\n\nGotta feel for Russell. Drove around in a back marker Williams all those years, switches to the factory Mercedes team, and now they stink.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dac2199",
                    "body": "There were rumours of Resta to Mercedes like one month ago.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Other-Barry-1",
                    "body": "I’m kinda convinced that’s why Lewis isn’t performing atm - why bother? The team has had a brain drain going on for years and almost no visible efforts to plug that. He absolutely carried the team to P2 last year, despite all the bad strategies, slow pitstops, inability to set up the car etc. why would you as an individual want to exert yourself that much again? Especially if you know you’re leaving",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LiquidDiviums",
                            "body": "Lewis is above all - a professional. He’s absolutely doing everything to help Mercedes. \n\nWith that said, he’s obviously realistic about Mercedes benefiting from his work and what that means for the future. He doesn’t really care about how good / bad the W16, but he does care about the team doing their best.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mookie_bombs",
                                    "body": "I get the vibe that he's just enjoying racing hard. I don't think he gives a rats ass where he or the team ends up in the standings. His focus, to me, seems like he is going to race hard, find an edge and get a result. Nothing more and nothing less.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Embarrassed-Mess-560",
                                            "body": "I agree that Lewis is likely racing hard and trying to just enjoy the sport without the pressure of being the reigning champ. He's in a great position to be able to race hard and play with setups and weird ideas he might normally shy away from before he hits the ground running at Ferrari.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Sevenfest",
                                    "body": "Don't forget as well that he knows firsthand what a team imploding/struggling for ideas looks like when he left McLaren in 2012. I'm sure he sees the signs and similarities and has a good idea of when it's likely right to move on",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "TheR1ckster",
                                    "body": "Yeah, people on here be acting like racecar drivers aren't racecar drivers. We want to win no matter what's going on outside the car.\n\nThe only reason he'd not be performing his best for Mercedes is that he doesn't trust the car and doesn't want to ruin next year with an injury.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "tokyo_engineer_dad",
                                    "body": "Lewis knows Ferrari is a hot mess. Imagine how little confidence he has in Mercedes that he would jump teams to Ferrari and consider it a shorter path toward his 8th.  \n  \nPeople will point out the ambassadorship or the money but let’s face it. Lewis wants one thing above all: championship contention.  \n  \nMercedes has reached a low point where Lewis believes it’s more possible with a team that hasn’t won a title since Bush was president.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BuckN56",
                                            "body": "Ferrari has poached people left and right and they're all going to be leaving their gardening leave at the end of this year to work on the SF25. They've been looking good.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "notafamous",
                                                    "body": "Also, isn't Ferrari the only engine the doesn't use the split turbo (banned for 2026) configuration?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tolleman",
                                                            "body": "Yes. The stars really seem to align for Ferrari.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "notafamous",
                                                                    "body": "I just hope they don't align **too much**, would hate to watch another dominance era",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "PattyThePatriot",
                                                                            "body": "Fucking same. Even if I pull for em I don't want to be bored again. \n\nI skip so many races because praying for max to crash isn't an enjoyable way to spend Sunday morning at 2am.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "BuckN56",
                                                            "body": "Yes. So at least they have a small lead there but who knows.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "buck_blue",
                                            "body": "Ferrari isn’t a mess. Not like the Binotto years. Not at all, really. Things are way calmer. The only drama recently is they replaced We Are Checking with Bryan Bozzi, whom is by all accounts, an upgrade. They’ve restructured, they’ve been on a shopping spree for talent, placed Inaki Rueda in a dark corner so he can strategize with the walls, hired Lewis, hired a slew of Merc and RB figures.. and not just peons, they hired some heavy hitters. Fred Vasseur is as competent as they come. Compared to the Binotto years Ferrari are in another league entirely. It’s going to take some time to see the benefits but they’ve got a pretty solid roadmap for the future. They haven’t looked this good in years.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "royjonko",
                                                    "body": "So Ferrari is at its best when lead by short Frenchmen?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "buck_blue",
                                                            "body": "Lmao short Frenchmen with perfectly spherical heads",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Low_discrepancy",
                                                                    "body": "Yet still managed to land Michelle Yeoh.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "xcore21z",
                                                                            "body": "To be frank you need a lot of charisma to flip an utter mess called late 80's - early 90's Ferrari",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Piercinald-Anastasia",
                                                            "body": "We are checking….",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "EddieMcDowall",
                                                    "body": "So next year will be our year ................. again!",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Consistent_Recipe_41",
                                                    "body": "We are checking...",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Affectionate-Panic-1",
                                            "body": "Ferrari poached some of the top engineers from Merc and they've just left their gardening leave.  I know it's repeated frequently, but Ferrari is looking up.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "cinyar",
                                                    "body": "the top engineers that botched the last set of regulations?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Robestos86",
                                                            "body": "And yet still came ahead of Ferrari last year? And were close in 2022 on the back of nearly a decade of dominance....",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Kevin_Jim",
                                                            "body": "It’s not like they are incompetent. That is clearly shown by the fact that Air Bender himself copied parts of the Merc design.\n\nIt’s just that they are organizationally, operationally, and strategically, a hot mess.\n\nLeadership is completely floundering. They have no idea what direction to go, and haven’t being able to crash the regs even at this point.\n\nTheir small efforts seem good, as other teams copy those, it’s the big staff that they suck at: aero flow which in these regs is mainly the floor.\n\nAir Bender is the absolute best at that. He personally designed most of the floor and the whole suspension because he knew that if they nail these, the platform would be solid to build on.\n\nWhich is exactly what Ferrari did this season.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Mindless_Let1",
                                            "body": "Vasseur is the reason.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "BeardedAgentMan",
                                            "body": "Ferrari now is def not a hot mess.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Garfield_M_Obama",
                                            "body": "Ferrari *was* a mess.  Outwardly they seem to be one of the happier teams with the most upward potential right now.  I hate Ferrari as much as the next guy, but don't let the red cloud your judgment.  There's a reason that many/most people rate Fred Vasseur as one of the top leaders in F1 and the core team he's building looks pretty solid.\n\nFerrari does pretty well when their management gets its shit together every couple of decades, and right now Vasseur and Elkhan seem to want to have a winning race team.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "frankyfrankwalk",
                                                    "body": "Vasseur seems to be making the entire Ferrari F1 organisation more relaxed and competent every month...I had no idea what to expect when they chose him but boy it looks like they made the right choice",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Intelligent_Poem_595",
                                            "body": ">Lewis knows Ferrari is a hot mess.\n\nI'm not seeing that hot messiness this season. Years past, very much so. I think Vasseur is righting the ship and making solid calls.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "sergerperf",
                                            "body": "Which team has it together the best right now. McLaren?",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "The_Nieno",
                                            "body": "Counterpoint: Fred Vasseur",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "giveanyusername22",
                                            "body": "He doesn’t believe it’s a shorter path to 8th. He thinks it’s a shorter path to a fuck load of cash",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Silver996C2",
                                    "body": "I disagree. He’s doing everything to get up as high as he can on the grid in qualifying and the highest finish he can for *himself*. If this happens to help the team from data or feedback that would be a byproduct of being out for himself - not a strategic plan to move Mercedes forward.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "slicknyc",
                                            "body": "he let russell pass at the suzuka gp",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Silver996C2",
                                                    "body": "And you ignored Imola…",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "slicknyc",
                                                            "body": "lol ignored? russell was the one begging to get p6 back cause he cooked his tires needing a pit stop to fend off perez who was over 30 seconds back. why should hamilton who finished on a one stopper give up anything?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Silver996C2",
                                                                    "body": "No… they basically told Russell it didn’t matter what he wanted to do as Hamilton was going to pass him anyway.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "slicknyc",
                                                                            "body": "the point is lewis is not looking for the highest finish. suzuka proves you wrong.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Silver996C2",
                                                                                    "body": "That’s ridiculous - he’s a racer - he is out for himself now.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "dl064",
                            "body": "Alonso said in 2015 or so that while he's a professional, he wasn't quite laying awake at night thinking how to find 0.001 the way you are in a title fight.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "psychohistorian8",
                                    "body": "not to compare myself to Alonso or Lewis...\n\nbut I kinda feel this way at my job\n\nsure I show up every day and give it my full attention\n\nbut I don't go above and beyond anymore",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "HomeInternational69",
                            "body": "Completely disagree. Hamilton absolutely still has that competitive fire underneath him. You could hear it a radio message in Miami where he was chasing Perez, telling the team to give him any power left in the car to get the overtake done. The car just simply can’t keep up with the RB, Ferrari or McLaren, and Lewis and George are gobbling up as many of the remaining points as they can.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Winstonwill8",
                                    "body": "God that message made me long for the times merc was a power horse. Even in sprint in China, when he was briefly leading he was exhilarated. (And he fought back from p18-P9\n\n\nHe has the fire, just can't fight with something that just isn't good at all. ",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "crownpr1nce",
                                    "body": "He's still racing, full of adrenaline and wanting to perform. Easing off for an F1 driver doesn't mean not caring if you get an overtake or not, if you get passed, finish outside the points, etc. But it wouldn't surprise me if he is not the last one to leave the office on Fridays like he used to trying to figure out the car setup. Or if he's not spending his Tuesdays wondering how to extract an extra quarter of a percent of performance. That's what easing off in F1 is. Of course on track you see a car you want to pass them. If not, retire.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "andrewthemexican",
                            "body": "Lewis had a rough first third/half of the season last year too. Russell was pretty often finishing higher at that time, but Lewis figured out the car and Russell had some more DNFs to make up the points difference between them",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Elrond007",
                                    "body": "Basically every season to be fair. But when he finds his groove later on he's unraceable as everybody had to find out so far",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bono5361",
                            "body": "That's not Lewis' mindset. He's one of the best in the most elite racing formula, he doesn't just give up. Idk if it's age or that the car has been moved away from his liking, but I have to disagree that Lewis would not exert himself for the team. He is a professional and one of the best the sport has seen.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "iameveryoneelse",
                                    "body": "I'm not sure....even the most professional people occasionally relax a bit when they've given notice and are taking a new job.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "figuren9ne",
                                            "body": "But he isn't a corporate executive, he's an athlete where his individual stats follow him regardless of team. Nobody will remember that Steve from accounting worked 5 extra hours each week, but they will remember if Lewis puts the w15 on pole.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "iameveryoneelse",
                                                    "body": "I mean, maybe...but the counterpoint is that he's already got his contract with Ferrari, and the W15 has practically no chance of a pole.  Nobody is going to remember or care if Lewis finishes 5th or 8th this year if he's putting in the work and winning races in next year's Ferrari.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "notallwonderarelost",
                            "body": "Couldn’t George just be pretty good?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RyukaBuddy",
                                    "body": "George is amazing and extremely unlucky. A season between him and Hamilton in a dominant mercedes would have been incredible to see.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "notallwonderarelost",
                                            "body": "Agreed, he is crazy underrated.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "MazeMagic",
                                    "body": "Never, its the same retort over and over, \"he's checked out\", \"he's not used to driving shitboxes\", \"he's thinking about Ferarri now, what's the point?\"\n\nMaybe your a 7 time world champion not beating Reddits favourite driver to shit on George Russell consistently who isn't any good according to half the people on here? But has won a race in the \"shit box\" and Lewis hasn't?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dblock1989",
                                            "body": "I don't think any rational person doubts George's ability. It is mostly his attitude that seems to turn people off",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Wgolyoko",
                                            "body": "I think it's pretty clear that Brazil had team orders to take absolutely 0 chances of fucking up the 1-2.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "MazeMagic",
                                                    "body": "So why didn't Hamilton out qualify him? Always excuses but never the facts. If he qualifies 1st, he wins. But George was faster.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "osfryd-kettleblack",
                                                            "body": "It's been a trend for a while now that George is better at qualifying but worse at racing.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Wgolyoko",
                                                            "body": "Bro Q3 didn't happen, MAG got his pole and Russel actually spun into the gravel... lmao",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "MazeMagic",
                                                                    "body": "Ok so we are ignoring the fact that George started the race in 1st place to fit the narrative. The sprint was called, Sprint Qualifying. Lmao the mental gymnastics.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Wgolyoko",
                                                                            "body": "Mate I don't what to tell you. If Q3 not happening is what it takes for Georges to \"beat\" Lewis in a race, it's not a good sign for him...",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "MazeMagic",
                                                                                    "body": "George has out qualified and beat Lewis in many races. But ok.. what's the head to head like so far this year? The point is. A 7 time world champion shouldnt be beaten by his team mate at all. He should be outperforming him easily and he isn't.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "codename474747",
                                            "body": "I'd say George's win has a lot to do with Max and Lewis colliding in that race\n\nWithout it, either one of them (though most likely Max) would've won it as his tyres went off...",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Toaddle",
                                            "body": "The thing is that it's difficult to rate George because he was on par with Lewis in 2022, the first year he drove in a top team with all the pressure that it implies (okay Lewis was playing with the setup but even when Lewis was better George was right behind) while in 2023 Lewis defeated him by a big margin.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "codename474747",
                                    "body": "Great over a single lap, not as good as some others at looking after his tyres seems to be the general consensus \n\nCan't say it's far off the mark tbh",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "notallwonderarelost",
                                            "body": "I mean he’s marginally worse than Lewis. No shame in that. He seems to be a better qualifier and giving Lewis a run. He gets dumped on way too much. Will be interesting to see what Lewis does against Leclerc though a very different situation as George came into Lewis team and Lewis is going to LeClercs team.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "musicartandcpus",
                                                    "body": "Wouldn't be the first time Lewis jumped into someone else's team and did well, that's what he did when he got to Mercedes. Not that I am expecting Lewis will show up and dominate Charles, but it isn't a new experience for him.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "BuzzedtheTower",
                                                            "body": "Lewis is also significantly older now. He moved to Mercedes in 2013 when he was 28. He'll be 40 when he moves to Ferrari. I'll grant you that he's like Alonso in that he's maintaining his absolute speed much better than the average F1 driver.\n\nBut still, he is undoubtedly past his prime. I think he'll had good fights with Charles, but I don't expect a stomping like during his title years. I also don't see Charles agreeing to play rear gunner to Lewis given that Ferrari is much more his team than Mercedes was to Nico",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "baldbarretto",
                            "body": "That really wouldn’t be consistent with the Lewis  we saw in his later years at McLaren—also a struggling team that had fallen from its former glory (of which Lewis was a part). Top top tier athletes like Alonso and Verstappen and Hamilton are not really in the habit of phoning it in or switching off that competitive intensity that’s so ingrained in them. During their working years as an athlete, it’s more natural than not for them to put in full effort. \n\nLewis has also been working with a new core training team since Angela’s departure. these initial transition years are particularly good ones for figuring out how they work together and how to extract the maximum from Lewis every week—because he’s not fighting for a title and has a little more time available. And even if he doesn’t think he can get a win in this year‘s Mercedes, why would he want to be soundly beaten by George (who is motivated) in his final season as the team’s senior driver and figurehead? It doesn’t make sense.\n\nHe may not be putting every last ounce of capacity toward improving the car or shoring l up the team for next year, but it’s very unlikely. he isn’t still trying to get the most out of himself.\n\nEdited typo",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "mochacub22",
                            "body": "Everyone did their part to get to p2 George included",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "banned20",
                            "body": "Lewis is performing fine. His only struggles are in qualifying and if you ask me that's an age thing and is not going to get much better.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "cfdn",
                            "body": "Copium",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "kaisadilla_",
                            "body": "> I’m kinda convinced that’s why Lewis isn’t performing atm - why bother? \n\nThat's not how you make it into F1. Alonso spent 4 years giving everything he could to drive a McLaren that was, at times, the worst team in the grid, to the best place he could. Do you think Hamilton will just not care?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mcninja77",
                    "body": "How can they deny him out? Can't quit anytime?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jaraxo",
                            "body": "He can, a company cannot force you to work for them (under UK law where they're based).\n\nI took it as a \"If you hire Newey I'm gone\" and the board sided with Allison.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ryde041",
                    "body": "This may be silly but why is it significant that Simone Resta is going to Merc and how would if influences Lewis’ decision?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cekeste",
            "body": ">James Allison, who took over as technical director last year in place of Mike Elliott, failed to give the turnaround that the German brand expected, but everyone recognizes the English engineer as having found himself too alone in a technical field which over time was literally looted.\n\n\n\nIt's impossible for us who are not his peers to tell, but Allison always struck me as someone valuable who Ferrari couldn't exploit. It doesn't sound like a bad idea to keep him as head, if the technical staff can be replaced.",
            "score": 694,
            "replies": [
                {
                    "depth": 1,
                    "author": "adeucan",
                    "body": "Plus you know, his wife died and he probably had some other things on his mind during that time.",
                    "score": 319
                },
                {
                    "depth": 1,
                    "author": "Broad_Stuff_943",
                    "body": "James Allison has never turned a team around. He’s very good at building on an existing good platform, though.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DisneyPandora",
                            "body": "Same with Toto.\n\nRoss Brawn and Michael Schumacher are more responsible for Mercedes dominance than Toto Wolff. Toto Wolff just took credit for it and the engine",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "No_Luck_5505",
                                    "body": "CEOs tend to do that.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Mug1wara1",
                                    "body": "And how is michael responsible for developing cars? Drivers don't do shit when it comes to developing cars. Its such a stupid myth. Giving feedback on the drivebility and set up of the car will not make next years car quick, let alone the car 2 years after. I guess we are also forgetting the whole new powertrain that was introduced in 2014 and is main reason that Mercedes was quick. Unless you think Schumacher was secretly an engineer and one of the best ones at that, how the hell do you figure out he was responsible for the 2014 car?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BuzzedtheTower",
                                            "body": "I think you're underestimating the role of the driver. No one is saying Michael, or any driver, is in the design room, making CAD schematics, and running CFD simulations. That's the engineering/design team's job. However, the designers can only create something they *think* should be amazing. The drivers then test it and give feedback to help shape the development of the car.\n\nSo if a characteristic of a car is that it isn't predictable in a medium speed corner, but it's fine in high speed and ok in low speed, they know where to focus in development. And then the positive changes they make will carry over to the next car",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "iguessnotlol",
                                            "body": "Good driver feedback is invaluable for developing a fast and drivable car. Schumacher is a prime exampe of that, you can look up how many laps he was doing around Fiorano back when testing was unlimited and how much praise he received from the engineers for his work. It was the best development team, including the driver.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "_mRKS",
                                                    "body": "Michael was known to have excellent knowledge about cars and wrenched together with the mechanics. Of course cars back then were less complex aerodynamic wise. But he had a feeling for the mechanical side of the car and could pin point issues and lead the direction that needed improving.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -29,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "count-of-tuscany",
                            "body": ">calling Ham \\*\\*\\*\\*er on their first day\n\nI would just like to clarify he said \"fucker\", and not... you know",
                            "score": 247,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Tomatosoup7",
                                    "body": "Bro that’s the worst possible way of censoring the word fucker, I was so confused",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "splashbodge",
                                            "body": "Yeh, why even censor it, you can say fuck here. Or anytime you censor it you keep the F and censor the rest. What an odd thing to do.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "MeisterHeller",
                                    "body": "I was gonna say that doesn't seem very \"playful\" at all lmao",
                                    "score": 91
                                },
                                {
                                    "depth": 3,
                                    "author": "IWillKeepIt",
                                    "body": "Yeah tf OP you gotta clarify man.",
                                    "score": 89
                                },
                                {
                                    "depth": 3,
                                    "author": "hicks12",
                                    "body": "thankyou for that clarification, I was thinking that didn't sound right and certainly wouldn't be playful haha.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Gooosse",
                                    "body": "Thank you. Geez who censors fucker and who does it like that!",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "MVites",
                                    "body": "I thought he called Hamilton a hamster and was weirded out why would you censor that",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "insurgentsloth",
                                            "body": "I read it as hamburger lol",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Rover_791",
                                    "body": "Bruh",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "imperatrixderoma",
                                    "body": "Lmao, I was like ???",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "PM_ME_YO_TREE_FIDDY",
                                    "body": "“Oh yeah bro just called Lewis fucking Hamilton the N word on their first encounter” isn’t as playful as you’d think lmao",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FormulaF30",
                                            "body": "I had to come this far to figure what else someone could have confused the edit with besides “fucker”",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "MrMSUK",
                                                    "body": "Omg people I'm so sorry. Meant the F word as per the \"beyond the grod podcast\". I didn't want to be rude so I censored most of the F word initially. Didn't realise until reading all the replies.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SubcooledBoiling",
                            "body": "Thanks for censoring the word \"fucker\". The lives of countless children were saved.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "splashbodge",
                                    "body": "In before Crofty apologises on their behalf to the poor UK viewers who had to hear that word",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "deathray1611",
                            "body": "You literally couldn't have made things look any worse with how you censored the word 'fucker' which makes me partly think you did it on purpose.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MrMSUK",
                                    "body": "My bad. Didn't know I could swear here. In the future will try to use quotation marks if referring to what someone said (even if rude) instead of blurring it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "deathray1611",
                                            "body": "Eh, happens to the best of us I guess. I mean, while initially I was like \"He said hwat!?\", when someone cleared it out it became pretty funny. Hence why I felt like it had to be intentional. Not a biggy",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "KerrinGreally",
                            "body": "There's no rules against swearing. Asterisks just make what you're trying to say ambiguous. Unless that's what you're going for for engagement? Pretty dumb either way.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MrMSUK",
                                    "body": "So sorry. Didn't realise I could swear here. Didn't realise that * made it wayyy worse. Apologies.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "boyeardi",
                            "body": "You know you can cuss on the internet right?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MrMSUK",
                                    "body": "Didn't realise I could swear here. My bad. Post editted. Apologies.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "GoldyZ90",
                            "body": "You gotta clarify what he called Hamilton lol. You can’t be having people think James Allison called Hamilton the N word.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MrMSUK",
                                    "body": "Frightfully sorry for this. Fixed. Didn't realise I could swear on here. Will aim to use quotation marks in the future, if the comment might be rude or just avoid it altogether.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ThordBellower",
                            "body": "err... what?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "BuckN56",
                            "body": "You censored that word the worst possible way lmao.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MrMSUK",
                                    "body": "Didn't realise. Fixed.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "thedeuceisloose",
                            "body": "Why did you make it look like he said the n word",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "blackeye1O1",
            "body": "Don't know how much of this is true but it's a good thing. After Newey, Allison is the most experienced person in the paddock.",
            "score": 233,
            "replies": [
                {
                    "depth": 1,
                    "author": "wowbaggerBR",
                    "body": "lol, Neil Oatley is much more experienced. And a big element on McLaren's ressurgence.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "20ol",
                            "body": "Biggest element of McLaren resurgence is Rob Marshall. Everything accelerated when he joined from RedBull. He was promoted to Chief Designer quickly.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Scotsch",
                                    "body": "According to McLaren he joined in january, can't have had that much impact yet.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrMSUK",
            "body": "Interesting that James was willing to tender resignation for Toto to secure Newey. Recognising that there can't be more than 1 Technical director.",
            "score": 445,
            "replies": [
                {
                    "depth": 1,
                    "author": "k2_jackal",
                    "body": "It was probably more of a if you hire Newey I quit thing vs a let me resign from this high paying job so you can hire Newey",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ecomystic",
                            "body": "I find that interesting cause not even a week ago James said he could work with Newey, the roles would just have to be clear",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CptAustus",
                                    "body": "Anything other than being Newey's peer would be a demotion, but Newey doesn't have any equals in the sport.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheRealArturis",
                                            "body": "Wasn’t Allison the one who designed the Previous Mercedes’? Including the 2020 one?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "icantfindfree",
                                                    "body": "His role in the design of this was very different to newey's in red bull, the two teams have very different structures for their development teams",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TheRealArturis",
                                                            "body": "I see. Still, you can’t exactly say Newey is unparalleled when it was under James’ direction that the most Dominant F1 car was ever created, not to mention the 6 World Championships",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "EddedTime",
                                                                    "body": "Was the RB19 last year not the most dominant car ever?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TheRealArturis",
                                                                            "body": "I think relative to the competition, that 2020 Mercedes W11 was so absurdly good. Perhaps most dominant is not correct, but Greatest overall fits",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "supersonic_lizard",
                                                            "body": "That sounds interesting. Can you elaborate what are the exact differencies between those two teams? Cheers",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "icantfindfree",
                                                                    "body": "From what I understand Allison's is far more involved on the managerial side of things whereas newey is more involved in car design though I reckon their jobs still overlap",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ferkk",
                                            "body": "Obviously I don't want to underestimate Newey's merits in F1 but... Talking like this about someone feels disrespectful for the hundreds of engineers that work in every F1 team.\n\nNewey (or Allison) don't design the car alone. Newey without a proper team of engineers wouldn't do shit. \n\nAlso, didn't Verstappen say that Newey's involvement with the current Red Bull car was... not too high? Well, to be more precise, he started by saying 'I don't say he wasn't doing anything...'. That's exactly what someone would say about another person not doing anything but trying to keep some respect to that person. 'I don't want to say X but...'. And Verstappen definitely knows more than us.\n\nI don't know if I'm being clear here, english is not my first language.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "I-hate-sunfish",
                            "body": "Allison was requested by Toto to return to F1 after he left to do boats\n\nKeeping his current job is pretty far down his priority list",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "jetssuckmysoulaway",
                            "body": "Let me go to Ferrari and Lewis type thing",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GoldyZ90",
                    "body": "F1 technical directors are like Highlander. There can be only one.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Skylair13",
                            "body": "Becomes more true post budget cap. Only 5 people's pay are exempt from it. The drivers, assuming no reserves, and 3 highest ranked people.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "MrMSUK",
                            "body": "This, I think.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "outm",
                    "body": "I would take it more like “if you think he is better than me and have higher trust on him and want him, then I’m of not use here, take my resignation”\n\nYou can only have 1 “big big boss of aero” and I doubt Newey or Allison would accept to be one below the other - also, they are not usually cheap, and only the top3 wages are not part of the cost cap, so having both (if you manage it) would be problematic and would lead to making cuts elsewhere\n\nEDIT: Just to add, also, it seems Allison is a bit “burned” on Merc, like in he is almost alone there compared to the last regs era - now, Merc had a big brain drain and a considerable amount of people from the aero department went into other teams. The aero isn’t made by Allison or Newey alone but a good working team. If your team is not there, you will be frustrated with mixed results.\n\nAlso, having to “fix” a car he put some bases at the start, and then evolved outside his direct input, so it’s like everyone is expecting to fix it suddenly on a cost cap era and without a proper team around supporting him.\n\nMust be hell to be there. And then, people will say “yeah… he is not that good! He had time already to fix it! Booo” people…",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Resident_Pop143",
                            "body": "This. There was really no way he was going to recover the car mid last year. He may get ‘25 right but he is probably hedging for ‘26.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "gomurifle",
                            "body": "Newey coexists with Pierre Wache so it's certainly possible. They would have to create a CTO position for Newey. ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "outm",
                                    "body": "I don’t think James Allison would be “below” Newey. Pierre Wache is under Newey on their hierarchy (until now, that is expected he will take control of that area).\n\nJames Allison = Adrian Newey\n\nPierre Wache < Adrian Newey (until now at RBR)\n\nSo it’s not a comparable situation",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "InZomnia365",
                    "body": "As I understand it, Allison is more of a \"whole picture\" kind of guy, which is exactly what Newey is. He doesnt get in the nitty gritty and design every part himself, but he oversees and has full control over the department that does. Having two people do that, doesnt work.\n\n\nThats also why David Sanchez and McLaren didnt work out. He wanted a similar role, but McLaren would rather stick to the current management style they have in place right now (and can you really blame them?), so it wasnt a good fit.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "drdinonuggies",
                    "body": "Wild way to take that lol",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Equitaurus",
                    "body": "Newey hasn’t been technical director for years now though",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "nigevellie",
                    "body": "Whooosh",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "scorpio1m",
            "body": "Don’t think Newey was ever interested in Mercedes. Kinda reeks of let me reject you before you reject me.",
            "score": 280,
            "replies": [
                {
                    "depth": 1,
                    "author": "IdiosyncraticBond",
                    "body": "Coukd be a case of he politely rejected them in private,  they rejected them in public \"to save their face\"",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HOHOHAHAREBORN",
                    "body": "Yup. When initial reports came out about Newey leaving and having finalized a deal with Redbull to exit, it was also mentioned he is not looking at two teams in particular:-\n\n1. Aston Martin: Newey believes Lawrence will sell the company by inflating the valuation via his brand name\n\n2. Mercedes: Newey believes it'll take too long to turn around",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Broad_Stuff_943",
                            "body": "I think newey has also said he’s not a fan of Toto.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Rivendel93",
                                    "body": "It's weird, I always liked how tough Toto seemed and how he always had Hamilton's back, but everything I've heard from F1 insiders is that he's the absolute worst. \n\nKind of surprised me because Susie seems so nice, but obviously that's his wife and not the people who work for him or he competes against.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mcas1987",
                                            "body": "That seems to check out with Mercedes' downward path and how people are jumping ship. It seems to me that most of the credit for Mercedes' dominance from 2014-2020 can be traced to the organization that Ross Brawn built between 2007-2013, and decisions Brawn made that had positive long term effects.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "GaryGiesel",
                                            "body": "It’s very easy to look like a god of business when you inherit a well-oiled machine and can massively outspend your competition 🤷‍♂️",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Broad_Stuff_943",
                                            "body": "Yeah same here on all counts.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HPL_Deranged_Cultist",
            "body": "James: I quit!\n\nTeam: No.\n\nJames: Okay :(",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sans45321",
                    "body": "Oversimplified type of script",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "yqry",
                    "body": "No James that’s not right - Toto, probably",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "carloslet",
                    "body": "[Same energy.](https://www.youtube.com/watch?v=0GMcdMDL3KQ)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "2R4Ronar",
            "body": "You're not rejecting me, I'm rejecting you.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "VictoriaBCSUPr",
                    "body": "Haha good Watchmen reference!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "slutforpringles",
            "body": "Translation:\n\nF1 | MERCEDES LOSES MORE... PIECES, BUT CLOSES THE DOOR ON NEWEY\n\nThe Star has probed the possibility of securing the \"genius\" who left Red Bull, but top management chose to give full confidence to James Allison. Mercedes continues to lose important pawns (also leaves Vino chief of aerodynamics). The restart will begin with Resta and Sampo arriving from Maranello.\n\nMercedes is no longer interested in getting Adrian Newey. The time, now, is up. The Star has no intention of waiting for the choices of the English \"genius\" because it intends to go its own way. Toto Wolff is in a very special moment in which the Brackley team is in a phase of full renewal, as if, having finished a cycle full of satisfaction and world titles, the phase has arrived in which it is necessary to build a new cycle.\n\n\n\nThe ebb phase has not yet ended: the exodus of leading figures has not yet ended. Out of the black-and-silver team comes Joachim Vino, head of the aerodynamics department. The Australian, despite his very Italian surname, begins his six-month gardening period after being an important ganglion of the team since 2018. In fact, Giacchino is paying for having headed the aerodynamic group at Brackley since 2022, that is, leading the cycle of three cars (W13, W14, and W15) that, with the ground effect regulation, did not yield the results the Star expected.\n\nJames Allison, who took over last year as technical director in place of Mike Elliott, has failed to provide the turnaround the German brand expected, but everyone acknowledges the British engineer has found himself too lonely in a technical sphere that has literally been plundered over time. Apparently, James was willing to tender his resignation, which was also rejected by the top management of the company, and the future must come through Allison's experience.\n\n\n\nIn addition to Vino, Loic Serra, the Frenchman who will be coming to Maranello from October 1, along with Jerome d'Ambrosio, Toto Wolff's right-hand man who will be Ferrari's vice-team principal, so he will answer only to Fred Vasseur, also left in April. The operation to strengthen the Scuderia comes with the...emptying out of Brackley, but the Mercedes strengthening also starts with the acquisition of two figures from the Cavallino.\n\nIn October, Simone Resta will arrive: the engineer from Imola, who has been Haas' technical director for three years and was not part of Enrico Cardile's plans to keep him away from Sport Management, will be the designer to whom Mercedes will entrust the design of the 2026 single-seater with the new regulations.\n\nThe Star is also banking on Enrico Sampò, the simulation specialist, an area where Wolff's team seems to have lost some steam: the Italian, in fact, will be head of performance software applications.\n\nMercedes is not putting itself in the upside game of Adrian Newey, who is willing to settle for another team, but without taking on any technical responsibility, preferring a consultant role available two or three days a week, working in out-sourcing and without the obligation to go regularly to the factory.\n\nToto Wolff, then, wants to build a new technical team by looking for resources that can be integrated into a staff that needs to be reformed from the ground up.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "Roddy-the-Ruin",
                    "body": "> F1 | MERCEDES LOSES MORE... PIECES, BUT CLOSES THE DOOR ON NEWEY\n\nTitle is editorialised.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "Typhoongrey",
                    "body": "Last I heard, Vino was fired from Merc rather than left of his own accord.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ecomystic",
                            "body": "yes he was fired to make way for Serra and Sampo, also it feels like nobody read the translation and are commenting based on the title like usual, Seems like James failed to make a winning car, was willing to resiggn and merc said no, it has nothing to do with Newey",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MSgtGunny",
            "body": "Employee salaries being part of the cost cap is killing F1. The main cap should encompass, testing, parts, simulation, etc. Let employees get paid what they should be in a fair competitive market. I wouldn't be surprised if the team heads worked with the FIA on the cap so they can reduce their employees salaries even more. It's a play on emotion, \"sorry, we can't give you a raise because then the car would be slower since we couldn't afford xyz, and you wouldn't want that would you? Why are you putting your needs ahead of the 'team'?\"\n\nIt's like an executive driven union agreement and it's a bit sickening honestly.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "keyboard_A",
                    "body": "Exactly, imo the employees should be limited by quantity and not money, you can have 400 engineers at maximum, then it will be like a fantasy game, teams will have to pick the best of the best and pay them their correct value.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "planeswalkered",
            "body": "Buongiorno, Adriano! The Newey x Hamilton dream  collaboration hopes continue to stay alive🏎️🏎️",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Old-Statistician1124",
            "body": "I am no longer interested in dating Christina Hendricks",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BiblaTomas",
                    "body": "Lol!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "eugene-fraxby",
            "body": "Translation: He turned them down.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InfiniteJackfruit5",
            "body": "Bottas got out of that team at precisely the correct moment.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "kalamari_withaK",
                    "body": "Russell is going to be the Harry Kane of F1",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Oceansnail",
                    "body": "kicked out at precisely the correct moment FTFY",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Delictable_Scrotum",
            "body": "Honestly all the newey speculations is just overblown. The man is loaded and just bought a yacht, I doubt he'll return until 2026.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gutster_95",
            "body": "Newey is either Ferrari or Retirement. Dont know why people actually believe that Mercedes or Aston Martin had a chance",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jo0Lz",
                    "body": "He might actually go to Williams. 👀",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "KLconfidential",
            "body": "I highly doubt that he was interested in going to Mercedes anyway.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dragonpuncha",
            "body": "“You can't say reject me, because I reject you!”",
            "score": 1
        },
        {
            "depth": 0,
            "author": "silentkiller082",
            "body": "this translated in my head to \"Newey was not interested in coming to us so we are just going to continue on with Allison.\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gumarik",
            "body": "Newey is going to sign for Ferrari and it is the best natural outcome.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "bookers555",
                    "body": "Not like it will matter much.\nThe coming regulations are like 2014-2021, Newey himself said that aerodynamics won't be able to compensate having a bad engine.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Chief_34",
                            "body": "I mean if everyone has a bad engine then the difference will be aero",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bookers555",
                                    "body": "If everyone has a bad engine the difference will be who survives.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Chief_34",
                                            "body": "I was thinking more poor performance, but yes reliability as well.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AgitatedQuit3760",
                            "body": "Ferrari have produced a decent engine here and there",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Cody667",
                            "body": "And we're gonna have 6 different engines to boot. Could be a bit of a shitshow lol.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bookers555",
                                    "body": "\"Could\" is a misunderstanding, I expect a return to the glorious days of the early 2000s when it comes to DNFs, at least for 2026.\nAnd may god have mercy on their souls if it rains on any race that season.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "2R4Ronar",
                            "body": "So 8 more years of Mercedes domination incoming then?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RX0Invincible",
                                    "body": "Mclaren will be using the same engine so if they can’t fix their aero then the best they could hope for might be a comfortable 2nd in the wcc",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dac2199",
                                            "body": "If Mercedes is the best engine, Mercedes Team will have the priority.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ofallthescotchjoints",
                                                    "body": "Priority for what? They have to give them the same engines, and McLaren will have visibility into packaging, etc",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "dac2199",
                                                            "body": "Because Mercedes will prefer that their own team win instead of their client.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ofallthescotchjoints",
                                                                    "body": "So you’re just stating things without knowing how engine customer relationships work nowadays? Got it",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "dac2199",
                                                                            "body": "I think you are the one who doesn’t know that. But ok, I won’t change your mind.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ofallthescotchjoints",
                                                                                    "body": "Here’s a bit of education since you’re so intent on being wrong \n\n“On the 2024 F1 grid, there are four engine suppliers - Ferrari, Honda RBPT, Mercedes and Renault - split amongst the 10 teams in which regulations state that a customer outfit must get the same quality engine as the factory squad.”\n\nhttps://www.autosport.com/f1/news/which-engine-does-each-f1-team-use-in-2024-/10598000",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "YellowDiaper",
                                                                                            "body": "Jokes on you, he can’t read.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HelixFollower",
                                                                    "body": "Yes, but how are they going to prioritize their own team engine-wise?",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "IdiosyncraticBond",
                                                    "body": "It is up to Mercedes to build the proper car around the engine. Customer teams can do the same, as McLaren currently shows a customer team can be better than the suppliers team",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "dac2199",
                                                            "body": "Because Mercedes will prefer that their own team win instead of their client.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "IdiosyncraticBond",
                                                                    "body": "Yeah, but there's nothing they can do about other teams, just their own team.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "RX0Invincible",
                                                    "body": "Priority in regards to what? They can’t sell an inferior version of the engine, only the aero will be the difference",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "dac2199",
                                                            "body": "Because Mercedes will prefer that their own team win instead of their client.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "RX0Invincible",
                                                                    "body": "Yeah but you’re not specifying what specifically Mercedes can prioritize to do something to make up for their aero deficit since they have the same engine\n\nThey are literally obligated by the rules to give the same quality of engines as their own to their customers.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "bookers555",
                                    "body": "Honestly I think the people better poised for the next regs are McLaren.\nFerrari in the past decade has needed a couple seasons to get their engines right, Red Bull is developing their own engines and I honestly doubt they'll nail it from the get go, and Mercedes is just suffering from too much brain drain.\nAston Martin is a wild card because they got that deal with Honda, it could either go really well or it could be GP2 Engine 2.0, though that also depends on whether they can finally get their shit together and make updates that work.\n\nBut right now is hard to say, the current regulations are just a very unusual thing in that they are focused on ground effect AND the engine development is frozen so the only way to improve performance is through aero, a situation that's going to change completely in 2026 due to the new regs but also because the engine development freeze ends with the 2025 season.\n\nIn fact I have my suspicions that Newey might be waiting to announce his next move in case there's no changes to the upcoming regs and that, if he was right, he might just retire.\nI mean, this is obviously going to be his last contract, and he might not want to be working into his 70s if he feels like his work isn't too relevant, though that's entirely my own hypothesis.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dac2199",
                                            "body": "McLaren will use Mercedes engine for the new regulations. So they won't have priority.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "GeraldFisher",
                                                    "body": "what priority? stop talking nonsense already.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ohiowolverine",
                            "body": "Mercedes is gloating like it is there problem if it is 2014 mclaren looks like the Mercedes engine champion",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Chief_34",
                    "body": "Anyone who read his book has gotta be thinking he’s going to Ferrari. He’s nearly signed with them multiple times and he expressly stated his desire to work for them one day. He never did due to a combination of not wanting to uproot his young family and working with those he knows well in England. His children are now older adults, he’s been divorced, and he has a new wife with whom he doesn’t have children.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Aff_Reddit",
                            "body": "And Lewis is there.\n\nTwo birds, one stone.\n\nWorking with Ferrari, working with Lewis, and the potential of winning a WDC with Ferrari is massive.\n\nNot to mention (if anything like the last offer), the potential to control Ferrari's road cars is massive.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SommWineGuy",
                    "body": "Hopefully not.  I'd rather see him return to Williams or go to Andretti.  Either would be better for the sport than him going to a team already fighting at the top.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "XOVSquare",
            "body": "To be fair I don't think Newey was interested either. I'm sure Verstappen will also be looking at this and making his decision if he hasn't already.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NinjaSpartan011",
            "body": "Cmon McLaren 😂",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Zodiac4v2",
            "body": "Mercedes success really went to their head and they couldn’t react when someone finally caught up.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Catswearingties",
            "body": "\"Just when I think I'm out, they pull me back in\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ispita",
            "body": "I want Newey to go to Ferrari because they really need a championship win but more and more I realise for the sake of the sport it would actually be better if he wouldn't join any team.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BigSlothFox",
                    "body": "He's not a superweapon 😊 and even if he was, a team can't change it's entire car design just like that, even if they knew exactly what to build. These things take time, so you have to make compromises etc. Also isn't newey a bit overhyped? It's not like every car he built was a success or am I wrong?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Typhoongrey",
                            "body": "He's designed his fair share of stinkers too.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nolnogax",
                                    "body": "MP4-18 and ...? Honestly, I'll wait.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Typhoongrey",
                                            "body": "RB11 as well. \n\nI know they blame Renault but it was a bad car overall by their own admission.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gullinkambi",
            "body": "Why _the fuck_ is there a popup that looks like it will translate the page, but actually redirects you back to a different home page instead of the article I was trying to read??? Wtf, motorsport. I would like to read the article I am trying to read, please. Not a different article altogether.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "primavera31",
            "body": "hello darkness, my old friend..",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GenderFluidFerrari",
            "body": "Here comes Andretti!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hadronmachinist",
            "body": "Damn, we were so close to a \"James, it's Adrian\".",
            "score": 1
        },
        {
            "depth": 0,
            "author": "coriolisFX",
            "body": "Translation: they couldn't sign him and are trying to still hold their head up about it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SaturnRocketOfLove",
            "body": "Conspiracy theorist's opinion, but what if both James and Adrian want a spot at Ferrari and James thought he found a way to secure it by locking Adrian in at Merc...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NlNJALONG",
            "body": "Mercedes spin zone undefeated",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Gubrach",
            "body": "It's like Drake being no longer interested in Rihanna because she chose A$AP Rocky over him.\n\n\nNo Kendrick fans in here I see, yikes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KingBlue2",
            "body": "Newey is overrated",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LordBogus",
            "body": "I dunno, you wanna keep allison but I rather would want someone who won 20+ championships and made succesgull ground effect cars rather than someone who didnt\n\nAlso, what kind of role does newey want??? Redbull style again or full technical director?",
            "score": 1
        }
    ]
}