{
    "title": "[Luke Smith] Drivers asked in the FIA presser about their favorite films, their picks are: Ocon: The Dark Knight Rises, Tsunoda: Transporter, Russell: Casino Royale, Verstappen: Wolf of Wall Street or The Hangover, Albon: The Grand Budapest Hotel, Leclerc: Harry Potter",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "[The **News** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_news) is reserved for submissions covering F1 and F1-related news. These posts must always link to an outlet/news agency, the website of the involved party (i.e. the McLaren website if McLaren makes an announcement), or a tweet by a news agency, journalist or one of the involved parties.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BillyHoyleAnd1",
            "body": "Now we know where Tsunoda got his driving style from.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CandidLiterature",
                    "body": "He literally loves Jason Statham. I’m sure I haven’t just hallucinated an interview where he says he wants him to play him in a film about his life.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DoritoBenito",
                            "body": "Well shit, now *I* want that movie -- just Jason Statham walking around on his knees with a terrible wig, acting out Yuki's journey to F1.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OppositeYouth",
                                    "body": "Oh that makes more sense. For some reason I thought Yuki wanted to play Jason in a film about Jason's life",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Cyberhaggis",
                                            "body": "Either way I'd watch the shit out of it",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "djblackprince",
                                            "body": "It's the summer blockbuster to end all blockbusters. This July see Yuki Tsunoda as he takes out the bad guys in Mechanic 2.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LivingInTheStorm",
                                                    "body": "Numbered titles are out let's call it Resurrection",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "_Spare_15_",
                                                    "body": "What about a Crank sequel",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "LivingInTheStorm",
                                            "body": "Yuki played by Staham meeting Jason played Tsunoda at Abu Dhabi",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "boredofredditnow",
                                    "body": "If we get to see Statham beat up whichever actor plays Nikita Mazepin after the 2020 F2 Spa race where Mazepin nearly punted a board into Yuki then I’m so there for it",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "SatisfactionKooky435",
                                    "body": "Jason has already played Stroll in a film, we'll, I think that's what Death Race was.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "j__video",
                                            "body": "Weird, i thought it was a documentary on the career of Romain Grosjean",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "GBreezy",
                                    "body": "It's like a somehow worse version of Connery in You Only Live Twice",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "irspangler",
                                    "body": "I don't think Jason would need to walk around on his knees. He's a short king just like Yuki. Hell, that might even be another reason why Yuki loves him!",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BillyHoyleAnd1",
                            "body": "ya, I think there are recent pictures of them together.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ICumCoffee",
                                    "body": "[he got to meet Statham at Abu Dhabi last year](https://www.instagram.com/p/C0QbSEJIo8K/?igsh=MTFteWhmaDduMmxwaw==)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PradaAndPunishment",
                                            "body": "The camera crew reflected in their shades lol",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "endichrome",
                                            "body": "This is my Mona Lisa and I will keep this above my baby's crib in hopes that it inspires it to chase what they tell you can't have. Lets go Tsunoda",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "GP2_user",
                                            "body": "There was also a video of it on the Alpha Tauri YouTube channel (not sure if it's still there now that they've rebranded) where we see Yuki's reaction to meeting Statham. He was super chuffed.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "naumectica",
                    "body": "Damn the driving style. We understand where Tsunoda gets his English from.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "endichrome",
                    "body": "I find it so interesting and beautiful when a person from a completely different world, in many senses, finds a connection with a person I could never ever imagine being together. The juxtaposition of Tsunoda and Statham is bisarre and beautiful and oh god i just saw a photo of them together, man life is beautiful after all. it's the little things and I hope Tsunoda never loses his affection for Statham, life would lose some of its magic. Maybe I need a Statham",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Poopy_sPaSmS",
                    "body": "More Death Race than Transporter.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "dhruvgeorge",
                    "body": "And where he learned to swear like a sailor",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ICumCoffee",
            "body": "Also George just revealed in the conference that he has a video of Charles from 2012 pretending to be a wizard.\n\nCharles replied: “Keep that video to yourself”\n\nEdit: [George showed the photo of Charles on a broom ](https://imgur.com/a/YJS92BE)\n\nEdit 2: [apparently, it’s not the only time Charles had done this ](https://imgur.com/a/nHY1i9c)\n\nEdit 3: [Video from Press Conference](https://x.com/F1/status/1793667173736476866)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fragrant_Spirit3776",
                    "body": "Bro has been keeping RECEIPTS lmao",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "_box_box",
                            "body": "the fact that he kept that photo for what, 14 years….😂",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TehAlpacalypse",
                                    "body": "Mans doesn't get to become head of the drivers association for his tea brewing abilities",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Lanky_Relationship28",
                                    "body": "The second photo looks way more recent.\n\nBut I'm impressed at how easily George found the photo on his phone.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bono_my_tires",
                            "body": "George Russell the kind of guy to blackmail you forever and have it ready at a moments notice",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "samdiatmh",
                                    "body": "really makes you think what was on his \"powerpoint\"",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "georgeb4itwascool",
                                    "body": "George Russell the type of guy to make a joke in his best man speech about how crazy you were acting at your bachelor party even though you just played top golf with the boys, and now everyone thinks you cheated at your bachelor party. And then he asks you if he can take home a bottle of veuve from the open bar.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EveningRing1032",
                            "body": "On speed dial 🤣",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "caj69i",
                    "body": "I never knew I needed this so much.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ceceeparker",
                            "body": "It's not a want, it's a need.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IdiosyncraticBond",
                                    "body": "It's a broom, not a wand",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "jedifolklore",
                            "body": "And he’s a Ravenclaw? Now I need the grid to do a house sorting ceremony..",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lobsters4",
                                    "body": "Max is 100% Slytherin.  I'll never believe otherwise.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dorgilo",
                                            "body": "Bottas is Hufflepuff",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "razorracer83",
                                                    "body": "LOL! Yeah, I can't see Bottas as a Gryffindor, Slytherin, or a Ravenclaw. He just screams Hufflepuff.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "caj69i",
                                            "body": "I'd say Slytherin in the badass way, \"don't care about anything else, let's make some progress\".",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "razorracer83",
                                    "body": "I can honestly see him being a Ravenclaw. I took the Harry Potter sorting exam myself and also was sorted as a Ravenclaw. He just exhibits many of the values of one.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "hzfan",
                                    "body": "Here’s where I’d place them off the top of my head\n\nGryffindor\n•\tCheco\n•\tYuki\n•\tGasly\n•\tSargeant\n•\tMagnussen\n•\tHulkenberg\nHufflepuff\n•\tLando\n•\tOscar\n•\tRicciardo\n•\tBottas\n•\tAlbon\nRavenclaw\n•\tLewis\n•\tCharles\n•\tCarlos\n•\tOcon\n•\tZhou\nSlytherin\n•\tMax\n•\tGeorge\n•\tAlonso\n•\tStroll\n\nI feel least confident about Hulk at Gryffindor. I could see him at Hufflepuff and Ravenclaw too",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jedifolklore",
                                            "body": "Nice list! Hulk, because of his Magnussen comment back in the day I see him as a proper Gryffindor. Also Lewis at Ravenclaw, I see the vision, Carlos is definitely one, Ocon has to be a Slytherin, Gasly is more Hufflepuff",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "The69BodyProblem",
                            "body": "Can I offer you this video as a consolation prize?\n\nhttps://youtu.be/cNPGDx7nBw4?si=Bdiuk3OGCnETkuf1",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "gramathy",
                                    "body": "covid was a weird time man",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "musef1",
                    "body": "I like that he must have had that picture to hand for the right moment.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MrGoldilocks",
                            "body": "Wait, so you don't have a folder of Charles Leclerc photos to look up when the need strikes?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lobsters4",
                                    "body": "\\*hides my phone behind my back\\*  No....?",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Zipa7",
                                    "body": "George has blackmail on everyone, sorted into files on his phone, like a professional blackmailer.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "shewy92",
                            "body": "George made a powerpoint to get into Mercedes. Him having a folder of drivers' doing silly things doesn't surprise me.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Extinction-Entity",
                                    "body": "Omg did he really?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "pablos4pandas",
                            "body": "Dude whipped out the meme folder at work. What a legend",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kevin_Jim",
                    "body": "Ferrari had taken huge steps forward from 2012. The car is almost unrecognizable.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IdiosyncraticBond",
                            "body": "It's a Nimbus 2001",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "stomp224",
                            "body": "A magical transformation",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "oursfort",
                    "body": "lmao, the second photo tagged as \"may contain erotic imagery\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "insurgentsloth",
                            "body": "And rightly so!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "frocodile191",
                    "body": "Kinda hilarious that Imgur said the post contains erotic or adult imagery.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Street-Dependent-647",
                    "body": "So after F1 Charles will be captaining the Monegasque Quiddich team? The fanfiction crossover basically writes itself.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "SpaceOdysseus23",
                    "body": "The best part about this is that he's most likely changed 5-10 phones since then but always decided that the picture stays lmaoo",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ICumCoffee",
                            "body": "It’s most likely backed up to his iCloud",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NCC-72381",
                                    "body": "His password is cr1key63.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Lobsters4",
                    "body": "Well now I love Charles even more.   LOLLLLLLLL.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ExiledinElysium",
                    "body": "I am new to the sport and have so far not understood people getting rabidly obsessed with one driver. I get it now. I'm a LeClerc fan for life. \n\nNow to get in character: \n\nI'm so stupid. So stupid.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Oukaria",
                    "body": "I love it that the whole group just get along and have fun, been a while we had a grid with so many drivers just having fun with each other and a laugh like that ? Always had been groups that like each other but this is even bigger",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "RayneShikama",
                    "body": "George just been holding on to that to use as blackmail one day.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "formulapain",
                    "body": "Is it a Nimbus 2000, and does it have the upgrade package?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CDNChaoZ",
                    "body": "Noicely done George, noicely done!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "azn_dude1",
                    "body": "send da video",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "AnteatersEatNonAnts",
                    "body": "I love Charles’ hat, but I don’t think anybody else could pull that hat off",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Danjiks88",
                    "body": "EDIT2: Looks like photshop to me, but Im no expert",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "GrapefruitAlways26",
                    "body": "Wingadrium Leviosa!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gonzo5622",
                    "body": "Lmao!! Omg this is so good!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "charlierc",
                    "body": "I like how much these photos remind me of George Michael from Arrested Development pretending to be a Jedi",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "FecusTPeekusberg",
                    "body": "Strangely enough, there's a youtube video out there where it's Harry Potter asmr, and the picture used for it does look a hell of a lot like Charles.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Hapless_Buffoon",
                    "body": "good for him",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CarsCarsCars1995",
                    "body": "Everyone: \"Don't worry about that embarrassing thing. No-one else remembers\"\n\nGeorge Russell:",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Shirdel",
                    "body": "Does that photo look like it's on Gambon Corner to anyone else?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "kerc",
                    "body": "George Russell is Tom Wambsgans!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DaleDimmaDone",
                    "body": "Bro why does George look like someone whose wearing a mask that's too small for them. That picture legit looks AI generated",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "martindines",
                            "body": "Yeah something is off with this photo. Some of the sponsor's logos are completely mangled",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "hjhof1",
            "body": "It’s amazing how on brand these are",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "edin_dzekson",
                    "body": "Russell couldn't be more British if he tried",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fudge_is_1337",
                            "body": "To be fair it's a cracking film, good pick",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "R_V_Z",
                                    "body": "It's like a top 3 Bond movie for anybody who cares about rating Bond movies.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "aetp86",
                                            "body": "I'd argue top 1.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "myersjw",
                                                    "body": "100%. If you need to see one bond film it’s that one",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Usaidhello",
                                            "body": "Absolutely agree. Which are the other 2?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "R_V_Z",
                                                    "body": "It usually depends on what you're partial to, but FRWL, OHMSS, Goldeneye, and (my dark horse pick) License to Kill are usually all in contention.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Scotsch",
                                                            "body": "Which are those to us mortals",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ParlayVooAndale",
                                                                    "body": "From Russia with Love (Connery) and On Her Majesty’s Secret Service (Lazenby).",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "therl2000",
                                                                            "body": "Simon Lazenby was a brilliant Bond",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "saberline152",
                                                                                    "body": "wasn't it george lazenby in the film tho?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "therl2000",
                                                                                            "body": "Simon Lazenby is a Sky Sports F1 presenter",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "James_Vowles",
                                                                                                    "body": "in his spare time",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "SureReflection9535",
                                                            "body": "Great choices, think I give the nod to Goldeneye, Casino Royal and Skyfall in that order, but the Dalton movies fucking slap too",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "GooneyBird36",
                                                            "body": "I'll never understand the love for OHMSS. Beautiful setting, beautiful Tracy Bond..... and that's about where all my praise ends.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "kymri",
                                                            "body": "License to Kill (and to a lesser extent, The Living Daylights) are underrated, IMO.  Dalton's Bond is very on-brand for the books.  Plus they're both fun rides in their own way.\n\nGoldeneye has to be top 3, absolutely.  So much greatness in that, including Sean Bean as 006.",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Fart_Leviathan",
                                                            "body": "Sounds like you have good taste.\n\nI'd say a lot of people also put Goldfinger up there. Wouldn't personally agree with it, but I've seen it rated as one of the top 3/5 more often than On Her Majesty's Secret Service or even From Russia With Love (despite that one being the best actual spy movie in the series and probably the best Bond outside Casino Royale).",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "PrestigiousWave5176",
                                                            "body": "What about Skyfall though? It's better than Casino Royale imo.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "R_V_Z",
                                                                    "body": "It has even worse plot convenience than The Dark Knight. If it wasn't for all that in the second act it'd be up there.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "XsStreamMonsterX",
                                                            "body": ">License to Kill\n\nAnother Dalton enjoyer I see.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Sensitive_Klegg",
                                            "body": "Pretty much anyone English then",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "JCAMAR0S117",
                                    "body": "I mean, that's assuming he's talking about the '06 Craig film and not the '67 Niven disaster lol",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "mostlygroovy",
                                    "body": "Possibly my all time favourite.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "baldbarretto",
                            "body": "He must have been punching the air as a rookie at such a British team through and through, watching Verstappen and Gasly do the tuxedo racing suits and bond promo",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Fenrir-The-Wolf",
                            "body": "I can think of a few ways of topping Bond tbf. The Bridge on the River Kwai, Waterloo, Zulu, Sharpe.. I could go on. Bond is up there though.\n\n(Waterloo will forever be one of my favourite films just for those cavalry charges, it's proper cinema, and I doubt we'll ever see anything like it again, not on that scale)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nonchalanthoover",
                    "body": "lol Albons is my fav",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Son_of_Mogh",
                            "body": "Same, what a man of culture.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "terminbee",
                            "body": "That's a very Albon pick.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "hjhof1",
                            "body": "Personally I couldn’t stand the movie but it’s on brand for sure",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PPLifter",
                    "body": "Max and the Hangover caught me off guard.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Suikerspin_Ei",
                            "body": "I mean, have you [see him drunk?](https://www.youtube.com/watch?v=qKixKGUzSdA)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GrapefruitAlways26",
                                    "body": "He has 0 memory of any of this lmao",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ARL_30FR",
                                            "body": "He literally says he remembers that night pretty well in the clip lol. The perks of knowing Dutch I guess.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "GrapefruitAlways26",
                                                    "body": "Well shit, yeah I don't speak Dutch, wouldn't have guessed it seeing how trashed he looked hahaha",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ARL_30FR",
                                                            "body": "It's a fair assumption lmao",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Objective_Piece8258",
                            "body": "nah his choices are the most unsurprising",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "charlierc",
                    "body": "Given how much Spider-Man stuff Ocon has got in the F1 Secret Santas and how much he has said he loves Spider-Man, I'm surprised it was another superhero that he picked",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Uroshirvi69",
                    "body": "Surprised Ocon’s favorite is a Batman film as opposed to a Spider-Man film",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Specialist_Seal",
                            "body": "Just baffling he'd pick the Dark Knight Rises over the Dark Knight",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CaptGeechNTheSSS",
                    "body": "Of course Ocon chooses Rises of all three",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "JKBFree",
            "body": "All these could not be more on point to their personalities.\n\nIf they asked the other drivers, i’d imagine:\n\n- Hulkenberg: rocky iv\n\n- nando: sicario\n\n- lando: spiderman no way home",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "drumjojo29",
                    "body": "Lando picking one of the Tom Holland Spider-Man’s is just funny \n\nAlso a big W from Alonso",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Cutlass0516",
                            "body": "Considering that Lando and Zak give off Peter/Happy vibes",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JKBFree",
                                    "body": "OMG SO TRUE",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "JKBFree",
                            "body": "Well, i totally made these up!",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "PerspectiveNormal378",
                            "body": "Sicario is such an underrated movie, assumed it was just another action flick when I chose it but boy was I wrong",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Grizzybaby1985",
                                    "body": "Pretty sure Sicario is not underrated it’s rated very highly ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "_runthejules_",
                                            "body": "yeah maybe underacknowledged because lots of people never watched or heard of it",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "redsyrinx2112",
                                                    "body": "Yeah that's a good way to put it. People typically love it when they actually see it. The problem is that it's not a super famous movie.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "JKBFree",
                                            "body": "One of villnueve’s better movies. They had the audacity to make a sequel.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "purse_of_ankles",
                                            "body": "Agreed - in film circles it’s highly regarded",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "The_James_Bond",
                                    "body": "It was literally nominated for an academy award, definitely not underrated, appropriately rated as a masterpiece",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "BowieObscura",
                                    "body": "It's so fucking good. Easily Emily Blunt's best role too.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "KuyaGTFO",
                                            "body": "Ahem Devil Wears Prada would like a word\n\nJK it’s probably tied with Arrival for one of my favorite Villeneuve movies I’d happily watch on a whim",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Fudge_is_1337",
                                                    "body": "She's great in Edge of Tomorrow as well",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "amedyth",
                                                    "body": "Devil Wears Prada is my guilty pleasure movie. I have zero fashion sense but love that movie lol.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "GetawayDriving",
                                            "body": "Tie between this and Edge of Tomorrow for me. Which is an ACTUAL underrated movie.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CycleV",
                                                    "body": "\"The thrill of a movie like Edge of Tomorrow is in watching a star appear fully high on himself. No one is a bigger Tom Cruise junkie than Tom Cruise. He makes the Robert Downey Juniors and Matthew McConaugheys of the world look like Walter Cronkite. \"\n\nfrom Wesley Morris/Grantland's review \n\nedit to add another quote from the review: \"Edge of Tomorrow is Full Metal Jacket taking two War of the Worlds and waking up inside a version of Groundhog Day that’s been held hostage by Private Benjamin.\"",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "drumjojo29",
                                    "body": "Same for me. Watched it shortly after it came out via „streaming“ and had no idea what it was about other than „FBI and CIA go boom boom“. It’s also the only movie I know that utilizes the [Mexico filter](https://amp.knowyourmeme.com/memes/mexican-filter) in a good way. ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sundark94",
                                            "body": "My first watch of Traffic, I was annoyed by the Mexico filter and Washington filter. But you do get used to it... or maybe the story makes you see beyond it.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Oukaria",
                                            "body": "Saying it's a mexico filter kinda hurt, Roger Deakins is one of the best cinematographer ever !",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "drumjojo29",
                                                    "body": "It does switch to a more yellow/orange tone for every scene in Mexico, that’s a fact. So you could call it a Mexico filter without any judgement. But it’s utilized as a way to convey the danger that Mexico carries in that movie. And that’s what makes it amazing and a good visual storytelling device that gives it a certain vibe beyond „hey, look, we’re in Mexico“. ",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Makyura",
                                                            "body": "And then Villeneuve + Greg Fraser takes that to the extreme in dune 2, filming geudi prime in an incredible way",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TheCrudMan",
                                    "body": "I mean Sicario tricks you into thinking it's not just another action flick before revealing that it's in fact just another action flick.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "gilgobeachslayer",
                                    "body": "It’s good but Prisoners and Arrival are better. Incendies too probablt",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PerspectiveNormal378",
                                            "body": "I like sicario and prisoners for different reasons. I haven't watched incendies yet, and it's been so long since I've seen arrival, and I just can't hack Blade Runner for the life of me.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "gilgobeachslayer",
                                                    "body": "Yeah Blade Runner 2049 wasn’t bad but it wasn’t good either.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "008Gerrard008",
                            "body": "They didn't actually pick those, that person just made them up",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "real_with_myself",
                            "body": "Well, he is more mature than others.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "naftalanga",
                    "body": "- Sergeant: the walking dead",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JKBFree",
                            "body": "Oh nooooooooooo",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Sensitive_Klegg",
                            "body": "Ooof",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "black-dude-on-reddit",
                    "body": "Are we sure Hulk wasn't in rocky IV cause the resemblance to Drago is unccanny",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ButthealedInTheFeels",
                    "body": "KMag: Death Race or Mad Max",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "The_James_Bond",
                    "body": "Me and Fernando have the same favourite movie? Let’s fucking gooo",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fantuckingtastic",
                            "body": "Alonso and Alejandro: Old Spanish speaking, masters of their craft that are seeking a return to glory(3rd movie/3rd championship)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "The_James_Bond",
                                    "body": "A 3rd glory that will probably never come 😔",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "chickenalfredogarcia",
                            "body": "Poster was imagining",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "The_James_Bond",
                                    "body": "As am I",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "freedfg",
                    "body": "Of all the Rocky Movies.\n\nRocky 1 being an almost perfect film. Hulk pics 4... Don't get me wrong. 4 is dumb and fun. I love it. But best?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JKBFree",
                            "body": "Well, i made it up!",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "HairyHematologist",
                            "body": "That soundtrack tho",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Arellan",
                            "body": "can't even get any of the first 3 rocky 😔",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "haldouglas",
                    "body": "- Ric: Taladega Nights\n\n- Valteri: Crocodile Dundee\n\n- Stroll: Mr Magoo\n\n- Lewis: Zoolander\n\n- Zhou: Zoolander 2\n\n- Perez: Horrible Bosses\n\n- Sainz: Free Guy",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "baldbarretto",
                    "body": "I could see Alonso  being really into gladiator or Braveheart",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "nicolaslabra",
                    "body": "Nando has pretty good Kino taste wow.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Anagreg1",
                    "body": ">All these could not be more on point to their personalities.\n\n>If they asked the other drivers, i’d imagine:\n\nBottas: What we do in the shadows 😅",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gsfgf",
                    "body": "Danny Ric: The Big Lebowski",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "alexrobinson",
                    "body": "Fernando is a man of taste. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "valueofaloonie",
            "body": "A Wes Anderson movie is totally on brand for Albon. Love it.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "scope_creep",
                    "body": "Confirmed that I could be buds with Albon.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bigred42",
                            "body": "Exactly where my mind went.  I bet Albon listens to Sufjan Stevens and the Decemberists.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PradaAndPunishment",
                    "body": "I've never seen Albon's choice but I have seen clips and visually it matches his aura",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dovahkiiiiiin",
                            "body": "It's a fun movie, watch it!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SemIdeiaProNick",
                                    "body": "the food inspection scene gets me everytime",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MrTrt",
                            "body": "It's one of if not my favourite movie. It's so unique. Wes Anderson can get very weird at times, but Budapest Hotel is, I feel, a very accessible film plot-wise while keeping what makes him special.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dolomick",
                    "body": "Most Albon answer ever",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "needmilk77",
                    "body": "Albon is my spirit animal. I love Wes Anderson films.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "snuFaluFagus040",
                            "body": "As do I.  Albon stock goes up.  Not a big fan of most of these other choices.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "the_schlomo",
                    "body": "And I thought Alex could not get more likable. And here we are",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "xMattewx4",
                    "body": "Definitely shows why he seems to be the most down to earth driver.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BelowTheSun1993",
                            "body": "You are the only person who considers Wes Anderson movies 'down to earth' lol",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Wah-Wah43",
                                    "body": "I think it shows he is perhaps more 'worldly' rather than 'down to earth'.\n\nHe actually seems somewhat interested in the world outside of racing which is good.  I also like him for this reason, even though I wasn't that bothered about that film.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Daakilah",
                                    "body": "You are sooo wrong.... There is at least 2! of us.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TwasntTryinTo",
                                            "body": "r/unexpectedfactorial",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "GlacialPeaks",
                                    "body": "I think the point is more that he’s actually enough of a movie buff to have seen a bunch of movies so he’s not spitting out some generic off the top of his head answer like everyone else did.  That or they gave generic answers because they legitimately are such racing robots they haven’t seen films beyond the generic answers they all gave.  It just shows albon is down to earth and actually watches a wide variety of movies like the rest of us as well as knows a good movie when he sees it.  (Props to Yuki for answering seriously too.  That’s 100% his favorite movie)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dasher2442",
                                            "body": "Lol I bet if you polled the general population on this question The Hangover, James Bond, Batman, and Harry Potter would also be some of the most popular answers. These answers just prove most drivers are normie regular people with basic movie taste... if anything it proves they are more like us than if they started giving weird ass answers.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "thieflikeme",
                                    "body": "lol right?  Wes Anderson makes the most whimsy ass movies on Earth, and that's more relatable than the boilerplate action movies/drama/comedies that everyone else mentioned?  \n\nYeah, we're on Reddit, alright lol",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ChuckVowel",
                    "body": "Truly.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "GaviFromThePod",
                    "body": "This made me like albon less. Wes Anderson fans are usually abysmal hangs.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dry_Brush5280",
                            "body": "People who judge others based on their taste in movies are usually super rad to hang out with, however.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Edgar101420",
            "body": "\"You are a wizard, Charles.''",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "56473829110",
                    "body": "Dumbledore def gives off \"we are checking\" vibes. ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mattycrits",
                            "body": "Oh my god, he does! I just recently rewatched the movies with my girlfriend and at least once per movie we shouted at the screen “THIS WOULD NOT HAVE BEEN A PROBLEM IF YOU WOULD HAVE JUST TALKED TO HARRY ONCE IN AWHILE DUMBLEDORE!” \n\nHarry- “Dumbledore, why is the most evil wizard in existence trying so hard to kill me?” \n\nDumbledore: “*we are checking*”",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Arellan",
                                    "body": "DIDYA PUT YER NAME IN THE GOBLET OF FIRE?!!? QUESTION!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TrueCooler",
                                            "body": "-he asked calmly",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "totallykoolkiwi",
                                            "body": "Dumbledore said calmly.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Lobsters4",
                                    "body": "This was the laugh I didn't know I needed today.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "LeBaus7",
                                    "body": "Toto: Ferrari, after all this time?  \n\nHamilton: Always.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Robotdude",
                                    "body": "Lmao thank you for the laugh 😂 ",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "smortandtoit",
                            "body": "Lmaooo",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "totallykoolkiwi",
                    "body": "\"Voldemort is back!\"\n\"Stop inventing, please.\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Edgar101420",
                            "body": "\"We are checking''",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GoodGuyJeff00",
                    "body": "Sorting hat: \"hmm... yes... bit of a doofus... passionate... lives life both freely and on the edge... you will be sorted in... Hufflepuff!\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Silverchaoz",
                            "body": "More like Ferrari lmao",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PogO_449",
                    "body": "Imma wot?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gomurifle",
                    "body": "\"You shall not pass!\" ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Living-Response2856",
            "body": "This is hilarious, it really sums up their personalities",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "scope_creep",
                    "body": "And matches expectations.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "El_Chipi_Barijho",
            "body": "Bottas: Emmanuelle in space.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AcidRegulation",
                    "body": "All I found was something called Emmanuelle In Space on laser disc. I could’t watch it but it sounded sexy…\n\n*laser disc*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gioraffe32",
                    "body": "What? What movie is that? Like a sci-fi movie? My friends and I definitely didn't accidentally see that on Skin-emax, I mean Cinemax, in high school during an overnight field trip...",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Samsonkoek",
            "body": "With Max's film choice and the latest Ted's Notebook Max and James should get along well.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ofallthescotchjoints",
            "body": "Albon has taste",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Justaberser",
                    "body": "Definitely would never forget the L'air de panache.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ofallthescotchjoints",
                            "body": "Will have to watch it again soon. Ralph Fiennes is so fckin funny in it",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NiceColdPint",
                                    "body": "Don’t keep us in suspense Serge, this has been a complete fucking nightmare. Just tell us WHAT THE FUCK IS GOING ON",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Last-Performance-435",
                                    "body": "Quietly one of the greatest actors of our generation.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ofallthescotchjoints",
                                            "body": "And so versatile. The same guy playing Amon Goth, Voldemort, Gustav, Harry in In Bruges, M in the newer Bonds, the chef in The Menu… I could go on",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "32SkyDive",
                    "body": "A man of culture",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Geo_q",
                    "body": "Truly",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Juppo1996",
                    "body": "Only non-NPC answer.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mur-diddly-urderer",
            "body": "Transporter????? Let’s fucking go",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Appropriate_Plan4595",
                    "body": "Oh fuck me, I completely misread Tsunoda's movie as 'Trainspotting', Transporter makes so much more sense",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "laboulaye22",
                            "body": "I first read it as Transformers lol.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "blackscienceman9",
                            "body": "I read trainspotting as well and I was surprised\n\nExcellent movie, but didn't expect it to be anyone's favourite. And that seems to be the case",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Appropriate_Plan4595",
                                    "body": "It's definitely a great movie, I'm just not sure quite how well it translates outside the UK.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "blackscienceman9",
                                            "body": "I'm not from the UK and still thoroughly enjoyed it so yeah",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "mchollahan",
                                            "body": "my dad and brother are both huge fans- my dad took my brother to see it when he was 14 lmao. they went to see transporting 2 together and were very disappointed",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Spynner987",
                                            "body": "I live in an area where heroine was an enormous problem in the 80s and 90s so it translated well here.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Nartyn",
                                            "body": "Tsunoda has lived in the UK for half his life so",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "RelationshipAlive777",
                                                    "body": "maybe you've got Yuki mixed up with Zhou? I think Yuki only lived in the UK for about a year.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Nartyn",
                                                            "body": "Ah i think so",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "whateverfloatsurgoat",
                                            "body": "Translates well with us, after all Charleroi is an even shittier and grim version of Edinburgh lol.\n\nSame problems, too.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Space_Wizard_Z",
            "body": "Lmfao Charles",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Shaddix-be",
                    "body": "If I had to connect movies with drivers I would not have put HP with Charles. But good for him!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AMorton15",
                            "body": "He’s just fully engaged with the new sponsor",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "InvisibleBlueUnicorn",
                                    "body": "underrated comment.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Temporary_Piece2830",
                            "body": "Weirdly Charles makes me think of HP a lot because he resembles Daniel Radcliffe and it’s so hard to unsee.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "doobie3101",
                                    "body": "Daniel Radcliffe wishes.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LastResort318",
                                            "body": "Daniel Radcliffe is a good looking man, what do you mean he wishes?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Lobsters4",
                                                    "body": "I second this.....rawr.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "KrifeH",
                                                            "body": "Keep your pants on",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Lobsters4",
                                                                    "body": "🫡🤣",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "fappybird420",
                                    "body": "Charles makes me think of HP because of those obnoxious blue circles on his kit.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Lobsters4",
                                    "body": "He's the Boy Wizard!",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "guntanksinspace",
                                    "body": "Need me Charles doing the \"Wacky Danny Radcliffe waving around two pistols and wearing bear slippers\"",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Space_Wizard_Z",
                            "body": "For sure!",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Training_Pay7522",
                            "body": "Why? He actually looks quite similar to the HP actor.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Shaddix-be",
                                    "body": "Not sure, just a feeling, I would have thought he felt too cool for HP or something. But that was just my impression based on nothing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lobsters4",
                                            "body": "He probably would have been just old enough to start watching the movies as the last few came out.  Seems on point for a boy wizard.  LOL.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Last-Performance-435",
                            "body": "Ferrari would though.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "scootsscoot",
                            "body": "We now know why Ferrari got the HP sponsorship",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "f8Negative",
                    "body": "Bro has def been Harry Potter for halloween.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lobsters4",
                            "body": "Oh definitely.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dementorpoop",
                    "body": "Just another reason to love him",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "vtsxxl",
                    "body": "?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Space_Wizard_Z",
                            "body": "It's just so different from the other choices mentioned. Just thought it was funny.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "boredofredditnow",
            "body": "Now I’m imagining Helmut Marko as McConaughey’s character asking Max on his first day at Red Bull: “do you jerk off?”",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IdiosyncraticBond",
                    "body": "His days of \"free practice\" are long gone",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "pensaa",
            "body": "DID U PUT UR NAME IN THE GOBLETOFFIYAAAA, CHARLES?!?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Rosieu",
                    "body": "*Vasseur asked calmly*",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "fakeplasticdroid",
                    "body": "We are checking...",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "UberChief90",
            "body": "Leclerc: \"Expecto Podiumo\"",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IdiosyncraticBond",
                    "body": "That's more a George remark",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Extinction-Entity",
                            "body": "*Forecasto Podiumo!*",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PradaAndPunishment",
            "body": "Alex mentioned in an episode of Torque that he was surprised to see one of the drivers watching a romcom called Love Actually on a plane next to him. He didn't mention who the driver was and now I'm even more curious. \n\nFrom that same episode I think Logan mentioned he really liked Cars lol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "palalabu",
                    "body": "i think liam lawson's racing hero is lightning mcqueen",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "paitenanner",
                            "body": "He’s also said that he’d love to be in a Cars movie as Lightning’s son or something",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jeffjeff97",
                    "body": "Love Actually fans can also be Grand Budapest Hotel enjoyers",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PradaAndPunishment",
                            "body": "He recognized it after all. Alex also liked Legally Blond and posted it on his story once",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "j__video",
            "body": "Of COURSE George would be a Bond guy haha. He is so English.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Alpha_Jazz",
                    "body": "Casino Royale is an amazing film tbf",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FatalFirecrotch",
                            "body": "Yeah, Casino Royale is an amazing movie and not just a good bond movie.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sanzhar17Shockwave",
                                    "body": "Except for intro and airport chase, it's mostly accurate to the novel tho",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FatalFirecrotch",
                                            "body": "I am not saying it isn’t an accurate bond film. I am saying its quality goes beyond the bond franchise. There are a lot of bond films where people say that’s a good bond film, but the quality of the movie by itself doesn’t necessarily hold up.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MrGoldilocks",
                    "body": "Casino Royale is the rare Bond movie that will stand the test of time for its plot and the performances of the actors. It's still so good on rewatch.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "j__video",
                            "body": "It is! Shame they followed it up with... whatever QoS was",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Specialist_Seal",
                                    "body": "You telling me you weren't on the edge of your seat to see if the bad guys would...control 60% of Bolivia's water?",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "008Gerrard008",
                                    "body": "Think that one they had issues with because of the writer's strike so they rushed it and came out with that shite.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "johnnytifosi",
                                    "body": "All of the Craig Bond movies have been a letdown for me except Casino Royale. Even Skyfall, which was surprisingly popular despite being a glorified Home Alone instead of a spy action movie. And don't even get me started on No Time to Die.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Last-Performance-435",
                                            "body": "Fuck Skyfall. Spectre and No Time to Die were both vastly better films. \n\nSkyfall is the second-worst Daniel Craig Bond film.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Amphiscian",
                                                    "body": "Hard disagree.  Spectre is not a serious film.  It starts off incredible, but every scene is worse than the one before it.  By the end it's like a below-average TV crime drama",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Slappathebassmon",
                                                            "body": "Spectre was soooo disappointing. I was looking forward to it because of the return of Spectre and Blofeld. But the plot was just too ridiculous. Even for a Bond film.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "QuirkyScorpio29",
                    "body": "Casino Royale is my favourite Bond film though.\nDaniel Craig and that director NAILED it.\n\n\nEva Green is soooo beautiful in that move too\nMikelsenn was Great",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KiwifromtheTron",
                            "body": "Directed by Martin Campbell who hails from the same small country as Liam Lawson.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dtgeorge12",
            "body": "Charles is a wizard confirmed. Also Max is literally just a frat boy deep down. Amazing",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Usaidhello",
                    "body": "It’s why he gets along with Daniel so well. \n\n*Ki ki ki hey hey hey rrraa rrraaaa*",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jazwch01",
                            "body": "I can't explain it, but I feel like Daniel's favorite movie would be cool runnings.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mccannr1",
            "body": "Really hoping Ocon meant The Dark Knight and not Rises. That'd be an insane pick. \n\nAlbon repping Wes Anderson is perfect.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "SatisfactionKooky435",
                    "body": "They're both excellent. My preference is rises, only because I prefer Bane's character.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Roddy-the-Ruin",
                            "body": "Rises is by far the worst of the trilogy imo.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Training_Pay7522",
                                    "body": "Indeed, it's a general consensus that it's the worst movie in the trilogy.\n\nThe best definition I've seen of it is \"A good super hero movie, but a weak Nolan one\".",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Extinction-Entity",
                                            "body": "That’s such a great summation of it, honestly.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TerribleNameAmirite",
                                    "body": "That French woman’s death scene was so bad it ruined the suspension of belief like pulling a rug. I was a tween then and it was still jarring.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "SemIdeiaProNick",
                                    "body": "fight me but i think Begins is the worst of the trilogy. I just dont know why but that movie never felt as much of an experience bigger than a movie like the other two",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ecco311",
                                            "body": "It set the tone for the trilogy in a great way in my opinion. I remember watching it in cinema 19 years ago (holy shit why the fuck is it so long ago?) and I was really satisfied with it. It was such a different Batman experience to the older movies. Then The Dark Knight fucking blew everyone away. And well.... DKR was good, it just couldn't live up to Dark Knight. The story was kinda lacking something and it just felt as if it wasn't written in such a great way compared to its predecessor.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "katorias",
                                    "body": "The worst of a great bunch though.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Nartyn",
                                    "body": "It's the weakest but not massively so and still better than most superhero movies",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Shaddix-be",
                            "body": "I'm pretty sure Ocon can relate more with coldblooded Bane than with chaotic Joker lol.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "mar33n",
                            "body": "The movie has Joseph Gordon-Levitt so I adore it more on principal.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Well-Jenelle",
                            "body": "Same, I think Bane is an awesome villain",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NET_1",
                                    "body": "For you",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "zaviex",
                            "body": "Both are fun enjoyable films. In terms of writing and filmography they arent close though. DKR suffers from some issues with loose narrative threads and while it looks good, its shots lack a lot of the depth work Nolan is known for. He really got a chance to make a banger film and not rely so much on the minutia. I think of them as both great meals but the DKR is the top meal at a medium priced steakhouse, the DK is a mid tier meal at the nicer steakhouse. Similar thing but theres a certain craftsmanship that went into the DK that wasn't required in the DKR",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "doobie3101",
                            "body": "Love Dark Knight but DKR is more rewatchable.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "KyuubiReddit",
                            "body": "I strongly disagree. DKR was quite mediocre compared to DK, so many glaring plot holes in that movie, and that ending... 🙄",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "thieflikeme",
                            "body": "I like Rises because they made both main characters the hardest to understand without subtitles in the entire movie \n\n(just a yoke btw)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "psbankar",
                    "body": "Surprised that Ocon a huge Marvel fan, choose the dark Knight as his favorite",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Amphiscian",
                    "body": "Perhaps he also wondered why you'd shoot a man before throwing him out of a plane",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gilgobeachslayer",
                    "body": "Begins is the best one",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "dl064",
                    "body": "I sincerely think Oppenheimer is finally the upswing in what has been a largely uninterrupted downward trajectory since Inception.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Rich_Housing971",
                    "body": "Maybe he's a Baneposting fan. Maybe he thinks about that scene when he's fighting for a position.\n\nGasly: \"If I make contact, will you crash?\"\n\nOcon: \"It would ruin the aero…\"\n\nGasly: \"You're a fast guy.\"\n\nOcon: \"…for you.\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lazarus6826",
                            "body": "\"They expect one of us in the wreckage, brother\" as Gasly sends him into the barrier.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Twistpunch",
                    "body": "I’m surprised it’s not one of the Marvel movies considering he love Marvel so much. But The Dark Knight is totally understandable.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ecco311",
                    "body": "Checked comments just for this. DKR is definitely the worst in the trilogy and DK is miles ahead of Begins already. The Dark Knight is just so fucking good, there's no room for discussion.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Skanvar",
                    "body": "yeah that must've been a slip of the tongue because its the worst of the trilogy and it's not really close imo.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RyanIsHungryToo",
                            "body": "So what if it’s the worst, it can still be his favorite lmao",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "reluna",
                    "body": "Rises is the worst Christopher Nolan movie, not only from his Batman trilogy but from his whole Filmography. I now have one more reason to hate Ocon :P",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "UndeadBuggalo",
            "body": "The grand Budapest is a FANTASTIC movie",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "NiceColdPint",
                    "body": "Did he just throw my cat out the window?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Minty_beard",
                    "body": "GET YOUR HANDS OFF MY LOBBY BOY.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "-Effing-",
            "body": "Albono has great taste.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Francoberry",
            "body": "Charles is reminded of Binotto with his favourite film ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NotAcvp3lla",
            "body": "Makes sense, young Charles did resemble a young Harry Potter.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Spicyoneybutterchips",
                    "body": "IDK if it's just me (and if it's just the glasses), but Charles gave me serious adult Harry Potter vibes [at this event](https://pbs.twimg.com/media/F8s3SS9WUAAEp6G?format=jpg&name=large). That's the [head of the Auror Department](https://pbs.twimg.com/media/F8s3SEqXMAA4cZC?format=jpg&name=large)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ceceeparker",
            "body": "Charles Leclerc x Harry Potter - the crossover we didn't know we needed.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "the_godfaubel",
            "body": "Max: You're a dirty man",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LaughJust",
                    "body": "He’s got the movie taste of a 16 year old boy… love it!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Victarionscrack",
                            "body": "I wouldn't call the Wolf of Wall Street a movie for 16 year olds. It can be funny because of Leo and Jonah giving banger performances. What themovie is about is pretty serious. Financial crime, addiction etc",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Last-Performance-435",
                            "body": "Entirely unsurprising given that's about when he was thrust into a full-time career and stopped going to school formally. Those experiences before that point became the most formative media experiences I'm guessing.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "No_Bathroom2927",
            "body": "Bottas: Crocodile Dundee",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Uknewmelast",
                    "body": "Vertel: Hold my Knoife",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SubcooledBoiling",
            "body": "Russell going to Aston Martin confirmed !!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dry_Brush5280",
            "body": "“Did you put your name in the Goblet of Fire Charles??”\n\n“We are checking”",
            "score": 1
        },
        {
            "depth": 0,
            "author": "magondrago",
            "body": "I don't know why but every driver and their chosen movie make sense? Imma try my hand at cracking it:\n\nOcon+DNR: Embracing your powers about not being the good guy, describes Ocon to a T IMHO.\n\nTsunoda+The Transporter: Do the right thing while being a badass no matter the cost at very high speed seems like it would fit his idea of motor racing.\n\nRussell: Casino Royale.  George has a terminal case of unironical Britishness, I cannot imagine a more cliche'd representation of a British Man than 007.\n\nVerstappen+WoWS+The Hangover.  The two faces of the reigning world champion: a ruthless go-getter that will stop at nothing to get his own and a party animal.\n\nAlbon+TGBH: Not gonna lie, haven't seen the movie but from what little I've seen TGBH is clever, fun and quirky, which all seems to align with Albono's personality.\n\nLeclerc+HP: My man is a geek and he cannot hide it. My geeky lady friends would probably tell me that they would rather date the ruggedly handsome Carlos Sainz, but I won't be fooled; at the end of the day, they would fall head over heels for the cute boy with a sparse beard who will also show them his Elder Wand.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CaptainDonald",
            "body": "These drivers are alright. Good movie tastes from the lads",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DuhMastuhCheeph",
            "body": "Dark Knight Rises over The Dark Knight is absolutely bonkers. Fascinated by Ocon’s brain.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mash709",
            "body": "Picking the Dark Knight Rises over the Dark Knight is blasphemy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "imbasicallycoffee",
            "body": "The brit likes 007? Not shocking in the slightest.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "forzagoodofdapeople",
            "body": "The Dark Knight ... *Rises*? \n\nPenalty for Ocon.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MrMarbles77",
            "body": "It's sad how judgmental some of the comments here are. For most people, their favourite movies are the ones where they had the best experience while watching, it's not trying to prove something or pretend you are more clever than others.\n\n*Average person : \"The best times in my life were probably with those closest to me.\"*\n \n*Reddit: \"Omg, this person has no brains or cleverness. Garbage take, like a common person.\"*",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "PickleCommando",
                    "body": "I’d consider myself a bit of a movie connoisseur and know a decent bit about filmmaking and techniques as well as being a long time musician that has a fairly good understanding of music theory, but people that exhibit snobbery in both of these mediums might be one of my biggest pet peeves. It’s okay to have fun and like fun things. They don’t have to be “Art”™️ for it to be your favorite. Now describing them as good might be a different matter, but again even that’s subjective. ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Oukaria",
                            "body": "I fucking love pacific rim because they never said it was something other than big fucking robots fighting big fucking monsters with an awesome BGM",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "vtsxxl",
            "body": "Makes me like Charles even more.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "narf_hots",
            "body": "Okay, I want Alex and Fernando in a room with me to talk about movies please.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "freshicedmatchalatte",
            "body": "Dear Ocon,       \nThe Dark Knight >>>>> The Dark Knight Rises.\n\nAnd Charles is just like a little kid of me who loved Harry Potter franchise (books & movies).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FreshStaticSnow_",
            "body": "And now reddit will be reddit and talk about how shit these movies are.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Regular_Frosting_25",
            "body": "I wasn't expecting Verstappen to choose a Scorsese of all films, but I'm glad he did (I'm choosing to ignore he also mentioned The Hangover).. Also surprised by Albon's pick.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ConnectionOdd6217",
                    "body": "Max just likes films with people getting hammered",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Special_Estimate_275",
                            "body": "Yeah those are definitely the picks of someone who loves a good bender",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Aquilonn_",
                    "body": "Sounds like the ghost of Daniel speaking through Max. Can def imagine him cueing The Hangover up for young Max when they were in Red Bull together and telling him it’s “one of the best movies ever mate”",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IdiosyncraticBond",
                            "body": "Max probably played The Hangover for Lando after partying his 1st win",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Dry_Brush5280",
                    "body": "The Hangover is an awesome movie and I’m tired of pretending it’s not.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "scorpio1m",
                    "body": "That Leo scene where he thinks he drove fine still makes me lol",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gilgobeachslayer",
                    "body": "I mean it’s not like he chose After Hours or King of Comedy",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Regular_Frosting_25",
                            "body": "If he had, my opinion of him as a person would have gone way up, I admit :D. (I was expecting him to choose a Nolan film, for some reason).",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PradaAndPunishment",
                    "body": "Albon's pick is incredibly on brand",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Regular_Frosting_25",
                            "body": "Thinking about it, it really is.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pernicious-pear",
                    "body": "Albon's pick feels on brand.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GodlessCommie69",
            "body": "Tsunoda and Albon have good taste, the rest, ehhhh",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Doccyaard",
                    "body": "Wolf of Wall Street is a very well made movie. Taste might differ but it’s of high quality.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ixixan",
            "body": "Lol I was going through this list thinking to myself \"all very typically favoured by men, I guess that's to be expected\" and then Charles didn't disappoint lol\n\nI always thought he'd be the one to get a handbag sized dog as well lmao",
            "score": 1
        },
        {
            "depth": 0,
            "author": "shitrod",
            "body": "Leclerc’s makes perfect sense",
            "score": 1
        },
        {
            "depth": 0,
            "author": "REMA5TER",
            "body": "Okay I've loved Albon since his F2 win in Baku but this takes it to a new level.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Gaspony",
            "body": "Albon 👌",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mr_Joor",
            "body": "Albon has taste, who would've thought",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CertainBird",
            "body": "It's adorable how much Yuki loves The Stath.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Prestigious-Orchid95",
            "body": "Currently watching Harry Potter (Order of the Phoenix) lol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "FootballRacing38",
                    "body": "May I ask if have you read the books? Not that i have any problem with the movies",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Prestigious-Orchid95",
                            "body": "I'm actually reading goblet of fire atm (about half way through). I never read them as a kid, so decided to buy them about 2 months ago!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FootballRacing38",
                                    "body": "I surprised you are ahead on the movies compared to the other way around.\n\nThen again, maybe it's better that way so you are not tempted to think about the changes they made with the movies and enjoy it more.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Prestigious-Orchid95",
                                            "body": "I've watched the movies 100s of times, and they are always the films I'll have on in the background etc! So being behind in the books doesn't make much of a difference to me, but it's been nice to reas all the little details they missed in the films so far!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FootballRacing38",
                                                    "body": "Yeah. That's why I always prefer books to movie adaptations because of the time constraints",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Grizzybaby1985",
            "body": "Looks like they need to watch more movies I like verstappens choice of wolf of Wall Street though",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lobsters4",
                    "body": "It's so on brand for Max.  LOL",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Magog14",
                    "body": "It's literally a movie about a scumbag who lives a trashy unfulfilling life and gets away with a slap on the wrist. I don't see how anyone takes anything from it besides money corrupts",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Grizzybaby1985",
                            "body": "Yeh it’s great I love it",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheGMT",
            "body": "Himbos, apart from Alex.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Firefox72",
                    "body": "Excuse me but Casino Royale is cinema.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BuckN56",
                    "body": "Watching Wes Anderson doesn't make you some genius lol",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "possums101",
                    "body": "Harry Potter is for himbos?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FatalFirecrotch",
                            "body": "Obviously! Those are just sports movies about Quidditch.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Training_Pay7522",
            "body": "Really, Ocon chosed the worst movie in the trilogy and the worst Nolan movie overall as his favorite.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "YorkshireRiffer",
                    "body": "Or, Ocon is confirming he's an admin for r/baneposting",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "KatnissBot",
            "body": "That all adds up lol.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DSQ",
            "body": "The only one that isn’t so obvious it hurts is Tsunoda liking The Transporter. It’s a good film though. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "XenonJFt",
            "body": "Now I know why George adores the Suit advertisements",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sinister_Grape",
            "body": "Love you Albon",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ninchica13",
            "body": "Movie picks somehow suit them...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ReciprocatingBadger",
            "body": "Always thought Charles looked like he was a pair of glasses away from making a good Harry. Now we know.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "OttoVonBismarc96",
                    "body": "Especially in the \"just an inchident\" clip",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Batgod629",
            "body": "I like Ocons pick but come on, the Dark Knight is the best of the trilogy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mkvii1989",
            "body": "Ocon, wtf dude. I like Tom Hardy as much as the next guy but you pick the worst of the trilogy?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "uxxandromedas",
            "body": "W Albon, that’s one of my favorites too!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "johnnytifosi",
            "body": "There is some great recency bias on those films given all of these guys are in their 20s.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "una322",
            "body": "man all those films are so new. i thought we at least get one odler film like aliens, back to the future, terminator. something that isn't post 2000 lol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "delirio91",
                    "body": "A lot of these drivers are late 90s babies. So their early memories are 2000+",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "una322",
                            "body": "i guess, but when i grew up my parents got me to watch loads of classic movies made b4 i was born lol",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "-crackhousebob",
            "body": "All movie choices make sense except for Harry Potter😂😂",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Crake241",
            "body": "Albon incredible based and wholesome.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mkg11",
            "body": "This is like one of those BuzzFeed clickbaits but its real",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AveragePinkSocks",
            "body": "Of courses Ocon likes the worst batman movie out of the trilogy",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NotSuspicious215",
            "body": "Agent Georrrrrrrrrge",
            "score": 1
        },
        {
            "depth": 0,
            "author": "danielskis",
            "body": "Ocon embracing darkness as his ally. Interesting",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dunbar31",
            "body": "hahaha this all checks out perfectly.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Youngwolff",
            "body": "Ocon n Russell have impeccable taste, Albon too. Tsunoda n Verstappen's choices are pretty good too.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "_box_box",
            "body": "the fact that charles just said harry potter is so charles 😂🤣",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RealisticAf99",
            "body": "Charles really does kinda resemble Harry Potter 😁\nBtw, why no one said my fav of all time, Lord of The Rings 😢",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yodel_anyone",
            "body": "Funny, I would have sworn Max was a Tarkovsky fan",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Poopy_sPaSmS",
            "body": "Russel is so fucking predictable 😂",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Yung_Chloroform",
                    "body": "Ofc it would be a Bond film",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "FCI",
            "body": "wish i didn't know.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FixiHamann",
            "body": "Well, they are paid for driving fast, not for having a good taste.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Avpersonals",
            "body": "That all missed the opportunity to mention Kingsman.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Snoo_47023",
            "body": "Albono my king of good taste\n\nI need his review of Asteroid City",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Daeurth",
            "body": "Huh, Albon and I have the same favorite film. Neat.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sameslemons",
            "body": "Lmao I do love these basic ass bitches",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Motor-Donut-8014",
            "body": "Even Jason Statham would laugh at someone who thought Transporter was their favorite movie",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NearSun",
            "body": "At the end of the day, they are still kids",
            "score": 1
        },
        {
            "depth": 0,
            "author": "oakmen",
            "body": "This shows how young they all are. All relatively recent movies. No oldskool classics. I like that.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "m8_is_me",
            "body": "THE F1 GRID IS KINO",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tangmang14",
            "body": "Dark Knight Rises and not The Dark Knight. \n\n+5 seconds ocon",
            "score": 1
        },
        {
            "depth": 0,
            "author": "katewildheart",
            "body": "That is absolutely everything I expected it to be.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mulligantour",
            "body": "Better to not trust any of them except for Albon with anything other than driving cars, lol.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "forzagoodofdapeople",
                    "body": "Nah, Russell's pick is a solid choice. Casino Royale is a great film, not just a great Bond film.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "SatisfactionKooky435",
                    "body": "It's almost like movies are highly subjective, like music.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mulligantour",
                            "body": "if you like The Hangover more than any other movies you've ever seen then that's great and enjoy being subjective, but I won't be bothering you for recommendations after that lol.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SatisfactionKooky435",
                                    "body": "That's great. I'm sure many think you're favourites are shite and won't ask you for recommendations.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Mulligantour",
                                            "body": "No my favourite is Paul Blart: Mall Cop, way better than the Hangover and nobody in the universe thinks it is shite.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SatisfactionKooky435",
                                                    "body": "Never heard of it, but glad you enjoy it.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tummerd",
            "body": "No Lord of the Rings is beyond criminal.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "QuirkyScorpio29",
                    "body": "I am watching it.now and it's great.\nBut Godfather 2 is the GOAT movie for.me.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tummerd",
                            "body": "I hereby challenge thee to combat for sprouting such ludicrous words! Choose thy weapons and lets begin.\n\nJokes aside thats also a good movie, but lotr is the pinnacle for me\n\nEdit: people get angry over this? Come one now lmao",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "QuirkyScorpio29",
                                    "body": "Whoever acted as Smeagol/Gollum played the role of their lives IMO.\nBeing that bipolar on screen and everything about it is just so difficult to act IMO.\nAmazing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Tummerd",
                                            "body": "Its Andy Serkis, often regarded as the top actor for motion capture. He was also Caeser in Planet of the Apes for example.\n\nFun tip, watch his eyes. When the pupils are big its Smeagol, when the pupils are very narrow its Gollum who has dominance at that moment",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "IdiosyncraticBond",
                    "body": "K-Mag: Thou shall not pass",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Jokobib",
                    "body": "They're like a 7/10 at best",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Zeta-Omega",
                            "body": "Off with this guys head.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Yu_Neo_MTF",
            "body": "Wolf of Wall Street for Verstappen? No wonder why he wants to be dominant. He might be a decent businessman too considering his online store business.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aw_geez_man",
            "body": "These are perfect and make so much sense.\n\nNow do Danny Ric...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rav3musik",
            "body": "cursed blunt rotation",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ridititidido2000",
            "body": "Charles lepotter vs voldemax",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kitkatis",
            "body": "the dark knight rises?!? are you out of your mind?!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dl064",
            "body": "Hamilton's said in the past that his favourite films are Cool Runnings, and the later works of Eddie Murphy.\n\n(...)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sykretts1919",
            "body": "Ok, I did not see the Tsunoda response coming, but the rest somehow oddly just make sense those would be their responses lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "razorracer83",
            "body": "I honestly can see Charles being a Potterhead. Hell, his young self probably would pass for a decent Harry Potter for Halloween, what with him having similar bangs or fringes as him back then.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ButthealedInTheFeels",
            "body": "Logan: Talladega nights    \nKMag: Death Race   \nLance: “I like Turtles”",
            "score": 1
        },
        {
            "depth": 0,
            "author": "vdubsession",
            "body": "I don't even care for Harry Potter, but I find Leclerc's nerdiness endearing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Last-Performance-435",
            "body": "Based Albono.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "persepolisrising79",
            "body": "Wolf of Wallstreet is my go to for longer flights",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KitchenNight6883",
            "body": "Tsunoda has the same favourite as me. Lets go!!!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Repulsive_Fly3826",
            "body": "OT: a few days ago I saw the 1969 version of The Italian Job at a local retro cinema - young Michael Cain looks so much like George Russell in it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Manadoro",
            "body": "That journalist didn’t realized his question would unlock childhood memories and a great conversation!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheGoteTen",
            "body": "I can’t help but imagine Leclerc saying “Harry Potter” with a French accent.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mtglilianavess",
            "body": "Stroll: Ritchie Rich\n\nActually a documentary to him.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jihad_llama",
            "body": "Common Albon W",
            "score": 1
        },
        {
            "depth": 0,
            "author": "svartanejlikan",
            "body": "Max with the most bro answer ever. Get this man on Barstool.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "barthw",
            "body": "Except Albon those all are pretty bland choices tbh",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SafeIntention2111",
            "body": "Check out the big brain on Alex!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "G_h_c",
            "body": "+1 for GenZ representation",
            "score": 1
        },
        {
            "depth": 0,
            "author": "revitbitch",
            "body": "albon’s and max’s make sense",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ginnybin25",
            "body": "i love how Ocon, a self-proclaimed Marvel fanatic, picked a DC film.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mindless-Ad2039",
            "body": "Albon is a man of culture, I see! 👍🏼",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BatKat58",
            "body": "Does George play good poker?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TParden13",
            "body": "Why am I not shocked George’s favourite film is a Bond movie",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Zenon-45",
            "body": "Toto: NAW MI5 THEEZ IS *SOO NOT RIGHT*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Don_Tommasino_5687",
            "body": "Asking the important questions I see… 🙄",
            "score": 1
        },
        {
            "depth": 0,
            "author": "notryangosling22",
            "body": "Stroll:Ritchie Ritch",
            "score": 1
        },
        {
            "depth": 0,
            "author": "work_accountforwork",
            "body": "Man Leclerc can be lame sometimes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HansGuntherboon",
            "body": "Slow news day",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fleobis",
            "body": "Albon the only one with any sense…",
            "score": 1
        },
        {
            "depth": 0,
            "author": "M8gazine",
            "body": "Wonder what their favorite anime is",
            "score": 1
        },
        {
            "depth": 0,
            "author": "deeplevitation",
            "body": "I knew I loved Alex Albon…",
            "score": 1
        },
        {
            "depth": 0,
            "author": "albanianandrea",
            "body": "Wow, I'm surprised nobody named Sátántangó.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fredbeercat",
            "body": "K-mag: Apocalypse Now",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Thestickleman",
            "body": "The dark knight is a great film and transporter is abit of classic. The rest though...... ☠️",
            "score": 1
        },
        {
            "depth": 0,
            "author": "EvelcyclopS",
            "body": "Albon - man of taste",
            "score": 1
        },
        {
            "depth": 0,
            "author": "No_Sun_2121",
            "body": "Whats so good about Wolf of Wall Street ?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pokemongofanboy",
            "body": "> Leclerc: Harry Potter\n\nNow I can’t unsee the slight resemblance between him and Daniel Radcliffe",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fizzelen",
            "body": "Did Russell clarify if it’s the 1967 or 2006 version?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Archonixus",
            "body": "Lol, what the actual flying fk are these dogshit picks???",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Octavian1453",
            "body": "yet another reason to dislike Verstappen.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Aerodye",
            "body": "Albon my guy",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Macknificent101",
            "body": "bro leclerc just even more popular to all those women who fan over him",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jopperfromkwangya",
            "body": "lec and i are literally twins wdym",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Thuglos",
            "body": "Dark Knight Rises over Dark Knight is crazy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bklyngaucho",
            "body": "Who. Fucking. Cares?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NoPasaran2024",
            "body": "Pretty sure Verstappen is one of those guys who thinks Jordan Belfort is the hero of Wolf of Wall Street.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "refusestonamethyself",
                    "body": "Idk what is up with people saying that if you like the Wolf of Wall Street, then they idolise Jordan Belfort.\n\nYes, there are people who do that. But TWoWS is a fucking amazing, hilarious and hysterical movie. The movie is hardly boring for an almost three-hour runtime. It's not hard to appreciate the movie and recognize that Belfort is the bad guy.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "strangecharm_",
            "body": "It's posts like these that remind me that they're all basically still children.\n\nAlbon stands out.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Affectionate_Sky9709",
            "body": "Ocon picking a DC over Marvel goes against his public persona cookie cutter, haha.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BuckN56",
                    "body": "So apparently DC movies have always been these distinctive colorful great movies? Besides the Nolan trilogy and until recently TSS most DC movies were considered boring, too long, and grey.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MountainJuice",
            "body": "Some real shit choices. Norris will probably be Transformers or something.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ofallthescotchjoints",
                    "body": "What’s the need to insult someone who wasn’t even mentioned?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "hjhof1",
                    "body": "The first few transformers movies were straight 2000s bangers don’t @ me",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ofallthescotchjoints",
                            "body": "I’ll give you the first one. The others…. meh",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hjhof1",
                                    "body": "Definitely a drop off but the soundtrack is so good it just makes me forget the rest 😂",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "essteedeenz1",
                    "body": "Er what's wrong with any  f those films",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Chupaqueedeuva",
                    "body": "Did you really expect *racing drivers* to pick some Tarkovsky or Bergman stuff as their favorite movies?Lol",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MountainJuice",
                            "body": "It was a light hearted comment and far from the only one in this thread, but no, Harry Potter and Bergman aren't the only two types of films.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chupaqueedeuva",
                                    "body": "I disagree.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hellowhatisyou",
                    "body": "Marvel",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Spynner987",
                    "body": "He said Spider-Man: No Way Home",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "patrick1415",
            "body": "Verstappen is stuck in 2010",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "aliens_licked_my_ass",
                    "body": "Those race wins are rookie numbers",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Longjumping_Papaya_7",
            "body": "Wolf of Wallstreet? Max to Mercedes confirmed!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TigreSauvage",
            "body": "Dark Knight Rises is an awful Batman movie. Give Ocon a penalty and make him start from the pit lane.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TypicallyThomas",
            "body": "Slow news day",
            "score": 1
        },
        {
            "depth": 0,
            "author": "codename474747",
            "body": "How can you like The Dark Knight Rises more than The Dark Knight, c'mon now Esteban...\n\nSome people just want to watch the world burn....",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "canibanoglu",
                    "body": "He wouldn’t even get where that quote is from",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "codename474747",
                            "body": "There's a storm coming Mr Ocon",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dl064",
            "body": "Casino Royale is a very solid choice.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "phen0",
            "body": "Unsurprisingly Russell is the only one with a bit of taste.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "delirio91",
                    "body": "Albon's choice keeping Russell awake at night!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stranggepresst",
            "body": "Wolf of Wall street? Wolf like Toto Wolff? Verstappen to Mercedes confirmed /s",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "I-Get-Down-I",
                    "body": "I commented the same then i saw yours, sad",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "wowbaggerBR",
            "body": "yikes",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BedrockMetamorph",
            "body": "Harry Potter, really Charles?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cyndagon",
            "body": "Can't wait for the internet to cancel LeClerc for liking Harry Potter.\n\nAlso, my boy Yuki <3",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BooksCatsnStuff",
                    "body": "As someone who is big on Harry Potter but hates the author, no one is going to care. I'm glad he enjoys the movies, I do too.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Cyndagon",
                            "body": "You say no one is going to care, but I personally know people that have cut me and others out of their lives because we continue to he fans of the franchise.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cody667",
                                    "body": "Same...one of my best friends form high school's wife (we're all 32, so this is someone I've known for over a decade), refuses to speak to me anymore because I played Hogwarts Legacy. That game really brought out the sheer stupidity in people over the the bizarre selective outrage imagineable.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "BooksCatsnStuff",
                                    "body": "Big difference between being a fan of the franchise and supporting the author/giving the author money, which is what people are usually against. Sure, there's people that will make no distinction but it's not the majority.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Cyndagon",
                                            "body": "I agree with you. But the anti Harry potter fans are rather vocal.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BooksCatsnStuff",
                                                    "body": "Are they actually anti Harry Potter or anti Rowling? Because I've seen very few of the first. Those few may be loud, but loud or not, they don't matter.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Cyndagon",
                                                            "body": "Both. They won't separate them.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "refusestonamethyself",
                    "body": "Nah. Even the Harry Potter actors don't like JKR.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "LemonLyman84",
            "body": "lol they’re so basic",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "cumofdutyblackcocks3",
                    "body": "Maybe because they don't care much about what people think of their movie taste as they are busy travelling to multiple countries and enjoying life.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "onlinepresenceofdan",
            "body": "Wow Max is basic",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "GhxstySucks",
                    "body": "I think it’s fine to like wolf of Wall Street it was a good performance from Leo I think the red flag/basic bro view is people who say they like or idolise the mc lol",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rhllor",
                            "body": "Fight Club, Wolf of Wall Street, and Joker: the trifecta of sus",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GhxstySucks",
                                    "body": "Fight club was HUGE when I was doing media studies at college aha it had so many aspects we had to study I haven’t seen that movie in over 10 years I’d forgotten about it",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "montyzac",
                                            "body": "I have a 16 year old step son and it's been amazing watching some brilliant movies with him. Seeing him slowly catch on to Fight club was ace.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "onlinepresenceofdan",
                            "body": "Well if you list it as “this or the hangover” I am more inclined to see him as a basic bro.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GhxstySucks",
                                    "body": "Oh yea I immediately forgot he said the hangover too I concede lmao he’s basic",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheSadman13",
                    "body": "You must be real fun to be around, lol.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "justabrew",
            "body": "i hate people who act like their taste in entertainment is superior to others.\n\n\nmovies are supposed to be interesting to watch, and if you have more fun watching some arthouse film, good for you. doesn't make you smarter/more interesting/educated than someone who watches romcoms or action films. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ollie_Plimsolls",
            "body": "Did they ask everyone? Did someone give a non-basic answer?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wah-Wah43",
                    "body": "Albon",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EpicEpic_",
            "body": "F1 Journalism in a nutshell",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PirelliSuperHard",
            "body": "SHOCKING. All of them.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ArcticBiologist",
            "body": "INVESTAGATIV JURNALIZM",
            "score": 1
        },
        {
            "depth": 0,
            "author": "freedfg",
            "body": "How do they all have impeccably trash taste?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "VettelsBees",
            "body": "As a Wes Anderson fan, Albon has given me more reasons to like him more!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tuba-Dude",
            "body": "Ocon picking the Dark Knight Rises over the Dark Knight justifies my dislike of him.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "flatspotting",
            "body": "Albon, Ocon and Max best movie taste imo",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mkosmo",
            "body": "None of these are surprising... except I expected Ocon's to be a little more obscure.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "PradaAndPunishment",
                    "body": "He's open about a marvel fan lol. None of the movies who make billions at the box office are obscure lol",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mkosmo",
                            "body": "Oh for sure, and by obscure I don't mean some Indie film that never got on a big screen... just one of the not-quite-so-Dark-Knight-in-popularity movies.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Affectionate_Sky9709",
                                    "body": "Well, it's Dark Knight Rises, which is movie 3. Movie 2, Dark Knight, is the much more popular one.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mkosmo",
                                            "body": "That's a good point.  I didn't catch the Rises in the title.\n\nApparently I upset some fans given the downvotes :)",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sufficient-Pin-481",
            "body": "I have a feeling if Yuki actually watched a decent movie he’d fall asleep during it or be on his phone the entire time.",
            "score": 1
        }
    ]
}