{
    "title": "FIA urged to delete best laps of F1 drivers causing Monaco red flags",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "[The **News** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_news) is reserved for submissions covering F1 and F1-related news. These posts must always link to an outlet/news agency, the website of the involved party (i.e. the McLaren website if McLaren makes an announcement), or a tweet by a news agency, journalist or one of the involved parties.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Samsonkoek",
            "body": "2006: controversial incident\n\n2014: controversial incident\n\n2022: controversial incident\n\n2030: controversial incident?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "fordern997",
                    "body": "2022 even had two controversial incidents happening at the same time, lol. ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CX52J",
                            "body": "I love how no one noticed Alonso’s controversial incident as Checo had one first.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chronic_Avidness",
                                    "body": "Was Alonso up to good own shenanigans too? What did he do?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Snowfall_89",
                    "body": "2021: almost controversial incident",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "iMatthew1990",
                            "body": "But those are just little inchidents",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Kolec507",
                            "body": "Sure it wasn't on purpose, but it still left that sour taste for me.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Other_Beat8859",
                                    "body": "It's pretty much why any driver that causes a red flag should be forced to start at the back of the session imo. You cause a red flag in Q3? You're starting P10 as a result. Indycar has this system I believe. \n\n\nA driver shouldn't benefit from causing a red flag.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Rivendel93",
                                            "body": "Yeah, I don't know why they haven't introduced this years ago.\n\nIt's an easy, simple solution. Any driver that causes a red flag by accident or not deserves to start p10 when they cause other drivers race to be wrecked.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AdFancy6243",
                                                    "body": "Less of an issue in monaco but weve seen some red flags in recent years when the car had simply stopped briefly and easily got going again to set a second lap. It would be harsh to punish a driver when the race director pulls the trigger too early on red flags",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Psych_Crisis",
                                                            "body": "Very reasonable, but also a good argument for the director to be given some discretion in such matters, as long as an explanation can be provided. Perhaps it could be race director's discretion if the other cars hadn't yet made it into the pits.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rafaxd_xd",
                    "body": "What happened in 2014?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mjyys99",
                            "body": "Rosberg ran wide at Mirabeau and caused yellow flags when he was on provisional pole. Possibly (well, probably) intentional, possibly an honest mistake.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TonyQuark",
                                    "body": "The Schumacher Special.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "slabba428",
                                            "body": "Schumie’s was waaaay too obvious. Oh whoops I’m understeering, not enough though let me just straighten the wheel for a second to get up to the wall, nobody will see\n\nTV cam: everyone will see",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Turboleks",
                                                    "body": "I'm no driver, but I would have tried to lock up ever so slightly so that the car would touch, but not slam, the barrier at Noghes. Preferably, that would be head-on, in order not to expose the front suspension. A new front wing would be needed, sure, but it would still be worth it and also far more convincing.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "slabba428",
                                                            "body": "Forget preserving the front suspension, back in those days just send it into the wall then go back to the pits and grab the spare car 😂",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "s7beck",
                                    "body": "Whilst Lewis was on a hot lap iirc? I'm probably wrong...",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BerntMacklin",
                                            "body": "Yeah I remember it being the second hot lap with Lewis behind him",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Coaster5307",
                                    "body": "Rosberg just posted a purple S1. It's not like he wasn't pushing for a better lap.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Triple_Manic_State",
                                            "body": "Doesn't the sector end pretty much at the braking zone? If not now in 2014 with much less downforce?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LowkeyChuwy16",
                            "body": "Rosberg went to a run off area if I remember correctly.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bringinthefembots",
                    "body": "What year was the inchident?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Samsonkoek",
                            "body": "2012.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Wrong_Occasion",
                            "body": "Was looking for this one",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "KLconfidential",
            "body": "Fully support this at all tracks.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nn4260029",
                    "body": "100% agree. Win it when you bin it is unacceptable.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "saltyfuck111",
                            "body": "putting them last wont work either so what do u propose",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "nn4260029",
                                    "body": "What the article said. Cause a red flag, lose your best time.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "zystyl",
                                            "body": "That's what indycar does.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "hoxxxxx",
                                                    "body": "indycar does quite a few things that make sense",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Snorr0",
                                            "body": "So ride the two best times and then bin it, got it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Gurbx92",
                                                    "body": "If you could manage the top two best times, track evolution or not, you are on pole. You don't need to bin anything.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Snorr0",
                                                            "body": "Might still adversely affect a direct WDC competitor.",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "UNHchabo",
                                                    "body": "Indycar's format is that causing a red flag means you lose your two best times *and* you can't advance to the next round. So in Q1 even if you somehow put in the three best laps then caused a red, the best position you could possibly start is 13th.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "mildmanneredme",
                                                    "body": "Haha if you were Max, you’d probably have a really sore neck.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "fdar",
                                                    "body": "OK... how is the current situation better?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "strillanitis",
                                    "body": "Why does that not work? What’s unfair about being punished for your errors? This is Motorsport",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "posthamster",
                                    "body": "Why not just add 5 mins to quali if there's a red flag? They already stop the quali timer on a red because that time is precious. I know that doesn't account for tyre wear if someone's on a fast lap that gets interrupted, but it seems better than not having enough session time left after a restart (or no restart).",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kaisadilla_",
                    "body": "100%. How does it make sense that the consequence of your accident is that you secure your position?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "FormulaJAZ",
                    "body": "I'd even do this for yellows. If your yellow impacts someone else's hot lap, it is no different than impeding, which is already a penalty. If your actions affect someone else, then you have to pay a cost.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fdar",
                            "body": "> it is no different than impeding\n\nIt kind of is though. I thought it was \"we punish the offence not the outcome\".",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "edfitz83",
                    "body": "Indycar deletes your 2 best laps and kicks you out of further qualifying if you cause a red",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "GBreezy",
                    "body": "I swear in F1: Championship Edition for the PS3 this was a thing and I assumed for a very long time it was a rule. It just makes so much sense",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mtarascio",
            "body": "Support",
            "score": 1
        },
        {
            "depth": 0,
            "author": "joaopaulofoo",
            "body": "100% this should be a rule, not just for Monaco but all year around",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zaviex",
            "body": "should be a rule everywhere. If you crash you dont benefit. I would go with, cause a yellow impacting more than 1 drivers lap, lose your fastest lap.  Cause a red, lose all laps if anyone else was on track.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "kkraww",
                    "body": "That's basically indycar rule. Cause a yellow that impedes another driver, fastest lap deleted. Cause a red, top two fastest laps deleted.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "justarandomrussian",
                            "body": "What if it’s a technical fault? Seems unfair to punish for that.\n\nThen again that does create the possibility of cheating:\n‘Oops me and my teammate are p1 and p2 but my car had a totally legitimate fault that made me stop on track and cause a red’.\n\nSeems far fetched but if crashing on purpose is a legitimate theory, then this can be too.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "johnso21",
                                    "body": "Thats still the team/drivers fault and it would still impact others race. Dont want the penalty? Make sure your car is good to go. I agree though, there needs to be some penalty for causing red or yellow flag in qualifying.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Archer2223R",
                    "body": "How would this work in an instance like Las Vegas, where a manhole cover got sucked up and destroyed Sainz's car?\n\nWhat if a driver has to go off to avoid a car on track, and in turn, they crash and cause a red flag?\n\nThe stewards should just look at the data and punish a driver accordingly if they think they binned it on purpose. There's enough in the telemetry to do this.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zaviex",
                            "body": "The sainz thing didnt happen in quali and if it did, he would have been starting last anyway. With the other scenario, First how often does that happen? Second the other driver would be impeding and the stewards would figure it out anyway. \n\nOther racing series have been using these rules for years. F1 is the outlier and drivers have asked for these rules for years.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Archer2223R",
                                    "body": ">The sainz thing didnt happen in quali and if it did, he would have been starting last anyway.\n\nIt could have happened at any time.  What if it happened in Q3 when he already banked a provisional pole lap?  Would it be fair to send a driver to be back of the grid because a piece of the track, animal, spectator, garbage, or some other non-driver-error related thing caused an incident?\n\nJust have the stewards review the data.  If a crash is entirely down to driver error or a mechanical problem with the car, assess the appropriate penalty.  If they banked a good lap, and a manhole cover shit-canned the car and ended the session, it they should not be penalized.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Psych_Crisis",
                                            "body": "I think you make the critical distinction here. The idea is to act *if the driver brings out a red flag.* Carlos didn't bring out that red in Vegas - similarly, if a driver puts another driver in the wall, the first driver could plausibly be determined to have brought out the red, and there are already mechanisms for adjudicating fault in such situations. Obviously it would be harder to crash *someone else* to maintain your pole lap, but not an implausible scenario.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Dry_Brush5280",
                                            "body": "If it happened in Q3 he would have needed a pit lane start anyway. \n\nIt blows my mind that people are in favor of more subjective rulings from the stewards. I think the rules should be as black and white as possible, so we can avoid having human error mess up a race.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Archer2223R",
                                                    "body": ">If it happened in Q3 he would have needed a pit lane start anyway.\n\n  \nNot necessarily - you can bin the car in a way that it damages the barriers and causes a red flag, but the car is still intact.  LEC in monaco a few years back comes to mind when Ferrari rolled the dice on his quali crash and it turns out, he did trash the gearbox and it caused a DNS.\n\nWhat if a driver has to bail out of a lap because of slow traffic, cuts a chicane, and tosses gravel all over the road resulting in a red flag?\n\nYou have to work these things out, otherwise, they will come up, or drivers will find a way to exploit them.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Dry_Brush5280",
                                                            "body": "You seem really good at coming up with hypotheticals. All I’ll say is I think any rule that gives the stewards wiggle room to interpret how they feel on a given day is a bad rule that should not be passed. If they can come up with a way to account for every eventuality, great. If not, don’t make the rule. That’s all I can say about it.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "zaviex",
                                            "body": "It doesnt matter when it happened he'd have been penalized anyway. In quali it might have been worse probably pit lane start. This isnt a real concern.  I can't recall a single time in Indy where anything like this happened. Also, the feeder series F2 and F3 just added a red flag rule like this and no one complained. Theres no reason to overcomplicate this and we already know the drivers want it",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "fluvicola_nengeta",
                                                    "body": "I don't think you're understanding it. Say it's Q3, Sainz goes out for his first flying lap, sets a tremendous time, pole, banger of a lap. Everyone goes back to the garages, come out, time for the last flying lap of the season. Oh, what's this? Manhole cover outta nowhere! Bam, Sainz is out, red flag because his car sucked a magnet. Now, he didn't get to set a second lap. But no one else did, and his previous lap put him on pole. Therefore, getting taken out by the manhole cover is not a penalty, because he is already on pole and now no one else can be. So he isn't penalized, as you're saying he would be in this hypothetical scenario. But because of the rules, his time needs to be wiped, because his car brought out the red flag. But it wasn't his fault at all. The people responsible for making the circuit safe were numbskulls, and Sainz just happened to be in the wrong place at the wrong time. Therefore, completely blameless, and so deleting his time would be a complete injustice.\n\nAnyways, this is the scenario the other person is trying to make you see. I personally don't think it would be a problem so long as it was written in the rules that some circumstances completely and entirely outside of any driver's or team's control would exempt them from the penalty for bringing out a red flag. Because sometimes shit just happens and punishing someone for no reason would just make people sour on what would be an otherwise positive rule. I'd love to see the yellow/red flag rule in F1.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Dana94Banana",
                                            "body": "No, reviews only mean that someone will find a way to play the rules and loopholes. If your car causes the red flag, you get punished. Driver at fault or not, that way there is no room to play stupid games anymore.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Archer2223R",
                                                    "body": "so a driver sucks up a manhole, or a driver hits an animal on track and you penalize them?\n\nSorry, but that's stupid and absurd.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "slabba428",
                            "body": "I would think it would be easy to argue that Sainz didn’t cause the red flag, the track caused a red flag and Sainz was a victim. I know everyone wants some magical black and white rule but there will never not be room for interpretation/extenuating circumstances",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "d0re",
                                    "body": "That should be a general extenuating circumstance policy, i.e., any penalty caused by a track failure or similar fault (basically anything that would be under the FIA/organizers' fault) can get canceled out. That way Sainz wouldn't have received a grid penalty for parts changes at Vegas, and these hypotheticals in this thread would be null.\n\nIt doesn't specifically affect the idea of having a black and white quali red flag rule though. They can make it so any action that impacts other competitors creates a penalty, then cancel it out in the rare event of it being a track issue.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "timelessblur",
                            "body": "Sainz did cause it and in take case it falls under track issue.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "International-Elk986",
                    "body": "Cause a red flag, start from pit lane",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CoachRyanWalters",
                            "body": "Cause a red flag, straight to jail. We have the best lap times in the world because of jail.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kolec507",
                                    "body": "Death penalty for Leclerc in his home race.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Street_Mall9536",
            "body": "Not liked by Sergio Perez \nlol",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "cheezus171",
                    "body": "He's hardly the only suspect.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Street_Mall9536",
                            "body": "Nico Rosberg and Micheal Schumacher are not huge fans either",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cheezus171",
                                    "body": "I meant Norris and Russel actually\n\nEveryone remembers Perez because Max threw a hissy fit about it, even though noone really noticed or suspected anything for a few months.\n\nBoth Norris and Russel did IMO much more obvious things, that a ton of people immediately said looked suspicious at least. And somehow those have been completely forgotten.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "chickenalfredogarcia",
                                            "body": "What were those incidents? Genuinely curious, not sure if I was watching at the time",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Street_Mall9536",
                                            "body": "Oh, you're one of THOSE guys lol. \n\n\nNorris ran out of talent, Russell looked super suspicious. \n\n\nEveryone on reddit and on YouTube were calling out Sergio's \"accident\" the day of..",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Street_Mall9536",
                                                    "body": "Or how about Bottas going lawn mowing after he set fastest lap lol.\n\n\nPeople remember thing very well but relevancy matters. \n\n\nTop team, Sergio \"still in the championship hunt\" crash to save your spot/your teammate gets stuck mid pack and you win the race, then you get re-signed the same night,,\n\n\ngets a lot more attention than \"ah, that looks sketchy\" from a midpacker. ",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "xLeper_Messiah",
                                            "body": "People were calling out Sergio's incident right away, it just got more prominent attention after Brazil\n\n\nIt looked sus immediately to anyone who watched his onboard, what kind of racing driver doesn't attempt to countersteer the instant they feel over-rotation? That shit was definitely on purpose, i know Checo's your guy and all but *come on*",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "buzz_shocker",
                            "body": "The most recent one however. He tried to do it again in 23... safe to say it didn't work out as well as he had planned in 23.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Glory_63",
                    "body": "I was surprised to see he spoke in favour of this rule too. But I mean both things can be true at the same time",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Affectionate_Sky9709",
            "body": "For anyone who doesn't know, it's being essentially tested in F2 and F3 this year. If a driver causes a red flag in qualifying, they are out of the session and their best lap time may be deleted. I'm trying to think, but I don't think F2 or F3 has had a red flag in quali yet this year, so we haven't seen the \"may\" come into play yet or not.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "bisette",
                    "body": "I hadn’t heard about that, thanks for sharing. I’m all for removing the fastest lap time of the driver responsible for a red flag but I’m not sure how I feel about also eliminating them from the session. That feels like a big jump from the current attitude of “oh well” to “double punishment time”, especially when the catalyst for the incident could have been something beyond the driver’s control (I’m looking at you, drain covers).",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "UNHchabo",
                    "body": "Indycar has this too, you get your *two* best laps deleted for causing a red, *and* you automatically don't advance. If you cause a local yellow your best lap is deleted.\n\nThe first example of the top of my head was [Newgarden at Laguna Seca 2022](https://www.youtube.com/watch?v=wS6_BAZjrag). Since then they've implemented a rule that freezes the clock for the first red flag of a session.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "dl064",
            "body": "I think the simpler approach is what Hamilton said many years ago - the skill becomes making your first flyer at Monaco closer to your limit than usual, because you may not get another go.\n\nHappened in 2011 too.\n\nI think regulating this becomes a can of worms unless you have zero tolerance, and then you could be punishing innocent parties quickly.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "basvn",
            "body": "I do support this, but change the rulebook at the beginning of the season. And not when it is already started.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ArrowtheArcher",
                    "body": "This rule would not change anything from past GPs and will not affects teams progress. No harm in this rule specifically.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DalinerK",
                    "body": "I see no issue making this change mid season",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "basvn",
                            "body": "It is not that the Monaco Grand Prix is suddenly added to the season. They could have added this before the beginning of the season",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "moonlightracer",
                                    "body": "There are track specific rules elsewhere. Like how on some tracks if you go over on the final turn leading into a hot lap, then the next lap is deleted as well. Crashes impact Monoco way more than other tracks, so I think it's fine to have a track-specific rule.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "International-Elk986",
                                            "body": "It should just be a rule everywhere anyways.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "zaviex",
                                    "body": "There are rules that change every weekend in the race directors notes based on the track.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Known-Reporter3121",
                                    "body": "Who cares, unless for those looking to cause a red flag",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Psych_Crisis",
                            "body": "The issue is that a single speedy lap early in the session followed by a crash that can plausibly be blamed on inadequate machinery is the entire plan for Williams to be competitive this season.\n\n/s I think.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aenae",
                    "body": "They change rules all the time during a season, why would they stop now?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "scobydoby",
                    "body": "There’s track specific stewarding rules like this all the time.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Phoenix77_reddit",
                    "body": "As long as everyone is informed of the rule before Quali begins I don't see any issue.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "International-Elk986",
                            "body": "Yeah by the logic of not changing rules mid season, should technically directives also just not exist?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mlp851",
                    "body": "What is the benefit of waiting until after the season to change it? Just do it for Monaco this weekend, it’s a no brainer.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Takis12",
            "body": "FIA understood the message and decided to go even further. They will delete best laps of all F1 drivers if someone causes red flags.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IdiosyncraticBond",
                    "body": "Red flag, everybody starts from thd garage on lights out. Speeding in the pitlane? Drive through penalty /s",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "tnellysf",
            "body": "100%",
            "score": 1
        },
        {
            "depth": 0,
            "author": "trackmaniac_forever",
            "body": "All the downvotes are from Sergio Perez on alt accounts.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DepecheModeFan_",
            "body": "I'd prefer giving the minimum punishment required to stop it, as opposed to the maximum. \n\nI think a one place grid penalty for causing a red flag in qualifying (on every track, not just Monaco) should be trialled rather than immediately going all or nothing. If that's not enough, then a 2 place grid penalty, then 3 and so on until all these suspicious mistakes at the end of Q3 go away.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "wolverineFan64",
                    "body": "I like this idea much better as deleting your best lap can be enormously punitive, especially in cases where a driver was genuinely just pushing for a pole worthy time.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SemIdeiaProNick",
                            "body": "and it wouldnt make sense to have a bigger punishment being applied if you crash in quali than if the one for forcing a driver off track/causing a colision during the race",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "iIenzo",
                    "body": "That wouldn't work, I think. Let's say a bottom 5 team driver reached Q3, is the first to finish his last flying lap, and then promptly crashes, causing a red or yellow flag. P1 turns into P2, while otherwise he'd start in P10.\nHugely beneficial. ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ye11ow",
                            "body": "If he's the first to finish a flying lap, then there's plenty of time for other drivers to set their times after the red flag is cleaned up.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "iIenzo",
                                    "body": "Last flying lap, specifically.\n\n\nHe'd need to get P1 by being faster than others in previous laps, but he'd benefit most from track evolution if no one else can set their last lap. Even if he only gets P5, it's still 4 positions ahead of P10 after the grid penalty.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SemIdeiaProNick",
                                            "body": "again, how often does a not-so-competitive driver set the best time of Q3 and that time stays until the end of the first round of laps? i dont think i remember a single time",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ResponsibleCut720",
                                                    "body": "He's saying from p10 to p5 which is very plausible on tracks with a lot of track evolution.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "SemIdeiaProNick",
                                                            "body": "but even then, when was the last time you remember a driver crashing during Q3 that wasnt someone fighting for pole? Still isnt an issue that would stop that version of the rule (that is much more fair) of being applied",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "iIenzo",
                                                    "body": "Every sprint Q3 is only one lap, so that would work (but it's less interesting due to the limited number of points it gives). The point is, it can happen in sprints, and it could happen in the race. \n\n\nLet's say we implement a one-place grid drop now and Hulk ends up on temporary pole in Monaco, manages to semi-convincingly cause a yellow flag, and starts P2 because we said 'one-spot grid penalty' is the rule. we can't change it at that point, not for Hulk, because you can't retroacitvely implement more severe penalties. So he benefits massively from his 'accident', and we step it up to 2 grid drops and wait for someone to turn a pole into a P3.\n\n\nI don't know if there have been any P1 -> P10 drops, but Ocon was on pole for quite a while and ended in P4 (huge difference in Monaco). From this year, there isn't much, but Hulk did drop from P6 to P9 between finishing his last lap and finishing the session.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Delts28",
                            "body": "How often does that happen just now though when there's no punishment at all? It's not going to suddenly become a regular occurrence *after* the penalty is introduced.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tyafastics",
            "body": "Feel like I’m in the vast minority but, no. \n\nObviously, it’s different if someone does a Schumacher in Rascasse, but if you want to be on Pole Position at Monaco and don’t want to risk a poor position, you’ve got to nail all of the laps available to you.\n\nSport is full of controversial moments, moments that generate discussion and drama. Remember all the discussion at BRAZIL when Perez asked to go past Max and it boiled down to what happened in Monaco, that’s a storyline that just.. doesn’t exist with this rule being implemented.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Rich_Housing971",
                    "body": ">if you want to be on Pole Position at Monaco and don’t want to risk a poor position, you’ve got to nail all of the laps available to you.\n\nif you want to be on Pole at Monaco you should also not crash during your pushlap.\n\ntakes a big brain to realize this, I know.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pablobhz",
                            "body": "“Being a red flag driver means you are red flagging with other people and if you no longer go for red flag that exists you are no longer a red flagging driver because we are competing for the red flag.”",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "SemIdeiaProNick",
                            "body": ">if you want to be on Pole at Monaco you should also not crash during your pushlap\n\nwhen you are single digit milimetres from the wall, a super tiny misjudgement can result in a crash\n\nthat argument you presented isnt enough, in my opinion, to justify changing the (already good enough) rules to punish drivers trying to get a fast lap in a harsher way than those purposefully being a menace on track during the race",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Stranggepresst",
                    "body": "I agree. Yes a red flag or even a yellow can ruin other drivers' quali lap, but I feel like it's too harsh of a penalty and might just discourage drivers from pushing. \n\nBesides, it's really not like this is a common problem in first place.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "whoTookMyFLACs",
                            "body": "> might just discourage drivers from pushing. \n\nGlass half full perspective: It'll make all of the balls-to-the-wall laps that much more special, because we'll know they're risking it all for glory of winning Monaco.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Stranggepresst",
                                    "body": "fair point!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "willfla29",
            "body": "This is such a commonsense change.  IndyCar does it and it works great.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Skeeter1020",
                    "body": "IndyCar doesn't do it for competition. It's primarily about ensuring sessions run to time in order to get all the adverts breaks in.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BobbbyR6",
            "body": "Support but when has this \"recently\" happened intentionally?\n\nAlso, stewards re-instate laps when fault is decided to lie with the track itself? (manhole covers at Las Vegas)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Glory_63",
                    "body": "Yeah, Perez 2022 in Monaco was the most obvious, but I remember after that Sainz had insinuated quite clearly that there were other instances that people weren't aware of (most thought it was Norris at Imola 2022, that qualifying had like 3 red flags)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "anthony-209",
            "body": "Wouldn’t like this.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Deckatoe",
                    "body": "Genuine question, why not? It seems like a pretty straightforward rule change that benefits everyone. This way the driver who bins it is also punished and not just everybody else",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dl064",
                            "body": "I am not actively a fan because I think they're 20 adults and they don't need this literal regulation. \n\nI think the simpler solution is what Hamilton said: just make sure your first flyer is 100%\n\nThat's way more parsimonious than deletions etc. What if someone causes a yellow or red and it's ambiguous if it was *really* their fault?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Extension_Bat_4945",
                            "body": "In my opinion it will probably make drivers drive more carefully. I want them balls out on the track getting everything out of the car, (over) pushing the limit is part of that.\n\nIf a driver crashes, the FIA can tell if a driver crashes intentionally and punish them. If it's unintentional  I'd rather have them extend the session so other drivers can set a lap time.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "VictoriaBCSUPr",
                                    "body": "You’d like to think FIA could tell then punish. But when you watch Perez in 22, it’s awfully suspicious on what he did to cause his spin. There’s a vid out there that compares the 22 spin to 23, I believe, where he’s counter steering and it looks normal. 22 definitely had some “interesting” gas and steering inputs, lol!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Extension_Bat_4945",
                                            "body": "To my knowledge no one reported it to the FIA, thus it wasn't investigated, that's the way these things go.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "nschwalm85",
            "body": "100% would support this at every track!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SFishes12",
            "body": "Seems fair",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FortuneCookieLied",
            "body": "Haha cause k-mags on a mission this year",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Skeeter1020",
            "body": "Red flags yes.\n\nYellow flags, no.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dana94Banana",
            "body": "Can this be done everywhere, not just in Monaco? Please!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "el-gato-volador",
            "body": "So if someone is on provisional pole at the start of q3 and they bin it on accident they start p10?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Haze95",
            "body": "Don't do it, it's a terrible idea",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mayhem747",
            "body": "Should be a no-brainer. You make a mistake, best pay for it instead of securing your place on grid while denying others the opportunity.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lalabadmans",
            "body": "Would kmag care though as long everyone else except hulk is screwed?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "iIenzo",
                    "body": "As far as quali is concerned, Kmag has mostly been the victim and not the culprit.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "SgtBallsack",
                    "body": "Nah he will send it into the wall coincidentally right after hulk gets through to q2",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Vicariously___i",
            "body": "Sounds great, let’s do it everywhere",
            "score": 1
        },
        {
            "depth": 0,
            "author": "3600CCH6WRX",
            "body": "Anyone that crash and caused red flag should start last of its qualifying. If crash on q1, 20th, if crash on q2 -15th, q3-10th. Then add all other penalties if the have one.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "silenthills13",
            "body": "All laps, not the best laps. Red flag = immediately to the bottom of the current session (Q1 = 20, Q2 = 15 etc.)\n\nAt all tracks. \n\nIf they can restart the car and somehow complete another lap in the session after the red flag then fair game and that should be valid though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "cheezus171",
            "body": "This isn't just Monaco, there were more incidents on other tracks recently involving Russell and Norris as well. I really don't understand why this hasn't been a rule for a long time. It's illogical. And would hardly be controversial if introduced...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "beautify",
            "body": "Great another way to target Spanish drivers 🙄🙄🙄",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Other-Conflict-3278",
            "body": "All thanks to leclerc",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "montyzac",
                    "body": "I think Perez and Rosberg also?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "valueofaloonie",
            "body": "Subscribe",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CaptainOBVS3420",
            "body": "Literally thought of this yesterday night. They really need to penalize drivers for binning it in quali without destroying the car AND ending the session prematurely.\nYeah sometimes the mistake is genuine but in Monaco if you pull a Rosberg or Schumacher or Perez then that needs to come with a penalty of some kind. ESPECIALLY if the driver just so happens to be on provisional pole.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "dl064",
                    "body": "So *only* if it's that level, and intentional? Leclerc 2021 as well?\n\nSchumacher was punished. \n\nSainz said that the tricky thing is not egregious intentional spins like Schumacher. That's easy. Where it's murkier is: driver has a good first flyer. Then on his second flyer, he's happier going to 101%. He didn't intend to screw anyone...he just doesn't mind.\n\nI think the idea is fine but when you dig into it, it's a can of worms.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "WeAreNotAIone",
            "body": "Only Monaco? Enforce this on tracks.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "reimer013",
            "body": "Yes please.",
            "score": 1
        }
    ]
}