{
    "title": "Fernando Alonso’s helmet for the 2024 Monaco Grand Prix",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "[The **Photo** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_photo) is for submissions sharing photos from the world of F1. Photos should be interesting and relevant - random photos not notable enough to warrant a standalone post will be subject to removal. This flair should not be used for images which are not photos, such as screenshots, statistical graphics, or artworks.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Francoberry",
            "body": "It's funny how many people are saying 'this is just an ad' and yet also absolutely adore Marlboro, Vodafone, Benneton, Gulf, and other liveries 😂  \n\n\nModern liveries are almost all driven by branding, it doesn't really make them any better or worse than more traditional designs based on racing or national colours. ",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AlonsoHamilton1444",
                    "body": "What, an ad? Scuderia Ferrari HP would never.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ShreddlesMcJamFace",
                            "body": "Lol. That really kicked me in the saubers",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "charlierc",
                            "body": "We all know Ferrari believe in their purity of Mission Winnow",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "darth_baltimore",
                                    "body": "Mission Wearechecking",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "charlierc",
                                            "body": "There's laws against tobacco advertising, consider Plan G. Plan G",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Scudw0rth",
                                    "body": "Mission Stillwaitingtowinnow\n\nMission Wegotridofouronlyrecentracewinnernow",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "colin_staples",
                    "body": "Have these people even seen the helmets of the Red Bull drivers over the last 20 years?\n\nAside from one (Coulthard) they all look alike, a big Red Bull logo on the side and a few other colours. You simply can't tell them apart.\n\nPut them all in a row and I defy anyone who has complained about this Alonso helmet to pick out <driver> from that big set of Red Bull helmets within 3 attempts",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "_SteeringWheel",
                            "body": "I just googled to find a compilation of all RedBull helmets, because it's not _that_ bad. ( I mean, Vettel helmets are pretty recognizable too, Max as well)\n\nBut funny thing : Google only returns Max helmets, like, every individual custom one just he ever had, and I can only identify a few as his. His base model pretty much stands out, some of the special ones too (like the dark champion one, the big orange obv he once used, etc), but most I don't recognized as Max.\n\nThe RB logo is obviously prominent on all of them though :)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "colin_staples",
                                    "body": "[Here you go](https://duckduckgo.com/?q=red+bull+f1+helmet&t=iphone&iax=images&ia=images)\n\nAs I scroll down that list there aren't any where I can instantly go \"that's <driver>'s helmet\". They all look alike to me. Big Red Bull branding and some random colours.\n\nWhereas in the 80s and 90s you could get wall charts of the helmets and they were all so different and instantly recognisable.\n\nBut then I started watching F1 when a driver would have one helmet design for their entire career.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "_SteeringWheel",
                                            "body": "Interesting how we used the exact same search. *Edit and how duckduck gives me different results, I mean. Well, not interesting interesting, Google likely knows I'm Dutch and Duck defi doesnt.....Just...interesting..\n\nAnd I fully agree with your 80s and 90s assessment. The # of \"special\" liveries are wild, drivers seem to change every year anyway, corporate branding is fully taking over, and Red Bull absokuetly is the worst in that.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "colin_staples",
                                                    "body": "I don't want to come over all \"old man yells at clouds\", but it is a shame the way helmets are these days.\n\nHowever I do like some of the special edition helmets. The Lando Norris one that was drawn by a young child was fantastic.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "_SteeringWheel",
                                                            "body": "Oh yeah, there are some beauties among them, defi!\n\nBut don't worry, I'll join you!! 😤😡🤬🤌🖕🌤️🌥️☁️🌩️",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Parabolica242",
                    "body": "Not to mention that all Red Bull program drivers’ helmets have  pretty much zero individuality to them and are just a massive Red Bull logo.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ecksell",
                    "body": "McLaren went all in on the Gulf livery for Monaco 2021, and I still want a Lego car of it. That machine was gorgeous.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "young_london",
                    "body": "At least it’s not another senna tribute thing",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "1ordc",
            "body": "I really like it\n Classic 80s vibes",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NoooUGH",
            "body": "Give me a lot of late 90's Mark Martin NASCAR vibes...\n\nhttps://www.reddit.com/r/NASCARCollectors/comments/lvrz4n/",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "spiral_out462",
                    "body": "Maybe if Fernando has a crash, they’ll send him back out later with the car looking something like [this.](https://www.reddit.com/r/NASCAR/s/QcreAuFHin)",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NoooUGH",
                            "body": "The FIA would lose it.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "processedmeat",
                            "body": "I love when teams dgaf and just want to race. ",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GetawayDriving",
                    "body": "Totally Mark Martin. Mark was my guy watching NASCAR in the 90s. Fernando P2 incoming.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Supahos01",
                    "body": "Lol made same comment then found this. The 1996 one looks pretty similar",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "booxterhooey",
                    "body": "I was gonna go with Al Unser Jr, but I like this more.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "D0lan_says",
                    "body": "Came here to comment this!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "shewy92",
            "body": "It's a classic sponsor with a classic look at a classic track. IDK what people's problem is with it just because it doesn't have 50 different shapes and colors",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Supahos01",
            "body": "Honestly feels like a throwback to Mark Martin  helmets from circa 1996 or so.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "freedfg",
            "body": "It's gorgeous. \n\nI love classic blocky helmets. If you can't tell what it is in a moving car. What's the point?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "sentient_salami",
                    "body": "but speedlines!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "freedfg",
                            "body": "And FLAMES! And whatever the fuck is going on with Pierre and Niko's helmets.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dilirium22",
            "body": "That's kinda hot.. It has 80s rally vibes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "weissbrot",
            "body": "When did Senna wear this?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "MountainJuice",
                    "body": "and Alonso is one of the very few who actually did grow up watching him.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "berberine",
                    "body": "Thanks for the chuckle this morning. When I saw the headline, I thought, \"oh god, please no, not another one.\"\n\nI get it's a giant ad for Valvoline, but I still kind of like it.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mineralke",
                            "body": "a lot of iconic car liveries were just giant ads, but they looked nice nonetheless",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "LowKeyWalrus",
                                    "body": "You mean like the Marlboro and Vodafone McLarens that most here adore to death?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Mineralke",
                                            "body": "Yeah, those, and also Rothmans Williams, John Player Special Lotus, etc.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "l0sth1ghw4y",
                            "body": "Everyone in this sport carries sponsors. I’m just happy to see an original helmet rather than “another one of those.”",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bestfinlandball",
            "body": "I mean it looks good, has kind of a classic vibe to it, but it's just a Valvoline ad.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DistinctCellar",
                    "body": "90s and 00s Gary Rogers V8 Supercars team.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HardSleeper",
                            "body": "I see Valvoline and I hear John Laws. Probably anyone who hears John Laws needs serious help",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "JeremyWheels",
                            "body": "Or 1993 Al Unser Jr Indycar",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "cheeersaiii",
                            "body": "Steven and Jim Richard 1997 babbyyyyy",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FlorydaMan",
                    "body": "Guess what every livery has been since ever?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bestfinlandball",
                            "body": "Have you noticed how drivers have different helmets that are designed to look how the drivers want them to? Yes, they are designed around sponsorships, but they have unique colors and designs. This doesn't look like Fernando's helmet, it looks like a generic Valvoline helmet from a racing game.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "shewy92",
                                    "body": "Your point? Have you seen Red Bull drivers' helmets?\n\nIt's a classic looking helmet for a classic race",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MajorHubbub",
                    "body": "Maybe he's born with it, maybe it's valvoline",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fourth_place_again",
                            "body": "Lol. 💄",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "P_ZERO_",
                    "body": "Describe a livery in one sentence\n\nhttps://imgur.com/a/7T4vZKC",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Codydw12",
                            "body": "Needs more boner pills.\n\nBut still, that era NASCAR was amazing.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "jlaweez",
                            "body": "curiously, that to me, growing up with old Indycar, watching Fittipaldi battling Al Unser, it is Unser's car that it reminds me of.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MyCarHasTwoHorns",
                    "body": "Advertising in F1??? Oh no I’ve dropped another monocle.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "shewy92",
                    "body": "> but it's just a Valvoline ad\n\nWait till you learn what their paint schemes are for",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Sockinatoaster",
                    "body": "An ad in a sport funded by advertising? Say it ain't so.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ChewzaName",
                    "body": "1997 NASCAR Mark Martin too",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Space_Reptile",
                    "body": "congratiulations you figured out what liveries are",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Quohd",
            "body": "Hmm I wonder who he's sponsered by...",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Quirkybeaver",
                    "body": "HP",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Saul_von_Gutman",
                    "body": "McDonald's",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Kolec507",
                    "body": "Por- I mean Rich Energy.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "charlierc",
                    "body": "Sainsbury's",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheCatLamp",
            "body": "Always when I see Valvoline I immediately associate it with Gil de Ferran.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "l0sth1ghw4y",
            "body": "Finally a nice looking retro helmet that isn’t another Senna tribute from children whose lives didn’t even overlap with his.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BvG_Venom",
            "body": "Mark Martin would be proud.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Basic_Two_2279",
            "body": "When they do these special helmets, do they get a whole new one made or just repaint the one they have. Cause those fuckers aren’t cheap.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IsaacChan_3803",
                    "body": "F1 drivers are all rich AF so they usually just get a new one made.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Basic_Two_2279",
                            "body": "Yea didn’t think of that. Expensive to you and me is different than for them. And the sponsors or teams probably pay for them.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rainfordporter",
                                    "body": "I’d imagine the only thing that the driver would maybe be paying for out of their own pockets would be the artist who designed the helmet. Still wouldn’t be much for them but if you have 3-6 special helmets plus your main it adds up",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GetawayDriving",
                    "body": "At these speeds and tolerances, you’re going to want a new helmet every race. The slightest hairline fracture can compromise the effectiveness, and so having this thing carried around week to week around the globe with many different hands on it, just better to maximize safety and start fresh.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Basic_Two_2279",
                            "body": "Yea that makes sense. Rather be safe than sorry, regardless of the cost.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButterscotchEmpty290",
            "body": "Change Aston to Mark and you have a retro NASCAR helmet",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OriolHimself",
            "body": "I love it, it gives me Chris Amon’s lid vibes",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SuperSalamander3244",
            "body": "I like it and for some reason it reminds me of Williams.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "real_fake_hoors",
            "body": "Maybe he’s born with it. Maybe it’s Valvoline.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KitchenNight6883",
            "body": "Looks like toothpaste",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ForeverIdiosyncratic",
            "body": "Gil De Ferran Walker Racing vibes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Murky-Twoer",
            "body": "This is dope",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KrombopulosMAssassin",
            "body": "Idk, I think it's kind of fire to be honest.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BassTrombone71",
            "body": "In the 4th picture it really reminds me of Barrichello's helmets.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AccomplishedWonder1",
            "body": "Clean, gives me V8SC vibes too",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cleenred",
            "body": "W",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Adhesive_Duck",
            "body": "That's how you do advertising properly honestly.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "snorlaxatives_69",
            "body": "Classic!!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "myth-ran-dire",
            "body": "Excellent lid. Simple, beautiful.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "macundo",
            "body": "Finally a design that is not Senna fest inspired. Thank you.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Peaking_Ducko",
            "body": "Very tasteful",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bouncebackability",
            "body": "Always love Valvoline colours. Looks good if a impersonal",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BodiesDurag",
            "body": "Man has the Dominican Flag 🇩🇴 under his visor",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DeLoreanAirlines",
            "body": "The colors are excellent. Beautiful design",
            "score": 1
        },
        {
            "depth": 0,
            "author": "theogchunkmunk",
            "body": "Wait, this isn’t an ode to Senna, what’s going on?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "the_real_nicky",
            "body": "Very nice ad",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cheetahsareveryfast",
            "body": "Well, valvoline does have the best greases/lubricants on the market.",
            "score": 1
        }
    ]
}