{
    "title": "The 2004 Monaco 'Diamond Heist' turns 20-years-old this weekend",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "[The **Photo** flair](https://www.reddit.com/r/formula1/wiki/flairguide#wiki_photo) is for submissions sharing photos from the world of F1. Photos should be interesting and relevant - random photos not notable enough to warrant a standalone post will be subject to removal. This flair should not be used for images which are not photos, such as screenshots, statistical graphics, or artworks.\n\n*[Read the rules](https://www.reddit.com/r/formula1/wiki/userguide). Keep it civil and welcoming. Report rulebreaking comments.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/formula1) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "freedfg",
            "body": "No one ever figured out that story huh?\n\nMy running theory isn't some elaborate heist or lost or replaced diamonds. But that the \"diamonds\" were and always were fake. Probably either cut resin or acrylic. \n\nNo chance any movie advertising budget would A. Pay Jaguar to put sponsors all over an F1 car while also B. Providing two matching 250,000 dollar diamonds to be on both cars.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Firefox72",
                    "body": "I think there's only 2 real explanations. One of which is far more likely.\n\nIt was replaced pre-race with a shoddy replica that just fell off at one point because it wasn't secured on properly. Although this would likely require someone knowing the diamond would be on the car well ahead to get a somewhat matching piece. Which likely makes this unlikely.\n\nThe more common explanation is that it just fell of sometimes during the race and was pocketed by someone or even just straight up destroyed. The car was in a crash wasn't it?\n\nEven if it wasn't real the 2nd thing makes just as much sense.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "freedfg",
                            "body": "Both cars wound up in the barriers. One (I think it was Webber) immediately at Sainte Devote on lap 1. And the other pretty early on too I believe. \n\nWhich led people to come up with the conspiracy that they crashed intentionally to steal/hide that the diamonds were fake.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Thiswilldo164",
                                    "body": "Klein went into the wall on lap one. I don’t recall Webber going into the wall. The race was won by Jarno Trulli.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Jebus_17",
                            "body": "Honestly, if you're stupid enough to put a real diamond on one of the most fragile parts of an F1 car around the most publicly accessible circuit on the grid, you deserve to get it stolen.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "hi_im_bored13",
                            "body": "Also worth noting, the press images and photoshoot of are a different gem, the \"genuine\" diamonds in the race were significantly smaller and inset in a stainless steel casing: https://www.thedrive.com/content-b/message-editor%2F1647226069171-gettyimages-508599851.jpg?auto=webp&optimize=high&quality=70&width=3840",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "GrowthDream",
                            "body": "For me there's a third obvious possibility: It was always part of the marketing plan to \"disappear\" the diamond in the case of a crash through the weekend (not unlikely at Monaco) because they knew they\"d get free advertising via the Mystery for the next 30+ years",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "TheRomanRuler",
                            "body": "There is 3rd possibility. Diamonds are not inherently expensive, they are only expensive because people pay for them. With gold we also decided its expensive so it is, but you can sell your used good for decent price, diamond barely gets you anything because thats how worthless most diamonds actually are. Diamonds are only worth much in very specific scientific uses (most uses need only cheap stuff) or because prestigious company sells you a diamond and people pay for it. \n\nSo maybe they just got a diamond cheaply somehow, then after race wanted to sell \"race run\" diamond for massive price. So its lost opportunity, but they did not necessarily pay much for the diamond.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GrowthDream",
                                    "body": "Everything is only expensive because people are willing to pay money. Something might be inherently valuable because of scarcity but even that doesn't always relatie to the monetary expensiveness of it. \n\nYou said it yourself that gold is only expensive because we like it. Same as money, it's literally worth much more than the paper it's written on in many cases. So what you're suggesting, that they \"somehow\" got a diamond for cheap, reeks like suggesting that they \"somehow\" got money for less than the value of the money. If they could do that they they wouldn't be messing around with marketing stunts!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheRomanRuler",
                                            "body": "You dont get it. Unlike gold, which is expensive in quantity, only sold diamonds are expensive. Finding a diamond somewhere is not expensive like it is with gold, even though humans have both decided its expensive.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "GrowthDream",
                                                    "body": "Why isn't everyone in the diamond trade then?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "okaywhattho",
                                    "body": ">So maybe they just got a diamond cheaply somehow\n\nThis... is the bit that makes diamonds expensive. You don't just stumble upon a $250,000 diamond.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MrMarbles77",
                    "body": "This is a mystery right up there with the Hamburglar getting away with all those crimes on camera for years and years.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "freedfg",
                            "body": "Swiper getting away with attempted robberies since 01",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "RooBoy04",
                            "body": "And the suspicious number of deaths that happen in the small village of Midsomer",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "elMurpherino",
                                    "body": "Lol I never expected midsomer murders to make an appearance in here.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "False_Implement_43",
                            "body": "also kinda difficult to sell it afterwards everybody knowing it was stole at the race, who would buy it",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AlexBucks93",
                                    "body": "Some rich dude to put it in his house?",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "LaBelvaDiTorino",
                                    "body": "I mean, they've tried to steal and sometimes successfully sold many famous paintings, which are unequivocally identifiable, let alone a diamond",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MrMarbles77",
                                    "body": "I think you're maybe missing the point of my comment? I was comparing this event to McDonalds marketing materials, where valuable items (hamburgers) are also \"stolen\" to create drama.\n\nYour reference is an actual pretty gruesome murder of a whole family?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AlexTheMacedonian",
                                            "body": "I completely missed the point lol, I thought you were mentioning an actual unsolved crime",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "_SteeringWheel",
                                            "body": "Man, TIL that the striped prisoner guy from McD has a name ánd a purpose.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Turboleks",
                    "body": "The Drive did a video recently on this subject, and apparently they interviewed the Head of Marketing for Jaguar at the time, and he basically went \"The diamonds were legit, on account of the fact that no reputable jewelry in the world would ever provide you with fake diamonds\". So, there's that.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "FassolLassido",
                    "body": "It was a publicity stunt to promote the movie Ocean's Twelve, a heist movie. Nothing of value was lost.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "LaBelvaDiTorino",
                    "body": "I think the fact that the diamond was there to promote an heist-themed film makes it probable it wasn't lost randomly, but it came off the car on purpose, so it was badly secured.\n\nAnd tbh, this makes more sense if it was a copy/fake rather than the real deal.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Big0bjective",
            "body": "To be fair I don't want the truth ever to surface because it's just way too funny as it is. Was it fake acrylic/glass, was it a 3D sticker, was it stolen...\n\nDiamond on F1 car nose, car crashes with nose into wall, diamond is gone. You can't make this up.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CandidLiterature",
                    "body": "Thing is it’s probably far from the most valuable part of the car…",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BlackLeader70",
                    "body": "The real story is probably way too boring. I’ve always maintained it was a publicity stunt to amp up the movie and it was never a real diamond to begin with.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Hamburgo",
                    "body": "Or it was moissanite, cubic zirconia or some other type of alternative like a lab grown diamond, as a piece of acrylic or glass would be way too easy to spot to even a fairly untrained eye — has to have characteristics like “fire” which can’t be faked. Would be hilarious if it was  a LGD or CZ and stolen lol.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DexterFoley",
            "body": "I was definitely a publicity stunt.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Rich_Housing971",
                    "body": "So was I... the awful truth revealed by my parents on my 13th birthday.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "PSDSTR",
            "body": "Diamonds were there to promote a movie about Heists then they were \"mysteriously\" stolen it was all part of the show cant believe people are still talking about it",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "MrEngland2",
                    "body": "Finally someone who sees the obvious too",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "persepolisrising79",
            "body": "so. how she doing nowadays ?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Spiked-Coffee",
                    "body": "Bridget Hall is fine",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tuscan777",
            "body": "Only Christian Klien knows where that went. I saw him at a race event last year, lovely tan, perfect teeth, seems to be doing well…..pure coincidence I’m sure.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sarcastik_Moose",
            "body": "Publicity stunt or insurance scam.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AlexTheMacedonian",
            "body": "There never was a heist. The diamonds were fake and it was \"stolen\" purely to create mystery and drama.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Vlaed",
            "body": "My theory is they were real for pictures and replaced with fakes for the race. Someone snatched it (plant or rando) and it built more press attention.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Nr1231",
            "body": "How has this not been turned into a movie?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "KPthatguy",
                    "body": "Would make a great Oceans/National Treasure crossover film…..",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Necessary-Beat407",
                            "body": "Seeing as it was promotion for a Oceans movie, it would be a great setup if they made a Oceans movie about how the group stole the diamonds off the f1 cars in broad daylight",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KPthatguy",
                                    "body": "I’m not saying I’d watch it, but I’d probably watch it.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Necessary-Beat407",
                                            "body": "Be a good crossover and could be filmed on location for stationary scenes like the grid walk, where you could have George Clooney taking to Martin Brundle while the heist team doubles as a paddock crew and steal the gem (or fail! And have to figure out how to steal them after lights out and the race starts)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "_SteeringWheel",
                                                    "body": "So they then pretend to be the race engineer and tell Mark to plant it in the wall.\n\nUgh.\n\nToo far gone. Plus, it would be a proper wall break if in Oceans 14 they go and steal a diamond from a F1 car, that was there for the promotion of Oceans 12. That would fuck my mind so much, that they should just make it like Scary Movie style and go way over the top. Not just tell Webber to crash it, it was actually him in the end who set it all up and framed the Oceans.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "_SteeringWheel",
                                                            "body": "Or Last Action Hero style, so anything can happen, including an AI generated race between Senna, Schumi, Max and Ham in the same car.\n\nDon't ask me why or how, but it would be cool.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Fart_Leviathan",
                            "body": "But with Mark Webber playing George Clooney and Christian Klien (aka the most forgettable driver of the past 20 years) as Nic Cage.\n\nOn second thought, no, because Cage would probably be up for it if it seems fun enough.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "pumpman1771",
            "body": "Forgot about this. Thought it was a stupid stunt at the time, then the story got interesting and moved into the forgotten stage.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "the_bad_company_duke",
            "body": "Anyone have a good tl:dr of this? First time hearing about it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "StevefromLatvia",
            "body": "This is my favorite F1 story a lot of people don't know about",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PradaAndPunishment",
            "body": "and I will not turn myself in.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Rivendel93",
            "body": "Surprised I don't remember this lol, I imagine the diamonds were never real on the car, makes zero sense to put diamonds on the part of an F1 car that literally gets destroyed a good 50% of the time.\n\nHell, her diamond probably isn't real.\n\nIt costs way too much to hire security for stuff like this, it wouldn't be worth the trouble when you can just put fake diamonds there and no one knows the difference.\n\nAnd obviously the movie probably got a little more hype from it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Darth_Mumphy",
            "body": "I was at that race, good memories. Time flies though",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kendalld27",
            "body": "It was marketing for a heist movie. Coincidence that the diamond got lost in a heist itself...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "cepxico",
            "body": "Ok. Some rich kids lost their toys. Who cares.",
            "score": 1
        }
    ]
}