{
    "title": "Would you be open to accepting new territories into the US if they wanted to join? What would your criteria be for accepting/rejecting such proposals? Any specific places you would want to see join us?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nSuppose that, say, Ontario wanted to join the US. Would you be open to that?\n\nGenerally, what kind of factors would matter to you in deciding who could join (assume they want to). Geography? Language? Economy? Culture? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">Would you be open to accepting new territories into the US if they wanted to join? \n\nI'm not just open to it, I insist.\n\nWe are in the midst of the longest stretch our country has ever been through without adding a new state. I view this as a symptom of the 'we just can not do great things anymore' sentiment, and that sentiment needs to die.\n\n\n---------\n\n>What would your criteria be for accepting/rejecting such proposals? \n\n* They have to want it.\n* We have to believe it is in our best interests.\n\n\n---------\n\n>Any specific places you would want to see join us?\n\nGreenland.\n\nTrump seemed like a nut when he talked about acquiring Greenland, but that is mainly because he was going about it all wrong (suggesting he would 'buy it from Denmark' like this is 1803).",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "sliccricc83",
                    "body": ">We are in the midst of the longest stretch our country has ever been through without adding a new state. I view this as a symptom of the 'we just can not do great things anymore\n\nWhy must the US constantly expand to be great? This is the first liberal pro manifest destiny argument I've seen in my lifetime lol",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> Why must the US constantly expand to be great? \n\nIt doesn't *need* to \"expand to be great\", but it *should* expand when that makes sense.\n\nAlso an argument that it *can't* expand any longer is an argument that it has lost some of its greatness.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "scarr3g",
                                    "body": "But then we would have to buy new flags... And stuff is really expensive these days.\n\nSorry Puerto Rico, wait until inflation calms down.\n\n(/s)",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "sliccricc83",
                                    "body": "So every citizen of Greenland, which overwhelmingly voted for home rule, should just give up their rights of self-determination to become a state because......American exceptionalism? That's a terrifying logic",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "othelloinc",
                                            "body": "> > > What would your criteria be for accepting/rejecting such proposals?\n\n> > * They have to want it.\n\n> So every citizen of Greenland, which overwhelmingly voted for home rule, should just give up their rights of self-determination...",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "sliccricc83",
                                                    "body": "Literally not one single state was founded with the consent of its indigenous inhabitants lol. What you're describing is an impossibility. They will never want it (but I suspect you'd still want to subjugate them to US statehood)",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Fugicara",
                                                            "body": "Friend, what part of\n\n> * They have to want it.\n\nled you to\n\n>I suspect you'd still want to subjugate them to US statehood [even if they don't want it]",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "sliccricc83",
                                                                    "body": "He said he's not just open to more states, he insists upon it. I don't buy for a second that he actually cares about his prerequisites (their consent).  He said he was fine with the idea of Trump getting Greenland, as if Greenland hasn't been building their own democratic institutions for 50 years\n\nWhen someone says 'they have to want it', when that sentence is surrounding by a paragraph of colonizing language, you probably shouldn't believe them",
                                                                    "score": -8,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "The-zKR0N0S",
                                                                            "body": "Bro, c’mon",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "sliccricc83",
                                                                                    "body": "Bro, Greenland has had home rule since 1979 and has national health insurance. Why on earth would they become a state. It would literally become less democratic lol. But I guess liberals don't care about that? Manifest Destiny is more important it seems",
                                                                                    "score": 0
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Armpit_Supermaniac",
            "body": "I can't remember the title of the book at the moment, but there was this alt-History novel that had this very premise.......that the US opened itself to other territories/nations joining the Union. \n\nIn the novel, the first country that joined was Taiwan. Then it was followed by a really diverse group - the UK, South Korea, etc. The irony in the book was that the final territory to join was Puerto Rico.\n\nI would hugely support expanding the union globally.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "Yeah, you guys think now Castro is dead, Cuba might be into it? I’d love easier travel to Cuba ",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Lamballama",
            "body": "Sure, on three conditions:\n\n1) have to be able to access them geographically - if Tajikistan or some other landlocked power signed up tomorrow, we actually can't support them as a a primarily naval power\n\n2) we have to be values-aligned with the territory. Not in a political flavor-of-teh-day way, but on a more fundamental moral level\n\n3) ideally they wouldn't throw off the population balance (not a race thing, but just by sheer numbers) \n\n4) they join as an incorporated territory to be granted statehood when all laws are compliant with United States law and constitution\n\n5) they have to want it. Not the leadership, the people",
            "score": 3
        },
        {
            "depth": 0,
            "author": "CTR555",
            "body": "Of course, the more America the better!  The most important criteria is clearly that the change not result in too much border gore, so if we’re taking Ontario then hopefully we just take all of Canada - Ontario is like half of Canada anyway. \n\nI was never upset about Trump’s Greenland proposal.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "The prompt asks if we want to accept them if they want to join. \n\nSMDH at the idea that we would *ask* Canada. Sea to shining sea includes the Arctic.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CTR555",
                            "body": "True!  54°40' was for the weak - we shouldn't stop until we hit 90°.  Welcome to America, Santa!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ButGravityAlwaysWins",
                                    "body": "And then we take a short break and then go get ourselves some Chilaquiles and Al Pastor.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sadistmon",
                    "body": "Please take all of Canada.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "sliccricc83",
                    "body": "Why weren't you upset at Trump's Greenland proposal? Do you not think the Inuit people of Greenland deserve the same rights of self-determination you enjoy?\n\nGoing from current Greenland to US statehood would represent a significant backslide in democratic sovereignty",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "GiveMeAnEdge",
                    "body": "I think Canadians prefer their children living rather than dead.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CTR555",
                            "body": "Honestly, I have no idea what you’re talking about. But sure, that’s probably a safe assumption for people generally.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GiveMeAnEdge",
                                    "body": "Infant mortality and child mortality is significantly higher in the US than in Canada.",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Okbuddyliberals",
            "body": "Should require more than a simple majority to support it. Let's say something like 67% *of the total potential electorate* (as opposed to just 67% of voters). As long as there's a clear mandate for statehood, I'm fine with that - but they'd need to have more of a mandate than a simple majority of voters (like occurred with the last PR referendum)",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "GiveMeAnEdge",
                    "body": ">67% of the total potential electorate (as opposed to just 67% of voters).\n\nSo higher than any turnout the US has ever had? Just say no at that point. It's like people who claimed that Jim Crow laws weren't racist due to a technicallity.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Okbuddyliberals",
                            "body": "Look at the Hawaii and Alaska statehood referendums. That would, if I remember correctly (it's been a while since I looked it up and did the math to be fair), be a rather lower bar to clear than the way the vote for statehood ended up turning out in those cases (iirc something like 80% with 80% turnout or something along those lines, ended being the margins/results for those two votes)",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "its_a_gibibyte",
                                    "body": "I just took a look. \n\nHawaii statehood vote. 90% of registered voters voted with a 93% approval rate. Makes it that 85.6% of registered voters approved. \n\nAlaska was lower with an 83.4% approval rate out of people that voted. I couldn't figure out how anything about voters turnout though.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "octopod-reunion",
            "body": "It would have to be indisputable that the people there want it. \n\nThere would need to be a mandatory timeline of territory transitioning into state (so we don’t end up with another puerto Rico situation).",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "I would be open to merging the US and Canada into a single nation if the populations of both countries were supportive of it.  People have mentioned Greenland which I wouldn't oppose but am somewhat more hesitant about.\n\nI'm not as worried about economy but I think Geography, Language, and Culture are all important.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "azazelcrowley",
            "body": "There is not a realistic way for more states to join the USA without negotiating with them amendments, as most now have their own developed view of political rights and the role of government.\n\nThe exception is possibly US territories and nearby Caribbean island nations, largely due to the smallness of those countries and their economic precarity.\n\nJamaica might be a good bet. Polling indicates a majority wish they were still a colony of the UK (51-29), but a majority also wish they were a republic (59-27). That to me indicates that a US offer of statehood might be taken seriously by the inhabitants.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Shadow_Eator",
            "body": "Manifest destiny didn't stop at one. As ling as thry have influence over there ppl and industry it's fair",
            "score": 1
        },
        {
            "depth": 0,
            "author": "drhizouse",
            "body": "Yeah we just don't want any of those \"shithole countries\" 😂😂 /s",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Gsomethepatient",
            "body": "If that territory asked to join or if the united states invited them to join, if the US invited Mexico to join it would not only eliminate import restrictions but also make millions of illegal immigrants us citizens,",
            "score": 1
        },
        {
            "depth": 0,
            "author": "secretid89",
            "body": "Why would any territory want to join the US, at this point?   :)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ecothropocee",
            "body": "You guys can have Alberta",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MondaleforPresident",
            "body": "Probably yes, if they wanted.\n\nI don't want anywhere that doesn't want to join, but if I could pick anywhere to want to join, I would pick Atlantic Canada. That would add 8 pretty realiable Democratic seats to the Senate, and help with the House as well. Then we could pass all sorts of stuff and even probably create a social safety net similar to what Canada has, so those provinces/new states wouldn't even lose anything.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dachuggs",
            "body": "How about we support our current ones before trying to acquire more.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "GiveMeAnEdge",
                    "body": "Yeah like we already have enough poverty and domestic issues. We want to increase those? I think Greenland is doing just fine without school shootings.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "sliccricc83",
            "body": "The US should have far less territory, considering all of it was stolen in the first place",
            "score": 0
        },
        {
            "depth": 0,
            "author": "GiveMeAnEdge",
            "body": "Why would I want to drag more people into this shithole? I think states need to start seceding, not the other way around.\n\n>You can leave\n\nI have already. I live in australia now. Idiot.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "rnason",
                    "body": "You can leave",
                    "score": 1
                }
            ]
        }
    ]
}