{
    "title": "What do you think of Daniel Perry's pardon by Abbott in Texas?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nDaniel perry a groomer, a pedophile and a convicted murderer was pardoned by Abbott for killing Air Force veteran Garrett Foster. \n\n \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "diplion",
            "body": "I think prominent Republicans are in a race to the bottom of absolute depravity.",
            "score": 45,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ok_Star_4136",
                    "body": "I think I can't take conservatives who would vote for Abbott seriously when they talk about pro-life, respect for law and order, or morals in general.  Frankly, I'm tired of pretending that their opinions should be respected and given equal weight with my own when they do not actively reject this type of thing even at a symbolic level.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Snuba18",
            "body": "I'm baffled how in a state that basically encourages open carry seeing a guy with a gun walking towards you is apparently justification for shooting them.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "jcmacon",
                    "body": "He was convicted by a jury of his peers. There is no justification in this other than Perry killed a BLM protest or and Abbott is a racist prick that is soft on crime perpetuated against people who don't agree with him.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Therealbradman",
                            "body": "> He was convicted by a jury of his peers\n\nNot a great argument imo, many pardons are issued to people who were convicted by juries, and I don’t think I oppose all of those.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "greenflash1775",
                    "body": "It’s because they only encourage open carry for their brown shirts. Anyone else does not enjoy gun rights.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "perverse_panda",
            "body": "My thoughts are that state-sanctioned vigilante violence is a hallmark of fascism.",
            "score": 31
        },
        {
            "depth": 0,
            "author": "Apprehensive_Fix6085",
            "body": "Daniel Perry killed a fellow citizen. Daniel Perry was convicted of murder by a jury of his peers. Daniel Perry was pardoned almost immediately by the Texas Governor.\n\nDaniel Perry deprived our fellow citizen of the due process he was allowed. Abbot, the Texas Governor, pardoning Perry so soon nullifies the jury. \n\nThe whole thing stinks to high heaven.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ok_Star_4136",
                    "body": "Thank you!  I don't mean to put you on the spot, but it's refreshing to hear a conservative give a reasonable empathetic response.  Yes, unfortunately this is a rare occurrence in my experience.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Weirdyxxy",
            "body": "I'm glad I don't live in Texas, and I really don't like pardon powers for this reason. You can just let dissenters be killed this way",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "VeteranSergeant",
                    "body": "I think parole powers should exist, but parole boards should be independent and bipartisan, with elected members.  \n\nThe idea of handing pardon privileges to a single executive is an antiquated relic of the time when the king or local lord held absolute power over their subjects.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "Pardon should only mean that you will not be executed. You still have to serve your time but you won't be put on the electric chair for it.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheOneFreeEngineer",
                            "body": "That's a insane take. And irrelevant considering the death sentence wasn't on the table in this case.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "We're talking about a convicted murderer here. You need a very, very good reason to pardon that.\n\nBtw, watch this sub when Trump pardons himself for every single charge possible if/when he becomes president....",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheOneFreeEngineer",
                                            "body": ">We're talking about a convicted murderer here. You need a very, very good reason to pardon that.\n\nI agree and abbot abused the system for political points. But the idea that pardons in general should only save someone from the death penalty is insane.\n\n>Btw, watch this sub when Trump pardons himself for every single charge possible if/when he becomes president....\n\nI mean he just simply can't, he can't pardon himself for the dozens of state felons he his facing. \n\nBut the point is that abuse of the pardoning system (which Trump already did by selling pardon before he left office) is not good enough reason to dismantle the whole idea of what a pardon is on a fundemntal level",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "All the charges, as far as I know, were made in another state than New York.  \n\nHe has two federal charges, one in Florida and one in Washington DC. Both could/can be pardoned by the president. \n\nThen, you have him falsifying his business documents which is handled at a state level and him being charged for trying to overturn elections in Georgia. One is handled in New York, the other in Georgia. Normally, you may correct me if I'm wrong, you'd suspect that Trump as president could postpone the business documents or pull it up to the SCOTUS. If the same goes for the case in Georgia, you'll see him run away without even a scar. \n\nIt's ironic, but I would place my bets on him never being injailed or even convicted.\n\n>But the point is that abuse of the pardoning system (which Trump already did by selling pardon before he left office) is not good enough reason to dismantle the whole idea of what a pardon is on a fundemntal level\n\nI understand the concept of a \"pardon\", but I do not see a realistic implementation of it. Simply put: For every case in which it should've been used (e.g. Carter pardoning draft evaders), there will be 10 in which it shouldn't (e.g. Ford pardoning Nixon). It's one of those things you need a people who believe in the fragility and the necessity of the democratic checks and balances for. \n\nJust look up all the pardons in the past, how many should've taken place? How many are presidents acting out of self-interest instead of fighting injustice?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "engadine_maccas1997",
            "body": "I guess it’s ok to shoot people in Texas you see exercising their right to open carry now, if you claim to be afraid, according to Gov. Abbott. \n\nHaving a history of racist messages, musings about shooting BLM protesters, and a history of grooming minors isn’t a disqualifying factor, either. \n\nBut in all seriousness, this is another incident of the modern Republican Party openly celebrating political violence. Daniel Perry revived a fair trial by a jury of his peers, and was deemed guilty. I can guarantee you if the roles were reversed and Daniel Perry was a BLM protester who shot someone under the same circumstances, he wouldn’t even be on the Governor’s or right wing media’s radar.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "greenflash1775",
                    "body": "It’s ok to shoot the “right people” in Texas. It always has been. That and it’s always projection, they accused Dems of this with BLM because it’s how they want the law to work.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "I haven't heard anything about him being a groomer or a pedophile so I'm going to take that with a grain of salt.\n\nThat being said there are a lot of things that I strongly disagree with Republicans.  There are a smaller number of things that I believe they have to be huge assholes or idiots to believe.  I understand however that part of being in a society is having to deal with people that you disagree with and do not like, and that it's even possible those people might actually even be correct every once in a while making you better off than if they were not also part of society.\n\nEvery once in a while however something happens which steps outside of that general dynamic into a thing that everyone in society should be in agreement is unquestionably unacceptable.  January 6th was one such event, the pardoning of Daniel Perry is another.\n\nI checked askconservatives for a question about this and was disappointed in what I saw.  To be fair most of the people were at least hemming and hawing about their position rather and the few who were openly celebrating it were down voted (though that may have been by non-conservatives), but no one just acknowledged this is an absolute miscarriage of justice for clearly partisan reasons.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "Thats cause that miscarriage is fundamental to their ideology as right wingers. Its not a problem, *its the solution*",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "GortimerGibbons",
                    "body": "https://www.texasobserver.org/daniel-perry-pardon-greg-abbott-garrett-foster/",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "GabuEx",
            "body": "It's no different than the Philando Castile case.  If it's legally acceptable to kill someone on the basis that they have a gun, then you do not actually have the right to own a gun.  Anyone who supports the second amendment should be appalled by this.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "EngelSterben",
                    "body": "Go tell that to r/firearms",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sleep_On_It43",
            "body": "I think it is indicative of the modern day Republican Party.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Gertrude_D",
            "body": "I think that being a a groomer and pedophile is not relevant to what happened. What did happen was pretty disgraceful. From what I understood of the case, his conviction was justified. Apparently the jury thought so too. The real crime is carrying a gun if you hold views the people in charge don't like.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "NoDivide2971",
                    "body": "Since a pardon has to consider if the convict has been reformed, the grooming and the pedophilia are relevant.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Gertrude_D",
                            "body": "But that wasn't relevant to the crime he was convicted of. I honestly don't see the relevance.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Unban_Jitte",
                                    "body": "If we're going to pardon people,  I'd prefer they'd be generally upstanding citizens that fucked up one time,  rather than just generically despicable people that finally got caught for something that stuck.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Gertrude_D",
                                            "body": "I mean, I don't want him pardoned period. As far as I am concerned, he went in looking for an excuse to kill someone and found one.\n\nBut let's look at your criteria. If someone were jailed for marijuana possession and had a couple of petty crimes on their record, would you oppose them getting pardoned for the possession because they were not the right kind of person?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FreeCashFlow",
            "body": "“Conservatism consists of exactly one proposition, to wit: There must be in-groups whom the law protects but does not bind, alongside out-groups whom the law binds but does not protect.”\n\nIf you are a Texas conservative, you can shoot your ideological opponents at will and be pardoned. If you are not a conservative and you do the same, the full force of the law will fall upon you. ",
            "score": 5
        },
        {
            "depth": 0,
            "author": "EngelSterben",
            "body": "Fucking hate it. I've seen way too many right wingers on certain gun and political subs completely ignore this just because Foster was a \"liberal\"(he was a libertarian). Fucking stupid that just carrying around a firearm is now grounds for being shot by some fuckboi looking to kill protestors as he put it.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "jcmacon",
            "body": "I think Abbott is vying for VP pick and needed something big to put him in the national news cycle.\n\nEdit: he isn't dying, he is vying.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "postwarmutant",
                    "body": "> he isn't dying, he is vying.\n\nToo bad.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jcmacon",
                            "body": "Damn nice one.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "EchoicSpoonman9411",
            "body": "It reinforces my view that Wilhoit's view of conservatism is likely the correct interpretation.\n\nIf that's true, then those opposed to the fascist right should do everything they can to disenfranchise them, rather than holding to high-minded ideals of fairness.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Greg Abbott is a piece of shit and so is Perry.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PlayingTheWrongGame",
            "body": "It’s soft-on-crime Abbott signaling his support for murdering liberals at protests. ",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Sammyterry13",
            "body": ">What do you think of Daniel Perry's pardon by Abbott in Texas?\n\n\nI think we're in a cold civil war that is increasingly becoming dangerous for the rational, moderate, left, minorities, LGBTQIA2S+, and women.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "VeteranSergeant",
            "body": "The dude said he wanted to shoot protesters.  Then he went looking for protesters by driving around a protest he knew was happening. Then he shot the first guy he saw with a gun, and admitted the guy never pointed the weapon at him.\n\nBut he shot a civil rights protester, so of course he's a right wing hero. Republicans in America don't actually believe in anything.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Muhabba",
            "body": "It's a great time to be white.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sleep_On_It43",
                    "body": "Good time to be a white bigot, you mean…(Foster was white).",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "Late_Cow_1008",
            "body": "Its ridiculous. The feds should get involved.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "The_Grizzly-",
            "body": "He couldn’t even care about the people who served in the US Military. Even from a right wing POV, this is very anti-American",
            "score": 4
        },
        {
            "depth": 0,
            "author": "material_mailbox",
            "body": "This: [https://www.thebulwark.com/p/daniel-perry-and-the-republican-meaning?utm\\_source=profile&utm\\_medium=reader2](https://www.thebulwark.com/p/daniel-perry-and-the-republican-meaning?utm_source=profile&utm_medium=reader2)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Dell_Hell",
            "body": "Reddit terms of service prevent me from sharing my thoughts on this matter in a comprehensive and accurate matter.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TheSoup05",
            "body": "This guy went before a jury in Texas of all places and was convicted, and he’s going to walk free because a Republican governor is just cool with murder. \n\nAnd you might expect most Republicans who pay lip service to caring about law and order, being “pro-life”, or even just advocating for gun rights would be pretty fucking quick to condemn that. But no, of course now they just think guns are scary and so murder is totally fucking cool. What a bunch of fucking disgusting hypocrites. \n\nIt’s seriously not a joke. It’s really fucking vile, and I don’t think anyone justifying this or making excuses for it is a person worth listening to or whose words have any value.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "-Quothe-",
            "body": " Ot at all unexpected. Sadly.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BiryaniEater10",
            "body": "For me, there was a solid case for a “not guilty” in trial, and a reasonable question about whether the case was beyond a reasonable doubt. Ultimately, the jury felt one way though, and I don’t see this as what pardons are to be used for,",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheOneFreeEngineer",
                    "body": ">For me, there was a solid case for a “not guilty” in trial,\n\nOnly if you ignore all the evidence and context presented in the trial",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BiryaniEater10",
                            "body": "The correct answer was “guilty as shit” for me but I could see how someone thinks an armed person walking to your car is a threat. Still, *I* don’t think you can have open carry without freedom of movement while open carrying so hence why I don’t like that defense. Again, I don’t think pardons are for making political statements on close cases anyways.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheOneFreeEngineer",
                                    "body": ">I could see how someone thinks an armed person walking to your car is a threat.\n\nIn an open carry state (or even in a non open carry state), being armed in and of itself is not a threat. And by that logic driving a car into a crowd of protesters is also a threat which is what happened. It's illogical defense and unreasonable, not a reasonable doubt.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "greenflash1775",
                    "body": "Only if you think the mere presence of a gun is threatening, which 2A nerds have assured me is absurd.",
                    "score": 3
                }
            ]
        }
    ]
}