{
    "title": "Is there value in the Jordan Klepper style Republican street interview videos? ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nDo they add to our understanding and discourse? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "material_mailbox",
            "body": "It has entertainment value. And I guess it's kinda interesting to see how stupid some people can be, but the clips are cherry-picked so it's not like you can watch them then come away with the conclusion that all right-wingers are like that.",
            "score": 29,
            "replies": [
                {
                    "depth": 1,
                    "author": "KingBlackFrost",
                    "body": "A lot of them, are though. Like... you can say \"oh it's just cherry picked\" but they sound exactly like all the conservatives I know. And I mean 'in person' not 'online'.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "Really?!?! Ive never met one who sounded like that. The most unhinged thing ive heard them say in person is that they fear the left going around guillotining Christians who wont denounce their faith.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "03zx3",
                                    "body": ">The most unhinged thing ive heard them say in person is that they fear the left going around guillotining Christians who wont denounce their faith.\n\nLike, that's pretty fucking unhinged.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "It is! But its not the brand of stupidity that we see in those clips",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "WildBohemian",
                                                    "body": "It's just as stupid if not more stupid.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Inquisitor_ForHire",
                                                            "body": "Right?  We're not the French!  We don't guillotine!  I mean worst case would be lethal injection using some hard to find pharmacuetical that's totally just like going to sleep and nothing like being paralyzed while you feel like your drowning!",
                                                            "score": 3
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Sad_Lettuce_5186",
                                                            "body": "The method of the murdering isnt important. \n\nI dont think thats comparable to shit like “JFK Jr has been faking his death all along and will reveal himself on this day to announce that he’s going to be Trump’s running mate and that he’s got a list of people he’s got evidence on for criminality and theyre gonna go after them together” type shit. \n\nIts fair if you dont think that theyre that different, but they sound very different to me",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "WildBohemian",
                                                                    "body": "The idea that the left has any desire to kill christians is so unbelievably stupid that the JFK jr. thing, though completely stupid as well almost seems benign by comparison.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Sad_Lettuce_5186",
                                                                            "body": "How?\n\nOne is \n\n“These people who I am actively beefing with may kill me and my family” \n\nThe other is \n\n“This guy has been faking his death for decades and is really a spy and is now ready to reveal the plot and join the President as his VP”",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "WildBohemian",
                                                                                    "body": "Neither has any basis in reality.  The JFK thing is weirder but they are equally stupid things to believe and if anything the Christian lynching nonsense is much more destructive.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "PlayingTheWrongGame",
                                    "body": "I’ve definitely heard some insane takes similar to those aired by Klepper, among conservative acquaintances. ",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "CharlieandtheRed",
                                    "body": "Bro, you need to meet my mother then!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "What does she say? Lol",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Pauly_Amorous",
                    "body": ">but the clips are cherry-picked\n\nI feel the same way about most of these type of interviews from either side, but you never really know how many people they interviewed before they found the few dumbasses who embarrassed themselves on camera.\n\nI reckon the only way to know for sure is to go out and interview people yourself.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dr_Scientist_",
            "body": "> Do they add to our understanding and discourse?\n\nYes.\n\nI don't think they transform Trump voters into non-Trump voters but they do provide insight into the kind of person that attends Trump rallies and will reliably vote for Trump.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Unban_Jitte",
                    "body": "Nobody is going to do a 180, but the more you expose people who are on the cusp to the idiots they are associating themselves with by proxy,  the more they are going to waver.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "cthulhus_tax_return",
            "body": "Who cares? They’re hilarious.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "pillbinge",
                    "body": "I think people care when they've come to realize that through careful questioning and editing, you can make people seem like they're saying anything. When you quickly edit things, it gives the impression that everyone is of one mind, and that really you're revealing more of the same position.\n\nIt worked years back for sure. I think we've grown up. Funny, but that's why someone would care. You could literally go back and watch the Sailor Socialism interview and imagine it being chopped up to paint Dasha like an idiot, but she handled it very well.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "CG2L",
            "body": "It’s entertaining and it shows how far “normal” people have fallen down the rabbit hole/believe the garbage they are told.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "phoenixairs",
            "body": "The channel is Comedy Central. It's entertainment.\n\nIf you're holding them to the standard of news, journalism, and political discourse, then there are other \"News\" channels that try to pass themselves off as news doing worse. [Example](https://www.youtube.com/watch?v=PJmnLzw8NA4) But like, why are you holding them to the standard of news?",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "Im not. \n\nI dont think you have to be legitimate news (he calls himself a fake journalist) to spread a message. \n\nI question if that message is a good one. It seems to be that Republicans are just so gosh darn stupid.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phoenixairs",
                            "body": "> It seems to be that Republicans are just so gosh darn stupid.\n\nIs it? Why Republicans, and not Americans (broader) or Trump supporters (narrower)?\n\nI just went to watch a few (because I don't actually watch regularly) and it's clear that it's the dumbest or funniest comments from Trump supporters at a rally or whatever. Why are you concerned that people don't get this?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ewi_Ewi",
                                    "body": "> Why Republicans\n\n[Because the data supports it](https://www.cnn.com/2023/08/03/politics/cnn-poll-republicans-think-2020-election-illegitimate/index.html):\n\n> The share of Republicans and Republican-leaning independents who believe that President Joe Biden’s 2020 election win was not legitimate has ticked back up, according to a new CNN poll fielded throughout July. All told, 69% of Republicans and Republican-leaners say Biden’s win was not legitimate, up from 63% earlier this year and through last fall, even as there is no evidence of election fraud that would have altered the outcome of the contest.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "phoenixairs",
                                            "body": "Sure, but my point is that watching select clips of people saying dumb things on a comedy show is not by itself sufficient to draw any conclusions about the larger group. And in this case, the \"larger group\" seems to be of arbitrary precision.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Some dont. Whenever i see klepper brought up its to justify people arguing that conservatives are mind numbingly stupid cultists",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "phoenixairs",
                                            "body": "> people arguing that conservatives are mind numbingly stupid cultists\n\nIf it doesn't come with sound reasoning, then is this not also just dumb people yapping?\n\nI feel like the standard for releasing content shouldn't be \"can idiots misinterpret or draw bad conclusions from this\"?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AddemF",
                    "body": "This is precisely the Fox News defense.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phoenixairs",
                            "body": "Well see, when the logo on the screen says \"News\" and you do this, then you're misleading people and full of shit.\n\nWhen the logo says \"Comedy\" and you do this, you're doing what you said you would.\n\nIf \"Fox News\" changes their name to \"Fox Entertainment\" and calls themselves fake journalism while doing these bits, then they can do it too.\n\nFair enough?",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "grammanarchy",
            "body": "It’s funny, but it’s just nutpicking.  It’s not helpful.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "justsomeking",
                    "body": "It certainly helps my day.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "wonkalicious808",
            "body": "They're in line with my experiences with Republicans when I campaigned and worked for them. So in terms of adding to \"our understanding,\" sure, if you didn't already know this about Republicans. And it's hilarious and sad.\n\nHe's obviously talking to the kinds of Republicans that show up at events. But even the ones I only met at the office were delusional and crazy. Probably the main difference between the event Republicans and the office Republicans was how loud they were.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "Entertainment value and self gratification mostly. \n\nI guess there is a type of normie that doesn’t follow the media close enough to realize that people like that exist and exist in not just fringe numbers but who also watches the daily show could get them to embrace the reality of what we’re actually facing.\n\nThe problem is that enjoying the daily show requires that you follow the news at least a little closer than the average person so I don’t think if that big number of people.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "_psylosin_",
            "body": "Yes, amusement",
            "score": 3
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Not much past entertainment.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Gertrude_D",
            "body": "Yes, but it entirely depends on the motivation. I've seen these interviews where the interviewer is doing so in good faith and trying to figure out where our commonalities lie instead of trying to get a good soundbite. Those are great IMO. I would love to see more of that type of discourse.  If they are done for entertainment value, I am tired of them.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DoeNaught",
            "body": "Maybe a little because you actually get to hear directly from them. At the same time he's likely cherry-picking the interviews he shows so it probably gives a skewed view of them.\n\n\nI think channel 5 with Andrew Calahan did a better job overall at interviewing Trump supporters for the purpose of understanding them. Klepper sometimes seems to speak with them with a certain amount of smugness and/or disdain (I don't fully blame him though... he probably has plenty of people hostile to him). While Andrew does a good job a remaining mostly neutral. That is probably partially due to one being more after a series of sound bites, while the other mainly does longer stuff.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": "Eh...\n\n\nThat doesn't really help anything. Just kinda presenting the edge cases as normal cases.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "I feel similarly. It feels like we’re supposed to point and laugh and I dont think that helps anything",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "justsomeking",
                            "body": "What help are you expecting from it? It's pretty straight forward about being entertainment.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "I dont think so. Klepper also interviews political operatives and bureaucrats. He’s blending entertainment with mild journalism and that makes his message skewed",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "justsomeking",
                                            "body": "What is the message you think he is trying to to get across?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "That Trump supporters arent reasonable people and thus we need to just outvote them",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "justsomeking",
                                                            "body": "What message would you prefer to see?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sad_Lettuce_5186",
                                                                    "body": "These Trump supporters and Right wingers actively want or prefer the type of government and society Trump is promoting over the alternative. They like that stuff, and are in line with traditional Americans in that regard. We need to vote against them and recognize that this isnt a one off fringe movement, but a recurring issue that is inherently baked into our culture.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "justsomeking",
                                                                            "body": "I guess I'm not seeing the disconnect here. He's highlighting why it's important to vote against these ideals, and showing that there are people out there who's ideas should be on the fringe but have become mainstream. Isn't it better to put a spotlight on them?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Sad_Lettuce_5186",
                                                                                    "body": "In one scenario theyre just too damn stupid to know better and are a newfangled phenomenon. They don’t want bad things, theyre just dumb and cant recognize the bad things. \n\nIn the other, they know what theyre doing and they arent fringe. Theyre typical. \n\nThe first interpretation lets privileged people engage with it at surface level and makes it likelier that we fail",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "justsomeking",
                                                                                            "body": "I feel like I lean towards the first point. They are dumb. And they don't want bad things for themselves, so that is relative. I think Keppler assumes his audience is aware of trump supporters and why they are bad, so he chooses to focus on highlighting the ridiculous ones. More of a \"these people vote, do you?\"",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                    "body": "They want bad things for us, good things for themselves at our expense",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "justsomeking",
                                                                                                            "body": "I agree, but I don't think they would. In their mind they want good.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                    "body": "Its fine if they dont agree. Klepper isnt portraying that\n\nYou get a lot of White people who simply do not believe that right wingers want bad things for others. They think right wingers want the same outcomes and just have different methods or think that right wingers are brainwashed by recent media into being some new extreme. Neither are true. \n\nIt distorts reality and since White people are the biggest voting block, thats dangerous",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kakamile",
            "body": "It's better than other street videos that tend to shorter clips of more surprised people. Klepper lets them tell their stories and sink themselves. \n\nBut it's still just entertainment.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "alpacinohairline",
            "body": "Yes, it’s literally the liberal equivalent of what Charlie Kirk and Ben Shapiro did to build their platforms. It illustrates how dumb and unaware the other side is . Just in this case that 9/10 times, these are tax paying adults that are embarrassingly ill-informed.\n\nIn this social media day and age, videos like these play a bigger role in political idealogy formulation than one would want or expect….",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tommy__want__wingy",
            "body": "They do both.\n\nThey are nitpicky in that they are going to ask questions that we already know how a Republican voter will answer.\n\nThat’s grounds for discourse.\n\nThey also provide understanding on how crazy SOME voters can be.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AddemF",
            "body": "I suspect it makes everything worse by being antagonistic and cruel.  I'm not commenting on whether those specific individuals deserve it; but using that to represent conservative people and voters as stupid and bad, is probably just adding to everyone's bitterness.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FiveStarPapaya",
            "body": "Absolutely. It paints a picture of how republicans think and reason.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Annie_Rection__",
            "body": "They're done by both sides and they only prove that there's tons and tons of stupid people on both sides. \n\nIf you think most of your political opposition is as dumb as the people in those videos, you're probably not much smarter",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Certainly-Not-A-Bot",
            "body": "It's funny, so... that's the value. They don't really contribute much to actual political discourse, but it is fun to laugh at Republicans with insane opinions",
            "score": 1
        }
    ]
}