{
    "title": "Why isn’t more attention given to the fake elector plot, and instead goes to the January 6 riot?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nPeople talk about Trump trying to seize power in the 2020 election, that he wants to be a dictator, but all I ever see them reference is inciting the riot/insurrection on January 6. That was pretty messed up, but it could be argued in court that he did t specifically try to stop the election. \n\nHowever, the [fake elector plot](https://en.wikipedia.org/wiki/Trump_fake_electors_plot) was such a blatant attempt to steal the election, and he was more obviously and directly involved. It was undeniable election fraud on an incredible scale, seven key states in a presidential election. He has been indicted, and he is arguing he should be immune, but it seems to get little to no attention, at least in my circles on Reddit and in life. It seems so damning.\n\nWhen people are trying to explain why Trump is treasonous, or has aims to be a dictator, or is wrong about Democrats cheating the election, why isn’t this always the first piece of evidence? Why, unlike 1/6, do I never hear about it? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LucidLeviathan",
            "body": "Because the fake elector plot requires knowledge of how the electoral college works, which most Americans don't have. There's no good footage to show the fake elector plot, whereas there is footage of people breaking windows and making asses of themselves on January 6. It's simply a matter of what gets through to the average person.",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "bearington",
                    "body": "Exactly this. If a simple slogan or buzzword isn't enough to explain it or evoke a memory it's not gaining traction. Doubly so if there is any level of nuance behind it (e.g. legalities, shades of grey, etc). \n\nThe Democrats have long suffered from this dynamic. Although there's a lot more to it, this is one of the reasons they don't do well with non-degree holders. What I don't understand is why they don't hire people to help them message more effectively. The Lincoln Project has shown it's possible. Now if only someone who isn't a disaffected Republican can learn those skills",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "Its not that. \n\nIt doesnt matter what their message is, theyre the opponents of the White Party. And thats what matters most of all",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "LucidLeviathan",
                                    "body": "I know a lot of conservatives, and at least around here, that doesn't seem to be the motivation. They believe - foolishly - that Republicans are better for the economy.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "Even in the face of data saying otherwise? M\nYou never stop and consider “hmm. Maybe theyre not telling me the full story”?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LucidLeviathan",
                                                    "body": "They don't look at data. They just believe that Republicans are better for the economy and vote that way. It's not a position they've reasoned themselves into. It's what they've heard, and they just believe it to be true.\n\nMy Mom is also a hardliner on abortion, and is practically a single issue voter against access to abortion.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bearington",
                                                            "body": ">They don't look at data. They just believe that Republicans are better for the economy and vote that way. It's not a position they've reasoned themselves into. It's what they've heard, and they just believe it to be true.\n\n100% this. My Republican friends fall into two groups:\n\n1. Rich friends from my MBA days who like the people who keep their taxes and regulations on their businesses low. This one is obvious and not who we're discussing.\n2. Lower class to middle class people who grew up being told they were Christian and that they vote Republican. Their entire family is the same as is most of their social circle. They have zero incentive to question their lifelong beliefs, much less risk othering themselves from their friends and family.",
                                                            "score": 2
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Sad_Lettuce_5186",
                                                            "body": "Ask your mom if she were to choose between policies that guaranteed racial equality and policies that guaranteed the end of abortion, which she’d choose",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "LucidLeviathan",
                                                                    "body": "She doesn't consider racism to be a significant problem today. She's wrong, of course. That doesn't mean that she supports \"The White Party\".",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Sad_Lettuce_5186",
                                                                            "body": "You can still ask her. Ask her pretend it is a significant issue. \n\nI ask conservatives shit like this and they side with the White party regardless. Theyll say things like “i’d support the return of segregation if it meant ending abortion”",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "LucidLeviathan",
                                                                                    "body": "I'm not going to do that, and that's quite silly.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Sad_Lettuce_5186",
                                                                                            "body": "What makes it silly?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "LucidLeviathan",
                                                                                                    "body": "Because it's not the way that they think, and it frames *everything* in a racial dimension. It's not in the top 5 considerations for her, or most conservatives. The vast majority of conservatives *just don't care* about racial issues. That's a problem, but it doesn't mean that the intentionally vote for \"The White Party.\"",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                            "body": "You just know this intuitively?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "LucidLeviathan",
                                                                                                                    "body": "We've talked about related topics before.",
                                                                                                                    "score": 1
                                                                                                                },
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "MaggieMae68",
                                                                                                                    "body": "u/LucidLeviathan is correct. \n\nThat isn't \"intuitive\" knowledge. It's knowledge based on having friends and family (especially family) who are exactly like that. \n\nThey don't think racism still exists. They think that Dems who mention it are pushing \"identity politics\". And they think that anyone who claims the Republicans are the \"White Party\" is practicing \"reverse racism\".",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                            "body": "I have had friends like that too. If you dont ask them hard questions, its no surprise they dont give hard answers.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "LucidLeviathan",
                                                                                                                                    "body": "Asking people \"hard questions\" is rarely a way to get them on your side. If you ask somebody a \"hard question\", it's infinitely easier for them to just shut down and close you out.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                            "body": "The hard questions did make one of my friends and one of my relatives each vote differently. \n\nAvoiding learning problematic things about the people you love does us no good. It allows hideous beliefs to remain hidden. We should be acknowledging them and then we should go from there",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "LucidLeviathan",
                                                                                                                                                    "body": "I've had discussions that touch on these issues. I know how they think. Framing something in that way is not going to get anywhere.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                                            "body": "But have you directly asked them?",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "LucidLeviathan",
                                                                                                                                                                    "body": "I don't understand precisely what question you're asking. I'm also not going to inject some rando from the internet's opinion in my family dynamic.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                                                            "body": "Do you directly ask them tough questions, or do you talk about topics that could be made difficult if they take it there?\n\nNaturally. Im more curious about the dynamic now. Assuming youre a typical person, the way you approach those talks may be similar to how most people do.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "author": "LucidLeviathan",
                                                                                                                                                                                    "body": "I have before. It usually ends up being awkward and uncomfortable. Doesn't really change minds.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "depth": 22,
                                                                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                                                                            "body": "Was it awkward and uncomfortable because they felt like you were trying to out them or judge them or something?",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "depth": 23,
                                                                                                                                                                                                    "author": "LucidLeviathan",
                                                                                                                                                                                                    "body": "Not exactly. Let me give you a counterexample. Let's say that you had a conservative family member. Let's say that this conservative family member approached you and said something like this: \"You know, I really think you need to rethink this whole 'defund the police' thing. Black people have it better than they ever have in this country. Racism isn't really a problem. Meanwhile, stuff like Black Lives Matter makes people who aren't Black feel like they're less important. It makes me really uncomfortable whenever you talk about these things.\"  How would you react?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "depth": 24,
                                                                                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                            "body": "I’d ask them what metrics they were using to determine that Black people are better off now.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "depth": 25,
                                                                                                                                                                                                                    "author": "LucidLeviathan",
                                                                                                                                                                                                                    "body": "But how would you feel emotionally about this conversation?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "depth": 26,
                                                                                                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                            "body": "I’d feel like they were being reasonable and I would appreciate how they said their view very respectably. \n\nThe conservatives I talk to are pretty similar (more jabs at times though). Ultimately, theyre dumb evil people. I just think they have bad morals (often the conversations reach that conclusion. The evidence is there and it makes no difference because they still want what they want. Often its to not have to lose privilege. Which is reasonable, just unfortunate.)",
                                                                                                                                                                                                                            "score": 1
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HotStinkyMeatballs",
                                                                    "body": "She'd probably choose racial equality. If no one has legal access to abortion that's racially equal.\n\nBut that's the response you get when you put illogical hypotheticals out there in an attempt to prove an opinionated \"point\"",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Sad_Lettuce_5186",
                                                                            "body": "Its not a gotcha, its a straight up value question.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "HotStinkyMeatballs",
                                                                                    "body": "I never said it was a \"gotcha\".",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Sad_Lettuce_5186",
                                                                                            "body": "Ah sorry, i saw opinionated point and reworded that in my head \n\nIt increasingly seems like the people who dont see racism, dont see it because they dont want to. \n\nYou can just ask them questions and theyll usually tell you",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "StatusQuotidian",
                                                            "body": "My Mom is a hardliner on abortion, but she's also someone who decries the loss of \"decency\" in America. Of course, decency here means the time when people all knew how to behave. And by \"knew how to behave\" she means \"didn't make me uncomfortable by being gay or brown in public.\"",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "bearington",
                                    "body": "I used to feel the same but then I watched Obama win my state of Indiana. Don't get me wrong, I know that racists will align with the Republican party. They're not the driving force though.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "st0nedeye",
                                            "body": "It depends where you are.\n\nI'm from CO.  Racial identity has little to nothing to do with political parties here.  \n\nGo to the South and the GOP is basically a white identitarian party.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "You dont have to be openly racist to support the White party. \n\nYou can just want better for your family even if it comes at the expense of others",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "StatusQuotidian",
                    "body": ">there is footage of people breaking windows and making asses of themselves on January 6\n\nI mean, there's footage of people in Trump campaign gear trying to kill police officers",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "lobsterharmonica1667",
                    "body": "Also the conservative media keeping saying that the issue the things that Trump said on J6. Like isn't it absurd that he's getting in such trouble for giving one speech one day.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "Partly because understanding the fake electors plot requires more than a basic understanding of how the system works and most people don’t understand anything about how the system works. The riot is easy to understand and has a visceral visual component. It looks like an opening scene in a dystopian movie. \n\nPartly because democrats are generally very dumb when it comes to marketing.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "FizzyBeverage",
            "body": "***The average American couldn't tell you who their governor is***. Forget about senators or their rep. Plenty of them don't know if they live in a red or blue state and what that might mean for them.\n\nMost of them assume their vote for president means something, and don't understand what an \"electoral college\" or 270 means. I've actually had a coworker ask me \"*where is the electoral college, in DC or something*?\" She's basically the typical American, not the exception.\n\nJanuary 6th is easy to understand. It's lunatics smashing the windows of a federal office building. Riots are easy to understand.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "People are facing legal consequences for the scheme. But it's more complex to explain to people. Most people can't name the three branches of government.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Both-Homework-1700",
                    "body": "I hope you mean the general population and not regristerd voters if regristerd voters don't know the branches of government that's concerning",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Odd-Principle8147",
                            "body": "I know quite a few active voters who couldn't name the three branches of government when asked. Across all demographics.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "e_hatt_swank",
            "body": "The question's already been answered well by other folks here (we all watched Jan.6 in horror on TV; the electors plot is complicated & nuanced, etc.) but I just wanted to add an additional point ... it frustrates me to no end that we tend to talk about this stuff with regard to isolated pieces of the attack on democracy (Jan.6, the electors) rather than approaching it as a large, organic whole beginning with that piece of trash Trump refusing to accept his loss in November 2020. \n\nTrump's attacks on the vote counting (\"Stop the count!\"); spreading bullshit lies about something mysterious happening when mail-in votes were added to vote totals;  MONTHS of this asshole running around screaming \"we won! it was stolen!\" to his hordes of brain-dead cultists while almost no Republicans in positions of power had the balls to tell him to shut the fuck up; all of this leading up to Jan.6 where he was screaming at them \"you have to stop this! you cannot let this happen!\" ... the violence was inevitable at that point. But all of his incitement from November into January gets glossed over somehow, because it's Trump being his typical egomaniacal, bullshitting self, I guess. \n\nGod how I hate that treasonous, juvenile, moronic fucker.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">Why isn’t more attention given to the fake elector plot, and instead goes to the January 6 riot? \n\nThey are linked.\n\nThe purpose of the riot was to delay the counting of the electoral votes. The purpose of the fake electors was to create a legal pretext for no majority being recognized. Combined, they could make sure that no one received a majority of votes on January 6th, which means the House chooses the president.\n\n...and people are being [prosecuted](https://en.wikipedia.org/wiki/Trump_fake_electors_plot#Prosecutions) for their participation in the fake elector plot; it isn't as if that aspect is being ignored.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "I’ve heard a decent amount of discussion about it ",
            "score": 3
        },
        {
            "depth": 0,
            "author": "MollyGodiva",
            "body": "Republicans have been focusing only on J6 from day one. Because with J6 they can isolate a few sentences Trump said and a few of the tame videos of the attack and claim it was a no big deal. The fake elector plot is completely indefensible.\n\nThey are trying to convince the public the attempted coup never happened.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "vibes86",
            "body": "That’s an excellent question. Jan 6 is flashy and there’s video coverage. That got people’s emotions up. I also think some of it is people not understanding how the electoral college and electors actually work.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "badnuub",
                    "body": "I would go as far to say, considering how visceral that footage was, how much more the riot was ingrained into our memories. It’s why the  conservative revision of what happened is so insulting. We all saw it with our own eyes, and you want to pretend like it didn’t happen or wasn’t as bad as you say?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vibes86",
                            "body": "That’s very true too. There’s so much of that ‘it’s not true, that’s fake’ bullshit but then they don’t realize real stuff when it’s in front of their face.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kakamile",
            "body": "It should be, but both and all the charges matter. \n\nThough I have to say the highest government official committing government document forgery sounds silly.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PlayingTheWrongGame",
            "body": "J6 was far more dramatic, memorable, and easier to understand as a political risk. It also directly endangered the lives of many people, and led to several deaths.\n\nMeanwhile the fake electors plot is a somewhat arcane legal issue that’s hard for the typical voter to follow or care about. Is it just as serious? Yes. Is it equally politically marketable? No. ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "HotStinkyMeatballs",
            "body": "1/6 was explicitly violent and publicly broadcast live.\n\nFake elector plot was a private scheme involving communications that were found well after it occurred.\n\n  \nLive, violent, public broadcast you can watch immediately. It's easy to share on TikTok and Instagram.\n\nReading documents requires you to actually research and read. Americans don't like either of those things.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Warm_Gur8832",
            "body": "Because stupid people doing shockingly bad things is easy to overlook.\n\nJust because Trump supporters seem like a LARP of the Third Reich doesn’t take away from the fact that it’s a really bad crime to try to thwart the will of the people by systemic fraud.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "decatur8r",
            "body": "They are all part of the same plot.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "maineac",
            "body": "> There is no Constitutional provision or Federal law that requires electors to vote according to the results of the popular vote in their States. Some States, however, require electors to cast their votes according to the popular vote.\n\nThe quote is from archives.gov. But basically the electors are not legally bound by the constitution or federal law to vote for who the people voted for. They are known as a faithless elector. This actually happened in 1832 and 1836.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IgnoranceFlaunted",
                    "body": "They weren’t the selected electors. That’s the part they lied about. Do you think any random third party could’ve sent certificates saying their candidate won the vote? Could I submit a certificate saying I’m the state’s chosen elector, and I’m voting for myself?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "maineac",
                            "body": "No, of course not. I just thought it was interesting and most people don't realize this part. I mean in this day and age faithless electors would probably not stand up.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PowerfulTarget3304",
            "body": "Because it didn’t happen in the end, and there aren’t any lasting consequences from it.  People don’t get nearly as upset about plots that don’t come to fruition.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SovietRobot",
            "body": "As others have said the so called plot is complicated. But it’s not just about what resonates with people, it’s also about what’s prosecutable. \n\n\nBecause the way it works is - Republicans chose their electors before the elections. Democrats chose their electors before the elections. The fact that Republican and Democrat electors both exist - is not illegal. \n\n\nIt’s also not illegal that said Republican and Democrat electors are on “standby”. I mean, that’s what they do in a normal election when everything is proper. \n\n\nWhat is illegal is sending a fake Certificate of Ascertainment to the Senate and to the Archivist - stating that you party’s Electors won and they elect so and so, if in fact your party did not get the majority / plurality vote. \n\n\nIf you look at those that have already been successfully prosecuted with regards to this - they have all been charged with some variation of forgery, falsifying documents and conspiracy to do so. \n\n\nThe thing is - Trump didn’t actually forge or falsify anything. What he did was hear about the scheme from Eastman and what he did was claim there was election fraud. \n\n\nThat’s a big leap from hearing about a scheme to proving that Trump was involved in orchestrating it. \n\n\nNow I get that liberals might think it’s no big leap but most States disagree which is why even the States that did charge others for the scheme like Michigan, Nevada and Arizona did not also otherwise charge Trump. Because unlike the others charged, Trump wasn’t directly involved. \n\n\nBut Georgia has charged Trump. And in that case Trump’s defense is admitting that they heard about the scheme from Eastman. But they never sanctioned forgery or falsification of certificates. Anyway - that case is still pending. \n\n\nAll that said - it’s difficult to say Trump is guilty of such when the whole innocent until guilty thing exists and the one case that pertains to it hasn’t resulted in a conviction yet.\n\n\nAll of the above doesn’t mean I’m saying Trump is morally blameless. I’m just describing the technicality of it.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "MollyGodiva",
                    "body": "If you accept that Trump was unaware of what was going on, then that means that Trump was so clueless that he did not see at attempted coup being planned in his own White House. Not a good defense.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "MollyGodiva",
                    "body": "Trump spearheaded the whole plot. He knew about it quite well. That is why he was pressuring Pence. Trump did engage in the first attempted coup in US history.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "pinner52",
            "body": "Because anyone who is being honest understands what happened in 1960, how the rules are set up so they have to be picked likely before the court cases are settled, and that if there had no been a second slate and trump did win his lawsuits, Biden would have still won the election, even if the Vp had tossed it back to the states because there would be no second skate to vote on, which he had that power to do because the following year they changed the rule to now allow that anymore.\n\nwhich is ironic because if trump does steal the election this year, there ain’t going to be much you can do now even if you win the court cases unless it is before the cut off date which is extremely unlikely.",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "-Hypnotoad26",
                    "body": "You're providing cover for a conspiracy to choose a fake slate of electors to subvert the election. \n\nDear Leader will never love you.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pinner52",
                            "body": "I don’t care lol. I don’t even like trump that much. He is not someone I would emulate, but I also wouldn’t run for president.\n\nOhhh so scary. Any day you want to provide some substance I’ll be waiting",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "-Hypnotoad26",
                                    "body": "You love Trump, your whole life is in the service of lying for him online. \n\nYou're in a cult.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pinner52",
                                            "body": "Why feel the need to lie lol. I didn’t support him in 2026 and wasn’t going to support him after jan 6th. \n\nMaybe you shouldn’t keep lying. That will make me not support him again lol",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "-Hypnotoad26",
                                                    "body": "Trumpers pretending they're a Trumper because of comments on Reddit is classic. \n\nYou know Trumpism is wrong, that's why you want to blame your support for him on anyone but yourself. \n\nThe psychology is obvious and transparent.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "pinner52",
                                                            "body": "How does a trumpet pretend he is a trumper? Can you explain that logic to me. Wouldn’t they just be trumpers and not have to pretend since a=a lol. \n\nYou not aware of the law of identity either?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "-Hypnotoad26",
                                                                    "body": "Did you hear that? It was something going over your head. \n\nNow you know what that sound you've been hearing all your life is. \n\nCongratulations Trumper.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "pinner52",
                                                                            "body": "lol is it like impossible for you to explain anything you said. \n\nDo you ever wonder if you might be the reason Biden isn’t dominating in the polls like he should be?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "-Hypnotoad26",
                                                                                    "body": "I'm light years ahead of you, little guy.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "pinner52",
                                                                                            "body": "How are those polls working out for yeah?",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "-Hypnotoad26",
                                                                                                    "body": "I'm not Joe Biden, so I'm not really concerned.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "pinner52",
                                                                                                            "body": "lol you will be if trump wins",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "-Hypnotoad26",
                                                                                                                    "body": "Trump will never hold elected office again.",
                                                                                                                    "score": 2,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "pinner52",
                                                                                                                            "body": "Will you leave the country if he wins this time? Y’all can’t seem to keep your promises.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "-Hypnotoad26",
                                                                                                                                    "body": "I can't wait for Obama's FEMA trains to gather all the Trump refuse.",
                                                                                                                                    "score": 2,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "pinner52",
                                                                                                                                            "body": "I thought that was a right wing conspiracy. I know it’s pretty hard for people who don’t actually believe in anything to remember what the current mantra of that day is. \n\nHints: I think your all complaining about the Jews this week on campuses.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "-Hypnotoad26",
                                                                                                                                                    "body": "Your and you're are two different words, Trumper. \n\nDon't trip over yourself supporting a rapist criminal.",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "pinner52",
                                                                                                                                                            "body": "Wow a grammar Nazi too. Colour me surprised.",
                                                                                                                                                            "score": 0,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "[deleted]",
                                                                                                                                                                    "body": "[removed]",
                                                                                                                                                                    "score": 2,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "AskALiberal-ModTeam",
                                                                                                                                                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                                                            "score": 1
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "Wasnt? Are you gonna now?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "-Hypnotoad26",
                                                            "body": "Classic Trumper.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "pinner52",
                                                                    "body": "So classic trumpers didn’t support him in 2016 and supported giant meteor?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "[deleted]",
                                                                            "body": "[removed]",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "pinner52",
                                                                                    "body": "Still waiting on that citation. \n\nlol why is is so hard to believe I might be one of the 12 million trump gained between 2016 and 2020?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "[deleted]",
                                                                                            "body": "[removed]",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                    "score": 1
                                                                                                },
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "pinner52",
                                                                                                    "body": "lol uhh just to be clear… You don’t think everyone trump gained in 2020 was a new voter right? Cause that would be a pretty stupid thing to say or even imply lol",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "[deleted]",
                                                                                                            "body": "[removed]",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                    "score": 1
                                                                                                                },
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "pinner52",
                                                                                                                    "body": "Is that all you can say. Liar liar liar 🤥.\n\nAnd you people wonder why minorities and Jews are running away from the party in droves the last few months. \n\nKeep acting this way. Please. I am begging you. Don’t ever stop until after the election.",
                                                                                                                    "score": -1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "[deleted]",
                                                                                                                            "body": "[removed]",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                    "score": 0
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "pinner52",
                                                                                                                                    "body": "Thank you for doing what I asked of you 🙏",
                                                                                                                                    "score": -1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "[deleted]",
                                                                                                                                            "body": "[removed]",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "[deleted]",
                                                                                                                                                    "body": "[removed]",
                                                                                                                                                    "score": 0,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "[deleted]",
                                                                                                                                                            "body": "[removed]",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                                                    "score": 1
                                                                                                                                                                },
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "pinner52",
                                                                                                                                                                    "body": "lol irony. \n\nSo it’s cool if trumps rounds people up now? That is what you are going with? You sure?\n\nEdit: Of course he blocked me after responding. I guess you all think you win that way when you do it.",
                                                                                                                                                                    "score": 0,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "[deleted]",
                                                                                                                                                                            "body": "[removed]",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                                                                    "score": 1
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        },
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "AskALiberal-ModTeam",
                                                                                                                                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                                            "score": 0
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                },
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "AskALiberal-ModTeam",
                                                                                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                                                                                    "score": 0
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AskALiberal-ModTeam",
                                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "pinner52",
                                                            "body": "Yea lol. Shouldn’t have indicted him on novel charges during an election where you have to rely on a person who admitted to lying to Congress, the police and the courts, after lying for 6 months about how it was ok to remove trump from the ballot using the 14th amendment without a conviction for 18 U.S. Code § 2383 or a new law by Congress. My suggestion would be to tell the crazies here to calm down a bit. I could care less but your also losing support for your support of Hamas.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sad_Lettuce_5186",
                                                                    "body": "Do you look back on earlier generations of conservatives fondly?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "pinner52",
                                                                            "body": "Depends on how far back you look. I hate the Republican and Democrat Party if that helps, and I was an Obama supporter in the past, and I hate bush more then probably anyone who has lived in my life time.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Sad_Lettuce_5186",
                                                                                    "body": "How far back can you go while still looking back fondly?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "pinner52",
                                                                                            "body": "Maybe ww2 unless we specifically talking economics. Plus conservatism is such a broad term. I don’t consider myself one expect in fiscal policy either and until about 2015 I was arguing with mostly conservatives and religious people.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                    "body": "Conservatism as an ideology. Maybe right wingers would be better? \n\nIts hard to agree with conservatism in the Jim Crow era, that was heinous shit",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "pinner52",
                                                                                                            "body": "It depends on what you mean by conservatism. It has changed over time, along with what they support. I wouldn’t say Jim Crow laws were conservatism unless you are using it as just a word to fill in for “not changing”. But no I didnt support the redeemers Dems Jim Crow laws.",
                                                                                                            "score": 1
                                                                                                        },
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "pinner52",
                                                                                                            "body": "Maybe it would be easier if you tell me what exactly you mean by conservative. I ain’t a right winger to be clear. Neither am I a Republican.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                    "body": "> Conservatism is a preference for the historically inherited rather than the abstract and ideal. This preference has traditionally rested on an organic conception of society—that is, on the belief that society is not merely a loose collection of individuals but a living organism comprising closely connected, interdependent members. Conservatives thus favour institutions and practices that have evolved gradually and are manifestations of continuity and stability. Government’s responsibility is to be the servant, not the master, of existing ways of life, and politicians must therefore resist the temptation to transform society and politics. This suspicion of government activism distinguishes conservatism not only from radical forms of political thought but also from liberalism, which is a modernizing, antitraditionalist movement dedicated to correcting the evils and abuses resulting from the misuse of social and political power. In The Devil’s Dictionary (1906), the American writer Ambrose Bierce cynically (but not inappropriately) defined the conservative as “a statesman who is enamored of existing evils, as distinguished from the Liberal, who wishes to replace them with others.” Conservatism must also be distinguished from the reactionary outlook, which favours the restoration of a previous, and usually outmoded, political or social order.\n\nBrittanica",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "pinner52",
                                                                                                                            "body": "Yeah so I agree with the part about government is the servant. But that’s about it for that definition. I also think some things are worth conserving and others are not, but not because that’s the way it’s been done historically.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                    "body": "With that, is there a group of conservatives you look back on fondly",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "pinner52",
                                                                                                                                            "body": "Uhhh by that definition. Prob not. I would have to think about it though looking back, applying that specific definition, see who actually adheres to it and not in name only, and then I would have to look at individual policies probably to determine that which looking at the context for that time period. \n\nJust to be clear though, you won’t see me barking up the tree for most people throughout history.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                    "body": "I get that. \n\nDo you expect the current crop of conservatives and right wingers to be looked back on fondly?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "pinner52",
                                                                                                                                                            "body": "Well like if you mean trump and his supporters. I wouldn’t call them really conservative by that definition anymore. The only ones I would think are actuslly conservative by that definition in American would be come Christian groups prob. \n\nNow if you’re really talking about trump et al., that will depend on a lot of things lol. Like so many it’s difficult to predict or even guess. A bunch of scenarios would lead to a yes and others a no.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                    "body": "Well, why dont you look back fondly on other right wingers?",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                            "body": "Well one I am not right wing , but two even if I was I don’t. Look back fondly on most people throughout history lol. Most people, even today as assholes looking out for themselves and their inner group only. I don’t look back fondly on classical liberals or fiscal conservatives even though I am one because they fail so hard and were overtaken by zealots.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                    "body": "Do you look back on groups in an unequally fond way? \n\nOr is everyone equally in the wrong when you look back?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "depth": 22,
                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                            "body": "Well there is a baseline. I would say some groups I look back on with more distain and disgust. I can think of a lot of other groups I hate a lot more for their actions or inactions, but there is a level of distain for all.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "depth": 23,
                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                    "body": "Do their politics factor in?",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "depth": 24,
                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                            "body": "Well prob. I sure hate Nazis for the politics lol I hate\nCommies too.",
                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                {
                                                                                                                                                                                                                    "depth": 25,
                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                    "body": "Would you say you tend to look back equally unfavorably at left and right groups in the past?",
                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                        {
                                                                                                                                                                                                                            "depth": 26,
                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                            "body": "Uhh if being honest, I have swayed back and forth over time. Now it’s about even.",
                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                    "depth": 27,
                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                    "body": "Thats wild. Cause left leaning groups did stuff like advocate for abolition, women’s suffrage, children’s rights, immigrant rights, etc. \n\nWhile the right opposed them",
                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                            "depth": 28,
                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                            "body": "Left leaning groups also lead to the most deaths in the 20th century while claiming to save them so what’s your point?",
                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                    "depth": 29,
                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                    "body": "Did they? \n\nHow do you define left wing and is your definition solely about economics?",
                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                            "depth": 30,
                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                            "body": "Commies are right or left? Remember you changed from talking about conservatives to left and right? Commies are clearly left. Cons are clearly rights.",
                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                    "depth": 31,
                                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                                    "body": "It would depend on the aggregate of their views\n\nLeft wing politics are defined as being focused on the pursuit of equality and egalitarianism, which totalitarianism is a rejection of",
                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                            "depth": 32,
                                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                                            "body": "Yeah sooo several issues. \n\nNo I reject that. The left wing politics has no problem with authoritarianism and totalitarianism and history is replete with examples of this. \n\n2) you didn’t answer the question. Are commies right or left. If you say right because they were authoritarian I am just going to scoff…\n\n3) the pursuit and what actually results is not always the same. Some of the worst crimes committed were done with the best of intentions. \n\n4) there is a bit of dishonesty there because there is no agreement on What you mean by equality? Opportunity or outcome, and if you pick outcome you have some serious issues.",
                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                    "depth": 33,
                                                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                                                    "body": "You reject this definition? Which definition do you use and where did it come from?\n\nI did, you arent right or left based solely on one issue nor on your economics. **Its the aggregate of your views**\n\nIf somebody is pursuing totalitarianism, thats not a left wing pursuit. They may still be a left winger (granted that the rest of their views skew them in that direction overall), but that is specifically a right wing ideology. \n\nIt would likely be a mixture unless you believe that regardless of conditions, some people should expect better outcomes societally.",
                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                            "depth": 34,
                                                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                                                            "body": "Ok let’s be clear for a second. Even if we use your definition.  The commies said they were going to make everyone equal right?  How many people died to try to achieve that and how do you plan to do that without forcing people to be the same through the threat of the state? \n\nI don’t think you’re answering in good faith now. \n\nYes or no. Commies are left wing? If you say they are until they act like authoritarians as you seem to be implying, I would tell you you need to rethink your definition then just ignore the last 140 years. \n\nTotalitarianism is a political system and a form of government that prohibits opposition political parties, disregards and outlaws the political claims of individual and group opposition to the state, and controls the public sphere and the private sphere of society. Therefore there is nothing there saying right wingers are this and left wingers are not. Both can fall into this trap. You’re confusing the stated goals with the means to reach it. They want equality and the left has no issue killing you to make things more equal for the group using the complete force of the state with no allowed opposition. \n\nThe left killed more. Just accept it.",
                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                    "depth": 35,
                                                                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                                                                    "body": "They enacted totalitarianism…is that equality? I would say no. The totalitarianism was intentional, wasnt it? I would say yes.  \n\nSo how were their actions pursuant of equality?\n\nIm answering in good faith. Youll notice none of the definitions Ive used have anything to do with economics. Thats because economics alone dont determine your political orientation. \n\nIts not ignoring the last 140 years. Those atrocities happened, but what makes them left wing? Segregationists also “pursued equality”, we know that wasnt a left wing movement and was purely *bullshit*. \n\nLeft wing politics are defined by their focus on equality and egalitarianism \n\nRight wing politics are defined by their prioritization of hierarchy. They try to maintain and create inequality. \n\nUnder those definitions, its very obvious that totalitarianism isnt a left wing ideology. Its a right wing ideology. \n\nCommunism, as written by Marx and without any other political views, is a left wing ideology. \n\nTotalitarianism with a communist economic system is a blend of left and right and would need to be weighed as such. \n\nWhich part of this specifically do you disagree with?",
                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                            "depth": 36,
                                                                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                                                                            "body": "Everyone has to have the same so give me your land and everyone gets one potato a day and if you do not like it off to the gulag. That good enough? Yeah everyone is equal lol \n\nSegregationists pursed equality…. Really… where did you get this idea? \n\nSure, they pursue equality. So you have three people and two potatoes. What does the leftist do. History shows us more often then not they shoot the third guy. And more often then not they actually shoot the two guys and the one guy gets both potatoes because his cousin is in charge and the left is full of hypocrites where equality doesn’t really matter.\n\nOmg. This is so stupid. You literally saying we cant be totalitarian . Because our definition says you can’t even though it doesn’t say that or preclude it, especially when we look at real life examples. \n\nThis is literally a “that’s not real communism” argument lol. I reject your definition and any definition that says that says the left wing can’t be totalitarian. You literally arguing that whenever a person seeks equality through the prohibition of opposition political parties, disregards and outlaws the political claims of individual and group opposition to the state, and controls the public sphere and the private sphere of society, it’s now somehow right wing lol. Yeah i wholeheartedly reject that.\n\nThey are left wing cause they said this is for your own good and equality as they put you up agasint the wall lol.",
                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                                    "depth": 37,
                                                                                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                                                                                    "body": "Are people in the gulag equal to people outside of it? Does not seem like it to me\n\nThey themselves said that. They defended it as being separate and equal and regularly (in interviews) stated that racial inequality was not real. \n\nIf theyre hypocrites, then what makes them left wing?\n\nIf a gay guy regularly rejects being with gay men and instead only has sex with women, then by what measure are they gay?\n\nIf a firefighter never participates in the duties of firefighting, then what makes them a firefighter?\n\n> This is literally a “that’s not real communism” argument lol. I reject your definition and any definition that says that says the left wing can’t be totalitarian. You literally arguing that whenever a person seeks equality through **the prohibition of opposition political parties, disregards and outlaws the political claims of individual and group opposition to the state, and controls the public sphere and the private sphere of society**, it’s now right wing lol. Yeah i wholeheartedly reject that.\n\nVery transparently, none of those methods increase equality. If i enslave only Black people, is that racial equality? How about if I enslave only people who choose to believe in Jesus? Is that equality? What if I ban vegetarians from being openly vegetarian and free?\n\nAll of those are demonstrably not equality",
                                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                            "depth": 38,
                                                                                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                                                                                            "body": "Of course they are lol. Everyone is treated equally. Everyone gets one potato. And if you complain you go to the gulag. Equal punishment for all dissenters lol. I hope your not trying to say well people in the gulag aren’t being given a potato so it’s not equal. Cause it is. It’s equal punishment because it is the Same punishment. \n\nSo you just believe everything someone says. If they say we want equality so different bathrooms and in every case the blacks is out back your just gonna take thier word for it lol? \n\nBeing a hypocrite doesn’t prevent you from espousing those ideals lol, and if they are never kicked out your tacitly approving of them if you never speak out. \n\nThe fact that he is attracted to men lol. \n\nThe fact that they have that title and are being paid lol. Do you think the only thing firefighters ever do is fight fires? \n\nThey don’t need to lol. The point is they are not mutually exclusive lol. You can have all those things and equality in the sense where everyone is equal. If no one can create a new party, everyone is equal lol. If no one can make certain claims, everyone is equal. You have one potato and two people. How are you going to make it equal if the person says no I am not sharing my potato. What if you gulag everyone with a religious beliefs, yeah that’s equality lol. And yes if you ban vegetarians that is equality lol since no one can be one we all equal as meat eaters lol. \n\nYou understand equality can lead to the justified killing of people right? It just means the same for all or equal. That could be equal pain and suffering lol and will mean the lowest common denominator.",
                                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                                                    "depth": 39,
                                                                                                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                                                                                                    "body": "Thats like saying \n\n“Everybody is treated equally when gay marriage is outlawed. Nobody is allowed to be married to members of the same sex, including gay people”. Thats not equality. \n\nNo. If its somehow not clear im saying that you cant just go off of people’s words. You have to go off their actions. \n\nSo then, youre saying that if I espouse ideals I dont live by then it still counts? I can be a vegetarian, even if i eat meat?\n\nFunctionally, if he claims to be attracted to men and isnt, and if he claims to be attracted to men, but never acts on it, then he is doing the same thing. No?\n\nNo. I even explicitly said “firefighting activities”. I shouldve said firefighter activities though. \n\nYou have a strange view of equality if entire demographics can be damned to a lower quality of life and second class status in an equal system. \n\nNot on the basis of their identity or beliefs no",
                                                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                                            "depth": 40,
                                                                                                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                                                                                                            "body": "That js a bad example because If it’s the same rules for everyone regardless of the person that is equality.\nWhether it was equal or not is whether marriage or only heterosexual sexual marriage was allowed and how that is then enforced. \n\nSo then why do you believe the segregationists? \n\nSure. No one is perfect lol and to expect as much is foolish. \n\nYou need to remove the claims. Is he physically attracted to men or not regardless of what he claims? \n\nYou said the duties. And I am saying yes. Even if they never fight a fire or do any duty, if they are given the title and paid they are technically a fire fighter. You could say in name only but they still a firefighter and calling them one is not incorrect. \n\nSo question, to make everyone equal you have to lower everyone to the lowest common denominator, yes or no? If the answer is yes then that should explain your question. \n\nNo I just understand equality ain’t the be all of end all, has lead to some terrible things, and futhermore should only be focused on opportunity and not results, and even in that area equality still ain’t going to work because you can never properly make up for each persons individual strengths and weaknesses. \nEquality is as dangerous as utilitarianism in the wrong hands and can be used to bring us all down.",
                                                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                                                                    "depth": 41,
                                                                                                                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                                                                                                                    "body": "Think that through. The law equally bans gay marriage for everyone. If thats not equality, then how is it equality to ban political parties? And if its enforced through gulags, how is that equality \n\nI dont believe the segregationists. I also dont believe the totalitarian communists. Do you catch my drift? \n\nHow would I know whether or not he is? Thats fair, they can be a firefighter in name only, id agree with that. Not a lot of value in being an identity only in name. Much like being a left winger in name only means nothing. \n\nYou have to remove the barriers creating the inequality in the first place. Lowering everyone works too, but its an easy way to make life worse overall.",
                                                                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                                                            "depth": 42,
                                                                                                                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                                                                                                                            "body": "It is equality as long as it is equally enforced lols \n\nI don’t believe the commies either. That is when they say they are head to help and then say gulag is the best option if you wsnt a second potato is to scoff at them. Same when they say they can’t be totalitarians lol\n\nOnly he would really know. And then that is more of a question about knowledge, and they I would feel more comfortable saying only he can get close to the top of they pyramid that is knowledge. The rest of us are necessarily somewhere below.  \n\nThere is value to it. Just look at politicians lol. Many of them are x in name only but still get elected for spouting talking points for a few months a year. \n\nOnce you lift the barriers and you find out there are still a bunch of people of can’t even peel a potato, then what? You have to lower it once you find out some people can’t reach a certain level do you not?",
                                                                                                                                                                                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                                                                                                                                                                                {
                                                                                                                                                                                                                                                                                                                                                                    "depth": 43,
                                                                                                                                                                                                                                                                                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                                                                                                                                                                                                                                                                                    "body": "Gay marriage bans are equally enforced, aren’t they?\n\nA communist can be a totalitarian. But totalitarian isnt a left wing stance, so that moves them towards the right. Lets say, communism as an ideology with no other views rates a 7.5 out of 10 on the left side of the spectrum. Totalitarianism would have its own rating for its position on the right side of the spectrum. Maybe its a 7/10, maybe its an 8/10. In any case, it moves that person rightward from their 7.5/10 Left position. \n\nThe value is that they get paid right? They dont determine the qualities of the ideology that they only identify with in name. \n\nThats the fundamental difference in our beliefs. I expect (at least near) equality to arise from that. You expect us to be unequal still.",
                                                                                                                                                                                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                                                                                                                                                                                        {
                                                                                                                                                                                                                                                                                                                                                                            "depth": 44,
                                                                                                                                                                                                                                                                                                                                                                            "author": "pinner52",
                                                                                                                                                                                                                                                                                                                                                                            "body": "They should be if what you’re seeking is equality above all else. If heterosexual marriages were banned and gay wasn’t it would still be equality if equally enforced. \n\nThat’s a stupid definition and the definition of totalitarianism I have been using doesn’t say that. \n\nTotalitarianism is a political system and a form of government that prohibits opposition political parties, disregards and outlaws the political claims of individual and group opposition to the state, and controls the public sphere and the private sphere of society. - none of this is mutually exclusive with equality. Nothing. Zero. Nada. Your just saying well of you government that prohibits opposition political parties, disregards and outlaws the political claims of individual and group opposition to the state, and controls the public sphere and the private sphere of society, your necessarily right wing now, even though one could argue each of these thing would be necessary for true equality and prevent hierarchies. That is what is so dumb about this is you almost need a totalitarian government to even enforce true equality or anything close to it because dissent cannot be tolerated. And the left has made this clear with there new stance on words you can’t say and ideas that are to dangerous to consider and must be banned. Which happens every single time.\n\nIf you Mean the politician the benefits are a lot more then just being paid. \n\nYes, if you have one person who can read and one person who can’t read no matter how hard you try, what’s the solution to make them have equal outcomes? You start to treat them unequally to try to make up for the difference. And if you think you can balance millions upon millions of unique differences, you are going to get a lot of people killed…. Again.\n\nSome people will never play basketball and some people will never walk on the moon and some people will never be able to do anything but stock shelves. But they should atleast have the opportunity to try.",
                                                                                                                                                                                                                                                                                                                                                                            "score": 1
                                                                                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                                }
                                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                                        }
                                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                                }
                                                                                                                                                                                                                            ]
                                                                                                                                                                                                                        }
                                                                                                                                                                                                                    ]
                                                                                                                                                                                                                }
                                                                                                                                                                                                            ]
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}