{
    "title": "AskALiberal Biweekly General Chat",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nThis Tuesday weekly thread is for general chat, whether you want to talk  politics or not, anything goes. Also feel free to ask the mods questions  below. As usual, please follow the rules. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "[Tweet:](https://x.com/jayinkyiv/status/1792817290867863711?s=43&t=htvlSlrdyykrrTQxFzufZg)\n\n>Mitch McConnell admits that the Republican Party helped Putin enormously in Ukraine.\n\n(There is a 47 second video in the tweet.)",
            "score": 14
        },
        {
            "depth": 0,
            "author": "octopod-reunion",
            "body": "Just once I want a YouTubers VPN ad to say “in 2017 _Republican congress and president_ allowed your internet provider to collect and sell your data” instead of saying “the government”",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "tidaltown",
                    "body": "The “both sides” crowd always seems to be unwilling to alienate one particular side.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "GiveMeAnEdge",
                    "body": "I think there's some kind of advertising and campaign finance law that prevents that. Like if you call out one party it's considered an in-kind contribution.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "octopod-reunion",
                            "body": "I don’t think so, as it’s just reporting a publically available fact. ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GiveMeAnEdge",
                                    "body": "You could be right, it might be specific to PACs only.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sir_Tmotts_III",
            "body": "Yesterday, u/Butuguru recommended Risotto for dinner, an excellent choice when paired with chicken cutlets and a pleasant meal was enjoyed.\n\nToday, I marinated Chicken thighs in greek yogurt, and foolishly bought and used Vanilla-flavored yogurt without noticing. When parsley, paprika, garlic, lemon juice, soy sauce, and a heap of pepper was added, a surprisingly excellent basis for a chicken sandwich was achieved, Man's folly hasn't borne heartier fruit than since the discovery of Penicillin.\n\nTomorrow, u/MaggieMae68's Green Chile Chicken Enchiladas",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Butuguru",
                    "body": "Woot!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "PM_ME_ZED_BARA",
            "body": "Not to be insensitive to Americans who are struggling, but I am quite jealous of the US economy. My country’s YoY GDP is only 1.5% (US is 3.0%) and our household debt has reached 87% of that GDP, which is among the highest. Our inflation is not that bad thanks to gasoline subsidies but those subsidies are ending soon and that’s when the real inflation begins. \n\nI don’t know the specifics of Biden’s economic policies but the US seems to do much better than most other countries.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "MaggieMae68",
                    "body": "I wish Americans were aware of that.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "CNN: [Trump’s new trade war would cost middle-class families at least $1,700 a year, report warns](https://www.cnn.com/2024/05/21/business/trump-trade-war-tariffs-china/index.html)",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Sad_Lettuce_5186",
            "body": "I keep seeing people say that politics became toxic due to polarization and echo chambers. \n\nBut that doesnt make any sense when you consider the fact that our politics were always toxic.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "pablos4pandas",
                    "body": "I think it's a combo of a few things:\n\n1. People think their times are unique and new\n1. Sometimes some stuff does get worse\n\n\nYou can find quotes attributed to Socrates about how kids these days are uniquely terrible. People have always thought they were the last *real* believers in whatever principle and other people are degenerating society. \n\nA confounding force with that is sometimes shit does get bad. A South Carolina state senator said he would drink every drop of blood caused by seccession, and I don't think he went through with it but he whiffed that prediction pretty bad.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "Yeah it does seem like a combo of those factors. \n\nIt just comes across as being wildly inaccurate",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "loufalnicek",
                    "body": "The Internet has pretty significantly changed things, though.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "In a way that makes our politics more toxic now than it was before?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SovietRobot",
                                    "body": "It’s two different things. \n\n\nI agree with you - people were actually much meaner back in the day. \n\n\nBut now people get more support for their lousy views by being in echo chambers. And we see more of them because of how easy it is to post on the internet.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "That support should then translate to policy and rhetoric outcomes. \n\nWould you say those are worse now too?",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "loufalnicek",
                                    "body": "Yeah, I think so. Much more easy to associate only with like-minded people and get very entrenched in beliefs that might or might not adhere to reality. Plus the anonymity.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "What politics are we experiencing now that is more toxic than Bleeding Kansas and the fight over slavery?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "loufalnicek",
                                                    "body": "Well, neither of us were around for that, so I don't suppose we can really say for sure. But what they didn't have there was the ability of people to attack each other anonymously online and work themselves up in to a frenzy like we do today. Pre-internet and the rise of viewpoint news shows, political discussions mostly happened in a much smaller number of non-anonymous forums. It turns out people are not nearly as nastly and partisan when the things they say are not anonymous.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Sad_Lettuce_5186",
                                                            "body": "Oh, so you think a 7 year conflict in which 56 people were murdered is less toxic than people arguing with each other anonymously online? Thats your belief?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "loufalnicek",
                                                                    "body": "We're talking about the method of discourse, not the underlying topic. Yes, the method with which we discuss things is more toxic these days. Imo.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Sad_Lettuce_5186",
                                                                            "body": "> I keep seeing people say that politics became toxic due to polarization and echo chambers.\n\n> But that doesnt make any sense when you consider the fact that our politics were always toxic.\n\n> What politics are we experiencing now that is more toxic than Bleeding Kansas and the fight over slavery? \n\nNo. We’re talking about the toxicity of our politics, which was demonstrably worse back then.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "loufalnicek",
                                                                                    "body": "I think you're confused here.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Sad_Lettuce_5186",
                                                                                            "body": "What am i confused about?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "loufalnicek",
                                                                                                    "body": "A great many things, it would seem.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                            "body": "It would seem youre pulling a cop out. \n\n> the quality of being very harmful or unpleasant in a pervasive or insidious way.\n\n**Toxicity**\n \n> the activities associated with the governance of a country or other area, especially the debate or conflict among individuals or parties having or hoping to achieve power\n\n**Politics**\n\nIt’s obvious that the toxicity of our politics regards not only the methods of our discourse, but also the policies being debated, the methods for achieving power, and the way the dispute is resolved.\n\nWhich were demonstrably worse prior to the internet \n\nYou can cling being wrong, but i truly have no obligation to play pretend with you.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "loufalnicek",
                                                                                                                    "body": "Try looking at things through more than one lens, sometime.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                            "body": "Try actually substantiating your arguments instead of shoving your fingers in your ears and sticking your tongue out",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "loufalnicek",
                                                                                                                                    "body": "Everyone here knows you're incapable of looking at any topic except through the lens of race-related bitterness. Maybe someday you'll realize that there are other forces in the world worthy of consideration, too.\n\nOr maybe not.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                            "body": "Yeah, like the denial of women’s suffrage and support for rape at that same exact time. \n\nOr the forced treaties and genocide of Native American communities which happened at the same time as well. \n\nOr the lack of children’s rights, the hostility towards immigrants from Asia at the end of the century, \n\nI can give you more examples. Bleeding Kansas was the opening argument, it was never the whole argument. \n\nWhich again, all of this refutes your point that politics are more toxic now. \n\nIf your point is that polarization is worse now, again, how is that the case? What makes it worse than then?\n\nHonestly, the vast majority of you dont articulate your views. You just double down on your feelings.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "loufalnicek",
                                                                                                                                                    "body": "Mkay",
                                                                                                                                                    "score": 0,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "Sad_Lettuce_5186",
                                                                                                                                                            "body": "Reread this conversation. Youll see it",
                                                                                                                                                            "score": 1
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "My daughter has a friend with a big age gap between her and her brother. I have watched this little dude bum rush a the field at a game trying to get to his sister so many times I've lost count. However breaking lose and rushing the stage during her solo is just *chef's kiss*.\n\nI couldn't say it to his parents but here, I will say it. Fight the powers that be.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "[Tweet:](https://x.com/kdbyproxy/status/1792896048169451940?s=43&t=htvlSlrdyykrrTQxFzufZg)\n\n>Fentanyl deaths...tripled under Trump\n\n\n>[[Chart]](https://imgur.com/gallery/fentanyl-deaths-tripled-under-trump-E2rgGRE)",
            "score": 6
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "[[Putin Lies About NATO Expansion Promise: ‘Total Nonsense,’ Says Yeltsin’s Foreign Minister]](https://www.kyivpost.com/videos/33098)",
            "score": 5
        },
        {
            "depth": 0,
            "author": "zlefin_actual",
            "body": "I'd like to see that huckleberry user removed from the sub on grounds that they persistently delete all their stuff.  While I've long disliked them, it's really disruptive to a conversation when a user mass deletes all their posts every day or so, and it wrecks chains of conversation so that others cannot follow along at all.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "MaggieMae68",
                    "body": "Seconded this concept for anyone who repeatedly posts and deletes.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "sererson",
            "body": "Can the mods ban questions that are just \"thoughts?\" Like, there's no real question, people just use it to talk about bad news",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "MaggieMae68",
                    "body": "That type of question already isn't allowed as a main post. \n\nAre you saying ban them here in the weekly chat, too?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sererson",
                            "body": "No, I just see them a lot in the subreddit. Seems like some get to the top regardless of whatever the actual rules are",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CTR555",
            "body": "In local election news, Portland's 'progressive' District Attorney appears to have lost his reelection - he's currently down 44% to 56% and I don't think there are that many votes outstanding.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "RioTheLeoo",
                    "body": "I’m really gonna be shocked if somehow Gascón manages to be the only progressive DA to survive on the west coast by the end of the year. \n\nPortland - Likely progressive loss\n\nSF - Progressive recalled \n\nOakland - Progressive officially facing recall in Nov. \n\nLA - Gascón fairly well positioned for a potential re-election  \n\nSeattle - Progressive city yet elected a “walk away campaign” former Democrat turned Republican",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "I’m on the opposite end. I’m surprised any of them have a chance of surviving.\n\nCandidates who are perceived to be weak on crime are especially vulnerable when their base includes people who are most likely to be the victims of crime. \n\nThings like how we fucked up the decriminalization of drugs in multiple areas also doesn’t help progressive DAs. They’ve been lumped together now as soft on crime and ok with open air drug markets.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RioTheLeoo",
                                    "body": "Oh yea, I think I phrased that poorly. What I mean is, I’m surprised that among all of them, Gascón being the one to survive is not what I would have expected. I’d have thought he’d be the weakest going forward a few years ago considering his term has been literal non-stop attacks from the police unions, tough on crime crowd and various failed recall campaigns. \n\nFor one reason or another, LA has managed to avoid the swing to the right that’s seem to have set in in SF and apparently Portland (I’m sure there’s like a bunch of socio-economic factors behind the different outcomes, but generally SF, Portland and Seattle are of course thought of as the most left wing west coast cities, so it’s nice that LA is kinda getting a chance to steal that mantle haha) \n\nI haven’t seen any polling for the race yet, but I wouldn’t entirely count Price out either. If both her and Gascón manage to hold their seats, I’d consider that a solid victory for California’s rehabilitative reforms",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "Ah gotcha. \n\nI don't know the reality on the ground in LA versus the others but it does seem like the media narrative is mostly about SF, Portland and Seattle. I wonder if that helps him.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "RioTheLeoo",
                                                    "body": "Yea it’s really wild that LA has somehow managed to (relatively) keep the target off its back compared to the rest of the country’s major cities these past few years. \n\nI wonder, and this would be my guess, if it has anything to do with Karen Bass being a pretty well liked and well perceived mayor, on top of the LA electorate just not being like at all engaged with political news and media lol",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CTR555",
                            "body": "Setting aside local variability, it seems to me that the message here is pretty clear:  left wing cities and voters are happy to support police and judicial reform efforts (including paying higher taxes for them), but not if it means that (the perception of?) public safety suffers.  I hope the takeaway by reformers is that these efforts can continue, but only in a more thoughtful way.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RioTheLeoo",
                                    "body": "Yea I think that’s a fair assessment, particular for Oregon and SF. It’s unfortunate that that’s the narrative since it doesn’t really reflect the trends in violent crime and public safety. \n\nAssuming Gascón and Price make it through while maintaining their same coalitions as their previous elections, it’ll be interesting to see how this divide plays out between wealthier urban white and Asian left wing voters who opposed Gascón, Price and Boudin, and poorer Black and Latino left wing voters who supported them. I would imagine it’s the size of the latter groups in Oakland and LA specifically which is keeping those candidates afloat.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "miggy372",
            "body": "[Black MAGA are fighting and exposing each other.](https://x.com/notcapnamerica/status/1793051595271295456?s=46)",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "octopod-reunion",
                    "body": "One of them is trying to protect trump and cover her ass in the Georgia indictment and the other is indicted by the indictment and probably flipped or is going to flip on trump. \n\nI’m just surprised that this isn’t considered interfering with a trial or witness tampering",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "mtmag_dev52",
                    "body": "They sound like class acts, lol.\n\nWho exactly are these people,  and what are they \"famous\" for?",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "octopod-reunion",
            "body": "[Nikki Haley announces she will vote for trump](https://apnews.com/article/nikki-haley-endorses-trump-election-2024-president-72cd80b03d0cd6f69601a0c6166194a5)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Libertytree918",
            "body": "Anyone watch the Franklin show on Apple+.  How did you like it?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Is it just me or do conservatives focus on great men history too much?",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CTR555",
                            "body": "They absolutely do, but then so do many non-conservatives - a lot of people fall victim to it.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "I won't argue that, feels a Lil bit more on the conservative side",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> Is it just me or do conservatives focus on great men history too much?\n\nRemember: *Storytelling* will always rely on \"[great man theory](https://en.wikipedia.org/wiki/Great_man_theory)\" because storytelling works best when there is a main character, and the stakes of that main character's decisions are high.\n\n\"The Franklin show on Apple+\" will inevitably reflect \"great man theory\".",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "loufalnicek",
                            "body": "I don't think interest in history -- including important, impactful figures -- is a liberal or conservative thing.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "I'm talking about **great men history** the idea that history is largely moved by individual actors.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "loufalnicek",
                                            "body": "Does interest in the historical Ben Franklin indicate such a thing?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "IamElGringo",
                                                    "body": "Yes",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "loufalnicek",
                                                            "body": "That's silly.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Libertytree918",
                                                                    "body": "Very silly, especially stemming this Convo from a question about tv show, which has a very broad audience lol.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "IamElGringo",
                                                                            "body": "Why?  I'm trying to have a conversation beyond the show",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Libertytree918",
                                                                                    "body": "Which is very strange to me",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "IamElGringo",
                                                                                            "body": "Why?  Are you new to reddit?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Libertytree918",
                                                                                                    "body": "Nope does reddit usually answer questions with completely random irrelevant answers?",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "IamElGringo",
                                                                                                            "body": "Its not irrelevant but yes tangents are normal",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Libertytree918",
                                                                                                                    "body": "It's very irrelevant, and I don't see that happening often, outside this sub",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "IamElGringo",
                                                                                                                            "body": "It is relevant, it's a example of great men theory.  How is it not relevant?\n\nI do on literally any healthy comment thread 100%. Stop bull shitting.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Libertytree918",
                                                                                                                                    "body": "How is it relevant? \n\n\nIt's an innocent conversation about a new tv show and somehow got debased into irrelevant theories that have nothing to do with the show\n\n\nI'm not bullshitting,",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "IamElGringo",
                                                                                                                                            "body": "It's a example of great man theory as I literally just said in my comment.\n\nYes I started a tangent but so what?  You could have ignored me and you can still talk with other people about your show.  Im not stopping you.\n\nWell I see it **literally** everywhere so it really feels like bs ya feel that?",
                                                                                                                                            "score": 1
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Libertytree918",
                            "body": "Just you, I don't think history is a liberal or conservative thing. \n\n\nIn Boston the history scene has been infected with some nonsense, so I know that it's not. \n\n\n\nI'm huge into history, especially revolutionary war stuff, it's a fascinating subject to me, and I do think that has influence on my politics, but I'm not really here to talk about that, I'm simply trying to have a friendly discussion on a new show that I thought would have mass appeal.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "Neither do I'm, I'm talking about **great men history** the idea that history is largely moved by individual great men.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Libertytree918",
                                            "body": "Once again idk how watching a new popular tv show is \"focusing on great men in history too much\" but as I said I love history, and I do think we could learn from \"great men\" or circumstances they were in, reminds me of that great old adage \"those who don't know their history are doomed to repeat it \"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "> The great man theory is an approach to the study of history popularised in the 19th century according to which history can be largely explained by the impact of great men, or heroes: highly influential and unique individuals who, due to their natural attributes, such as superior intellect, heroic courage, extraordinary leadership abilities, or divine inspiration, have a decisive historical effect\n\nJust for clarity",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Libertytree918",
                                                            "body": "Ahh thank you,\n\n\n\n I still don't know really understand that theory, as opposed to what? How can you study history and not highlight impact of individuals in those moments. \n\nSure you can try to learn about boots on ground at bunker hill, but you're not going to find much info on random farmer who got killed, but there is alot on men like Dr Joseph Warren who was influencial and was also killed. \n\n\n\nYou cant learn about battle of Thermopylae without alot of focus on Leonidas, this doesn't make him a greater man than X spartan warrior, but X spartan warrior has fallen to history while Leonidas lives on",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "pablos4pandas",
                                                                    "body": "> I still don't know really understand that theory, as opposed to what? How can you study history and not highlight impact of individuals in those moments.\n\nYou examine the material conditions and systems that produced the situation",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Libertytree918",
                                                                            "body": "Like what for example?\n\n\nCan you give me some context.\n\n\n\nYou can pick historical topic. \n\n\nHow do you talk about declaration of Independence without men writing it, or voting on it.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "pablos4pandas",
                                                                                    "body": ">How do you talk about declaration of Independence without men writing it, or voting on it.\n\nYou'll talk about people doing those things like we do with battles. \n\nA rising merchant class saught to get more direct control of the levers of power so that it could be used to benefit them. In the north the growing financial centers needed greater internal improvements that a economic system based on London doesn't really give a fuck about. In the south greater colonial expansion was desired to expand the slave economy which was tamed by Britain's desire to balance expansion the American south with relations with other European great powers and some small consideration for the native people",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Libertytree918",
                                                                                            "body": "That's a weird way to discount history and not tell fill story, \n\n\nWhat is that theory called?",
                                                                                            "score": -1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "pablos4pandas",
                                                                                                    "body": "> That's a weird way to discount history and not tell fill story,\n> \n> \n\nI don't think describing Washington as a God-like figure who created an impeccable system of government out of whole cloth is particularly more authentic \n\n> What is that theory called?\n\nI think Historical Materialism is often how it is described",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Libertytree918",
                                                                                                            "body": "> I don't think describing Washington as a God-like figure who created an impeccable system of government out of whole cloth is particularly more authentic \n\n\nI have not noticed people really doing that, i think people do overinflate his effectiveness as a military general, and I do think he is revered but I don't know if I've ever noticed him being godlike \n\n> I think Historical Materialism is often how it is described\n\n\nThank you.",
                                                                                                            "score": -1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "pablos4pandas",
                                                                                                                    "body": "> I have not noticed people really doing that\n\nThe painting on the dome of the Capitol in Washington, D.C. is the [Apotheosis of Washington](https://en.wikipedia.org/wiki/The_Apotheosis_of_Washington) literally, the rising to Godhood of Washington. He is portrayed as sitting in heaven among classical depiction of goddesses.",
                                                                                                                    "score": 2
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "anarchysquid",
                                                                    "body": "The alternative to \"Great Man Theory\" is an approach that focuses on larger sociological, economic, and cultural forces. Its sometimes called  \"History from Below\", as well as specific names for specific approaches.\n\nInstead of focusing on Franklin or Washington, this approach would focus on how economic forces encouraged thr colonists for seeking independence from Britain, or how decades of skirmishes with Native Tribes led to a focus on hit-and-run tactics early in the war, or on expectations of \"manly conduct\" during war. The focus is less on individual people overall, at any level.\n\nIf I were making a Revolutionary War movie with a \"History from below\", focus here's how I'd do it:\nJohnny is a young man in Boston. His father runs a modest shipping business that's being squeezed by British taxes. Johnny tangles with Loyalists on the streets of Boston, and ends witnessing the Boston Massacre. He is loyalty is torn because his cousin Billy is a Loyalist, but he ends up joining the Sons of Liberty. He partakes in the Boston Tea Party.\n\nWhen the war breaks out, Johnny wants to join up, but his father, a Quaker, doesn't believe war is right and this leads to a rift between them. Johnny joins up anyway and we see some failed early skirmishes until his unit is whipped into shape. The climax is Johnny fighting at Bunker Hill, showing his patriotism and bravery. The movie ends with Johnny and his comrades in arms listening to someone read out the new Declaration of Independence",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Libertytree918",
                                                                            "body": "Isn't that just elevating Johnny into a great man then?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "pablos4pandas",
                                                                                    "body": "Johnny is just a guy going through life. If Johnny decided to stay home and help on the family farm and his brother Billy goes instead does history really change? Probably not",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Libertytree918",
                                                                                            "body": "I would imagine it would greatly, not only butterfly effect type stuff but johnny has very distinctive attributes that are different from Billy's distinctive attributes.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "pablos4pandas",
                                                                                                    "body": "I had not read closely enough to realize the other commenter had already used the name Billy which was my bad. I meant to use \"Billy\" as just a random guy not the already named guy, but I whiffed there. \n\nThe butterfly effect can be interesting, but I don't think it is sufficient to explain how one brother versus another joining an army of hundreds of thousands would change history drastically",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Libertytree918",
                                                                                                            "body": "I definitely do, my brother and I have very different skills and abilities, hell miniscule stuff like dinner is drastically different depending on who's doing the work, if I'm on a battlefield and I'm s better shot then my brother history can be definitively changed if I hit a shot that he missed. \n\n\nThat's what I love about history is human ability, I absolutely do believe it's a right person right time right place type of thing, you put George Washington today and he may be nothing more than a farmer, you put him in 1776 and he was commander in Chief,  \n\n\nOr you have people like Dr Joseph Warren, you replace him at bunker hill with his brother John Warren, he may not have same bravery as his brother Joseph , he may not insist on being in trenches, he doesn't get shot in face, the letter of his death doesn't get sent to John Adams in Congress in Philadelphia, he doesn't use it in argument of procuring an army, he never establishes Harvard medical school, we never get a small pox vaccine in 1799, who knows where we would be today by simply swapping out brothers.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "pablos4pandas",
                                                                                                                    "body": "> I definitely do, my brother and I have very different skills and abilities\n\nYou think your brother or you alone enlisting in the continental army would determine whether or not America wins the revolution? Why?",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Libertytree918",
                                                                                                                            "body": "What im saying is anything is possible.\n\n\nLook at timeline I just layed out for Dr Joseph Warren and Dr John Warren, had they traded places timelines could be altered exponentially, it's really impossible to say one way or another but people are very different, and can have vastly different outcomes in different situations",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "pablos4pandas",
                                                                                                                                    "body": "> What im saying is anything is possible.\n> \n> \n\nThings happen for reasons.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Libertytree918",
                                                                                                                                            "body": "I personally do not believe in that, I do believe if you switch people out though you'll have vastly different outcomes even miniscule background characters, obviously no way to prove either of those exist that I'm aware of.\n\n\nAnyways, another reason I don't participate here much, an innocent question about a new show to stream has spiraled into this very odd exchange lol",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "pablos4pandas",
                                                                                                                                                    "body": "> Anyways, another reason I don't participate here much, an innocent question about a new show to stream has spiraled into this very odd exchange lol\n\nYou asked about the nature of history, so I provided my perspective on it",
                                                                                                                                                    "score": 2,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "Libertytree918",
                                                                                                                                                            "body": "I'm not lambasting you, moreso original comment that spiraled into this, I do appreciate your insight!",
                                                                                                                                                            "score": 1
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "anarchysquid",
                                                                                    "body": "No, because Great Man Theory has the explicit or implicit argument that history happens **because** of \"Great Men\". That independence happened because of actions taken by extraordinary men like Franklin, Adam's, Washington, etc.\n\nJohnny is a viewpoint character, but he's just a small moving piece. History doesn't turn on his individual actions, History turns on the actions of thousands of Johnnys, who are driven into action by complex historical forces.\n\nTo illustrate, let's imagine how the British might be portrayed in each context. A \"Great Man\" movie might have a scene of King George foaming at the mouth and vowing to crush the rebels, a la Hamilton. A \"Historical Forces\" approach might have a scene where Parliament is discussing the need to raise revenue and cut costs after the French and Indian War. One places the emphasis on George's individual actions and the other on the economic reasons for British actions. Neither is right or wrong but they're different approaches.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "itsokayt0",
                                                                    "body": "It's more studying it in a systematic approach, for example from how certain movements built up, the culture at the time (economical, religion, etc.), the laws, the links between cause and effect etc.\n\nStudying random farmers' life can be useful to know how they lived the years, what traditions they had, what relationship they had with their lord, what expectation they had in war or famine etc.\n\nLike, you can't have the URSS without Lenin, but the foundations of the Romanov dynasty were very fragile and a revolution happened even without the communists.\n\nWe can certainly say some people were vastly more influential than others and things would have gone differently, but lots of stuff happened even if \"nobody\" was the main actor.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "I’m only on the first episode, but I like it so far.\n\nI guess it’s also nice that Apple TV has found the ability to do a good show that isn’t science fiction",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "mtmag_dev52",
            "body": "So apparently OPEC leaders were trying to bribe Texas?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "octopod-reunion",
                    "body": "I would go from “trying” to “did”",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "MapleBacon33",
            "body": "Also, on a completely unrelated note, should we report people who use sock puppet accounts to harass people to the moderators of AskALiberal, or just the Reddit admins?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "A clear message, hopefully with links to comments, about what’s going on sent to mod mail is useful. Don’t message individual mods since mod actions are supposed to happen with transparency to all the mods.\n\nWe do need a clear message with a history because none of us are reading every single comment that happens. You also should not expect a given response time because everyone’s volunteer. It also helps to add context like how you are convinced it is a sock puppet or the like.\n\nWe would appreciate if none of this is done publicly because feeding hostility in the sub is not useful. In many cases, they would be considered a rule violation as well.\n\nAlso helpful is if you think you are dealing with a legitimately unrepentant bad actor that is likely to get banned, don’t reply to them. Simply send a message to mod mail. \n\nAnd on a personal note, I could do without ever seeing another person announce that they have been blocked by another user.\n\nIf you have a specific concern right now or have details about anything that might recently have happened, feel free to send a message to mod mail.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MapleBacon33",
                            "body": "Ok thank you, that's very helpful.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "grammanarchy",
            "body": "With all due respect to Jasmine Crockett, I don’t like ‘butch’ as an insult.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "magic_missile",
                    "body": "Apparently she has plans to monetize it:\n\nhttps://x.com/JasmineForUS/status/1791662562821435456?t=Fykub26mq67g7G6vNtlNpg&s=19",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "Gross. \n\nI don’t have a problem with anything she said other than the butch part. Not a fan of Democrats using language that’s mostly associated with people who hate women and have decided what a “high value woman” looks like.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ChildofObama",
            "body": "This year, there’s simply no scenario that would allow Biden to cruise to re-election, not with inflation, and two wars going on.\n\nBiden is fighting an uphill battle, regardless of the fact that he’s running against Trump again.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "othelloinc",
                    "body": "> This year, there’s simply no scenario that would allow Biden to cruise to re-election, not with inflation, and two wars going on.\n\nThe U.S. isn't fighting in either of those wars.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "An interesting point from [Will Stancil:](https://secure.actblue.com/donate/whyfundraise)\n\n\n>Contribution limits are good but, counterintuitively...it increases the number of donors a candidate needs to rely on, and thus places a greater premium on finding these willing big donors. Candidate time is a huge resource on a campaign and one thing contribution limits do is force candidates to spend more time fundraising.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "octopod-reunion",
                    "body": "If the candidate has to do focused fundraising, vs popular broad fundraising. \n\nI would say it took Bernie less time to get a lot more donations from more people, that it took other candidates to get the same amount of money from fewer donors doing max donations. ",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AskALiberal-ModTeam",
                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kakamile",
            "body": "https://www.usatoday.com/story/news/investigations/2024/05/22/mexican-cartels-supplied-trafficked-guns-from-us/73700258007/",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "grammanarchy",
                    "body": "> He purchased 95 semi-automatic rifles at Guns Unlimited in Katy, Texas, making seven visits over two months.\n\nThey knew.  Come on.  Even if they decided not to realize those guns were going to a cartel, that gun shop knew something was up.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pablos4pandas",
                            "body": "> Guns Unlimited in Katy, Texas\n\nIt's a strip mall store of like a thousand square feet based on googling. No way they didn't notice one guy buying all that shit",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AskALiberal-ModTeam",
                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mtmag_dev52",
            "body": "France twenty4 and i24 getting tricked into promotoign  conspriacy theroeis...",
            "score": 0
        },
        {
            "depth": 0,
            "author": "mtmag_dev52",
            "body": "From the website of the  \"Ayn Rand Institute\":\n\n>Rational egoism is egoism without permission. It recognizes no obligation to acquire some sort of external, non-egoistic sanction or authorization. It does not regard personal happiness as a guilty pleasure.\n\nThoughts on this....claim :-D",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "octopod-reunion",
                    "body": "Interestingly Ayn Rand seemed like a miserable person. \n\nHumans are not wired for egoism. We are social creatures. \n\nIt would be irrational to think being happy comes from pursuing egoistic self-interest, when research shows altruistic, empathetic, and social people are happier. ",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GiveMeAnEdge",
                            "body": ">Humans are not wired for egoism. We are social creatures\n\nUnless they have a psychological malady, such as narcissism or antisocial personality. In that case egoism would probably make sense.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "octopod-reunion",
                                    "body": "Have you met people with narcissism or antisocial personality? \n\nThey are miserable. \n\nIt’s a “disorder” for a reason",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GiveMeAnEdge",
                    "body": "I think it's a pretty consistent definition of egoism. Personally I find that most egoists have some kind of underlying psychological problem that resulted in egoism being the most obvious philosophy to adopt.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Butuguru",
                    "body": "Have a link?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Butuguru",
                                    "body": "Yeah the weird rape.. joke? comment? Idk wtf their point is fucking wild. It does seem to not be terribly upvoted however and I’m sure the mods will take it down.\n\nNo idea about the conspiracy thingy tho",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pablos4pandas",
                    "body": "The comment you're referring to hasn't even been up an hour when you posted this. I don't think taking the upvote count especially on a new comment on a several day old megathread is a real sign of the situation",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pablos4pandas",
                                    "body": "> The megathread has lots of activity\n\nIt's relative I guess, but i'd say the megathread did its job\n\n>  I also hope the particularly disgusting comment will be removed.\n\nPlenty of disgusting comments stay up. It is what it is",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ChildofObama",
            "body": "Prediction: The DNC will pay Kamala Harris go away money to not run for President in 2028, on the basis that she’s unelectable. \n\nThey’ll pay off Gavin Newsom to not try either.\n\nIn this Post-1/6 climate, party leadership more than likely wants one candidate running unopposed for the sake of party unity. I could see Gretchen Whitmer getting it tbh. \n\nThe DNC is gonna be offering ‘unelectable’ candidates incentives to stay out of the race. Bernie Sanders probably already has a big paycheck to ensure his loyalty in 2028 and 2032.",
            "score": -9,
            "replies": [
                {
                    "depth": 1,
                    "author": "CTR555",
                    "body": "Obviously none of that is going to happen.",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ChildofObama",
                            "body": "Kamala, Mayor Pete, and Newsom are probably gonna be on a cruise ship in Hawaii once Biden leaves office.",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CTR555",
                                    "body": "Everyone deserves a vacation.",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "octopod-reunion",
                                    "body": "There’s not a chance in hell they’d give up a chance to be leader of the free world for a free trip to Hawaii.  \n\nNot to mention, even if their chances are low, they overestimate how well they do. \n\nMike Pence ran for president after his party tried to hang him for goodness sake. ",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "octopod-reunion",
                    "body": "You are overestimating the amount of power the party has. \n\nAnd underestimating the egos of people who want to run for president. ",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "loufalnicek",
                    "body": "That's silly.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "I can’t express how much thinking the DNC has really power makes one seem completely unserious to anyone who follow politics even moderately closely. \n\nThe same DNC that couldn’t stop a one term senator from challenging the anointed Hillary Clinton, couldn’t stop a back bench senator from challenging the anointed Hillary Clinton, couldn’t stop that same backbench senator once he had some prominence from challenging the anointed Joe Biden …\n\nOr if you wanna go back further the same DNC that couldn’t stop Jimmy Carter or Bill Clinton.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "MaggieMae68",
                    "body": ">The DNC will pay\n\n>They'll pay off\n\nBahahahahahahahha. \n\nHow to find the people who don't actually know anything about politics.",
                    "score": 1
                }
            ]
        }
    ]
}