{
    "title": "If America were much better educated, would you expect the Right to be significantly different? If so, what would change?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nThe American Right is often perceived as being very uneducated and as thriving off of that lack of education. So what would happen if they and the country overall, were substantially more educated? How would that impact our disagreements and platforms? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Complaintsdept123",
            "body": "We'd go back to debates over taxes and regulations like we did in the past.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "Haunting_History_284",
                    "body": "This. Republicans used to be the party of higher education once upon a time long ago. The scholarly wing of the party is severely lacking these days.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "fttzyv",
            "body": "The elites of both political parties are extremely well-educated.  You can stereotype however you please, but the typical member of Congress -- Republican or Democrat -- looks a lot more like Ted Cruz (Princeton BA, Harvard JD) than Lauren Boebert.\n\nMore educated people tend to be a lot more ideologically consistent, so if America were substantially more educated, then you'd probably see a higher degree of ideological consistency and thus a higher degree of polarization.  \n\nMore educated people also tend to be less susceptible to the appeal of populism, so I imagine that you'd see a much reduced appeal for populist movements like Trumpism/the Tea Party, and a lot more appeal for the kind of elite-driven, pro-business style of conservatism associated with the Mitt Romneys or George HW Bushes of the world.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gilbert__Bates",
                    "body": "> More educated people also tend to be less susceptible to the appeal of populism\n\nThis is only true because educated people tend to be more well off. As more people educate themselves but still end up in the underclass this will change.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "Yeah. If everybody is elite, then nobody is. The parameters would shift to make the elite different. \n\nPopulism still seems like it would be around",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "This is roughly correct in my opinion. If we had a more educated population, Everything would be closer to the center. Right now that means that the dominant strains in the Republican party would instead be fringe people and someone like Mitt Romney would be considered pretty much as far right as mainstream goes. \n\nSomeone like AOC would be about as far left as you could get except she would have to, probably more correctly, identify as a Social Democrat versus a Democratic Socialist. Someone like Cori Bush would not even get elected as a dog catcher.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fttzyv",
                            "body": ">Everything would be closer to the center. Right now that means that the dominant strains in the Republican party would instead be fringe people and someone like Mitt Romney would be considered pretty much as far right as mainstream goes.\n\nYou can move away from populism without moving towards the center.  In the current moment, those are pretty closely related but they don't have to be.\n\nI'd actually posit that we'd see somewhat *more* extreme positions under a more educated public.  Look at how many PhDs are actual Marxists out to the left.\n\nAs to the right, you'd probably see more libertarians.  Out on the fringes of the intellectual right, there's been a real surge of interest in  integralism especially in the form of Adrian Vermeule's common-good constitutionalism.  That is a zero percent populist but definitely extreme set of ideas.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Yeah. Its hard to understand what theyre talking about unless the assumption is that the intellectually correct position is the center/close to it.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "Do you know what makes the less educated more interested in populism?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fttzyv",
                            "body": "It's almost definitional.  Populism is anti-elitist.  Highly educated people are part of the elite.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "I was thinking that too. Ive heard some say its an ignorant approach, but that doesnt seem reasonable to me.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Blunt-Distro1776",
                            "body": "Probably because the less educated have less economic opportunity and therefore have to compete with “imported” low skill migrants for work and are undercut by cheaper undocumented labor. \n\nIt’s always weird when the people are caught saying dumb shit like “well who’s going to pick your fruit?, if we don’t let these immigrants in you’re going to pay way more at the grocery store ”…implying that they approve of the exploitation of an underclass of people. \n\nWhile the idea of globalization and equity is nice in concept, people fail to understand that the local average is much higher than the global median. If standards of living and quality of life were equalized, it wouldn’t “raise people up”. It would actually lower standards of living dramatically for everyone in developed countries. \n\nChina isn’t competitive in the global economy because they are so much better than everyone else and “create” value. They are competitive because they treat their people like shit and EXTRACT value from their large population. And they can do that as a result of competition, prisoners dilemma, and tragedy of the commons. \n\nListen to blue collar construction folk talk about the hispanics as a direct threat to their livelihood in the same way white collar well educated tech workers talk about Indians and you’ll understand populism. \n\nThe people that don’t care aren’t threatened. \n\nIn theory I don’t care about immigrants because my career is very unlikely to be threatened by them. But I can say that sitting in an airport these days is weird. I’ve noticed a dramatic increase in prices (for a variety of reasons) and reduced availability of empty seats. A flight was delayed and now I have a 10 hour delay because every single flight is full. After a couple hours here I have to wonder if the multitude of clearly non-citizens all wearing the same outfits with their folders and baggy that have been boarding flights to multiple cities by the dozens somehow have an effect on the demand side of this equation and are part of the reason my flights are so expensive now…\n\nI’ve been traveling a lot and every major airport I’ve been in lately has had large groups of travelers that clearly didn’t buy their own tickets.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Megalomaniac697",
                            "body": "Populist policies tend to be direct and immediate in effect, for example: a party may promise a check of $1000 to every family if it wins an election. It may sound condescending, but this has more appeal to the less educated while the more educated consider longer term ramifications like inflation from overspending.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sammyterry13",
                    "body": "> pro-business style of conservatism associated \n\nNot so much.  You get a bit \"educated\", own a few companies, be involved with 5 start ups, etc.  and you start to appreciate the longer term planning and the wealth creation model largely supported by the Democrats instead of the lack of planning and wealth accumulation model of the Republicans.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "soviman1",
            "body": "The correlation between conservative voters and lack of education is there, but I don't believe that it is the cause.\n\nThe entire conservative platform (currently) revolves around ideals that are generally \"selfish\". Selfish is probably not the best fit for what I am trying to describe, but its close enough. \n\nFor example, not wanting to spend their hard earned money, in the form of taxes, on other peoples healthcare. \"Why should I pay for someone elses stupid decisions?\" is a common generalization I have heard. They do not want to benefit anyone that does not include themselves.\n\nThis attitude is not tied to education, it is tied to culture and upbringing. While education can help widen someone's perspective on things, it does not necessarily mean that they are willing to accept outside opinions. You typically see examples of this with kids that grew up in small rural towns, who then go to college and get to experience what life is like for people that are not like them, thus the possibility for changing their views opens up, but is not guaranteed.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "I agree. It doesnt seem like us being more educated would really do much for our polarization.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "Probably not much.  Studies show that smarter people don't change their opinions, they just have a better ability to justify them.\n\nTo the extent anything would change it would be the process of more people going to college would increase the variety of people they interact with which would reduce the ability of bad actors to demonize them somewhat.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "not_a_flying_toy_",
            "body": "I read somewhere once that people with education aren't any more liberal but do tend to be more firm and non centrist in their views\n\nso I'd expect that if everyone in the US had a good education we would see some changes in both parties in the realm of populism and other areas where people have seemingly conflicting views\n\nalso I think we would see more engagement as a default, so less pandering to lowest information voters from politicians",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Gilbert__Bates",
            "body": "If the right were more educated, they’d probably favor a more populist and paternalistic conservatism like we see in many European countries. Most likely they’d go farther left economically but remain pretty much the same when it came to social issues, since those are more a matter of personal opinion than objective truth.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Dr_Scientist_",
            "body": "I don't think Trump supporters necessarily lack knowledge . . . though it's hard to see how they could still support Trump if they cared about or had knowledge of the rise of fascism throughout history. I just don't really perceive supporting Trump as falling anywhere on a knowledge spectrum. Knowledge is not a useful variable explaining support for Trump.\n\nWhich education is different from 'having knowledge'. \n\nIf there were more structured classroom environments with individualized attention where people have trust in school administrators . . . then yeah there probably would be less animosity directed towards 'the establishment' which is a motivator for Trump supporters.\n\nI mostly explain support for Trump as a consequence of arrested development. That person experienced trauma of some kind and has adopted a phony tough guy affectation as a defense mechanism to keep them from feeling vulnerable. They fundamentally feel insecure and are comforted by Trump's projected invincibility and lack of empathy. They don't want to feel because feeling is painful. \n\nI'm not sure 'education' as in the content taught in schools is going to fix that more than just having a stable environment where people of integrity support them.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "StatusQuotidian",
                    "body": "lot of nazis, falangists, and other fascists were quite educated.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tall_Panda03",
            "body": "Despite what the liberal echo chambers tell you, the right are not all a bunch of dumb hicks.  College education numbers do currently favor democrats, but not by a huge margin (55 vs 42) according to pew: [https://www.pewresearch.org/politics/2024/04/09/partisanship-by-race-ethnicity-and-education/](https://www.pewresearch.org/politics/2024/04/09/partisanship-by-race-ethnicity-and-education/) ).\n\nI suspect part of this stereo type comes from what each side \"knows\":  Liberals might want to discuss things like climate-change or racial disparities in net worth.  Conservatives aren't super knowledable about this, so might seem \"dumb\" or \"uneducated\" on these topics.  Conservatives might want to discuss gun control (most gun-control advocates are laughably unknowledable about guns, and conservatives laugh at them about this), or immigration and liberals have very different sets of knowledge on this.\n\nSo giving conservatives more \"education\" might sound good in theory, but unless you're running them through the same sources of education that you've got, they might not come to the same conclusions.  You can't simply \"re-educate\" all conservatives and they'll magically be just like you and your buddies.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "I dont think the left - right spectrum really has anything to do with education.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tall_Panda03",
                            "body": "I was talking about this statement:   \n\n\n>The American Right is often perceived as being very uneducated and as thriving off of that lack of education\n\nYour perception of them being uneducation is just that, a perception.  Based off stereotypes and them \"knowing\" different things than you.  My girlfriend works in Academia (at a top university) and 100% of her co-workers are incredibly liberal.  I work in tech and it's probably 50%/50%.  Both of us are highly educated.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Thats not my perception. \n\nMy perception is that education has nothing to do with it",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "An_Absurd_Sisyphus",
            "body": "Interesting question.\n\nI think it would be very difficult to make the claim that lack of education, ignorance, or even stupidity are the key factor that makes people support right wing policies and politicians in the US. From what I can see, especially over the last 20 year or so, the key motivating factor for Americans on the right is anger, dissatisfaction, and maybe even spite. Sure, poor education contributes to those feelings, but I dont think it is causal. Additionally, I think people on the left need to acknowledge that in some key ways, the anger that motivates people on the right is justifiable, even if we profoundly disagree on the cause of that anger or how to fix it. \n\nPersonally, I don't see access to education, in this context, as all that difference than access to any other resource, like healthcare, social saftey nets, and/or affordable housing. My reading of the current climate is that right wingers are primarily upset due to difficulties with accessing these resources, perceptions that they face difficulties to accessing these resources, and believing that their access to these resources is being threatened by outsiders.\n\nSo, with this in mind, I do think better access to education would make the right significantly different. Not because they would become smart enough to change their views, but that the anger they feel would be diminished and replaced with a degree of civic pride/enthusiasm. Similarly, I would apply that same logic to accessing any vital resource.  \n\nThis is where I think the Democratic party has failed. They are failing to really improve access to resources in the communities where right wingers typically live. Additionally, in some cases, they dont do a good enough job at making sure these communities understand that it is Democratic policy that is giving them access. This is a big reason why I am a communist. We cant lecture the right wing into abandoning their position. We need to actually deliver what they need, where they are at. Once that is done and we can improve their material conditions in a measurable way, we can bring them back from the current wave of reactionary thinking.\n\nFinally, I understand that in many ways it is right wing policy which is destroying their access to resources. I have worked in health care and public schooling for the last 10 years and I find it equal parts frustrating and amusing when right wing families (and they often like to tell everyone just how right wing they are) complain about the horrible state of the systems which their policies destroyed. However, rubbing their noses in it utterly fails to win them over, and infact just makes them more angry, perpetuating the cycle. I am not sure if the cycle is intentional, but if right wing politics and media intentionally built this cycle, it is pretty brilliant.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "StatusQuotidian",
            "body": "Hasn't really got much to do with education. The American right is a reactionary movement that's about restoring white Christians to dominance.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "I agree",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Oceanbreeze871",
            "body": "Racial white grievances wouldn’t change. Rural America is being left behind by economic and technological progress. Those Old factory towns are still gonna be dead.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hitman2218",
            "body": "I think our overall Covid response would’ve been better. There’s an open resentment on the right towards people who are more educated than them, and Republicans use that to sow division.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "secretid89",
            "body": "There are plenty of “educated” people who are extremely racist, sexist, etc, and vote conservative.  \n\n\nWhat we REALLY need is better ways to combat bigotry!\n\n\nCollege education helps, but not necessarily for the reason you would think.  It’s because going away to college tends to expose you to people of different backgrounds!   It’s a LOT harder to believe that black people are criminals when one of them is your roommate!   Or that Muslims are terrorists when one of them is your classmate!   Just for example.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tommy__want__wingy",
            "body": "If our country was better educated I feel how society is governed will be more liberal and the only difference would be how economy policy is governed.\n\nSo overall I feel left or right, legal abortion would be accepted, gay marriage would be welcome, and there wouldn’t be a fight on diversity. \n\nMan it would be awesome for the only arguments to be taxes and the amount of government oversight.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "How do you figure?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Tommy__want__wingy",
                            "body": "How do I figure what?\n\nI mentioned multiple things.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Your first two paragraphs. How does greater education mean less bigotry?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Tommy__want__wingy",
                                            "body": "Idk. It’s just what i would expect - per your question.\n\nHaving an education doesn’t mean someone ISNT bigoted.\n\nalso comes down to the overall support system someone has. Are they in an environment that harbors bigotry? If so would having more education change them? Who knows?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "Thats what i found interesting. Where does this expectation come from?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Tommy__want__wingy",
                                                            "body": "More education.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sad_Lettuce_5186",
                                                                    "body": "Essentially\n\nMore education > more liberal society **because** > more education > more liberal society?\n\nNo reasoning here?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Tommy__want__wingy",
                                                                            "body": "Nope.\n\nJust a liberal society that argues on economic policy.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "W00DR0W__",
            "body": "I think the debate discourse would be closer to what it was like in the eighties where policy and outcomes were debated instead of what it has been lately where we debate birth certificates and secret pedophile rings.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "chadtr5",
            "body": "Way more libertarian, at least over time.  Political conflict would probably shift away from culture wars and more towards economic issues.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "I think if *everyone* were better educated then our population would be more engaged and our discourse more constructive.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RedditLife1234567",
            "body": "I don't think the level of education affects the \"hot button\" issues like trans, immigration, etc. Why would having a PhD make me feel differently after immigration, for example?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Atticus104",
            "body": "My dad is a conservative with a PhD, what catches him up, I think, is semantics. \n\nI think how the Republicans have threaded that needle is they have excelled at double speak. They say just enough that white supremacists will feel validated while not enough that it is explicit. \n\nAnd I have seen a lot of liberals fall into validation traps, where they inadvertently support the claims of the Republicans. A good example of this was Critical Race Theory. Republicans started fear mongering that it shouldn't be taught in elementary school. Many tried countering with the obvious point that is a graduate level subject primarily for lawyers (and public health in my case) that is not taught at all in elementary school. But still many liberals took the bait, and argued that CRT \"should stay in public school\" inadvertently supporting their claim that it was there to begin with.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "squashbritannia",
            "body": "Looking at Europe, it would be more left-wing.  There would still be a right-wing political class, but the far-right would be less significant.",
            "score": 1
        }
    ]
}