{
    "title": "Any other Libs/Dems here who are fans of Bluegrass music?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nI’ve never been really into country music but I’ve always loved bluegrass (despite the stereotypes). I’ve always seen the community as more welcoming and progressive than country also. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "toastedclown",
            "body": "I'm a big fan of bluegrass, old-time, and trad country in general.  Not at all a fan of whatever Nashville is selling these days.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "They are selling cookie cutter pop and pop rap with a twang. With an almost entirely male artist base selling music almost entirely to women.\n\nThe best description I’ve ever ever heard of Morgan Wallen is Saloon 5.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "C137-Morty",
                            "body": ">The best description I’ve ever ever heard of Morgan Wallen is Saloon 5.\n\nouch lol. You're not exactly wrong, but I shamelessly enjoy both from time to time.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "toastedclown",
                            "body": ">They are selling cookie cutter pop and pop rap with a twang. \n\nFrom the little bit I've been involuntarily subjected to, that seems to be putting it generously.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "grammanarchy",
                                    "body": "To quote Steve Earle, it’s hip hop for people who are afraid of black people.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AndrewRP2",
                            "body": "Hick-hop is a term I’ve heard and I love it.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ButGravityAlwaysWins",
                                    "body": "That's a good one for the genre as a whole. I think Morgan Wallen is offensive as an artist enough that he deserves a bespoke term and the comparison to Maroon 5 is so perfect.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MiketheTzar",
                            "body": "It's the perfect market idea. You have male country singers sell to happy and horny women. And female country singers sell to mad and sad women.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ButGravityAlwaysWins",
                                    "body": "I think the big problem is that it has essentially cut out 50% possible artists and severely limited de genre appeal.\n\nI’m old enough to remember when Shania Twain, Faith Hill and the Dixie Chicks were not only huge country stars but huge crossover stars that brought people who otherwise would ignore country into the genre. \n\nMaybe it was never the plan, but I would not be surprised to find out that the reason Taylor Swift, so quickly pivoted away from country radio is that she could see the future it looked like Faith Hill’s career and not Tim McGraw’s.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MiketheTzar",
                                            "body": "Country also went through a very down period in the 2000s and 2010s when rap and hip hop hit a zenith.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "tidaltown",
                    "body": "You’ve gotta get off Broadway for anything decent these days, and there are gems to be found.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "toastedclown",
                            "body": "Oh, yeah, I meant Nashville as a synecdoche for the mainstream country music industry.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tidaltown",
                                    "body": "I think Austin is make a solid push to be 1B in that conversation these days as well. They’ve been pulling a number of CMA//CMT events away the last few years.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "toastedclown",
                                            "body": "Austin has been a major hub of the music business generally for a while now.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "toastedclown",
                            "body": "Oh, yeah, I meant Nashville as a synecdoche for the mainstream country music industry.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Yes.\n\nYou might be surprised to find out that we liberal hillbillies do exist.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "EchoicSpoonman9411",
            "body": "I live in rural Appalachia where Bluegrass came from. It has always been made by misfits and malcontents who are decidedly progressive, especially in comparison to the average Appalachian. Many have contracted my studio to record their albums over the years.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "I am! I’m also picky about it though.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "fieldsports202",
            "body": "Who's ever been to Merlefest?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": "Yup!\n\n\nI own a guitar, and a bass, and a banjo. 8 years of lessons, and I still suck. :)",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "Hey, why are are all the country songs by male artists like \"I married a young girl and we had 5 kids and she stays at home while I go out for a beer with my buds\" and all the country songs by women are like \"I killed my husband\"?\n\n\n:D\n\n\nSnicker...",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "grammanarchy",
            "body": "Love it.  Saw Ralph Stanley 20 years ago and it changed my life.  Traded my Fenders for a Martin steel string and never looked back.\n\nI also love alt country — Gillian Welsh, Steve Earle, Uncle Tupelo, all that stuff.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "jromansz",
            "body": "Love Bluegrass, I am a wild-eyed lefty from the great commonwealth of Kentucky.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "PatMenotaur",
                    "body": "Me too!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "RealSantaJesus",
            "body": "Fuck yeah! I put up with old country, and I like some new country if they’re trying something different. But I detest 85% of modern country music.\n\nHowever, I looooove bluegrass and folk!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PM_ME_LASAGNA_",
            "body": "Bluegrass is wonderful and I love the pure, clean sound that comes with it.\n\nFor other fans of the genre, check out the weekly show Bluegrass Ramble on 91.3 KBCS.  If you get their app, you can listen to the show on demand.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "deepseacryer99",
            "body": "Nah, but I am a rocker with my username as a reference to Jessica Dobson's band.  Nothing wrong with country or bluegrass, just not where my interests lie.\n\n\nI am a musician, though.  I've been playing guitar since I was 12.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "sevenorsix",
            "body": "Love it. It's a pretty progressive scene too.\n\nFwiw, some of the older country is relatively progressive too. I can't imagine any of the arena-country hacks of today writing something like Cash's 'man in black'.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "vibes86",
                    "body": "Agreed. A lot of old country is pretty progressive.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sleep_On_It43",
            "body": "I am a huge fan of any kind of Roots music….Blues, Bluegrass, Folk, Old school country, country Rock, basically anything with acoustic instruments. I also like some forms of Jazz(mostly cool, big band and swing)… it the real “way out” stuff? Not so much….same with Rock music…mainstream Rock and Roll is fine…but some of the progressive rock and the super fast Heavy Metal where the vocalist basically vomits into a microphone? Nope…",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BlueCollarBeagle",
            "body": "Emmylou Harris ....yeah.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "vwmac",
            "body": "Country is 99% of my listening time. For the longest time, country  / bluegrass / folk was actually quite progressive; even more conservative country stars in the 50s-80s like Johnny Cash were huge advocates of things like prison reform and healthcare. Willie and Dolly have been on big advocates for the LGBT community for a long time. the 90s, 2000s and war on Iraq really did a number on country music's image unfortunately. \n\nBluegrass is always a win, and if you want to branch out into some more modern country stars who have inclusive communities definitely check out Orville Peck. His debut album is one of my all time favorites, and he blends some of the darker elements from bluegrass / country with the more glam country styles of the 70s and 80s. He's also gay and is a huge face in the community for LGBT rights and acceptance.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "vibes86",
            "body": "I LOVE bluegrass.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SlopesCO",
            "body": "Absolutely. And the influx of interest by 20/30 somethings has been a game changer. At Rockygrass 6 yrs ago, saw my last southern & Gadsen flags. Four yrs ago, saw my first pride Bluegrass flags/interest group. Last year's closer was Big Richard who actively spoke of bringing down the patriarchy to huge applause. Bluegrass is experiencing a Renaissance right now.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Personage1",
            "body": "I like it a lot. I also like plenty of country, but as with pop music, if it gets mainstream radio play it probably sucks.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "aahorsenamedfriday",
            "body": "Yeah, I’m a fuckin hillbilly from Alabama. I believe in the struggle of the forgotten Americans because that’s all I know. Y’all means all.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "spice_weasel",
            "body": "Yes! I’m a classically trained double bassist, and actually love to play bluegrass. To get a picture of what bowed bass can sound like in bluegrass, you should listen to Edgar Meyer.  He’s utterly amazing.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PatMenotaur",
            "body": "I grew up in Appalachia, the sound of a fiddle or banjo makes my blood stir.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "MiketheTzar",
            "body": "The intersection of bluegrass and progressive views runs deep. Sadly the modern progressive movement seems to completely abhor anything to do with Christianity. Which is a secondary and tertiary themed in a lot of your bluegrass classics. \n\nThere is also an interesting pass that we tend to give left leaning media in regards to making fun of rural, mountain, and farming folk. Which tends to bleed into a weird disdain for bluegrass.\n\nThis is changing thankfully with a lot of queer bluegrass folks speaking out about these inconsistencies and how problematic the views I mentioned are.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "vincethered",
            "body": "Not a fan in the sense that I can list off lots of bands and albums I like and follow but I put it on my streaming service sometimes. I like the way it sounds",
            "score": 1
        },
        {
            "depth": 0,
            "author": "24_Elsinore",
            "body": ">I’ve always seen the community as more welcoming and progressive than country also.\n\nThere is a reason Joseph McCarthy had an extreme hard-on for persecuting early folk, country, and bluegrass artists.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "I'm not enough of a fan to know much about it, but I do like listening to it on occasion.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lobsterharmonica1667",
            "body": "I grew up in Apalachia, love me some bluegrass.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "anarchysquid",
            "body": "Oh. Absolutely. Both older stuff and some of the newer artists out there.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jkh107",
            "body": "Yes! I love folk (and the PROUD TRADITION of folk on the American left), Americana, bluegrass, and a lot of country as well, especially classic, Kasey Musgraves style stuff, or more distinctive country/alt country/roots acts with other influences like the Mavericks. I like folk-influenced songs with a sense of narrative, a sense of place, and a more acoustic style accompaniment. And also: fiddling. It's amazing. \n\nPart of the reason I think I probably like bluegrass so much is that I listened to it a lot when I was little--I grew up in the DC area and we had bluegrass on public radio from 3-6 for decades, no commercials just a bunch of old Bill Monroe tunes among others...tearjerkers like Footprints in the Snow always get me.  And I love it when the train songs actually sound like trains.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AddemF",
            "body": "For sure, Bill Monroe is great.  Tyler Childers is great even if it's not traditional bluegrass.  Love the Powell River Sessions.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mektige",
            "body": "It's not my favorite, but I do enjoy it quite a bit when the mood hits. I'd say I probably mostly enjoy more contemporary bluegrass, though, like Trampled by Turtles and Old Crow Medicine Show's bluegrassier stuff.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "not_a_flying_toy_",
            "body": "I'm a casual fan of bluegrass",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Scalage89",
            "body": "Hell the f no.",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "03zx3",
                    "body": "What don't you like about it?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Scalage89",
                            "body": "It's extremely limited in terms of composition, themes, variation and seems to be solely existent in the US south.",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "03zx3",
                                    "body": ">It's extremely limited in terms of composition, themes, variation\n\nName a more popular genre that doesn't.\n\n>and seems to be solely existent in the US south\n\nWhy should that matter?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Scalage89",
                                            "body": ">Name a more popular genre that doesn't.\n\nProg rock, prog metal, jazz, classical music, soul, house and trance.\n\n>Why should that matter?\n\nThe extremely limited scope is why absolutely nobody cares about it worldwide.",
                                            "score": -3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "sevenorsix",
                                    "body": "> extremely limited in terms of composition, themes, variation\n\nYou can say this about lots of music styles, especially house and trance, which you say you like below.\n\nIf you're looking to expand your horizons [here's](https://www.youtube.com/watch?v=1bVueNiKmK0) a jammy one that might appeal to you.\n\n> seems to be solely existent in the US south\n\nIt exists in the US north as well. There's a shitton of European festivals listed [here](https://en.wikipedia.org/wiki/List_of_bluegrass_music_festivals). Anecdotally I have family in Europe who are musicians who enjoy bluegrass.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "loufalnicek",
                                    "body": "Is it possible that you just don't know that much about it? This reads like a \"get off my lawn\" type complaining about hip-hop, with a couple words changed.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Scalage89",
                                            "body": "Then explain where I'm wrong.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TotallyNotGlenDavis",
                                                    "body": "Ton of bluegrass influence on The Grateful Dead and other jambands, their influence is far more prevalent in the Northeast and West Coast than the South.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Scalage89",
                                                            "body": "Ok, point taken.",
                                                            "score": 0
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "loufalnicek",
                                                    "body": "I mean, there's plenty of variety in the music, it's popular outside Appalachia (guessing that's what you mean by the \"South\"), etc.\n\nI guess I'd say the same thing to you that you might say to someone who said hip-hop all sounds the same and is only popular in urban areas, which would be something like \"not really\".",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Scalage89",
                                                            "body": "That's just restating your previous comment.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "loufalnicek",
                                                                    "body": "Right -- everything you said (about variety, popularity) was wrong. What else do you want me to say?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Scalage89",
                                                                            "body": "Good god, I have to explain someone's own argument to them again. You said I was wrong and that I just wasn't familiar enough with it, like I'm just saying hiphop is bad for no reason. So then I give you an opportunity to tell me which points I'm wrong about and you just repeat the same statement again.\n\nI specifically said *what* I don't like about it, and you seem to have no rebuttal. So am I really that unfamiliar with it or do you just not like my opinion?",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "loufalnicek",
                                                                                    "body": "Yep, really that unfamiliar.",
                                                                                    "score": 3
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}