{
    "title": "Why are 96.7% of Kindergarten teachers women?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nLiberals have this idea that men and women are only the way they are because of social conditioning.\n\nBut when you look at certain statistics like the fact that [96.7% of Kindergarten teachers are women](https://www.forbes.com/sites/kimelsesser/2024/02/12/over-96-of-kindergarten-teachers-are-women-research-shows-heres-how-to-attract-more-men/), that really makes me wonder. Is the idea that women don't have a natural aptitude with children despite being the sex that carries and gives birth to children and has the ability to feed children with their female organs?\n\nIs there a problem with Early Education engaging in systemic discrimination against men? Seems unlikely.\n\nSame with nursing, which is 88% women, according to that same article. Another profession that has to do with nurturing/caring/people-centric. This one doesn't have to do with children but the similarities are clear. Does the Nursing profession systemically discriminate against men too?\n\nWas my 4 year old niece socially conditioned into liking dolls and pretty things, along with most other little girls? I'm not sure about that. I mean the least we can say is that the social conditioning doesn't take long at all, and this conditioning is very powerful because girls and boys seem to gravitate to these gendered things, despite only a short time of conditioning.\n\nAnother thing that makes me wonder regarding the social conditioning argument: \\[[1](https://en.wikipedia.org/w/index.php?title=Empathizing%E2%80%93systemizing_theory&oldid=515528642#Evolutionary_explanations_for_sex_differences)\\]\n\n>research on one-day-old babies has found that boys look longer at a mechanical mobile while girls look longer at a face. This, as well as the effects of fetal testosterone on later behavior, is argued to be evidence against the sex differences being only due to socialization.\"\n\nI don't know, I think this argument that sex differences are purely the result of social conditioning is one of the weaker liberal arguments.\n\nDo you really think social conditioning is the only reason for differences between the sexes? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "postwarmutant",
            "body": "> only the way they are because of social conditioning\n\nUntrue. You would be hard pressed to find a liberal who believes that men and women are the way they are SOLELY due to social conditioning. \n\n> But when you look at certain statistics \n\nThese statistics don't really discount the idea that women are socially conditioned to be caregivers, though. They might actually reinforce it. \n\n> Was my 4 year old niece socially conditioned into liking dolls and pretty things, along with most other little girls?\n\nAt least partially, yes. \n\n> I think this argument that sex differences are purely the result of social conditioning is one of the weaker liberal arguments.\n\nGood thing it's not one the liberal arguments, then.",
            "score": 95,
            "replies": [
                {
                    "depth": 1,
                    "author": "gorkt",
                    "body": "Yeah, my parents let me play with whatever and I had Barbies, Legos and Transformers and played with them all equally.  I was also encouraged do whatever I wanted and I am a chemical engineer.  Parenting does make a difference.  It also helped that my mom was a med tech growing up so I had a role model.",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HayabusaJack",
                            "body": "My Dad wouldn't even let me have a GI-Joe. \"It's a Doll!\"",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Iterr",
                                    "body": "Your dad sounds like a barrel full of fun.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "HayabusaJack",
                                            "body": "Well, he's been gone for 35 years so a barrel of something anyway. :)",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Legalsandwich",
                    "body": "As a masc lesbian who grew up a tomboy, they tried awfully hard to condition me to like dolls. They failed miserably. And by they, I mean literally everyone around me.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "Oooh we’re finally getting somewhere. You mean to tell me that there are natural inborn differences between men and women when it comes to personality traits, choices etc that aren’t imposed on us by the patriarchy? \n\nWhat would you think those be?",
                    "score": -32,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "InterstellerReptile",
                            "body": "That's a bad faith take on what he said. Things like hormones and brain make up *can* have large effects on people traits, but there is not definitive trait that all women share in that ans a lot of traits are effected by social conditioning.\n\nFor example testosterone can lead to increased aggression. \"Riod rage\" is a real thing. Not all men are violent though and outside factors such as society pushing toxic male traits or environmental like lead poisoning can have much larger effects on men being so violent.",
                            "score": 27,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Right and both men and women have testosterone except men have on average 20 times more testosterone. And that’s just the common hormone  everyone knows about there are many others. I.e men on average have significantly higher cortisol levels, women have higher GH levels. Etc etc \n\nI’m assuming that you’re agreeing that the endocrine system in men and women are naturally different and it significantly contributes to personality differences and affects choices. Are we still on the same page?",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "InterstellerReptile",
                                            "body": "It's like you just choose to ignore all of my comment that didn't fit your narrative...",
                                            "score": 21
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Orbital2",
                                            "body": "Wait until bro figures out what “on average” means",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Smart-Tradition8115",
                                    "body": "do you think evolution of human beings just didn't affect the brain at all?\n\nWouldn't that be a bit odd?",
                                    "score": -14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "InterstellerReptile",
                                            "body": "....did you not read what I wrote? Because it's like you are imagining a conversation that I didn't have.",
                                            "score": 13
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "magictoasters",
                            "body": "The problem is typically the application of a group statistic to an individual and to what degree is nature v nurture and how that manifests itself in societal pressures within and between groups, which I think is just people being bad at it, and are taught poor generalization from a young age.  Honestly, its probably a pretty good approximation for many causes of social ills in general.  Which is also probably why many of those things can actually be ameliorated through education and socialization.",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "I agree that it’s a problem. We apply group statistics to individuals all the time in this country when our goal is to achieve the equality of outcome. \n\nIn depth analysis of statistics can however be useful when you’re trying to solve a problem. Or even to identify if the problem exists at all. \n\nI.e if someone proposes we should be aiming to equalize the number of men and women working as kindergarten teachers or in any other industry, maybe a study would be useful that analyzes career choices in men and women and how personality factors and maybe even endocrine system may affect them.",
                                    "score": -1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "That's interesting, is there like a percentage split on nature vs. social conditioning? I've really only heard that it's social conditioning, or that it's \"mostly\" social conditioning. Mostly I've heard that it's just social conditioning.",
                    "score": -25,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "postwarmutant",
                            "body": "> is there like a percentage split on nature vs. social conditioning\n\nI think it would be enormously difficult, in fact nearly impossible, to determine this. Nor do I think it's a particularly productive exercise. \n\nLiberals acknowledge that differences between men and women include behavioral differences, just as they do physical ones. \n\nI think a lot of the reason why liberals have been banging the drum of \"social conditioning\" in recent years is due to conservatives' refusal to believe it plays a significant role - largely because they want to discount the experiences of trans people.",
                            "score": 33
                        },
                        {
                            "depth": 2,
                            "author": "InterstellerReptile",
                            "body": "There's no way to do that. The best you can do is studies basic on identical twins and seeing how they are different and try to guess why. \n\nThere's no way to control all variables, though, so any scientific experiment on nature vs nurture will also be extremely flawed.",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "I mention this study in the OP, do you think this is interesting at all?\n\n>research on one-day-old babies has found that boys look longer at a mechanical mobile while girls look longer at a face. This, as well as the effects of fetal testosterone on later behavior, is argued to be evidence against the sex differences being only due to socialization.\"",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "InterstellerReptile",
                                            "body": "Interesting, sure... but again nobody here is claiming that sex differences are ONLY due to socialization, and I'm also sure that their finding isn't a universal trait for all the babies. They will have boys that look at faces longer than many girls and vise versa.",
                                            "score": 14
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "I think that even if I had not already read many studies like that, having heard it for the first time I would roughly answer with “yeah no duh“.\n\nI can’t imagine it’s possible to put a percentage on nature versus nurture, but obviously both are in the mix. Since we can’t go back in time and change evolution and wouldn’t want to if we could - just look at the nurture part and determine what we should and shouldn’t change.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "-Random_Lurker-",
                            "body": "I think most people who have actually thought about it for more then 30 seconds will realize that it's probably some combination of both.\n\nLiterally everyone who's aware of the most basic psychological research knows for a fact that it's some combination of both, since both \"exclusively nurture\" and \"exclusively nature\" have been clinically disproved repeatedly and definitively.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "maddsskills",
                            "body": "Nature vs nurture is one of the biggest debates out there.  It’s hard to tell.  But also: even if men and women tend to naturally skew one way or another doesn’t mean all men and women skew that way.  There are always outliers.  People should feel free to be who they want to be regardless of what genitals they were born with is the major take away.",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SuperSpyChase",
            "body": "There is an incorrect view that people who reject strongly deterministic views of personality are all blank-slaters. Steven Pinker wrote a whole book that is nothing but this strawman writ large. This is not accurate. I believe many things are related to socialization, and bio-deterministic explanations fall short in many areas, but there are biological factors that explain some tendencies and differences.\n\n>Is there a problem with Early Education engaging in systemic discrimination against men? Seems unlikely.\n\nI don't know why you would find that unlikely. As a man I am hesitant to be around children at all because of the kinds of accusations that fly. I've seen men be pretty actively counseled out of pursuing careers in Early Childhood Education.\n\n>Same with nursing, which is 88% women, according to that same article. Another profession that has to do with nurturing/caring/people-centric. This one doesn't have to do with children but the similarities are clear. Does the Nursing profession systemically discriminate against men too?\n\nIt doesn't have to be discrimination; in this case it's largely socialization. Little boys who say they want to grow up to be nurses are not given the same encouragement as little girls who say they want to grow up to be nurses.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "courtd93",
                    "body": "I agree. Both my parents and my brother are nurses-not only were there many steps that were taken in school to discourage them, and hold them to a higher standard in a similar way women are held to a higher standard in STEM or the trades, they continue to have additional barriers put in place by the hospitals they work at and their own patients with biases against males in nursing because something must be wrong with them. Our systems absolutely shape where and how men with those interests go. \n\nAlso, having had that many (plus two aunts) be nurses and spending much of my life around others, I can tell you that many of them are not in the field because of some interest in caring or nurturing but because it cost less time and money than med school when they find medicine fascinating or because it’s a pretty high paying job for someone who isn’t business minded. Just because a job has caring components doesn’t mean that’s why people do it (see doctors, therapists, college professors, etc) so the gendered/sex based arguments fall off quickly.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hungry-Technology335",
            "body": "Our culture instills the idea that caretaking children and nursing are inherently things women are better at, while also instilling the idea that women aren't as good at stuff men usually do. It's sexist towards men and women.",
            "score": 78,
            "replies": [
                {
                    "depth": 1,
                    "author": "perverse_panda",
                    "body": "Our culture is also strongly distrustful of men who show an interest in children who are not their own. \n\nIf you've got a kindergarten teacher who's a man, some not insignificant number of people are going to suspect him of being a pedo.",
                    "score": 95,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hungry-Technology335",
                            "body": "I got a bunch of weird looks from both men and women when I told people I wanted to teach young kids. It's fucking gross that people can't see a man teaching young kids without thinking of sex.",
                            "score": 48,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Thats shitty that that was your experience. For me, people just said it was a natural fit and that I was a good father figure",
                                    "score": 10
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ecfritz",
                            "body": "My elementary school had a male 1st grade teacher, and there were lots of whispered comments along those lines. Must have been very uncomfortable for him at times.",
                            "score": 28
                        },
                        {
                            "depth": 2,
                            "author": "TheOneFreeEngineer",
                            "body": ">Our culture is also strongly distrustful of men who show an interest in children who are not their own. \n\nAnd this is a relatively new social conditioning too. And largely happened alongside women entering the teaching field in large numbers. \n\nIt's so interesting how the social decline in the position of teacher corsponds closely to have many women start entering the field, and then men are socially suspect to be part of that field. But not coaching, people don't suspect even coaches of 4/5 year old leagues as much as they would suspect a male kindergarten teacher. Coaching a field dominated by men so it seems to get more trust for male members.\n\nThe only real exception i can think of to this relationship is pastors and priests which seems mostly because of massive scandals of institutional child abuse spanning atleats the past 100 years.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "CoatAlternative1771",
                            "body": "I will say, media is slowly starting to reveal women who sexually abuse children in a better light now.  As in, actually portraying them as monsters and not just a “oh yeahhhh” type of deal.",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fastolfe00",
                                    "body": "Anecdotally, it sure seems like Fox News stories on teachers having sex with their students tend to involve an attractive woman teacher. Maybe you're right, but judging from the Fox News comment section I suspect equitable treatment of the genders isn't necessarily the goal.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "salazarraze",
                                            "body": "The Fox News comments sections for those stories are basically what South Park predicted. Just a bunch of Chuds going \"Nice.\"",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Hungry-Technology335",
                                            "body": "I don't think societies distrust of men around young children is prevalent with the right more than the left.\n\nIn fact I would argue the right has a problem in the other direction, as they have a hard time holding right wing men accountable when involved in sexual conduct with minors.",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "notapunk",
                            "body": ">who are not their own.\n\nEven as a dad out solo with your kid it's not uncommon to get looks/comments.",
                            "score": 14
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "Are there other cultures where women don’t dominate childcare?",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheOneFreeEngineer",
                            "body": "What do you mean by child care exactly? Cause if you are talking about teaching elementary school kids. Yes. Our own, just a generation or two ago. \n\nHome care was different but the idea of absolute segregation between a father and childcare at home seems to be driven by the industrial revolution or the promotion of Prussian education system.",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "monkeysinmypocket",
                            "body": "I feel the need to point out there is a vast difference between \"childcare\" and early years education. One doesn't take much skill, you just need to be kind and patient (speaking from firsthand experience as a mother here), while the other requires proper training and qualifications. We denigrate early years teaching as \"women's work\", or \"childcare\" we pay it poorly, and yet these are the people who are in charge of our children's *most important* educational years. It blows my tiny mind.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Oh lord. Correction. *Early childhood education\n\nNot sure how “childcare” is somehow denigrating and less important but sure I’ll humor u",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "monkeysinmypocket",
                                            "body": "Childcare is not less important, but education at school or nursery is a separate thing. And it's not something anyone can do.",
                                            "score": 6
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ButDidYouCry",
                                            "body": "They are not the same thing.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Maximum_joy",
                                            "body": "Are you one of those people who elsewhere argues that words have meanings that are important and can't be changed just because?",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Hungry-Technology335",
                            "body": "Honestly I'm not sure. I'm sure some cultures / countries are better about this specific type of sexism, but I would imagine it's probably a global problem.\n\nIt's like racism. Sure, racism is prevalent throughout the world, always has been and always will be. But I can still call it out and fight against it when I see it.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "So you then believe that we ought to strive for more of a 50/50 ratio of men and women in childcare and offer affirmative action for men in this industry ?",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "Affirmative action isn’t even the right term. But changing incentives so that more men go into the field? Yeah, I think that would be good.\n\nRight now, even with the trending education tilting towards women, the gender pay gap is still a thing.  One way to address it would be to increase the pay.\n\nBut the rest is all cultural. We would need to shift towards a society that doesn’t seem teaching as something for women or dealing with young children as something for women. As well as the idea that the only reason a man wants to be around children is that they are a pedophile. \n\nThat is a decades if not centuries long project. It already started, but we have a long way to go and we will need to fight social conservatives of the entire way. But we will eventually get there since social conservatives always lose in the long-term.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "are you discounting any inherent physiological differences - endocrine system , hormonal differences that affect personality, tendencies choices?",
                                                    "score": -5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mentallyshrill91",
                                                            "body": "As someone with 12 years teaching, 2 years consulting, a bachelors in child development and a masters program in the same thing - yes. I am discounting the assumption about inherent psychological and physiological different being a serious impediment for men not being assholes to children. Anyone can learn the skill set of caregiving effectively because it’s not “natural” to any one particular personality, gender, or belief system - it takes time, effort and study.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "idowatercolours",
                                                                    "body": "That’s not the question. You shifted the goal posts. Never said anything about being “assholes to children.” \n\nWe’re talking about personality, tendencies, temperament shaped by physiological (to include endocrine) differences that affect career choices. **choices**. Please don’t be disingenuous. \n\nPlease use  your teaching and bachelors degree again, and come up with a good faith response",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "mentallyshrill91",
                                                                            "body": "uuhhh the focus on endocrine here is really bizarre? Lmao do you think that women with thyroid disorders and hormonal imbalances can’t be caregivers? \n\nAlso I did answer the question! I said there are no inherent physiological and psychological differences which would make men less suitable to being successful in a caregiving setting such as kindergarten— all skills needed to be kind, attentive, and respectful to children can be learned and are not inherent to any gender. Nobody is better suited to working with children naturally and being a truly great teacher takes effort. :)",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "idowatercolours",
                                                                                    "body": "So you’re saying it’s bizarre that men and women have starkly different levels of testosterone, cortisol etc.? do you realize that thyroid is not the only hormone that’s a part of endocrine system? Do you also realize that testosterone has an effect on temperament, personality, choices. Many others hormones do as well. I would think it would be in a basic curriculum as a part of your bachelors degree. Do they just hand these out these days ? \n\nYou didn’t answer the question. You shifted the goal posts again. Even though I highlighted the word “choices”. The reason women  dominate this area isn’t because of the belief or fact that they’re  better suited for the job, it’s simply because there is far far more female applicants that are women  for the job, hence more qualified candidates. They choose this area. And the reason they choose it is because the prospect of working with young children is far more attractive to females than it is to males.",
                                                                                    "score": -2
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "ButGravityAlwaysWins",
                                                            "body": "Of course, all these differences could count for things we see in different choices men and women make. \n\nBut the idea that 96.7% of kindergarten features are women coming down to biology or whatever is frankly ridiculous. I feel like you have to not know more than four or five people to think that differences are so great simply due to biology.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "idowatercolours",
                                                                    "body": "I know a lot of men and women and in my experience vast majority of men just don’t have the temperament to deal with young children. \n\nThere is no way around the fact that some professions are going to be naturally dominated by one gender. This is the case with nursing too. Which in some areas are very in demand and well paid jobs",
                                                                    "score": -6,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ButGravityAlwaysWins",
                                                                            "body": "Back a couple years ago, friend of mine took his toddler to Christmas in California and stayed with his in-laws. With a couple of kids in the house, he wasn’t really getting out that much and she probably primarily only had dinner at home, paternal grandparents house, my house and another friend of the families house.\n\nThe thing is is that all of those homes the husband did all the cooking. It never even occurred to my friend that that was the case because why would it? Not really something you think about.\n\nSo he’s at his in-laws and his daughter walks into the kitchen and she sees her father cooking. But she also sees her grandmother and her aunt cooking. \n\nSo when they get back from their trip, my friend shares this hilarious story about how his daughter ran off to find her mother and tell her that something weird was going on in the kitchen because there were girls cooking and girls don’t cook. Her little toddler brain was very concerned that the food would be no good or even unsafe.\n\nIt is perfectly fine to acknowledge the obvious reality that there are differences that are for lack of better term nature based between men and women. But if you think that and that alone results in 96.7%. Of kindergarten teachers being women, you are unfortunately stuck where my friends daughter was years ago.\n\nAnd I suspect the entire point of this conversation, that what you were saying is both misogynistic and misandrist, is not something you’re going to be able to understand.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "idowatercolours",
                                                                                    "body": "Why does it matter that the difference accounts for 96%? Maybe it accounts for 80% and the rest is just a self perpetuating stereotype. Why is that relevant",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "ButGravityAlwaysWins",
                                                                                            "body": "That’s not what the 96% everybody is talking about in this conversation refers to. It refers to the percentage of kindergarten teachers that are women.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "idowatercolours",
                                                                                                    "body": "I’m aware. I’m talking about what portion of this trend is accounted by natural biological differences that guide career choices among men and women. I’m saying it’s likely 80%\n\nIn my life I’ve met many men who are good with kids but haven’t met many who are interested in working with kids in any capacity.",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Hungry-Technology335",
                                            "body": ">So you believe ought to strive for more of a 50/50 ratio of men and women in childcare\n\nI wouldn't go that far, I would just like society to not discourage men to enter childcare.\n\n>offer affirmative action for men in this industry ?\n\nThat's a very hard no.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "But we do encourage women to go into stem fields more, we have quotas and incentives to have more  women in police and the military. Are you for that or against it?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CTR555",
                                                            "body": "There's a big difference between making sure the door is open for women to the high prestige/high pay/high influence jobs they'd traditionally been excluded from and letting men know that if they want, they can take on some of the lower tier jobs that have traditionally been performed by women.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "idowatercolours",
                                                                    "body": "I’m not sure if military and police are high pay and high influence. And we do absolutely have incentives to increase number of women in the military. Down to lowering PT standards in all branches",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "CTR555",
                                                                            "body": "Meh.  I'm fine with the idea of the combat arms MOS folks having to take a standardized test, but I think a lot of the bitching about PFTs is missing the point - they're not intended to be a race, they're supposed to evaluate fitness and they serve that purpose just fine.  They're not a skills test - those are separate (which is why, for example, a lot of women get NPQ'd for stress fractures from the humps).  \n\nAnd some of the 'low standards' can be misleading.. I, for one, preferred the pull ups to the flexed arm hang the ladies had to do - that shit was hard.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "idowatercolours",
                                                                                    "body": "PFT is only one small part. CFTs are actually more relevant as any troops in any MOS may end up in combat and may need to be relied on physically.\n\nWomen is one of the reasons army was forced to eliminate leg tuck. Which I personally thought was a superior core strength measuring exercise as it relates to functional strength.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Hungry-Technology335",
                                                            "body": "I can see the value in it in certain specific cases, but in general I am against gender & race based hiring quotas, especially legally.\n\n>But we do encourage women to go into stem fields more\n\nEncouraging is another story",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "lasagnaman",
                                            "body": "where do you get that from?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "From the last sentence.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hungry-Technology335",
                            "body": "Perhaps. But I would argue that any inherent biological advantage women have in that regard would be very minimal compared to upbringing / values / morals / learned empathy.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Hungry-Technology335",
                                            "body": ">For instance, if you want to find the ten most violent people on earth, you know ahead of time at least 8 will be men and you know it isn’t because of socialisation. Even if we were a rainbows and unicorns society, it would still mostly be men.\n\nWhat are the biological factors that make men inherently many more times violent than women?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Hungry-Technology335",
                                                            "body": ">You’re joking, right? \n\nI'm not saying I disagree with you, I'm just curious what your reasoning is.\n\n>I mean we can start with testosterone which I would hope you are aware is linked to aggression?\n\nI have heard that. But I have also read a study that says testosterone itself is not linked to violent acts. In fact I read that there is a positive coalition between testosterone levels and violence in women, but not in men.\n\nSo idk.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RandomGrasspass",
                    "body": "There’s a nature component to that.  Men can be great nurturing and impactful kindergarten educators,  and women can be incompetent disorganized train wrecks…. But most of the women outperform the men and men aren’t drawn to it.",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hungry-Technology335",
                            "body": "The nurture component matters way more than the nature component. The benefits of nurture component, morals / values / empathy etc, vastly outweigh the nature component, any inherent biological advantages women might have.\n\n>But most of the women outperform the men and men aren’t drawn to it.\n\nThat is not based on biology as much as the values, skills and ideas we raise men with vs women.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hungry-Technology335",
                            "body": "That is sexist of you, no way around that.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Hungry-Technology335",
                                            "body": ">I mean I mentioned I'm a man right? \n\nMen are just as capable of being sexist against men as women are.\n\nHow about this. I have been a prison guard for 15 years. I simply don't trust black people as much as white people. They murder more people. Sorry black people, it's just statistics. \n\nDoes that sound racist to you?",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Flufflebuns",
                                                    "body": "So let's say you had a kindergartner. Which I actually do. You're telling me that it would make no difference to you whether their teacher was male or female?",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Hungry-Technology335",
                                                            "body": "Of course I don't care what gender my kids teacher is at any age.\n\nWould it make a difference to you whether your kids kindergarten teacher is black or white?",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Flufflebuns",
                                                                    "body": "It absolutely wouldn't matter one bit the race of my child's teacher, and I also wouldn't necessarily be against having a male teacher, it's a case-by-case basis. But in general I am more trusting that a woman be a teacher in younger grades.",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Hungry-Technology335",
                                                                            "body": "Well I hope you become less biased against men who just want to teach in the future.",
                                                                            "score": 7
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "funnystor",
                                            "body": "> I mean I mentioned I'm a man right?\n\nMen can internalize misandry just like women can internalize misogyny.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Oceanbreeze871",
            "body": "There is one male teacher in my child’s elementary school…and he teaches upper grades. Some years none at all. That’s been consistent for years. \n\nThere’s a stigma against men teaching early education for whatever reason. It’s pretty unfair. \nIf you’ve ever been around those classes kids want lots of hugs, sitting in laps for story time….Nurturing etc. it’s just maybe awkward for men to be in that role and many don’t want it. \n\nbut I think men CHOOSE to not go into that field and focus on middle and upper grades as it’s easier to navigate",
            "score": 34,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hungry-Technology335",
                    "body": ">kids want lots of hugs, sitting in laps for story time….Nurturing etc. it’s just maybe awkward for men to be in that role and many don’t want it. \n\nThese actions are not inherently more awkward for men. The only thing awkward about it is other people making sexist judgments.",
                    "score": 25,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lasagnaman",
                            "body": "i.e. social conditioning",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "nikdahl",
                            "body": "If we are being honest with ourselves, the sexual judgments usually come from women.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Henfrid",
                    "body": "> I think men CHOOSE to not go into that field and\n\nYes, but you missed the reason. It's not that men simply find older students easier, its that there will literally be accusations of pedophilia if a man tries to become a early education teacher.",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "supercali-2021",
                            "body": "I had several male grade school teachers back in the 70s. They were all excellent except for the one I mentioned above. Although i never let him touch me and to my knowledge he was never accused of anything, it was quite clear to my friends and I that he was a perv.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Roughneck16",
                            "body": "Everyone's ignoring the elephant in the room: in a society where men's ability to find a mate depend largely on his earning power, men have a strong incentive to study for a high-paying career field. When people ask why I studied engineering, I tell them \"I'm not handsome enough to not have money.\" I'm only half-joking.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Maximum_joy",
                                    "body": "Can confirm, am handsome, don't try real hard because of it",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Roughneck16",
                                            "body": "Lucky you!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DexterCutie",
                    "body": "Wanting hugs and sitting in laps reminds me of my 6th grade teacher who was male. He was such an awesome teacher and kids always wanted hugs. Every month, he'd pick 3 or 4 kids to take out for pizza and bowling and then to spend the night at his house. It was a real privilege and something we all looked forward to. Damn would it be so inappropriate now.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "supercali-2021",
                            "body": "Hmmmm....it was inappropriate back then too. I wonder if we had the same 6th grade teacher? Except his overtures creeped most of my classmates out. None of us girls wanted to sit on his lap for hugs. He'd also invite us over to his house to swim in the pool. Even at age 10 I knew there was something wrong with that guy and made it a point to stay far far away. That was one class where I did not want to be \"the favorite\".",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DexterCutie",
                                    "body": "Everyone definitely loved this teacher. His name was Mr Shine lol. The other 6th grade teachers at that school did the same thing. This was in 1983.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "NemoTheElf",
            "body": "I am a male elementary school teacher, and the amount of \\*insinuations\\* of how I'm a creep or a predator for wanting to teach kids is a major hurdle in my career. It's also the main reason why I am not out as a gay man to everyone at work, because the risk of a parent complaining to my higher ups is very real.\n\nPoint being, many more men would go into teaching if there weren't so many social stigmas and prejudices directed at men. Men can be nurturing and affectionate too; just look at any loving husband, father, older brother, uncle, or grandparent. The only different is that men can be affectionate to children within their families, and even then that has its limits for some reason.\n\nSo no, chalking it all up to \"social conditioning\" while a massive strawman, still kind of makes sense.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Past-Bite1416",
                    "body": "It is no ones business your sexual orientation.    I am sure not interested in my kindergarten child knowing any adults sexual orientation unless it mirrors what they see at home.   They are too young at 6 to be in a position to think rationally about things like that.",
                    "score": -8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zeratul98",
                            "body": "Honest to God, why are you like this? The commenter was pretty clearly primarily talking about colleagues",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Past-Bite1416",
                                    "body": "I understand...my acct at work is gay. My brother is gay and is an engineer.  That does not matter and it does not matter if that person is gay or not, it has nothing to do with that.   Are you good at your job and are you able to properly fulfill your task with the best results.",
                                    "score": -5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "NemoTheElf",
                            "body": "I wear a wedding ring. I keep pictures of my SO on my desk. I get questions about both all the time.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "rnason",
                            "body": "Would you get mad if your child's teacher ( who I assume is a woman) mentioned her husband?",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rnason",
                                    "body": "u/Past-Bite1416 why did you delete your response about how straight people are okay because of biology?\n\nedit: LMAO of course he rewrote it since he was called out on it",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Past-Bite1416",
                                    "body": "No that is how a child comes into the world, DNA from a mother and DNA from a father.  With all mammals, it is biology.  However, sexual orientation does not have to be brought up in that at all, it is understood by the child who their parents are.  They seem to know who their father and mother are, and that they are their parents and know what the difference between the two are.\n\n   Ther first question asked by a 5 year old is why don't you have a wife ect, then sexual orientation comes to the forefront.   The answer is that that person is homosexual, or gay, lesbian what ever they want to answer and that brings up a ton questions that a 5-6 year old does not need to consider, nor do their parents need to educate a 65 month old child on, there is plenty of time to let them know.   The need to consider running, jumping, napping, counting, colors ect.   That is not appropriate for that age child.    And what good does that information do for a 5 year old except confusion because they cannot understand lust (except for sugary substances), intimacy sexual desire ect, unless they have been abused.   And that is never acceptable. \n\nAnd before you start with the homophobe crap, by brother is gay and I accept his lifestyle and love him and his family.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "Man elementary school must really suck if you have social conservative parents. \n\nI’m just thinking about the joy my daughter got when her fourth grade teacher got married that year. Getting to work on the group project making a gift basket for her and getting to hang out with middle school kids that came back to celebrate their former teacher wedding. \n\nOr when my son got to do something similar when his fifth grade teacher’s wife gave birth and current, and former students put together a book of dad jokes for him so he would be prepared for fatherhood. \n\nSocial conservatives really do seem to treat their children like they are morons. Imagine thinking that a five year-old can’t understand the concept of marriage and dating and can’t comprehend things like the existence of gay people.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "rnason",
                                                    "body": "They think so little of their own children",
                                                    "score": 2
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Past-Bite1416",
                                                    "body": "That is 4th grade...they are 10  5th grade they are 11, and yes dad jokes are cool.  many have watched their mom have a sibling.\n\n  \n5 year olds cannot understand a lot of things...i have 5 kids.  yes, 5 year olds should not have to worry about dating, or sexual relationships...isn't that fair?   How is it treating them like morons...even hyper liberal Hollywood has a rating system for their movies.   Have you ever been to an r rated movie?  Or a PG-13.  or that an elementary school library does not have Penthouse Magazine.    What is the problem in having the parent teach that stuff when the parent thinks it is acceptable.   My kids know my brother is gay, they found out when we could fully explain it to them.  He seemed fine with that.   Till then they just thought he was a close friend.   Just like why saying the N-word is wrong 100% of the time when they realized that skin color was actually a determinate of race, and that racism is real before they understand the concept.   \n\nOnly is hyper-sexual households would a 5year old really begin to understand what gay sex is and how does that help anyone.    How children do not come from that, and that it is not how procreation comes to be.   They understand that mommy has a brother or sister in their tummy and it came from mommy and daddy.  What is wrong with that.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ButGravityAlwaysWins",
                                                            "body": "So I think this is filled with a lot of the ideas social conservatives have about how sexuality gets discussed in school and how that dramatically diverges from reality. To the point that I’ve started to wonder if the big issue is that social conservatives are much less engaged than other parents in their children’s education.\n\nSo they default to thinking about these issues the way they think about them, disgust and insanity.\n\nThat sick person at LibsOfTikTok found one objectionable book at a few schools and that means porn is given to kindergartners. \n\nApparently, you think that your kids at five years old could not mentally process that while most people marry or love someone of the opposite sex some people don’t. With that for them to understand that they have to have detailed explanations of anal sex or fisting or something?\n\nBecause I got to tell you, at five years old, my kids understood the basics of both homosexual and heterosexual couples, but did not have an understanding of penis goes in vagina or anything like that. But they did get basic sex ed when they were five, mostly concentrating on the fact that they have private parts and only certain people were able to see and touch those areas. \n\nAnd that’s what really bothers me. Social conservatives are setting up a world in which proper sex ed cannot be taught to small children, and the only people who benefit from that are actual pedophiles.",
                                                            "score": 3
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "iglidante",
                                                            "body": "Why do you keep talking about gay sex? \n\nKids learn about people \"liking someone\" and being in love, hugs, kisses, cuddles - not sex. That's all a 5yo would be exposed to.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "rnason",
                                                                    "body": "Conservatives continue to be obsessed with gay sex",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "iglidante",
                                                                            "body": "Like, I don't even get where it is coming from at this point.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "rnason",
                                            "body": "Does he know you would consider mentioning his husband when children were around inappropriate?",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "24_Elsinore",
            "body": ">Do you really think social conditioning is the only reason for differences between the sexes?\n\nI never have, but that isn't really what liberalism cares about. The fundamental position is that just because one sex or the other is inherently different than the other doesn't mean the sexes need to be legally compelled into certain social roles, which is what social conservatism desires.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hungry-Technology335",
                    "body": ">sexes need to be legally compelled into certain social roles, which is what social conservatism desires.\n\nWhat are some mainstream examples of this?",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "24_Elsinore",
                            "body": "The only mainstream example of this I'd argue is that it is a hidden part of conservative efforts to stymie trans individuals from getting the medical care they need. Sure, the mainstream argument against it is that kids aren't mature enough to make those sorts of life-changing decisions, but there are many other structural ways of making sure kids get the right treatment for their mental health issues. The only reason anyone would go straight to banning trans care is from the fundamental belief that people can't be trans, which is based on the belief that men and women exist for different required roles.\n\nGetting not into the mainstream, I remember (long ago) reading an essay by Rick Santorum where he thinks that voting should be limited to married males as they are the head of the \"smallest political unit.\"",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "I'm not aware that conservatives believe this, is this a quote or something? I'm not sure I've heard that. I've only heard that men and women have natural aptitudes, that they are \"yin and yang\". I'm not sure I've heard that there should be legal compulsion.",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tidaltown",
                            "body": ">legal compulsion\n\nBecause that would be pretty Unconstitutional in our current system. However, strong social, community, religious, etc. pressures/compulsions absolutely occur in a lot of places in the U.S. (and around the world). \n\nI'll even give you an example that's not about boys vs. girls but a generational example: there was no *legal* compulsion for people in my generation to go to college, but when I was growing up, the vast majority consensus and push from our parents' generation was, \"Go to college or else you'll be poor and a failure and end up flipping burgers for the rest of your life, is that what you want?\" And what happened? My generation went to college (and a lot of my peers are still up to their eyeballs in student loan debt to this day as a result).",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "24_Elsinore",
                            "body": "Not all conservatives believe this, which is why I referred to the general belief system of social conservatism, which more or less believes the government needs to enforce the \"natural order\" of things.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "Corkscrewwillow",
                            "body": "It's been used as an excuse to uphold or not make changes that deal with systemic sexism.  \n\n\nSee the whole career of Phyllis Schlafly.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RandomGuy92x",
                                    "body": ">It's been used as an excuse to uphold or not make changes that deal with systemic sexism.  \n\nI do agree that misogyny is still a massive issue. But at least legally speaking I can't think of any laws aside from anti-abortion laws that discriminate against women.\n\nThere has to be societal change and toxic male culture has to be addressed. But I don't really see what politicians can do aside from ensuring access to abortion. \n\nIs there any other area aside from abortion where women are legally discriminated against?",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Corkscrewwillow",
                                            "body": "Politicians can do things like: \n\n\nequitable funding for healthcare research \n \nupholding Title IX and X (access to birth control) \n\n\npreventing repeal of the ACA with its protections against preexisting conditions, which used to included pregnancy and c-sections \n\n\nFund childcare programs \n\n\nChanging statutes of limitations for abuse victims \n\n\nProtecting the Violence Against Women Act \n\n\nExtended post natal care for mothers on Medicaid \n\n\nQuit trying to defund Planned Parenthood, which provides all kinds of healthcare other than abortion \n\n\nProtect LGBTQ+ rights \n\n\nEnforce laws against pregnancy discrimination  \n\n\nExpand red flag laws that remove guns from domestic abusers\n\n\nAll that and more. It's not all about abortion, and many issues that primarily affect women also affect men. \n\n\nIf people think the only thing politicians can and do affect is abortion policy for women, than it is no wonder we are in the state we are in.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "evil_rabbit",
            "body": ">Liberals have this idea that men and women are only the way they are because of social conditioning.  \nBut when you look at certain statistics like the fact that 96.7% of Kindergarten teachers are women, that really makes me wonder.\n\nwhy? saying that 96.7% of kindergarten teachers are women tells us nothing about why that is. it could be 100% social conditioning or 100% biology or a mix of both.\n\n>Was my 4 year old niece socially conditioned into liking dolls and pretty things, along with most other little girls?\n\nyes, absolutely. have you ever seen toy ads?\n\n>I don't know, I think this argument that sex differences are purely the result of social conditioning is one of the weaker liberal arguments.\n\ni don't think that *all* sex differences are *only* the result of social conditioning and i don't know a lot of other lefties who think that either. but i do believe that social conditioning plays a huge role in those differences. a lot more than conservatives seem to think.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": ">yes, absolutely. have you ever seen toy ads?\n\nIsn't she equally exposed to toys for boys? Or at least exposed to ads for toys for boys in a meaningful way?",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ewi_Ewi",
                            "body": "> Isn't she equally exposed to toys for boys?\n\nIs she a boy?\n\nIf not, then she isn't being targeted by those ads and therefore is being socially conditioned in the other way (\"these toys aren't for you\").",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "No, but she is likely to at least view some ads for toys for boys, and especially if they go to a toy store. I also know from my sister in law that she was given plenty of exposure to boy toys (via her brother) and shows little interest in them, and vice versa.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ewi_Ewi",
                                            "body": "> but she is likely to at least view some ads for toys for boys, and especially if they go to a toy store\n\nBeing exposed to toys for boys and being *advertised* toys for boys are two different things.\n\nShe isn't being advertised to. She's just seeing that they exist.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "Right, but did you read the rest of my comment? She has a younger brother and is usually surrounded by toys for boys and has even tried playing with them; she doesn't seem interested.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ewi_Ewi",
                                                            "body": "Again, exposure to and advertised to are two different things.\n\nToy preferences are absolutely social conditioning. That is why *exposure* isn't doing much and being advertised \"toys for girls\" does.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "willpower069",
                                                                    "body": "It’s funny how little they understand anything people are bringing up and they refuse to be clear when asked questions.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "evil_rabbit",
                            "body": "equally? probably not. if she watches tv shows \"for girls\", she'll probably mostly see ads for \"girl toys\". and online ads are likely even more targeted based on gender.\n\nbut that's not really the point. even if she was equally exposed to boy toy ads, those ads still make it clear that those toys are *for boys*. if you're a girl and you're seeing an ad for a doll, where all the kids shown in the ad are girls, the background is pink, and \"for girls!\" is written in sparkly letters next to the toy name ... that socially conditions you to think that \"that's what girls like me are supposed to play with\".\n\nand it also socially conditions your parents into buying you those toys, instead of some \"action figure\", which is obviously completely different from a doll, and meant for boys.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "She has a younger brother and has been exposed to toys for boys frequently. They are often mixed in with her own toys. And her parents have actually tried to get her to try playing with boy toys, and she isn't interested. I guess social conditioning includes aversion to toys for boys?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "evil_rabbit",
                                            "body": ">I guess social conditioning includes aversion to toys for boys?\n\nyou can call it aversion or just a feeling of \"that isn't for me\". just like a lot of boys wouldn't want to play with dolls because \"that's girly\".\n\nor maybe it's not aversion, but simply disinterest. there are a lot of social forces working to get girls interested in dolls and ponies. the same isn't true for monster trucks and dinosaurs.\n\n>And her parents have actually tried to get her to try playing with boy toys,\n\nwhat we want to play with and be like is probably a lot more influenced by the media and by people our age than by our parents.\n\nwhat's your opinion here? do you really think girls have a special gene that makes them love horses?",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Maximum_joy",
                                                    "body": "In my experience it's hard to get people on the right to grok that their objective social values basically come from the TV, a lot of other things will unravel if that becomes true in their mind",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "iglidante",
                                                            "body": "It's like, they just can't question what feels right to them. \n\nWhereas me, I've been struggling to fit into the world for 40 years - and it's clear to me that NOTHING is automatic and natural in the way they insist EVERYTHING is.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "fastolfe00",
                                            "body": ">I guess social conditioning includes aversion to toys for boys?\n\nYoung children easily pick up on social conformity cues. Girls generally know that they're girls. When they see (in real life or ads) other girls being interested in a certain kind of toy, and boys being interested in a different kind of toy, they're going to seek social validation and conformity. This is a very basic psychological and sociological instinct. Children go on to enforce this by teasing each other (or worse) when people don't conform.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "I tend towards occam's razor in general: the explanations with the least assumptions is probably correct.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "fastolfe00",
                                                            "body": "Psychology and sociology are fields of study, not assumptions. \n\nYou might as well be saying, \"Plate tectonics are complicated. The idea that God did it is simple. Therefore, Occam's Razor says that God did it.\"",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HelpfulJello5361",
                                                                    "body": "That's not what we're talking about though, right? In your comment, you describe a fairly complex sequence of events to explain something which has an alternate, much more straightforward explanation which is intuitive (not religious).",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "fastolfe00",
                                                                            "body": "That children pick up on social conformity cues is an observable fact.\n\nThat children tease each other when they don't conform is an observable fact. \n\nThat children seek social conformity is an observable fact. \n\nThis isn't some complex sequence of assumptions here. If you want some alternate hypothesis to explain what's going on, your explanation needs to explain away these data points. That's going to add some complexity to something you think is simple.",
                                                                            "score": 4
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "rnason",
                                            "body": "How much younger is her brother?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "Lots of jobs are coded by gender. We have very strong social traditions around the idea that jobs for women are “mommy jobs“. Education and nurturing and caregiving.\n\nWe also have lots of social traditions around the idea that regardless of any other factors, men are supposed to be the primary breadwinner and women are supposed to be secondary breadwinners. And so jobs that are coded for women pay less and women are the default for hiring and jobs that pay more are coded male And the default hiring practice is to select men.\n\nAnd as feminist have been pointing out since forever, this is part of toxic masculinity and patriarchy. We have strong social stigma around men doing jobs that put them in proximity to children. Because men are not supposed to do childcare, even if it’s for their own children. So the only kind of man who would want to be around young children is assumed to be a pedophile .",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "\"awww, it's so nice to see a man babysitting!\"\n\n\n\"Babysitting? These are my kids! I'm not babysitting! I'm parenting!\"",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "Oh my fucking God that used to infuriate me.\n\nMy wife and I are blessed with pretty flexible schedules. When my kids were young, I used to start work ridiculously early and she would handle drop off and then I would pick up the kids. And a lot of time that meant I would go to the park with them with some of their friends. it just so happened most of the time it was the fathers going to the park with us and not the mothers. \n\nThe amount of stupid comments or weird looks we would get from women, most of whom seem to be stay at home moms, really pissed us off.\n\nMine are also old enough that I caught the tail end of men’s bathrooms not always having a changing table. Thankfully that’s mostly over.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tonydiethelm",
                                    "body": "Yes! Always moms at the park! argh!\n\n\nI finally work up the gumption to go talk to the mom group as the only guy there... ",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "How old are your kids? I have found that there is an extent to which the stay at home mom versus two working parent divide never ends.\n\nLike I’m friendly enough with some of those moms but you don’t develop the same closeness that you do with the others.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "tonydiethelm",
                                                    "body": "5 and 8 come July.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ButGravityAlwaysWins",
                                                            "body": "12 and 13 and the divide hasn’t ended. My friends with older kids tell me they think it never does.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lucille12121",
                    "body": "“mommy jobs“\n\nIt's worth noting that the job of mommy is completely unpaid.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Certainly-Not-A-Bot",
            "body": ">Is there a problem with Early Education engaging in systemic discrimination against men?\n\nYes. Men who want to teach children are often accused of being pedophiles.\n\n>Same with nursing, which is 88% women, according to that same article. Another profession that has to do with nurturing/caring/people-centric. This one doesn't have to do with children but the similarities are clear. Does the Nursing profession systemically discriminate against men too?\n\nYeah, there probably is some discrimination against men in nursing. The bigger issue is that for a long time, nursing and education were seen as women's jobs and it takes a long time for society to change from that view. Men don't become nurses or teachers of young children because men can't imagine themselves doing those jobs. There's also the problem of those jobs being paid pretty badly, which is also a result of discrimination against women.\n\n>Was my 4 year old niece socially conditioned into liking dolls and pretty things, along with most other little girls? I'm not sure about that. I mean the least we can say is that the social conditioning doesn't take long at all, and this conditioning is very powerful because girls and boys seem to gravitate to these gendered things, despite only a short time of conditioning.\n\nYep, this is bang on.\n\nLet me ask you, when your niece got her first toys, did she pick what they were or did her parents pick what they were? That's how the conditioning starts.\n\nThe experiment thing sounds very suspect to me. The metric they're measuring seems fraught with potential issues, and psychology research in general is not very trustworthy because of the severe replicability problem in the psychology field.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">Liberals have this idea that men and women are only the way they are because of social conditioning.\n\nNo, we don't.\n\nThat is a caricature of our views, used as a strawman by people who seek to discredit us.",
            "score": 32,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "Can you expand on your view regarding this topic? Why are so many women in nursing and early childhood education roles?",
                    "score": -10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IndWrist2",
                            "body": "Why aren’t there many men in those roles? That’s going to be more revelatory than why there’s an over representation of women.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "I disagree, and this is a fundamental difference in left and right, I guess. When you see a field that's dominated by one sex, you think \"why are men driven away from this?\" but I think that's a bit silly. The \"occam's razor\" explanation is that there's something about being female which draws more women to it.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "IndWrist2",
                                            "body": "Pre-Nightengale, nursing roles were fulfilled by stewards, who were almost exclusively male. Post-Nightengale, nursing was portrayed as a feminine occupation. This is still evident in countries where senior nurses are referred to as matrons. In nursing, it’s entirely a social construct.",
                                            "score": 18,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "Agree to disagree.",
                                                    "score": -15,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TheOneFreeEngineer",
                                                            "body": "Do you dispute the historical claims presented? What part are you disagreeing with?",
                                                            "score": 15,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "willpower069",
                                                                    "body": "You will be waiting for a long time for that answer.",
                                                                    "score": 4
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "IndWrist2",
                                                            "body": "It was an occupation dominated by men, and now it’s not. Did inherent qualities of the sexes change or did society change?",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HelpfulJello5361",
                                                                    "body": "Do you have a list of differences between the \"Nightengale\" era stewards and modern nursing? In what ways are they different?",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ChickenInASuit",
                                                                            "body": "They were men, not women. They otherwise did the exact same job.",
                                                                            "score": 6
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TheOneFreeEngineer",
                                            "body": ">The \"occam's razor\" explanation is that there's something about being female which draws more women to it.\n\nWhat? How is that occams razor? That's just a base complex assumption, not the simplest answer often being the best. Your statement has just as much simplicity as his and would fit just as well into an occams razor idea",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "By that logic, when you look at any field which doesn't have equilateral and proportional representation for each minority group in the country, you have to list each minority group and think of an explanation for why each individual group feels deterred from that profession/field/hobby/etc/whatever.\n\n\"Oh, hm, I see that Pacific Islanders, Slovenians, Germans, Italians, Native Americans, and Mongolians are all under-represented relative to the share of the general population in the Magic the Gathering community. Why could this be?\"",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TheOneFreeEngineer",
                                                            "body": "That doesnt follow what I said at all. But I don't see why that seems to be a problem for you. There is a well documented history of exculsion in things as mundane as hobbies. If you never look for evidence of an issue, you will never find an issue even if it exists.",
                                                            "score": 6
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Hungry-Technology335",
                                            "body": "When I told people that I, a man, wanted to teach young children I was drawn away from it particularly because of the reactions from both men and women when I told them. Men are absolutely being driven away from teaching young kids.",
                                            "score": 4
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Poorly-Drawn-Beagle",
                                            "body": "But you don’t necessarily get the job you’re “drawn to,” you get the job your circumstances enable you to. ",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "s_ox",
            "body": "Societal conditioning does play a factor. Even though it is not the only factor.\n\nYou should check out this article:\n\nhttps://www.npr.org/sections/money/2014/10/21/357629765/when-women-stopped-coding\n\nWomen used to work in larger percentage in computer programming. It changed in the mid 80's specifically because of societal conditioning.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "The programming argument is not a good one in my opinion because programming has changed to an extreme degree since that era, to the point where it doesn't really resemble modern programming at all. It's also important to note that Mathematics is a male-dominated field. I think the mindset required to excel in mathematics is similar to programming.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "s_ox",
                            "body": "It is actually a perfect example in my opinion. Especially because the data comes from a senior researcher (Jane Margolis) from UCLA. With data, it's not just an opinion, it's a well informed one.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "Are you not compelled by the Mathematics argument?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "s_ox",
                                            "body": "I am not. Because in different countries around the world, the percentage of women in mathematics in university is very different. So it is culture dependent. \n\nWhy are you not convinced by my argument about computer programming? \n\nYou have said nothing to refute the article's data and it's conclusions.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "I see. As I said earlier, programming has changed massively with the advent of personal computers to the point where it does not resemble the old-school NASA programmers in any way, shape, or form. As we see in the data you provided, women in computer science starts to plummet right around 1985, which is when the Macintosh personal computer came out which really completely revolutionized what a computer was and what it could do.\n\nAs is often the case, in your article we see the fundamental difference between the left and right worldview:\n\n>This idea that computers are for boys became a narrative.\n\nThe liberal idea is that this \"narrative\" was completely arbitrary; it was invented out of wholecloth for no particular reason. For some reason it was decided that they just wanted to market computer \"culture\" to boys. Like, they flipped a coin and it just happened to end up on heads.\n\nWhat makes a lot more sense is that boys showed a strong preference as a group for this new form of computing for whatever reason, and thus the \"narrative\" was aimed at them. It's just simple marketing.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "s_ox",
                                                            "body": "I see. What makes sense to you doesn't make it true based on the data.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HelpfulJello5361",
                                                                    "body": "I guess you don't find my explanation compelling, but thanks for the discourse anyway",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "s_ox",
                                                                            "body": "No I didn't. You didn't address my point about mathematics enrollment rates in different countries being different from the US. If it was nature only, we would expect rates of enrollment across different countries to be similar. But it varies widely. (I'm only considering countries where there is little or no gender based discrimination in access to university education).\n\nhttps://www.europeanwomeninmaths.org/gregorio-presutti/\n\nThe problem here is that it is easy to express personal opinions about these kind of things. It takes time and effort to find data to refute your personal opinions. I have show you the data. You have just said something that \"makes sense\" (to you).\n\nI don't want to spend any more time than necessary on this.",
                                                                            "score": 6
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheOneFreeEngineer",
                            "body": ">It's also important to note that Mathematics is a male-dominated field. I think the mindset required to excel in mathematics is similar to programming.\n\nThe profession which computers get their name from was also dominated by women mathematicians. Before the computer was a physical object, it was a person, normally a woman who was paid to crunch numbers all day. From that programmers developed as \"computers\" were replaced by \"computers\" they were then tasked with programming the computers instead of doing the math themselves. Their proficiency in math is why programmers were dominated women to start off in the first place. So that doesn't seem like a reasonable explanation at all.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Maximum_joy",
            "body": "Well I can tell you I applied to be a daycare teacher and was told \"we're not hiring men,\" so",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "Holy fucking shit, did you sue them? That would be an open and shut case. If you didn't, and you have it in writing that they explicitly told you they wouldn't hire you because of your sex, that's the easiest case of a violation of the 1964 civil rights act that I have ever heard.\n\nI strongly recommend you get a lawyer and sue them if you have it in writing that they literally said they would not hire you because of your sex. I'm completely serious.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Maximum_joy",
                            "body": "\"you can't sue everyone, Peter\"",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "Well, in this case, you sure as hell can. No employer in their sane mind would tell a potential hire they were being denied because of an inalienable trait. That's suicidal.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Maximum_joy",
                                            "body": "Friend, I'm trying real hard to be polite with you; no doctor would recommend treatment nor would any lawyer recommend litigation based on an Internet comment and the fact that you're incredulously doing so tells me you are not really serious at all. \n\nNot every man can sue every business that violates their rights. Believe me, I work in HR - also like 90% female",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "funnystor",
                                                    "body": "> nor would any lawyer recommend litigation based on an Internet comment\n\nI think you misunderstand, they're not telling you to talk to a lawyer, then ignore the lawyer's advice not to sue and sue anyway by yourself without the lawyer.\n\nThey're saying that if you talk a lawyer, the lawyer would likely support suing because \"we don't hire men\" is an obvious violation of labor law (at least if you had solid evidence, e.g. getting that in writing, otherwise it's just \"he said she said\")",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Maximum_joy",
                                                            "body": "lol",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "funnystor",
                                                                    "body": "Straight from the US Equal Employment Opportunity Commission government website:\n\n> EEOC enforces two **laws that protect you from sex discrimination** at work (**including when you apply for a job**):\n\n> **Title VII of the Civil Rights Act prohibits an employer from treating you differently, or less favorably, because of your sex**, which is defined to include pregnancy, sexual orientation, and gender identity. This law also prohibits employment decisions based on stereotypes (unfair or untrue beliefs) about abilities and traits associated with gender. In addition, Title VII prohibits employment discrimination based on gender identity or sexual orientation. These protections apply even if state or local laws take a different position. Everyone, regardless of gender, is protected from sex discrimination under Title VII.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Maximum_joy",
                                                                            "body": "Well shucks with this I don't even need a lawyer",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "funnystor",
                                                                                    "body": "I mean if you don't *want* equal rights, no one can force you to claim them.\n\nThe law protects you from assault but it doesn't stop you from hitting yourself if that's what you really like doing.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Maximum_joy",
                                                                                            "body": "You and OP are both missing the forest for the trees. \n\nNot everyone has the resources or time to get a lawyer, and when you act like I just was unaware of my rights instead of unwilling to shoulder the burden, it makes it hard to take you seriously. \n\nI love my rights, but your comments make me like them less.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "funnystor",
                                                                                                    "body": "What resources? Pro-bono lawyers exist, and if they think there's a fat lawsuit many lawyers will move ahead with the case at no initial charge, and only take a percentage of the payout if you win.\n\nAn employer straight up admitting they break federal labor law by saying \"we don't hire men/women\" is the kind of slam dunk case lawyers salivate over.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Maximum_joy",
                                                                                                            "body": "aaaaaand here we go, now it's \"why didn't you report the rape to the sheriff immediately, the office across town is open 24 hrs\"",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "funnystor",
                                                                                                                    "body": "Jesus, nobody is saying you have to sue. All we're saying is, it's a clear violation of federal law, and there are resources to help you if you want.\n\nNo need to shoot the messenger.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Maximum_joy",
                                                                                                                            "body": " 11 comments ago I said, \"you can't sue everyone, Peter\"\n\nYou don't get to be the messenger when you don't pay attention to context and you don't get to play victim when you replied to my comment in the first place. \n\nYou can't even apologize, can you?",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "funnystor",
                                                                                                                                    "body": "Apologize for saying a violation of federal law is a violation of federal law? Lol.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Maximum_joy",
                                                                                                                                            "body": "Of course you can't apologize, because that would require empathy.\n\nNext time you want to be the messenger, actually have a message, lol\n\nEdit: and because you are you you will need to say something trite to have the last word. Will you play victim further? Take refuge in the supposed truth value of your statement in the absence of relevance or use?",
                                                                                                                                            "score": 0,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "funnystor",
                                                                                                                                                    "body": "How I see the conversation:\n\nYou: \"I was blatantly discriminated against\". This part certainly deserves empathy.\n\nOP: \"wow that seems blatantly illegal, did you consider legal action?\"\n\nYou: \"Woah get a load of this idiot on Reddit, thinking legal action is an option, as if a real lawyer would ever agree!\" This part makes you lose empathy and just look like an asshole.",
                                                                                                                                                    "score": 1
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        },
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Maximum_joy",
                                                                                                                                            "body": "In case it's unclear, yeah, it would be polite to apologize for saying something that obvious 🙂\n\nEdit: HA I can tell this one was spot on because you didn't try to argue your way out of it. Here's my response to the comment you did try to argue before you blocked me: \n___\nSo to be clear, you are going to double down on an argument rather than walk away or be polite. Just to confirm.\n\nYou're missing the first part of the conversation, which was OP stating: \"social conditioning seems like a weak reason,\" to which my first comment was a response.\n\nA response not about something blatant (a lawyer would tell you to fuck right off with the adverbs if you're really trying to be helpful) but about a social condition with which I had anecdotal, relevant, experience. \n\nAnd this is why I bring up the doctor, the lawyer, the sheriff: I did not give enough details for you or anyone else to say this case is a slam dunk, or what. You don't know if I was told this in the 70s, the 90s, or yesterday. \n\nYou and OP are missing the point when you immediately jump to \"you should sue,\" and now I have to have a conversation with you and my priest about statutes of limitations, conveniently sidestepping the point about social stuff.\n\nGood work; I look like an asshole to you because you're looking into a black mirror.\n__",
                                                                                                                                            "score": 0
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lemp_Triscuit11",
            "body": "> Do you really think social conditioning is the only reason for differences between the sexes?\n\n\nSocial conditioning isn't why I have higher muscle density or penises than my girlfriend (still just the one penis).\n\n\nIt is almost certainly the difference between who is conditioned to *feel comfortable* around children and who *parents feel their children being comfortable around*.",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "Aurabelle17",
                    "body": "Exactly it blows my mind a bit trying to use one of the most well-known unfair prejudices against men as some sort of liberal gotcha. Like.. yeah it's a serious problem; men who show even a slight interest in raising the next generation are thought of as pedo creepers. Acting like that's some sort of biological inevitability is gross and insulting to all men. Yeah, there are almost no male early childhood educators. Your stupid rigid \"biologically mandated\" societal shame and judgment have scared away most who would even consider it an option. \n\nWay to take a serious men's issue and throw it under the bus to try and score cheap points on \"muh liberuls\" because of course no man would be interested in raising and teaching children right?? That's a woman's job!",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "letusnottalkfalsely",
                            "body": "Thank you! Well said.\n\nAnd it’s additionally heartbreaking that these same rules discourage men from forming close bonds with their own children, and discourage boys and girls from forming close bonds with their fathers.\n\nThen we wonder why men say they feel lonely all the time.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Waryur",
                            "body": ">Way to take a serious men's issue and throw it under the bus to try and score cheap points on \"muh liberuls\"\n\nMen's rights activists in one sentence. r/menslib is where the good'ns hang out. r/mensrights is a hive of scum and villainy.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "You only have one!?\n\n\n*Pat Pat* poor fellow...",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ChickenInASuit",
                            "body": "*DoubleDickDude?!* Is that you?!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Late_Cow_1008",
            "body": "Why is this asked on this subreddit? Lmao... Typical MAGA fighting with windmills.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "Single issue 'immigration' voter talks about how scary non-traditional gender roles are....",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "Can  you quote the part where I said I'm afraid of non-traditional gender roles?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tonydiethelm",
                            "body": "Are you? \n\n\nQuote or no quote, kinda seems like you are...\n\n\nBy the way, that's a shit argument. You should avoid making it. It might work when talking to conservatives, but we just see that it's useless.",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FizzyBeverage",
            "body": "My daughter has a male 1st grade teacher, my older daughter had him too. He's amazing. Like a local legend, and this is a fairly small suburb in Ohio. Super funny, patient, nurturing, warm 6'4\" gay guy. He's absolutely incredible with those kids.\n\nThere's a stigma, but like with male nurses, it's undeserved.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "lucille12121",
            "body": "Someone in the comments will inevitably make the argument that women are to blame for their lower earning power, because they veer into lower paid professions by choice. I'm going to counter that up front and propose the reverse is true: \n\nWe define a job as requiring more skill and being more valuable as soon as men enter that field. One perfect example is [computer programming](https://www.nytimes.com/2019/02/13/magazine/women-coding-computer-programming.html). When initially done by women, it was just administrative work. When men took it on, they're \"rockstars\" and paid six-figures. \n\nIt's worth noting that in some school districts, junior high and high school teachers earn more than elementary teachers in the same district. Coincidentally, I'm sure, there are more male teachers junior high and high school.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "Programming has changed very dramatically over the years. Someone else shared an article earlier talking about how in 1985, when the Macintosh personal computer came out, women in computer science plummeted. Maybe there's a connection?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lucille12121",
                            "body": "I'd be interested in reading that. Link?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Beard_fleas",
            "body": "“Do you really think social conditioning is the only reason for differences between the sexes?”\n\nWhy are you assuming that this is the view of liberals?",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "What is the view of the majority of liberals on this topic, and what information convinced you that this is the case?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Beard_fleas",
                            "body": "That a combination of genetics and social conditioning are responsible for differences between men and women. This has been the standard view of all social science since the discovery of genetics. ",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "Euphoric_Bid6857",
                            "body": "To add the other comment, the best science can do is to say it’s a combination. You can’t (practically or ethically) raise a child in the absence of social conditioning. You can make small changes in a controlled environment, like showing kids pictures of possible careers either matching their gender or with typical gender coding and seeing if it changes how they answer questions about what they want to be when they grow up, but you can’t learn how much it matters overall. \n\nAn experiment like that is overcoming the conditioning they’ve received, so what if they’d never been exposed to gendered expectations? Would additional representation of female engineers or male nurses have greater impact each time or diminishing returns? \n\nThat’s before you get into what pieces of social conditioning and inherent differences, and their combinations, are having what affect. Are women not becoming engineers because they think they’re bad at it? Driven out by toxic company culture? Male-dominated fields are less receptive to working mothers? Do men think they’d be bad kindergarten teachers? They’d be looked down on? Never even consider it as an option? \n\nWhile the gender breakdown in careers would likely not be 50-50 even in the absence of any gendered expectations, we don’t know what the baseline is. All we know is that social/cultural effects are currently shifting us away from that unknowable baseline an unknown amount.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "> Liberals have this idea that men and women are only the way they are because of social conditioning.\n\nYou just couldn’t resist, could you?\n\nBut yes, I would imagine the men who might be interested in teaching kindergarten are somewhat put off by the fact that they might not have any male colleagues in the industry (that and the piss-poor pay) \n\n>Is the idea that women don't have a natural aptitude with children\n\nId go as far as to say there is no “natural” aptitude for children. Skill with children is something you absolutely have to learn by experience. ",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Corkscrewwillow",
            "body": "I'm an RN and there is a ton of sexism in nursing. \n\n\nMen have to deal with sexist stereotypes (they are all LGBTQ, there can be  expectations they should do the heavy lifting and deal with aggressive patients, they are asked if they are \"failed\" doctors). \n\n\nFor women, all other things being equal, we make 5 grand less a year than men on average. That's from an older study in JAMA.\n\n\nNone of these things is inherent.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "ziptasker",
            "body": ">Liberals have this idea that men and women are only the way they are because of social conditioning.\n\nCan you justify that statement?  Because I don't believe it's true.\n\nWhat's true is, liberals don't generally care why people are the way they are.  Because it doesn't matter.  We just want to clear the way so everyone can be themselves.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "thebigmanhastherock",
            "body": "In my community there were two male Kindergarten teachers, one retired. They are both very highly regarded and great at their jobs, like it was their calling. \n\nI'll just now mention the elephant in the room. Men are much more likely to be sex offenders and pedophiles. People are more aware of this now and the topic is more ever present. Men are not going into fields like this because they don't want to be seen as \"creepy\" people are not hiring men for these positions because they are afraid the guy they are hiring will do something horrible. \n\nhttps://pubmed.ncbi.nlm.nih.gov/1556756/\n\nThis is a sad state of affairs I think. Hopefully society finds a better balance but this is how I see this happening. \n\nIt's still a very low chance that any many involved as a Kindergarten teacher is a pedophile, but no one wants to be responsible for hiring someone that might do that and no one wants people to see them as such.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "I get that argument, but there's still the problem of the nursing profession (and other similar female-dominated fields). They don't have this same prejudice.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thebigmanhastherock",
                            "body": "But male Nurses have grown over the last decade. The amount of male elementary school teachers has decreased. \n\nhttps://www.nursejournal.org/articles/male-nurse-statistics/\n\nhttps://www.educationnext.org/missing-misters-worrying-decline-in-share-of-male-teachers/",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">Why are 96.7% of Kindergarten teachers women?\n\nBecause 3.3% are not.\n\n>Is the idea that women don't have a natural aptitude with children...?\n\nWait...what about the 3.3%? Are you claiming that they are inferior kindergarten teachers? What evidence do you have for that?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "If I had to guess, I would say they are particularly feminine men, which is fine.",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Poorly-Drawn-Beagle",
                            "body": "If we found you a male kindergarten teacher who fulfilled your (ahem) standards for masculinity, would you have to revise this hypothesis? ",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "No, that would be a fallacy. I mean, would you use this logic in other contexts? One masculine kindergarten teacher doesn't mean I suddenly no longer find it interesting that only 3% of kindergarten teachers are men, and most of those men are feminine (which, again, is totally and completely fine).",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Poorly-Drawn-Beagle",
                                            "body": "In fact you haven’t demonstrated that the men working as kindergarten teachers are feminine (whatever you mean by that). You said it was a possible explanation for why men would teach kindergarten, but never offered evidence it was true ",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "It is a logical inference that in a field overwhelmingly dominated by women, in which the nature of the work requires working with children (pleasant nature, soft and delicate mannerisms, etc), it is a logical inference that the small number of men doing these jobs would have feminine traits. I believe that is the case until otherwise proven. You're free to disagree with my logical inference. I don't care, to be clear - I don't think it's a problem, I just think it makes sense.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Poorly-Drawn-Beagle",
                                                            "body": "> It is a logical inference \n\n Okay, but it’s not something you’ve demonstrated. An inference rooted in logical processes is not necessarily a fact. Theories are meant to spring from facts, not “facts” made to suit theories ",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HelpfulJello5361",
                                                                    "body": "Do you agree or disagree that being a kindergarten teacher requires interacting with children in a stereotypically \"feminine\" manner? Speaking softly, smiling often, having a particular cadence, being nurturing, caring, using particular words, etc?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Poorly-Drawn-Beagle",
                                                                            "body": "I don’t even agree that speaking softly and smiling are inherently feminine mannerisms  \n\n And the only reason you do is, ironically, because that’s what you’re socialized to expect ",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "HelpfulJello5361",
                                                                                    "body": "So speaking softly, smiling, speaking in a particular cadence, the whole \"kindergarten teacher\" style, is not feminine? Even though over 96% of the people who use this teaching style are women?",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Poorly-Drawn-Beagle",
                                                                                            "body": "Dude, that’s just how people talk to kids. That’s how dads talk to kids. Soft voices are meant to sound comforting. Smiles are meant to seem welcoming. \n\nConservatives must have like a really low opinion of men if they don’t think the basics of body language would naturally occur to them ",
                                                                                            "score": 6,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "HelpfulJello5361",
                                                                                                    "body": "If you don't think there's anything feminine about the way kindergarten teachers interact with kids, I don't see us having a constructive discussion. But thanks for the discourse",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "polkemans",
                                                                                                            "body": "I think the issue is that you see these things as inherently feminine. I think you make that leap because you see it more in women. So it must be a trait inherent to femininity. But that's not necessarily so and many people don't agree that something is inherently feminine just because women do it more.    \n  \nMost people, male or female, tend to interact with kids the same way. You see it more in women, because they have more interaction with kids in general. That doesn't make things like \"speaking softly\" and \"smiling\" feminine traits in a vacuum.",
                                                                                                            "score": 4
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DavidKetamine",
                            "body": "I think it's wild that we can doubt social pressures can dissuade men from becoming teachers but in the same thread guess that male teachers are noticably less masculine than other men. I'm not saying you're a bigot or anything but we're actually doing the thing right now. We're making teaching a \"girl job\" by viewing men who teach as more feminine.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "I think it's safe to infer that in a field which is child-centric and 96% female, the remaining tiny percentage of men in that field are likely to be more feminine, which is completely and totally fine and I have no problem with it whatsoever. In the same sense, I imagine that the 1-2% of female ironworkers are likely to have more masculine traits compared to other women, which is equally okay.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DavidKetamine",
                                            "body": "I'm not really sure how you would even measure that but even if that assumption were true it kind of misses the point. I think many men take the implication that they're less than masculine as an insult and that's a pretty strong example of how social views can dissuade people from pursuing certain professions. It's strange to me that you can both hold the view that teaching is an inherently feminine job and also doubt how holding that view can impact what kind of people wind up filling that job.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CharredPepperoni",
                            "body": "Dude. I am a kindergarten special education teacher. I am bald and have a beard. \n\nYour assessment of this concept is flat wrong. Teachers choose their credentials in college. Most male teachers I have met prefer to teach single subjects in middle school. \n\nYou are just making things up.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "tonydiethelm",
                            "body": "Sweet baby Cthulhu...",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "1. Are most women kindergarten teachers? Yes\n2. Is it therefore logical to infer that being a kindergarten teacher requires feminine traits? Such as being gentle and speaking in a soft and delicate way which is appealing to children? Yes - we know this already, you just have to watch a kindergarten teacher work to understand the \"feminine\" nature of the work.\n3. Is it therefore logical to infer that the small number of men working as kindergarten teachers also use this kind of teaching method (which is feminine)? Yes\n4. Is it therefore logical to infer that the small number of men working as kindergarten teachers are feminine? Yes\n\nWithout a good reason to doubt the logical sequence I've just laid out, I see no reason to abandon it.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lemp_Triscuit11",
                                            "body": "Holy hell lmao",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "Instead of saying random exclamations, can you maybe explain why what I'm saying is strange to you?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Lemp_Triscuit11",
                                                            "body": "I tried once, you didn't respond lol. But what's keeping me for making once of these says that, you know, by your logic Asian children are just inherently better at and indeed *made* for sweatshop work assembling smartphones? Lol",
                                                            "score": 4
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "tonydiethelm",
                                            "body": "That is horse pockey, pulled from your own imagination, not reality. \n\n\nPeople are telling you exactly what's going on. \n\n\nYou don't care.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "I think it makes complete sense to assume that the small number of kindergarten men are more feminine given the logical sequence I just laid out. If you disagree, I guess we just have a very different way of thinking about things.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tonydiethelm",
                                                            "body": "There's the wày you think about things... \n\n\nAnd there's reality. \n\n\nFunny thing about reality, it doesn't matter what people think about it, it just is. ",
                                                            "score": 4
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "willpower069",
                            "body": "Why would that be?",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "In a field which is 96% female, it makes sense that the tiny percentage of men in that field are likely to have feminine traits. The same is likely true for male-dominated fields with tiny percentages of female workers, like oil rigs, iron workers, etc. They're probably a bit masculine for women, that's fine. Takes all kinds.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "willpower069",
                                            "body": "Why would it make sense though?",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelpfulJello5361",
                                                    "body": "If you don't inherently understand why, I don't imagine an explanation would change your mind.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "willpower069",
                                                            "body": "I am just struggling to understand how a man being a teacher means they would be feminine.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HelpfulJello5361",
                                                                    "body": "Would you agree or disagree that early childhood educators have a particular way about them? Mannerisms, body language, speaking cadence, word choice, etc?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "willpower069",
                                                                            "body": "I would disagree, I had quite a wide variety of teachers growing up and then on into high school and college.\n\nSo why would a man being a teacher mean feminine?",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "HelpfulJello5361",
                                                                                    "body": "For early childhood educators specifically, they behave in a particular way which is meant to appeal to children. I don't think any honest person would disagree with that.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "willpower069",
                                                                                            "body": "You gotta stop beating around the bush.\n\nI don’t share your experience and I had male teachers.",
                                                                                            "score": 6
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "not_a_flying_toy_",
            "body": "typically speaking, from a young age, men and women get pushed into different career fields. Education was often an attractive field for mothers because it meant they would be off work at the same days and times as their kids. Because more women pursued early education in the past, it creates the notion that its a women's field, and more women than men pursue it. \n\nAnecdotally there still seems to be a notion that a man who wants to spend time with little kids is kinda weird.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": ">Do you really think social conditioning is the only reason for differences between the sexes? \n\n\nYou started this with occupations, not differences between sexes. Don't change the subject halfway through. \n\n\nThere are obvious differences. Testosterone is a helluva thing. \n\n\nBut occupation wise? Unless a job requires lots of strength, and very few do now, we have these things called \"machines\"... \n\n\n>Do you really think social conditioning is the only reason for differences between the sexes? \n\n\n**YEESS!**\n\n\nMale nurses are stronger, more able to lift and maneuver a patient. The skills needed to be a nurse aren't gender dependant. \n\n\nBut nursing was one of the only good professional jobs women could have for a loooooooong time. \n\n\nAnd here comes you, asking why women dominate nursing? \n\n\nCome the flying @#$& on man... Can you *really* not see how a century+ of women dominating a field might not leave a weeeeee bit of social conditioning around who enters that field? \n\n\nReally? \n\n\n*Really?*",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Naos210",
            "body": ">Was my 4 year old niece socially conditioned into liking dolls and pretty things \n\n\nTo some extent. You don't really think about it but we are socially given our gender roles basically from birth. You put your boy in masculine colors, clothes and hairstyles to emphasize they're a boy. A similar thing is done with girls. \n\n\nYou'd put a 2 year old girl in a dress even before they can express the desire to do so, but you wouldn't do the same with a boy.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "mentallyshrill91",
            "body": "Child development professional here (bachelors in it and pending masters degree). There are no inherent skills women posses which make them better at caregiving, nor are there natural detriments for men who wish to pursue caregiving. What makes a good caregiver is someone who is patient, responsive, and connected - all of which are personality traits you can find in all genders and can also be learned in all genders. It is also notable to children require a lot of diversity in their caregivers to help them develop socially and emotionally - so not only is there no reason for men to avoid caregiving, it is actively positive when they do engage with it! \n\nThe current disparity in childcare and education professions is because of social conditioning to see women as inherently gifted with providing care services and men as inherently unable to provide them - and this starts young. Before the age of 7 children have unparalleled neural growth and the patterns for the rest of their life are formed. Sexism is insidious and can be introduced nonchalantly, such as encouraging girls to only play with dolls or telling a young boy not to cry or hug his friends These interactions form the framework for the child’s sense of self, and if they are reinforced by other messages such as 1) only witnessing women providing care in the form of mothers, teachers, nurses, babysitters, etc, 2) only witnessing anger or stoic displays from important male figures, 3) consuming media where parenthood or caregiving is portrayed as a woman’s job, or 4) receiving interactions where the emotional male self is stunted in favor of aggression or bullying tactics — then their “social script” has been written and their brain will create pathways accordingly. Many women feel expected to seek out such careers or bringing caregiving into other places, and many men feel as though they cannot care for children because they have not been given the social and emotional tools to do so. These subconscious early associations show up as “gut feelings” and impulses or reactions against anything other than the social norm. It is why people feel weird about men working with children. \n\nWith all that in mind, it is unsurprising to me that men are shamed, chased out, and discouraged from taking on kindergarten lead teaching positions. Sexism demands that men live apart from children because it is “woman’s work”, and a society which follows a sexist standard react unkindly when they see anyone -  man, woman, or child - going against it.\n\nan edit: it is also important to consider that many roles and careers branded as “women’s work” are historically underpaid and overworked, as well as the professionals in those places receiving a lot of abuse and stress. Many times you will find men in administrative positions such as principal, director, or lead counselor while the women occupy the teachers, caregivers, and social workers of these places - more work for less money. It is a structure which harkens back to the time of indentured servant nannies and wives who couldn’t vote, further demonizing men who wish to take an active role in the caregiving profession while also devaluing the role of women who already work there.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "HelpfulJello5361",
                    "body": "Would you say that early childhood educators behave in a particular way when they teach children? Body language, mannerisms, speaking cadence, etc?",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mentallyshrill91",
                            "body": "There are absolutely behaviors and choices which we in the field refer to as “best practice” because they have been linked by science to better outcomes for young children and they are not naturally known to any gender. I feel as though you are gearing up to say that speaking calmly, in a measured voice level, using sing-song cadence, and exaggerated facial expressions is a “feminine” trait, and you are categorically incorrect. These are not feminine traits but are instead linked to the amount of language and communication developmental levels that young children are capable of. Likewise with the need for cuddles and co-regulation - being kind and attentive to children is not a feminine trait but is instead a deliberate action which has been crafted due to the social and emotional developmental needs of young children. All genders are capable of this and it is not inherent to anyone specifically. \n\nIn fact, handling and guiding young children is a legitimate professional skill set which requires masters degrees for entry-level positions in many “developed” countries. Dismissing caregiving as being “natural” to women is not only sexist but incredibly insulting to the scientific merit of the study of child development. There are decade of literature and studies based on how children learn and grow and being able to work with them successfully is a complicated and outstanding professional skill.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HelpfulJello5361",
                                    "body": "> not naturally known to any gender\n\nI think it's fairly obtuse to believe this. Over 96% of kindergarten teachers are women, and they all behave this way with children. You're saying it's because they've been trained? See below.\n\n>In fact, handling and guiding young children is a legitimate professional skill set which requires masters degrees for entry-level positions in many “developed” countries\n\nBut don't most mothers in the world not have this education? And especially historically.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mentallyshrill91",
                                            "body": "Can you please specify how repeating the statistic you posted before refutes any of the numerous developmental science points I made? It just feels as though you are trying desperately to work backwards and find expected answers in a field you know nothing about. The 96 percent is simply an observation of who makes up that field currently - any sort of value statement or casual assumption you’re making is founded in your own bias. \n\nI have clearly explained the developmental path which might make women more accepted and expected in these places, as well as offered specific terms and facts surrounding best practice. You have offered nothing but shallow insults and are demonstrating an inability to engage critically with the subject matter in favor of meaningless “gotcha” points which have no teeth. \n\nSome things to consider, because now I am concerned that you do not have even the base knowledge to discuss this subject efficiently: \n\n1) are you aware that preschool, pre-k, and kindergarten are all vastly different programs, with the latter requiring at least a bachelors degree to run in the US? Would you not agree that a degree in education counts as training? \n2) are you aware that child abuse and neglect is most likely to happen at the hands of parents/primary caregivers, and that this usually stems from the parent being overwhelmed and unaware of child developmental science? Are you not able to conceptualize that many people have been abused by their mothers - do you deny their experience simply because you believe women are better are caregiving? \n\nLastly: I have 12+ years as a teacher, 2 years consulting, leadership promotions, and a bachelors degree Manga Cum Laude in the field of child development. I am not here to trade insults and meaningless anecdotes with someone who can’t bat in my league. If you can’t answer the questions I have asked or equally and intelligently counter all the numerous points I have made I will not be continuing this conversation. Yikes.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Past-Bite1416",
                                                    "body": "I am a dude and I don't know a dude that would be good as a kindergarten teacher.  I would assume that pedos would love to be in that position because they would be able to groom kids.  They look for these types of positions.  Even the most super liberal person must agree it is an open door to abuse large numbers of kids at impressionable ages.     \n\nI have coached football for 20 plus years, hundreds and hundreds of boys, none talk about little kids unless it is an sibling...never coached a kid that would make a good kindergarten teacher,  they could be good middle and high school teachers, but not kindergarten.  \n\nCoached girls softball for years as well.   All they talk about is wanting to have kids and a large number of them want to go into early child development.  \n\nI have 5 kids, and I would be very wary of a dude that would want to hang with 5 year old kids all day.  Personally, I would tell the boys to toughen up if the started crying, not how they should act, and if a girl started crying my heart would melt.  My personality.   Women, like my wife, are better at that stuff.  Just how they are wired. \n\nNursing is a little different.  My mom has been the hospital 5 times in the past year.  Male nurses are great, except with the delicate stuff (catheters...needles) where they tend to be rougher as a general rule.   But their core strength and leverage for being taller and wider and heavier helps.",
                                                    "score": -1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "vincethered",
            "body": ">Liberals have this idea that men and women are only the way they are because of social conditioning...\n\n>I don't know, I think this argument that sex differences are purely the result of social conditioning is one of the weaker liberal arguments.\n\nWho really says that in the “Nature Vs Nurture” question it is 100% nurture and 0% nature? Really, who? I don’t think that is a prevailing opinion at all and I don’t share it.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "We’re taught that it’s a women’s job. This simultaneously removes barriers for women pursuing that role and installs barriers for men.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ReneMagritte98",
            "body": "They really should change the name of nursing so that it doesn’t sound like literal breast feeding.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PsychicOtter",
            "body": "I mean, when I was younger this was specifically the age range I wanted to teach, and I was specifically told that it isn't something boys (or eventually men) do. So for this specific instance, I highly doubt it's entirely innate.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "MelonElbows",
            "body": "Conservatives are really really invested in inherent differences in order to justify treating people a certain way, aren't they?\n\nBecause that's what the unspoken thing in your post is.  If you somehow prove there's inherent differences, then you don't need to respect anyone who steps out of line.  You can enforce some kind of social hierarchy based on how people are born.\n\nYour post makes some flawed assumptions but the biggest one is this: \" I think this argument that sex differences are purely the result of social conditioning is one of the weaker liberal arguments.\"\n\nNobody, but NOBODY, says this, at all, ever.  Everything is always on a scale between extremes.  No human in history is the way they are *solely* because of the gender they were born.  But no human in history is also *only* the result of their gender.  Each person is different, and for each person different things affect different parts of their behavior, or affects them at a different severity, or at different times of their life, or all of those, or some of those.  There is no easy black and white answer for anything.\n\nOut of the 96.7% of women who are kindergarten teachers, some of them wanted to be one at a very early age.  Some of them were pushed into it, or settled for it.  Some of them choose it temporarily.  Some love it, some hate it.  And you can say the exact same thing for the 3.3% of men who are kindergarten teachers too.  Why does it affect one gender more than others?  All the reasons above and more. \n\nI think claiming differences in kindergarten teacher genders are purely the result of inherent characteristics is one of the weaker conservative arguments.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "conn_r2112",
            "body": ">Why are 96.7% of Kindergarten teachers women?\n\nI imagine because more women prefer to do that job than men do",
            "score": 2
        },
        {
            "depth": 0,
            "author": "HaveCamera_WillShoot",
            "body": "People really can't get their heads around how powerful social conditioning is.\n\nYou can see cultures today where the women go around topless every day, but that kind of behavior is unfathomable to 99% of everyone who lives in a city, for example. \n\nWomen have been killed for their hair being visible in public due to social conditioning. Heck, parents have murdered their children for bringing shame on them due to social conditioning. The list is literally endless as to how powerful a simple thing like social conditioning is. If you are down to learn some stuff about this, I cannot recommend [Philosophy Tube's newest video](https://www.youtube.com/watch?v=QVilpxowsUQ) highly enough.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "tbtc-7777",
            "body": "Look, I want toddlers in day care to be looked after by mostly women, and I want soldiers and law enforcement to be mostly men. But I'm still a liberal Democrat, because I want fair wages and working conditions for both groups of workers. I want them to do their jobs in places with sound environmental laws. I want those people to do be able to be hired and do their jobs regardless of racial or ethnic background.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Past-Bite1416",
                    "body": "well said.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "AwkLemon",
            "body": "More than likely because of social tradition. There was a story a long time ago talking about child trafficers using women to targeting men at the park with children because everyone jumps in to help save the woman. I think there's just a social stigma against men with children. Trying to make this political is pathetic because this is bipartisan.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Weirdyxxy",
            "body": ">Is the idea that women don't have a natural aptitude with children despite being the sex that carries and gives birth to children and has the ability to feed children with their female organs?\n\nThose are not the organs I'd expect a Kindergarden teacher to use for work",
            "score": 1
        },
        {
            "depth": 0,
            "author": "moonflower311",
            "body": "My kiddo had a male kindergarten teacher!  An openly gay one at that!  He was young, really smart and one of the more structured teachers (though I wouldn’t go as far as to say strict).  He was a great teacher and my daughter loved having him,\n\nIn terms of your other question I’ve thought about this a lot. I have an autistic daughter and even though she’s female she’s not looking at the face longer (or maybe at all) no matter how old she is.  I’m not autistic but probably neurodivergent and a math major.  My mom also preferred the sciences.  My guess is that some brains are more object/fact oriented and some are people oriented.  Probably evolutionary wise due to cultural pressure women who were more people oriented were “picked” more to be mothers in the past.  So there may be a lingering after effect genetically there.  However object oriented women (as a cs minor this made me chuckle a little) do exist and I am guessing will increase over time as more scientists are seen as worthy and valuable women to marry and start a family with.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Past-Bite1416",
                    "body": "> An openly gay one at that!\n\n\n\nSo this is the second time that someone here  mentioned that the \"great\" kindergarten teacher is gay.  So is that what makes them a good kindergarten teacher, sexual preference?  Is that something that you think is important in the education of your child or is whether or not there is a conducive learning environment.  If he was straight would that matter, or if the teacher was Asian, or Turkish.   What if he was Jewish?  (Horrors to some)  I don't understand why sexual orientation is an issue unless you think that is the reason he can teach kindergarten. that is even an issue. \n\nAnd why is that anyone's business if he is gay or not.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "moonflower311",
                            "body": "It’s not.  The subtext is that we are in TX and I thought others would knock the teacher for being gay but they didn’t.  My husband had a gay elementary teacher growing up but he was closeted so it’s more about being impressed that someone was comfortable enough taking a job where they are that much of a minority but also being open about all aspects of themselves in a place that may be hostile to it.\n\nI apologize if I said something offensive.  My kids have had all teachers of all genders and sexualities and I agree there’s no correlation between quality and who you like to kiss.  Kids are now 12 and 17 and both LGBTQ+ (one queer, non binary) and I was probably being a little over exuberant in my allyship there and I apologize for that!",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Guilty_Plankton_4626",
            "body": "I’m sure part of it is most women lean left and most men lean right, the rights demonization of education and teachers themselves probably has an effect.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "boofcakin171",
            "body": "This Seems like an odd statistic to have at the ready unless you are directly involved educational pedagogy. There are likely many reasons for this gender dispersion in kindergarten educators, none of which undermine feminist movements or are arguments against human rights for transgender individuals. If OP is concerned there are too few male kindergarten teachers he could go get a masters degree and help shift the demographics.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sliccricc83",
            "body": "It's purely social. If you go to Russia all the doctors are women because of intentional USSR policy to introduce women into the workforce without disrupting existing labor markets. Some societies have men doing more educational labor than western societies typically do. Occupational stratification is relative to the socialization process of a given society",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kineth",
            "body": "I would assume that part of it is cause of the stigma of a man being around young children.  It might also play into the nurturing aspect of the gender roles too.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lucianbelew",
            "body": ">Liberals have this idea that men and women are only the way they are because of social conditioning.\n\nCitation needed.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jansadin",
            "body": "Wasn't there studies done that showed sex differences in toy preferences in other apes? It's both obviously both genes + env. And the case rests with the individual with how open they are to environmental influences",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Quantizeverything",
            "body": "I didn't go into education because of the threat of being accused of sexual misconduct because I'm a man.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheSheetSlinger",
            "body": "> Liberals have this idea that men and women are only the way they are because of social conditioning.\n\nI can't speak for everyone but the wording choice I take issue with here is \"only.\" Certainly social conditioning reinforces and teaches gender roles but there are biological parts of it too. \n\n> Is the idea that women don't have a natural aptitude with children despite being the sex that carries and gives birth to children and has the ability to feed children with their female organs?\n\nYou're close. Because of those biological features. Early childhood education is often seen as an extension of mothering. And because of those biological features, motherly behaviors and instincts are often encouraged as girls age AKA reinforced. \n\n> Is there a problem with Early Education engaging in systemic discrimination against men? Seems unlikely.\n\nWhy does it seem unlikely? There's quite a lot of writings out there talking about the double edged sword men deal with working in ECE either being tokenized or looked at with suspicion of their motivations because it doesn't fit within the traditional box thay society expects men to fit into[^1](http://www.inquiriesjournal.com/articles/1708/walking-gendered-lines-the-contradictory-expectations-of-men-who-work-in-early-childhood-education)\n\n> Does the Nursing profession systemically discriminate against men too?\n\nAgain there's quite a lot of writings, studies, etc also out there discussing the challenges men face in this female dominated industry too ranging from tokenization to being perceived as a sexual threat. \n\n> Was my 4 year old niece socially conditioned into liking dolls and pretty things, along with most other little girls?... social conditioning doesn't take long at all, and this conditioning is very powerful because girls and boys seem to gravitate to these gendered things, despite only a short time of conditioning.\n\nThis is moving more into early childhood development. Some of it is innate and some of it is social conditioning. As a wise man once said. \"A little bit of column A and a little bit of column B\"\n\nTo summarize I guess. It's not nature OR nurture when it comes to what makes use the way we are but nature AND nurture. A boy might naturally gravitate towards mechanically interesting toys, this interest is also reinforced socially when friends family and parents only buy them toys geared towards traditionally boyish interests. Women might have a natural maternal instinct AND men who would otherwise be interested in ECE are discouraged through questioning of their motivations for working in such a field.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "afinto",
            "body": "The gender codes around different jobs also change throughout history, often based on either stereotypical gender traits of the time or perceived value of the work.\nA few mentioned coding, where most of the pre-computer coding work was done by women until computers could be used as an alternative.\nSecretarial work was similar, with secretaries and clerks being a job for educated men until the start of the 20th century. The advent of the typewriter (which meant women could be taught typewriting skills without needing a full college education), and the world wars requiring women to fill in roles previously held by men, changed the role to a predominantly female one.\n\nNursing was not always so female dominated. Throughout history, nurses were primarily men (often priests). In some cases it would be separated by gender, with female nurses for women. The wars in the 1800s (incl Crimean war and Florence Nightingale) and world wars also played a big role in changing the gender disparity in nursing, to the point where men were prohibited in enrolling as nurses in the army nursing core in the early 1900. Same in the UK, men became banned from becoming NHS nurses in 1919, to focus on manual labour and war effort.\nIt's only in the second half of the 20th century that male nurses were recognised again and that it was illegal to ban men from nursing school.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueCollarBeagle",
            "body": "Because males and females are different.   Did you not know this?\n\n&#x200B;\n\n>Liberals have this idea that men and women are only the way they are because of social conditioning.\n\nThat's emotion, not science.  Those liberals are incorrect and you are acting in bad faith assuming that all or even the majority of liberals hold this point of view.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Leucippus1",
            "body": "My wife an I bring our daughter to a private day care that whose clientele is mainly very well to do families. I noticed it, and so did my parents and in laws - the majority of dropper offers and picker uppers were the dads. Dad's driving Land Rovers, but it was the men. That shouldn't be unusual, but it is. \n\nI had a thought, why not staff the day care with majority men? Men can certainly look after small children for 8 hours a day, they trust us with critical care patients (if you are licensed for it), we can change a mean diaper, we can comfort a child, and kids generally like us. I had to drop the thought because I realized no one would send their kid to a daycare staffed only by men. We aren't *there* yet. \n\nNow, on the point about saying social conditioning is a weak argument, it is only weak because people are ignorant. The fact is, controlled properly for biases and repeating them, we find very few cognitive differences between the sexes. in other words, a 'female' brain is just a human brain attached to a female body. Yes, there are different hormones, but that doesn't seem to fundamentally change the way we view the world. We, simultaneously find it very challenging to see out of our culture for anything. Like, look at all of this talk about 'grooming', kids in ancient cultures were around sex and nudity all the damn time. Have you ever been to a classical museum in Europe? There are erect phalluses all over the place! That was their culture, we would find that abhorrent but that only informs us as to how oppressive a culture truly is. It has the power to *entirely* shape your perspective. \n\nYes, your niece was socially conditioned to like girl centric dolls. Boys like boy centric dolls, they are both dolls but because of our social conditioning we can't actually call the boy's toy a doll, it must be an *action figure*. Similarly, the term for the thing you put on in the morning to make you smell good is called a perfume, for men and women. Our culture demands we call it a cologne, even though colognes are also for both men and women. That may seem like a trivial example, but it is part of a much larger ecosystem. You don't think your niece is being socially conditioned because you don't perceive that you are doing that, but how did the dolls end up in her possession? It is almost like there is an entire industry designed to sell toys to girls. Say you manage to raise a girl to 4 without falling into that trap, then they spend a few hours with grandma who promptly buys them a bunch of pink stuff and tells them explicitly this is what girls want/like. You are assuming that these kids are organically separating themselves and their interests, that is a convenient perspective is it not? It absolves us, the adults, of any responsibility in it and we can just say \"see, this is what they *naturally* like and who are we to question it?\" That doesn't mean it is inherently wrong for a girl to like a doll in a pink dress, I am saying it is awfully convenient of us to develop a *just so* explanation while scoffing at the idea this is all essentially manufactured. \n\nSocial conditioning is 24/7/365 situation, it is happening all the time, by all the people, by all the media, you can't get away from it. That isn't an insult, it is just a reality. A lot of us seem to have the thought that we can reason our way out of that, that we aren't truly conditioned, that we are *independent* thinkers. That is just your smart brain doing some ego-protecting behavior. We really aren't, and even the smart among us are socially conditioned.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "merp_mcderp9459",
            "body": "1. Being a teacher pays like shit, so you need a spouse that’s going to be in a high-paying field (which means your spouse is likely a man, so you’re either a straight woman or a gay dude) \n\n2. As you mentioned, theres a degree of social conditioning that goes into career choice. When a profession is almost exclusively women or men, the other gender will have a harder time imagining pursuing it. \n\n3. There’s probably a degree of sex selection as well. But it’s pretty tough (especially when culture is semi-globalized) to separate social conditioning relating to gender from one’s actual biology",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ManufacturerThis7741",
            "body": "Because any man who expresses an interest in working with children is assumed to be a pedophile",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tall_Panda03",
            "body": "They don’t care. Discrimination against men is fine. Or it’s their fault.",
            "score": -7
        }
    ]
}