{
    "title": "Donald Trump publicly posted a new campaign ad referencing the creation of a \"unified Reich\" if he is reelected, directly echoing Nazi Germany. What are your thoughts on this?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nLink to story:\n\n* https://www.cnn.com/2024/05/21/politics/trump-unified-reich-video/index.html \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pablos4pandas",
            "body": "Looks like it was copy/pasted from a wikipedia page about WW1 https://www.newsweek.com/donald-trump-unified-reich-truth-social-wikipedia-ww1-1903068\n\n90% chance stupid campaign intern saw a relatively high quality meme and reposted it without seeing Reich, 10% chance Nazi intern saw Reich and thought it was funny and posted it until their boss told them to pull the mask up and delete it",
            "score": 57,
            "replies": [
                {
                    "depth": 1,
                    "author": "StockWagen",
                    "body": "This begs the question why is their intern stumbling across Nazi memes? I think the simple answer is there is a lot of Nazi/Trump memes that cohabitate together in certain corners of the rightwing internet.",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Eyruaad",
                            "body": "Trump may or may not be a nazi, but I sure can say the nazis think Trump is their ally and it seems like quite a few end up really close to him...",
                            "score": 23,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SullaFelix78",
                                    "body": "> Trump may or may not be a nazi, but I sure can say the nazis think Trump is their ally and it seems like quite a few end up really close to him...\n\nHe may not be a Nazi himself, but he is conspicuously doing nothing to disabuse them of the notion that he is their ally because it wins him votes, and I’d argue that’s just as bad.",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "mosslung416",
                            "body": "It’s not necessarily a nazi meme, it was made using the copy and pasted texts from the ww1 wiki article which includes the words reich several times, probably a.i",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "StockWagen",
                                    "body": "I understand what you are saying but in my mind it’s still a pretty loud dog whistle. I don’t really give his campaign the benefit of the doubt due to his campaign’s history of flirting with white supremacists.",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "okletstrythisagain",
                    "body": "You know, before we suffered through 7 years of non-stop constitutional crisis, this would have been enough to agree that Trump can't hire competent staff and for that reason shouldn't be president.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "That’s a good and charitable explanation and I have no problem with it.\n\nThe real problem is that this keeps happening over and over and over again. Like if I accumulate similar instances across every Republican presidential campaign from Ronald Reagan to the president, do I even come close to how often this happens with Trump?\n\nAt a certain point, you have to stop caring about whether or not this is a reflection of Trump himself or the people around him or is inability to actually run anything",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pablos4pandas",
                            "body": "> The real problem is that this keeps happening over and over and over again\n\nI agree. There are tons of references to atrocious stuff over the close to a decade he's been in the presidential spotlight. I would say it's less bad to delete the post in shame and say you didn't mean it compared to leaving it up and saying \"hell yeah we meant that\". Both are bad but I think the second is a good amount worse",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "throwaway8u3sH0",
                    "body": "This is the correct analysis. But also, Trump actually wants to be a dictator, independent of this gaffe.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sweens90",
                            "body": "Agreed, this isn’t the smoking gun that you can show to your conservative friends and be like see he wants to be a dictator!\n\nEven as someone who believes he wants to be just based on historical comments and tendencies. Or even that there is the risk of it I think this is pretty weak and the media attention it garners I think benefits Trump more because its so easy to say it was a mess up by an intern and was an odd catch and bad QA/QC",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "pablos4pandas",
                            "body": ">  Trump actually wants to be a dictator, independent of this gaffe.\n\nProbably, but he doesn't usually do the whole \"Folks, we need Lebensraum. International Judeo-Bolshevism threatens the future of white children\"",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "othelloinc",
                                    "body": "> Probably, but he doesn't usually do the whole \"Folks, we need Lebensraum. International Judeo-Bolshevism threatens the future of white children\"\n\nOf course not, he does the whole 'Folks, our country is over-crowded, so we need to get rid of these immigrants from shithole countries; it is the only way to stop the cultural Marxists from threatening the future of real Americans.'",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pablos4pandas",
                                            "body": "So then he doesn't use Reich, which was the point",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "> realm : empire : kingdom\n\n• Reich \n\nA unified reich would be a kingdom with high levels of unity. Possibly from deporting immigrants and crushing Marxists",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Call_Me_Clark",
                                    "body": "Let me try and sell it:\n\n\"Folks, folks let me tell you, we need Lebensraum. The biggest, most beautiful Lebensraum. International Judeo-Bolshevism threatens the future of white children. People are telling me every day, those cosmopolitans are trampling the volk, that’s what I’m hearing. Terrible hotel, gaudy, not like mine. They’ve got no roots, folks, not like the people here tonight. Aren’t you terrific, give yourselves a hand. But I’m here for the children, the beautiful blond little children. Would you call it a master race? I don’t know, I’m hearing it. People are saying it. They say Donald, there the best. The most beautiful. They have the most beautiful brains. The biggest brains. And that’s why we’re going to win, folks.”\n\nBlech ",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "L4ckzi3",
                                            "body": "Folks, that was one of, if not the most tremendous impressions I’ve seen on this subreddit. And I’ve seen a lot of impressions, my uncle was a professor of impressions, very genius.",
                                            "score": 4
                                        },
                                        {
                                            "depth": 4,
                                            "author": "BrawndoTTM",
                                            "body": "Impossible to read this not in his voice",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "G8BigCongrats7_30",
                    "body": "One time is by accident. Stuff like this has become too common with people associated with Trump. Time to stop giving them the benefit of the doubt.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Call_Me_Clark",
                    "body": "It’s both incredibly stupid and a little underwhelming. Like, obviously this is a lazy intern, or a malicious intern pretending to be lazy. ",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "iamiamwhoami",
                    "body": "They do it in purpose. \"Accidentally\" referencing Nazi imagery and slogans as happened too many times. For one there's a section of their base that legitimately likes stuff like this and it's a little wink to them that the Trump campaign is on their side. Second every time it happens there's the predictable outrage and since the Trump campaign always maintains an element of plausible deniability they can say it was an accident, leading to their other supporters to complain that Trump is just being treated unfairly by the media again. Last Trump legitimately looks up to dictators like this, and making these references desensitizes people to these comparisons.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "memeticengineering",
                    "body": "I'd understand the first explanation if this was the first or the second or third time this has happened, but some background detail of Trump ads has been explicitly Nazi esque every few months for the past 9 years. He's obviously employing at least one person whose job is basically to leave Easter eggs for fascists in his speeches, ads, and content.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "behindmyscreen",
                    "body": "Minimizing Trump winning. Like 2016 didn’t teach people not to fuck around with Trump getting elected.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">Donald Trump publicly posted a new campaign ad referencing the creation of a \"unified Reich\" if he is reelected, directly echoing Nazi Germany. What are your thoughts on this?\n\nI'm starting to think that this Trump fella isn't a good guy.",
            "score": 65,
            "replies": [
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "I know, right? \n\n\nI mean, we should probably still give him the benefit of the doubt. I'm pretty sure he's all white, I mean, an all right guy.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dangleicious13",
            "body": "What do you think our thoughts are?",
            "score": 12
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "My thought is that they did this on purpose to get free news coverage of the ad.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "earf123",
            "body": "I think this will play out exactly like every other troubling statement or message Trump and any other figure who is, at the least, nodding twords the alt-right has had. \n\nPeople on the left will point yet another example of this rhetoric out and think, \"certainly this one will be the one that crossed the line!\", conservatives won't care and pretend like there's plausible deniability, and centrists will continue to sit in their thumbs and go \"iTS boTh SiDEs!\". \n\nThere is nothing Trump can say or do, other than going against the alt-right populist grain, that will change the minds of conservatives and radical centrists. I think we're way beyond the point of questionable messaging poisoning his brand. \n\nThe only hope to really dissuade some of the centrists from voting for him is if he gets convicted for a fairly straightforward offense and serves some sort of sentence. Campaign finance violations won't be enough since people have made it clear that they don't care about that when it comes to Trump. Extortion won't be enough because \"he didn't literally say quid pro quo\" was enough to dismiss it in the past as a \"sham\" trial. \n\nCampaign wise, our only hope is to sell Biden more. Unfortunately, many people have nothing to say beyond bashing Trump and anyone who doesn't vote against him. We've had 7 years of bashing Trump, and we're in what's looking like another close election. If that strategy worked, it would have by now.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "velocitrumptor",
                    "body": "This is spot on. Trump and Biden are both known quantities. Nothing surprising will come from either one. I don't think a conviction will hurt his election chances though. He'll get to claim he's a martyr and that will help him, if anything.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "earf123",
                            "body": "It's my understanding that some experts believe it will turn some centrists and moderate Rs away from him. At the end of the day, it doesn't matter because charging Trump isn't something a plotical campaign can accomplish. The time for democrats to make sure the right people for the job are in offices and positions of power is long past \n\nRight now, all they can do is send messages to voters and enact policy. Policy wise, it should be clear as day the the current iteration of the republican party isn't responsible enough to govern, but low info voters and non-voters don't follow that. \n\nMessaging wise, I don't think most liberals and the DNC have been doing a very good job of building inroads with dissatisfied constituents and encouraging people to vote for Biden. They seem to have forgotten that a large plurality of Americans don't vote and simply yelling at them over and over again, \"this guy's sucks!\" doesn't mean their guy gets votes. It just means fewer people will vote, which benefits conservatives.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sadistmon",
                    "body": "It's what happens when you cry wolf 50 million times. Gamers who wanted video game journalists to stop being dishonest cunts were called Nazis repeatedly and relentlessly. \n\nSo yeah honestly I dismissed this without even looking into it as the left just crying wolf again. \n\nAlso Trump was already in power, the world didn't end, I have little reason to believe a 2ed term would be significantly different.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PowerfulTarget3304",
                            "body": "Here we are crying wolf again even.  Some third part made this and it got retweeted by an intern. It is definitely not a campaign ad.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lcl1qp1",
                    "body": "> *centrists will continue to sit in their thumbs and go \"iTS boTh SiDEs!\"*\n\nActually you hear people on the left say this all the time.   It helped get Trump elected.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "Trump probably wasn't directly involved in the video production, and probably didn't scrutinize the content of the video. Employees probably did. Specifically, much younger employees that are up-to-date on digital video production.\n\nThis isn't a story about Trump saying something naziesque (though we have other stories like that). \n\nThis is a story about young Republican staffers being explicit nazis.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "MateoCafe",
                    "body": "His staff being full of Nazis is also a massive problem. And I doubt they would hide Nazi easter eggs in their if Trumps was going to can them for it.",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> His staff being full of Nazis is also a massive problem.\n\nNo argument here!",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "IgnoranceFlaunted",
                            "body": "Who?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "justsomeking",
                                    "body": "Someone involved in this video, for one.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Butuguru",
                    "body": "> Trump probably wasn't directly involved in the video production, and probably didn't scrutinize the content of the video. \n\nIt sounded like from the CNN reporting this “re-truth” happened while he was in court so I’m not sure he was even the one who did it.\n\n\n> Employees probably did. Specifically, much younger employees that are up-to-date on digital video production.\n\nYeah there are a lot of cases of [groypers](https://en.m.wikipedia.org/wiki/Groypers) being heavily active in the GOP/Trump media sphere. It is a huge problem with the GOP youth base imo. \n\n> This is a story about young Republican staffers being explicit nazis.\n\nAgree.\n\nEdit: why the downvotes lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "m756615",
            "body": "Neither Trump nor his campaign posted this. It was Trump that had it removed. Be careful where you get your information from.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "m756615",
            "body": "It's getting so bad for Biden that CNN has to misattribute stories to Trump to make him look bad even though he's the one that had it removed. \n\nI wonder if CNN thinks all the negative stories about Biden are real too or maybe it just goes one way.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Megalomaniac697",
            "body": "Since the people here have clearly lost their marbles and can't do basic fact checking, here's the deal. The \"unified Reich\" is something that is barely visible in the campaign ad and really only on magnification. There is about a 99% chance that the creator of the video did not even realize it's there.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "godlyfrog",
                    "body": "The [NYTimes](https://www.nytimes.com/2024/05/20/us/donald-trump-reich-video.html) and the original AP article confirm this.  They got in touch with the video creator, and they said they just used a background from a free image site.  I've used that exact site myself for making Powerpoint presentations at work, and sometimes you take what you can get after looking at and rejecting hundreds of others, at which point you're not really looking at the details anymore.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sadistmon",
                            "body": "So someone used a stock photo and that makes Trump a Nazi... yeah was totally right assuming the left was just crying wolf again.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "godlyfrog",
                                    "body": "It actually irritates me.  CNN won't say jack crap when Trump makes patently stupid comments as he tries to pretend that his criminal trial is a sham; they could literally sit a lawyer down on a panel and have him do an on-air fact check against the things he says.  Instead, they make a mountain out of this molehill, practically handing him a positive news piece because, for once, his actions are defensible.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "justsomeking",
                    "body": "It's notable that other candidates do not have an issue of Nazi symbolism in their ads. How do you think it ended up there in the first place?",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Unknownentity7",
                    "body": "Maybe he'd get a little more benefit of the doubt if this didn't constantly keep happening with Republicans, like when DeSantis had to fire a staffer last year for making a campaign video with pro-Nazi imagery. It's more than a little suspicious that this specific problem keeps happening.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "festosterone5000",
                            "body": "This is it right here. If someone is a normal human, then sure honest mistake. But he and the people around him either have no QC, or they have no clue what is going on. There is no polish on his campaign. Before him, even if you disagreed with someone, at least they weren’t this sloppy. Guaranteed at some point he makes a reference to this saying “ehhh a reich would be better than this. It would be the best reich.”",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "behindmyscreen",
                    "body": "Trump is a fascist",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "lesslucid",
            "body": "Trump tries to get people to focus on a new shitty thing he's done or said every day, because it keeps the focus of attention on him.  \n\nI think it makes better sense for his opponents to just pick his two or three worst qualities / actions and just hammer on them rather than following the bouncing ball of each new bit of horribleness. Unless the new thing is the worst thing he's ever done, by giving it oxygen, we're playing his game.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "CaptainAwesome06",
            "body": "How many times are we supposed to just believe that some rogue staffer posted something that wasn't meant to be posted? Either they are lying or they don't have much control over what their staff posts.  And either way, their staff isn't very observant.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Beard_fleas",
            "body": "Definitely not voting for that guy. ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "hitman2218",
            "body": "We’ll see if/how he disavows it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Illuminator007",
            "body": "Nothing really surprising about this.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "almightywhacko",
            "body": "When someone tells you that they're a fascist... listen to them.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "VeteranSergeant",
            "body": "I honestly believe that he's too stupid and oblivious to know that was in the video, and that he, or someone on his team, just reposted it without looking too closely at it.\n\nI also believe that's probably another in the long list of reasons he's categorically unfit to be President.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "moxie-maniac",
            "body": "Team MAGA:  We’re marching to a faster pace! Look out, here comes the Master Race!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mosslung416",
            "body": "It says it’s a mistake, that a campaign staffer reposted this from someone else, it was taken down once it was noticed, so I have no reason to believe it was anything other than a stupid mistake. Just like how when the government of Canada invited a genuine murderous nazi into it’s parliament building and gave him a standing ovation, it was a stupid mistake.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Warm_Gur8832",
            "body": "When is his old orange ass just gonna die already? Can’t come fast enough.\n\nI’m so sick of hearing that shrill bad faith voice and seeing the ridiculous looking orange growl on his face.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AvengingBlowfish",
            "body": "I donʻt think Trump is capable of supporting anything bigger than himself. I doubt heʻs a Nazi, but he definitely has Nazi-sympathizers in his campaign who like to slip Nazi symbology and messaging in wherever they can.\n\nIn case people forgot:\n\nhttps://www.salon.com/2018/07/06/did-trump-administration-send-a-coded-signal-to-neo-nazis-maybe-not-but-is-that-reassuring/\n\nhttps://www.independent.co.uk/news/world/americas/us-election/donald-trump-nazi-tshirt-symbol-campaign-america-first-a9600466.html\n\nhttps://www.bbc.com/news/world-us-canada-53098439",
            "score": 1
        },
        {
            "depth": 0,
            "author": "greenflash1775",
            "body": "wHy Do LiBrUlS cAlL hIm A nAzI?!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PowerfulTarget3304",
            "body": "It wasn’t a campaign ad. Someone made it online and an intern retweeted or whatever they call it on Truth Social. The words are tingly and blurred from an old newspaper clipping. Framing it as a campaign ad is disinformation.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Daelynn62",
            "body": "He’s  TELLING people what he plans to do. It’s as if some of his supporters still dont think he is serious, or they want a dictator; they actually crave fascism. \n\nI heard an interview on one of the podcasts I listen to with a German historian, and he commented  “You have no idea how bizarre it is to watch what is happening in America from our point of view. “",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GiveMeAnEdge",
            "body": "We should send more aid to Israel. That'll prevent him from being reelected.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rogun64",
            "body": "Conservative speech writers are notorious for signaling to the extreme elements of their party and that's what I think it is. The only difference is that they're signaling Neo Nazis and were not very shrewed this time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bichaelscott4",
            "body": "When people repeatedly tell you who they are, believe them",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Felon73",
            "body": "Trump saying Trump shit. Just another Tuesday.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "spencewatson01",
            "body": "I thought I was going to see an ad that says \"We need a unified Reich\".  Instead what I saw a newspaper that didn't appear to have any print on it, however when you blew up the image and freeze the frame, you can see a hard to read sentence that references unified Reich.\n\nWonder why CNN isn't investigating the \"fan\" that made the video?  Maybe the person that made the video, isn't a fan of Trump at all.",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "MaggieMae68",
                    "body": ">Maybe the person that made the video, isn't a fan of Trump at all.\n\nReally? you're going with \"false flag\" claims?",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spencewatson01",
                            "body": "Makes as much sense as the “Trump posted a video echoing Nazi Germany” claim.",
                            "score": -3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Weirdyxxy",
                    "body": "The headline was \"posts video referencing a 'unified reich'\", not \"posts video calling for 'unified reich'\". Why do you react confused when something not advertised is not actually there?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spencewatson01",
                            "body": "You should ask the Biden campaign that question:\n\n>Trump is “not playing games; he is telling America exactly what he intends to do if he regains power: rule as a dictator over a ‘unified reich,” Biden campaign spokesperson James Singer said.\n\nI mean that's an extreme reaction for such a nothingburger.",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Weirdyxxy",
                                    "body": "Did you first hear Singer's response, then see this headline and click on it, expecting what you extrapolated from Singer's response?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "spencewatson01",
                                            "body": "I have no idea why it matters but:\n\n1. Saw post on reddit.\n2. Clicked Link.  Momentarily forgot that CNN is just an arm of the DNC and thought - wow, this is CNN news, the Trump campaign must have actually did something stupid by using the term reich in an ad.\n3. Saw the CNN anchors pretend to be on the tv show CSI and extrapolate text that's impossible to see without looking for it.\n4. Remembered that CNN is actually a propaganda network.\n5. lol'd at the CNN guest clinching their pearls.\n6. lol'd more at the Biden campaign throwing out the dictator word like candy at a 4th of July parade.\n7. Somehow got into meaningless conversation about what happened first.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Weirdyxxy",
                                                    "body": "It matters because you complained about having the wrong expectations, and are now either trying to shift the goalposts or claiming you were given the wrong expectations by something the article only mentions after it says very directly what is or isn't in that ad.\n\nI strongly doubt your account on 2, contest your account on 3, and rest my case on whether your comment affects my point. You did not have exaggerated expectations unless you mentally exaggerated the headline that was actually there (a very bad habit when applied to somewhat clickbaity sites), and your gripes about the Biden campaign don't change that. Did you exaggerate the CNN headline in your head and thus get a wrong impression, or did you lie about what was or wasn't your impression going in?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "spencewatson01",
                                                            "body": "yes, I exaggerated the CNN headline in my head and got a wrong impression because as I said I momentarily thought - Its on CNN, it must actually be a story.   \n\nBut at least I did get to hear the Biden camp call Trump a dictator which is always hilarious.\n\nAgain, no idea why it matters.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Weirdyxxy",
                                                                    "body": "Got it, thank you. I think CNN can uncover an important story as well as cover an unimportant one, but I don't think they're likely to undersell it. Maybe I'm wrong, though\n\nNot a dictator, a wannabe dictator - a weakling with srong-man fantasies, not a powerful leader. Let's be precise. And I think following that from this is a reach, yes - not a crazy one, but the more likely explanation is \"he staffes his campaign with people who support this kind of messaging and has them run wild\", not \"this is his messaging, as intended by him\". They have the right to view this differently, I have the right to slightly disagree with them.\n\nIt matters to me because it proves your response to me was irrelevant to my point, I often get side-tracked, but I don't like it when people try to evade a point or a question. So I asked if the most plausible way I could imagine it actually being relevant occured, that's all",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "spencewatson01",
                                                                            "body": ">And I think following that from this is a reach, yes - not a crazy one, but the more likely explanation is \"he staffes his campaign with people who support this kind of messaging and has them run wild\", not \"this is his messaging, as intended by him\". \n\nSo I know nothing about Q.  I tried to find Q drops on 4chann and all I saw was porn links.  But I know of ppl that are all in.  And there are weird things that surround Trump.  This one rally you could count up the number 17 (which is significant, idk why) over and over.  Like 17 flags and a bunch of other stuff.  I don't even remember, it's weird if someone explains it and there is some clear messaging.\n\nAll this to say.  idk what's going on with the staffers.  But I do agree with you totally that people around him message stuff constantly.  \n\nI'll say, I think this was an over-reach by CNN but talking through it with you. idk?  I see where you're coming from.",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nrcx",
                    "body": "It doesn't matter, just that one word in a newspaper article from ww1 (not ww2) will, in their book, let them claim forever that \"he literally said he wants the return of the third reich.\" You'll be hearing this for years.\n\nBtw shout out to the person who said on this sub earlier today that \"The common denominator of the conservative mind is the inability to see nuance.\"",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "srv340mike",
                            "body": "It's really tiring that people like you get angrier at the Left for reacting badly to the use of a word that's associated with Nazis than you do at the Right for continually having these issues again and again.\n\nLike, ya, I'm all for \"don't attribute to malice what can be attributed to stupidity.\" This is probably just an example of a lazy intern who copy and pasted something that maybe shouldn't have. \n\nBut the fact that a major Presidential candidate's staff is either copying, parroting someone who copied, from WWI German propaganda should be at least mildly strange to you.\n\nBut no, it's just \"Look at the stupid lefties! They don't appreciate Nazi stuff! How stupid of them!\"",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "LucidLeviathan",
                            "body": "I mean, don't you find it at least a *little* troubling that Trump-related folks keep accidentally associating themselves with Nazis? Democrats never do. The only way that I can think that this would happen is if they traffic in the same circles.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Eyruaad",
                                    "body": "At this point we have two choices,\n\nEither A) seemingly for quite some time there has been a coordinated effort by secret Trump haters to get jobs working for Trump so that they can one day post nazi related content to try and slander Trump, and somehow his hiring/hr practices never seem to catch it.  \n\nOr B) Trump associates with nazis a bit too often and occasionally they drop the mask.  \n\nI know which I think is more believable",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LucidLeviathan",
                                            "body": "But neither is a good look for the Trump campaign. Even the most innocuous explanation is still pretty damning.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Eyruaad",
                                                    "body": "Very few things are ever a good look for Trump.  It's always incompetence or just filled with terrible people.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "nrcx",
                                    "body": "The news text is about WW1. You know that's not even the Nazi period, right?\n\n> Democrats never do.\n\nBut they do unconstitutionally ban their opponent from ballots, and they do try to imprison him on felony charges that would never have a snowball's chance of sticking against anyone else.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LucidLeviathan",
                                            "body": "I am fully aware. I also know that, if you pick a random article from WWI, you are *extremely* unlikely to see a reference to a new Reich. *Somebody* did this intentionally. The fact that this keeps happening shows that *somebody* associated with Trump is promoting Nazi ideas. That *should* concern his supporters.\n\nThe Colorado thing was done using the legal process. By definition, that's not unconstitutional. The felony charges are well documented, and if he is convicted by a jury, then the process has been followed.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Similar_Candidate789",
                                                    "body": "The Colorado thing Id also point out was done by republicans……..",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "nrcx",
                                                            "body": "If you ignore the fact that the Colorado Supreme Court has seven justices and every single one of them was appointed by a Democratic governor, sure.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Similar_Candidate789",
                                                                    "body": "The one who brought the *lawsuit* was a Republican.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "nrcx",
                                                                            "body": "The ones who decided it were all Democrats, and we all remember the entire left wing being on board with it and trying to sell it to the country. Every left winger on my Twitter feed was celebrating, and every one raged against the SCOTUS for striking it down.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "nrcx",
                                                    "body": "The top comment on this thread already pointed out that the newspaper text came from a Wikipedia article on WW1.\n\n> The Colorado thing was done using the legal process. By definition, that's not unconstitutional. \n\nThe Supreme Court ruled unanimously that it **was** unconstitutional. And the Democratic party, including users here, responded to that ruling by delegitimizing the ruling with a ridiculous conspiracy theory that implicates even the three liberal justices - another totalitarian behavior, btw.\n\n> The felony charges are well documented, and if he is convicted by a jury, then the process has been followed.\n\nThe jury is 87% composed of people who voted against him. And we all know that even if they find him guilty, the charges won't stick on appeal. So it's nothing more than election interference.\n\n> The fact that this keeps happening shows that somebody associated with Trump is promoting Nazi ideas.\n\nThere you go again - it wasn't from the Nazi period. And even if that's true, who the heck cares about *associations* compared to unconstitutional ballot bans? Assuming you don't disagree with the SCOTUS ruling, do you understand what it means? It means that the SCOTUS was literally **the only thing** that stopped the Dems from unconstitutionally canceling the election this year. How stupid do you folks think we independents are, that we would put *assocations* with some *staffer* on a higher level of importance than something like that? Just the fact that that happened is automatically more troubling to me than any amount of things that Trump staffers could ever say. And it was just the start!",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LucidLeviathan",
                                                            "body": "Again, I'm fully aware. If you pick a random article from WWI, you're not going to find a lot of talk about a new Reich. Respond to that, please.\n\nAnd that's why we have court cases. It's not unconstitutional to file a court case. It's not unconstitutional to request something. It *would* be unconstitutional if, say, the legislature passed a law saying that he was disqualified. They didn't. They argued a case in court. They won. It got overturned on appeal. That's how the legal system works.\n\nYou're not entitled to a jury of people who voted for you or who agree with your political beliefs.\n\nWhat does anything about the Colorado case have to do with Nazis? That's what we're talking about. You're the one who brought up the Colorado stuff, seemingly as a distraction from a topic you find uncomfortable to discuss. I can only assume that you're ceding the point because you don't want to talk about it.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "nrcx",
                                                                    "body": "> What does anything about the Colorado case have to do with Nazis?\n\nIt has to do with democracy and constitutionalism, and it's related because the point of associating Trump with Nazism is to argue that he is a greater threat to those things.\n\n> If you pick a random article from WWI, you're not going to find a lot of talk about a new Reich. Respond to that, please.\n\nI have. I've said that any amount of things staffers could do or say is an incomparably smaller concern to me than what I've mentioned. You asked why it wasn't troubling, and that was my answer.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "LucidLeviathan",
                                                                            "body": "The point of associating Trump with Nazism is that *Nazism led to a genocide*. It led to the *single greatest crime against humanity in history.*",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "MaggieMae68",
                                                            "body": ">The jury is 87% composed of people who voted against him.\n\nSource for this? As far as I know, no one, including the judge and laywers, know who the jurors voted for. They are not allowed to ask. \n\n> And we all know that even if they find him guilty, the charges won't stick on appeal.\n\nWe all know this? For real? How do you know this? What law school did you go to and when did you attend this trial?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "nrcx",
                                                                    "body": "I mean that Manhattan voted 87% against him. But on second thought, you're right, it's not fair to extrapolate the jury's leanings based on that. Even if it is one of the most liberal jury pools in the country. For one thing, it excludes people who didn't vote.\n\n> We all know this?\n\nYes, we know this. FFS, their star witness is Michael Cohen.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "MaggieMae68",
                                                                            "body": "RemindMe! 6 months",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "MaggieMae68",
                                            "body": ">do try to imprison him on felony charges that would never have a snowball's chance of sticking against anyone else.\n\nAhem. Hunter Biden would like a word.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Weirdyxxy",
                                            "body": ">But they do unconstitutionally ban their opponent from ballots \n\n\nYou're probably referring to Anderson v. Griswold, where Norma Anderson (R-Co) sued Jean Griswold (D-CO) because Griswold didn't take Trump off the ballot and Anderson believed Griswold was obligated to take him off the ballot?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "nrcx",
                                                    "body": "Three states disqualified him and there are legal challenges ongoing in four others. [This is how this sub reacted](https://old.reddit.com/r/AskALiberal/comments/18t8sih/megathread_maine_disqualifies_trump_from_2024/) when Maine disqualified him. [This is how r/politics reacted.](https://old.reddit.com/r/politics/comments/18t8xme/maine_disqualifies_trump_from_presidential/) Polls showed that basically all left-wing voters were in favor of banning him. But you don't have to go back to the polls, because you remember, just like I remember.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Weirdyxxy",
                                                            "body": ">Three states disqualified him\n\nTwo others after a court ruling told the first one to\n\n>and there are legal challenges ongoing in four others\n\nI'd expect those disappeared after the SCOTUS opinion\n\n>[This is how this sub reacted](https://old.reddit.com/r/AskALiberal/comments/18t8sih/megathread_maine_disqualifies_trump_from_2024/) when Maine disqualified him\n\nA pretty conflicted reaction, it looks like.\n\n>Polls showed that basically all left-wing voters were in favor of banning him\n\nOkay. Sometimes, political sides have opinions on legal matters.\n\n>There's nothing more pathetic than trying to rewrite history\n\nThen don't.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "nrcx",
                                                                    "body": " As a summary of what Democratic Party rank and file were saying at the time, I'm just going to quote the **top comment** on the r/Politics thread:\n\n> I mean it plainly states anyone who gave aid and comfort to insurrectionists. Even if you don’t consider trump an insurrectionist (lol) there’s no doubt he did that. **It doesn’t say he has to be convicted, doesn’t even say he has to be charged.** The plain reading of the constitution obviously doesn’t allow him on the ballot and that’s pretty clearly the intention of the law.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Weirdyxxy",
                                                                            "body": "I don't think r/politics is a good representation of the Democratic Party's rank and file - too young, too outspoken, too online.\n\nFurthermore, the Democratic Party rank and file has little to do with the decisions of state SoSs.\n\nAnyway, I don't fully agree with this comment, but you're highlighting the wrong part. \"No person who shall have engaged in insurrection or rebellion against \\[the U.S. Constitution\\], or given aid or comfort to the enemies thereof\" doesn't say what the standard is, it doesn't demand a conviction. I don't think it makes much sense to complain about someone reasoning it doesn't require a conviction, either. Compare it to the thirteenth amendment: \n\n>>Neither slavery nor involuntary servitude, except as a punishment for crime **whereof the party shall have been duly convicted**, shall exist within the United States, or any place subject to their jurisdiction\n\nThe same people who passed the fourteenth amendment without a demand for a criminal convictiondemanded a criminal conviction in the thirteenth, they didn't just find it unnecessary to write the word \"convicted\" when they meant it.\n\nThe opinion in Trump v. Anderson, which is how Anderson v. Griswold went to the Supreme Court after some things I'm not knowledgeable on, doesn't claim the 14th amendment demands a criminal conviction or criminal charges, either - it only claims section 3 of the 14th amendment requires enacting legislation by Congress (if I understood it correctly). What can be criticized is the sentence before -\n\n>>Even if you don’t consider trump an insurrectionist (lol) __there’s no doubt he did that__\n\nYou need more than just yourself having no doubt. That can be criticized, if you have to - the sentence you marked is just true",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "nrcx",
                                                                                    "body": "You guys are just amazing. You're saying the Democratic Party could have unilaterally cancelled the election this year, without any trials, or even any charges, and you'd not have a problem with it. You'd be celebrating. The only thing that actually stopped you all from already doing that this year was the Supreme Court. And although you might deny it now, I'm sure that most of you would go on to extend that same 'aid and comfort' definition to include almost all Republicans and conservative independents. I don't know what to say any more. I guess there's nothing more that can be said.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Weirdyxxy",
                                                                                            "body": ">You're saying the Democratic Party could have unilaterally cancelled the election this year \n\n\nWhat? No. No one even considered canceling any elections, the thing that happened was one candidate being denied a place on the primary ballot because he appeared to be ineligible. Not in a unilateral decision, but due to a lawsuit because the Democratic-led Colorado Department of State decided to put Trump on the Republican primary ballot.\n\n\n\n>The only thing that actually stopped you all from already doing that this year \n\n\nDoing what this year? \n\n\n>And although you might deny it now, I'm sure \n\n\nI'm not surprised you're certain you know what people believe better than those people. Aid or comfort requires you to actually do something or at least make a significant decision regarding the thing you're providing, what you're claiming would in fact be beneath the pale\n\n\nI'm glad we agree where the part of the comment that could reasonably be criticized lies, though - whether or not \"Trump provided aid and comfort to the enemies of the United States\" is proven. So why did you not even bold that part? Your complaint was instead how some redditor could dare a constitutional amendment doesn't require something which a plain reading suggests it doesn't require\n\n\n>I don't know what to say any more. I guess there's nothing more that can be said.  \n\n\nI want to end by saying \"try to read what I write, not what you want me to have written instead\". The position you're dismissing is a strawman",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "nrcx",
                                                                                                    "body": "> What? No. No one even considered canceling any elections, the thing that happened was one candidate being denied a place on the primary ballot because he appeared to be ineligible. Not in a unilateral decision, but due to a lawsuit because the Democratic-led Colorado Department of State decided to put Trump on the Republican primary ballot.\n\nAgain, it was seven US states, not just Colorado. And it wasn't just the primary. Why muddy those points? Why retrace ground we've already covered? And if you believe what you're saying, then logically, you would support it for all states and other politicians who gave 'aid and comfort, such as conservatives who voiced support I do think that would be, in effect, canceling the election. More than that, actually. And it's certainly unconstitutional.\n\n> I'm not surprised you're certain you know what people believe better than those people.\n\nFirst of all, I never said anything about what they believe. I'm talking about what they would do and say. Second, why are you not surprised I think I know what people think? Is that a personal comment?\n\nI'm merely saying that their actions so far point in a definite direction. And as a reminder, what I said is what most independents believe, at this point. Which is why we identify a second Biden presidency as a threat to democracy more than a second Trump presidency, [by a double-digit margin.](https://maristpoll.marist.edu/wp-content/uploads/2024/05/NPR_PBS-NewsHour_Marist-Poll_USA-NOS-and-Tables_202404261555.pdf) (At *least.* That's an *NPR* poll.)\n\n> I'm glad we agree where the part of the comment that could reasonably be criticized lies, though - whether or not \"Trump provided aid and comfort to the enemies of the United States\" is proven. So why did you not even bold that part? Your complaint was instead how some redditor could dare a constitutional amendment doesn't require something which a plain reading suggests it doesn't require\n\nTo be honest, I don't even understand what you're saying at this point, sorry.\n\nI find your entire argument so far to be a weird kind of denial mixed with confession. As far as I'm concerned, this is a totalitarian movement. I don't think this conversation has further merit.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Weirdyxxy",
                                                                                                            "body": ">To be honest, I don't even understand what you're saying at this point, sorry.  \n\n\nWell, then we should start there, shouldn't we? \n\n\nYou complained some redditor said \"Section three of the fourteenth amendment doesn't demand criminal conviction, not criminal charges\" while that was the position backed by precedent. But that's just a true statement - if the writers of the fourteenth amendment had wanted to write \"convicted\" there, they would have, just like they did in the thirteenth amendment. That's the part of the comment you emphasized, not \"there is no doubt Trump gave aid or comfort\", which there can be much controversy over, and which you then shifted gears to exaggerating. \n\n\n>I find your entire argument to be a weird kind of denial mixed with confession. \n\n\nI don't think you managed to find my argument at all, sorry for the wordplay. You wouldn't have no idea what I mean when asking \"why are you pretending you had been criticizing something else than you had actually been criticizing?\" if you had understood my points",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "nrcx",
                                                                                                                    "body": "It doesn't matter to me whether the framers of that amendment wanted to require a conviction (as opposed to a Congressional vote) or not—you should want it anyway, and the fact that you don't personally need there to be a conviction, or a trial, or charges, or **any process** at all beyond just a Democratic state official declaring a Republican guilty and banning **by fiat** (as happened in Maine, which that comment was discussing) is alarmingly totalitarian to me.\n\nAlso, the word 'pretending.' I object to the sneering accusation of disingenuousness you keep injecting like that. Especially after you keep making me go over ground already covered as if it never happened, like \"dbecause the Democratic-led Colorado Department of State\" (it was 7 states and we were talking about Maine) and saying \"primary\" as if that's all it was. I really don't find any utility in this conversation.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Weirdyxxy",
                                                                                                                            "body": ">It doesn't matter to me whether the framers of that amendment wanted to require a conviction (as opposed to a Congressional vote) or not— \n\n\n\"As opposed to a Congressional vote\" is a weird framing. As opposed to a factual finding in the administrative process putting someone on a ballot is (just like the factual finding that a candidate got enough signatures), for instance, not just to something even more complicated.\n\n\nBut either way: If it doesn't matter to you, why is it the part you're complaining about? \n\n\n>you should want it anyway, \n\n\nIf you want to write a petition for Congress to amend the 14th Amendment in that way, be my guest. If you want to complain about what it says right now, complain to the Radical Republicans. But don't attack or for saying what the section means\n\n\n\n>and the fact that you don't personally \n\n\nI personally? Interesting\n\n\n>need there to be a conviction, or a trial, or charges, or any process at all  \n\n\nI don't think there \"[needn't be] any process at all\" for any executive decision. Moreover, there also needs to be a process to challenge such a decision - a process that exists, see: Anderson v. Griswold. The thing that kicked this off\n\n\n>beyond just a Democratic state official declaring a Republican guilty \n\n\nNot guilty, but engaged in insurrection or rebellion\n\n\n\n>and banning by fiat \n\n\nAgain, I don't think any executive decision should be by fiat. It should all only be an exercise of discretion limited by law, and susceptible to review by administrative courts (which are just the normal courts in the US, I believe) \n\n\n>(as happened in Maine, which that comment was discussing) \n\n\nThe state SoS just decided without a hearing, and without laws ruling her decision, to take Trump off the ballot? That would be bad, if it happened. Maybe the US should get a universal voting rights amendment to combat that, if it were true that is. \n\n\n>Also, the word 'pretending.' I object to the sneering accusation of disingenuousness \n\n\nYou have a point there. I tend to cling to the threads within conversations more than others, maybe you didn't do this intentionally. I'm sorry I didn't extend you the charity you deserved there, I was growing annoyed, but that's no excuse \n\n\n>\"dbecause the Democratic-led Colorado Department of State\" (it was 7 states and we were talking about Maine) \n\n\nI believe the later decisions were kicked off by the Colorado ruling, they were because of it. That's why I keep focusing on it",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "nrcx",
                                                                                                                                    "body": "> Why is that the part you're complaining about?\n\nIt's not.\n\n> If you want to write a petition for Congress to amend the 14th Amendment in that way, be my guest. If you want to complain about what it says right now, complain to the Radical Republicans. But don't attack or for saying what the section means\n\nThe Supreme Court (not 'Radical Republicans') has ruled unanimously that it doesn't mean that, insofar as it can't be used by states that way.\n\nAnd that amendment you're using was written for a Civil War, intended to be used against people who had actually taken up arms against the government in a war that killed half a million Americans and devastated countless cities, and **even on that occasion,** mass pardons eventually made it explicitly inapplicable to the vast majority of those uniformed insurrectionists, **to say nothing of** those who gave them 'aid and comfort.' The kind of authoritarianism you're justifying has never before been seen in this country. Ever.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Weirdyxxy",
                                                                                                                                            "body": ">It's not.\n\nWhy is it the part you chose to emphasize, then?\n\n>The Supreme Court (not 'Radical Republicans')\n\nInteresting scare quotes. If you want to complain about the term \"Radical Republicans\" for a political faction of the 19th century, I'm willing to choose another term. Do you have any suggestions?\n\n>has ruled unanimously that it doesn't mean that, insofar as it can't be used by states that way\n\nAnd four is prime, insofar as it cannot be divided by an odd number greater than one. (The decision is per curiam, by the way - claiming it's unanimous is speculation)\n\n>And that amendment you're using was written for a Civil War\n\nIt was written because of a Civil War, it is not restricted to one.\n\n>intended to be used against people who had actually taken up arms against the government in a war that killed half a million Americans and devastated countless cities\n\nDespite what your phrasing implies, that's not the criteria. It was intended to be used against people who had \"engaged in insurrection or rebellion against the Constitution, or given aid or comfort to the enemies thereof\", after swearing an oath to protect it. You need to be an oath-breaker for it to apply, but you don't need a civil war, nor a minimum death toll of 500,000. The Confederates were a reason for this amendment, but they were not all it encompasses\n\n>and **even on that occasion,** mass pardons eventually made it explicitly inapplicable to the vast majority of those uniformed insurrectionists\n\nI think the term is \"amnesty\" when a legislature does it\n\n>The kind of authoritarianism you're justifying\n\nDo you think everything is authoritarianism, or only when Democrats are following the constitution before SCOTUS redefines it?",
                                                                                                                                            "score": 1
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Weirdyxxy",
                            "body": "You're joining into a complaint that something the headline didn't claim wasn't in the article. I think that's a relevant nuance; do you?",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "No surprise.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "the_jinx_of_jinxstar",
            "body": "Our thoughts are we told you so. Try asking this on r/asksonservatives since they are the ones in denial.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Sad_Lettuce_5186",
            "body": "Yeah. The American right are largely fascists",
            "score": 0
        },
        {
            "depth": 0,
            "author": "EchoicSpoonman9411",
            "body": "The head of the American fascist party released an ad containing fascist imagery? I'm unsurprised.\n\nMy grandfather's generation knew what to do with fascists. We have forgotten their lessons.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "nrcx",
            "body": "I think that from now until November, and beyond, Biden and every Democratic media outlet will shamelessly lie and pretend that this is something that it plainly isn't.\n\nAlready started: \n\n> Trump is “not playing games; he is telling America exactly what he intends to do if he regains power: rule as a dictator over a ‘unified reich,” Biden campaign spokesperson James Singer said.",
            "score": -4
        },
        {
            "depth": 0,
            "author": "TimeAll",
            "body": "Since 2016, the dog whistles have become bullhorns.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "MollyGodiva",
            "body": "Trump already expressly said he would be a dictator. This is not any worse.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "It's a dog whistle to his base. The phrase itself doesn't make any sense in the context of America.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "twistedh8",
            "body": "Sounds really nazi like.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "FoxBattalion79",
            "body": "its on brand for him",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Orbital2",
            "body": "Par for the course and his supporters will still rationalize it away",
            "score": 0
        },
        {
            "depth": 0,
            "author": "C21H27Cl3N2O3",
            "body": "It’s not the first time he’s directly quoted Nazis or Italian fascists, and it won’t be the last.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "RedditLife1234567",
            "body": "honest question, what's the difference between \"From the river to the sea\" and \"Reich\"? It seems like pro-Palestinians are trying to make \"From the river to the sea\" acceptable, mean something else. So why can't Trump do the same?",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Megalomaniac697",
            "body": "The article says that Trump didn't post it.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Dj_Fabio",
            "body": "I wouldnt say he is hitler. He supports israel so much the comparison is invalidated",
            "score": -2
        }
    ]
}