{
    "title": "What is an authoritarian stance you have?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nI asked yesterday about libertarian stances and I agreed with most of them. So I want to ask the opposite question and see something I’ll probably disagree with. Examples would be banning certain speech, banning abortion, just anything viewed as “not free” \n\nBtw I don’t judge anyone for their beliefs, I’m just curious and want to hear other perspectives  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "I don’t care if you get a note from a fake doctor like a chiropractor, corrupt doctor, or appeal to sky daddy. Not getting your children proper medical care, including full vaccinations or allowing things like blood transfusion should be considered child abuse. In some cases it should be a felony.",
            "score": 222,
            "replies": [
                {
                    "depth": 1,
                    "author": "magic_missile",
                    "body": "Does this apply to hearing aids and cochlear implants? My hearing aids have been life changing but there is a cultural opposition, especially to the cochlear implants, among some people in the capital-d Deaf community.",
                    "score": 25,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GabuEx",
                            "body": "I would certainly apply it to that.  If you're an adult and you don't want them, then that's your business, but if it's your kid and they do want them, I would consider it child abuse to say no.  Seems no different to me than a Jehovah's Witness refusing their kid a blood transfusion.",
                            "score": 44,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "supercali-2021",
                                    "body": "What if parents can't afford them????",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Fugicara",
                                            "body": "I mean we're on the left so I think the obvious answer would be that medical care (which this is) should be taxpayer-funded.  Usually these \"pie-in-the-sky\" ideals assume that we've dealt with more pressing issues first, like the need for universal healthcare in the US.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "davvolun",
                                            "body": "In the perfect world we're hypothesizing, that should never be an issue.\n\nEven in this real world, no child should ever be in a situation where they lack for any health care, regardless of their parents financial situation. If Elon Musk can plan a trip to Mars, we can definitely make sure children get health care.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "supercali-2021",
                                                    "body": "Well I can tell you it was like pulling teeth to get any help at all paying for my kids hearing aids. Apparently our income of $35k for 3 people exceeded the limit to be eligible for help. People living in utter poverty get Medicare and the wealthy can afford to pay out of pocket. People stuck in the \"middle\" are stuck period. (Although IMHO 3 people living on $35k really should be considered low income and qualify for Medicare. The threshold is really outdated.)",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "davvolun",
                                                            "body": "Is that kids plural or kid's possessive? I'm assuming possessive and you're saying $35k for 2 adults and a child, cuz if it's multiple kids at $35k I have absolutely no idea how you're surviving. Either way though, that's really rough, I'm sorry. We absolutely need to update those thresholds.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "the_jinx_of_jinxstar",
                                    "body": "I mean. Going without a needed blood transfusion or vaccines can kill you. Not sure someone not getting a cochlear implant would risk their life. I guess you could make an argument for traffic or not hearing something that can kill you.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "I am going to go with yes. I have a friend who is blind, so I’m somewhat familiar with this attitude having talked to him about it. Plus, I’ve seen some stuff in the news.\n\nI actually think we may have had this conversation before.",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "RPG_Vancouver",
                            "body": "Yeah that’s wild to me. If you’re an adult that’s a decision you should be free to make, but you’re pretty objectively disadvantaging a kid if you raise them Deaf when there’s a very easy fix.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NeolibShill",
                                    "body": ">if you raise them Deaf when there’s a very easy fix.\n\nThats the issue the Deaf community has. They don't see being Deaf as something bad you should fix because it is a fundamental characteristic of them and their culture. To them, Deafness isn't a failing or a bad thing, it's an integral part of them and their community \n\n\nWhite and straight people have huge advantages in society. If a pill existed that could ensure your child was straight and white, would it be child abuse to not force them to take it when they are a minor and can't consent? Obviously not.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Wheresmyfoodwoman",
                                            "body": "Sorry I think the whole thing is freaking weird. Nothing about my disability is fundamental characteristic. It just comes off as a portion of their community is salty because they didn’t have the same opportunity for an implant when they were a child.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NeolibShill",
                                                    "body": "Yeah, it's probably different for deaf people that grow up with deaf parents, went to a deaf school, and interact with deaf people daily. ASL is a separate language than English and uses it's own grammar with it's own puns, rhymes, idioms, etc. \n\nEvery kid who gets Cochlear implants misses out on that and it means the death of this independent culture and community.",
                                                    "score": 3
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "erinberrypie",
                                            "body": "I think that's a poor comparison. In this instance, this is a treatable physical disability. Prejudice and racism is a social construct integrated systemically into our society and very unfortunately does not have readily available \"treatment\". Deafness does. If racism had a vaccination, then yeah, that should be mandatory too.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NeolibShill",
                                                    "body": ">I think that's a poor comparison. In this instance, this is a treatable physical disability.Prejudice and racism is a social construct\n\n\nWhat you treat as a disability or a quirk of individuality and identity is also a social construct. There are numerous traits nobody in a western society would consider disabilities even though they can have physical drawbacks.\n\n You can frame being LGBT as a disability, and many mental health  professionals and doctors did for decades. Being unable to have children due to a psychological trait you have no control over for example.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "erinberrypie",
                                                            "body": "Sorry, I'm not being argumentative but I don't understand. How is a trait or quirk the same as a physical disability in ways of treatment? LGBT is not a disability in any way, even if it was considered that for a long time due to prejudice. It's an identity and doesn't *need* treatment.\n\nAnd for your point on invisible disabilities (which is a great point btw), there are treatment options for lots of psychological issues. And for the ones that don't, well, they just don't. That doesn't mean all disabilities don't have treatment. In the very specific instance of deafness, there is. It feels like discouraging treatment for those who have the option because some don't.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "NeolibShill",
                                                                    "body": ">LGBT is not a disability in any way, even if it was considered that for a long time due to prejudice.\n\nThe point a deaf rights activist would make is that you are doing the same thing as an anti-LGBT person and are acting prejudiced. You are saying being deaf is bad, deaf people are broken, and they need to be fixed if they can. Its saying that being deaf and deaf culture are not legitimate ways to live. \n\nThe point of view is that being deaf while inconvenient, doesn't make them broken and they don't want to or think they should be fixed.  It is a different but equally valid way to live.  It feels like an attack on them and their community for you to imply they are lesser.  Even if they had a magic wand that could give hearing to every deaf person, many would still see it as an unnecessary attack on them and their community.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "erinberrypie",
                                                                            "body": "I most certainly didn't say or imply any of those things. I was addressing your comparisons and saying available treatments shouldn't be discouraged. Never once did I say they're broken, bad, or illegitimate. I won't have words put in my mouth. Have a good one.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "RPG_Vancouver",
                                            "body": "That’s still bizarre to me, its obviously not a FAILING, but it’s a part of your body that doesn’t work properly, and quite obviously disadvantages you in life, even if it’s significantly easier to be deaf now compared to even 50 years ago.",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "AdjustedMold97",
                                    "body": "This is very ableist. Most deaf people do not consider deafness a disability.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "RPG_Vancouver",
                                            "body": "It’s the DEFINITION of a disability. I’m deaf in one ear and it’s quite obviously a disability (even if a minor one for me compared to being completely deaf). It makes it much harder to pinpoint where sound is coming from. \n\nFrom the CDC\n\n> A disability is any condition of the body or mind (impairment) that makes it more difficult for the person with the condition to do certain activities (activity limitation) and interact with the world around them (participation restrictions).\n\nA lot of deaf people can learn techniques to reduce and minimize this disability, but I don’t think pretending it isn’t a disability in order to force kids to remain deaf is particularly helpful or kind.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "-Gurgi-",
                            "body": "Had a deaf kid in college. Refused hearing aids. Refused cochlear implants. The mention of them disgusted him. He also hated his interpreters who had to sign his disdain for them to us, which was awkward.\n\nHis solution? He fully believed everyone in the world should learn sign language.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KingBlackFrost",
                                    "body": "There's absolutely nothing wrong with Deaf people refusing cochlear implants or hearing aids. \n\nKeep in mind that Deaf people don't just suddenly get the implant, and then they're 'cured'. Cochlear implants are NOT a cure. They are a management tool. And there are legitimate reasons for people to reject them.  They have to undergo months and sometimes years of speech therapy, and learn how to speak and process sounds. Even for kids this can be difficult.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "Ok-One-3240",
                                    "body": "He’s not going far in the world.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "-Gurgi-",
                                            "body": "Oh I should’ve been more specific. This was in college. He was like 21",
                                            "score": 8
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AdjustedMold97",
                            "body": "There are a lot of good documentaries on this, ultimately my opinion as a hearing person is that the child should have the choice.\n\nIt’s a complicated problem with merits to both sides. On one hand, we have that getting a cochlear implant at a young age is ideal for developing speech, and starting at a later stage of life can make it difficult or impossible to learn speech. On the other hand, some will argue that children are not old enough to make a decision like that.\n\nI wouldn’t consider denying your kid a cochlear implant child abuse, though. Deaf culture and language is always growing and becoming more accessible.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "supercali-2021",
                                    "body": "Y'all are forgetting the most important deciding factor in whether a child gets implants or hearing aids. And that is how much is it going to cost and who is going to pay for it and how?  I can tell you from first hand experience, most insurance does not cover hearing aids. My son wanted and needed them when he was a kid. Our family of 3 lived on $35k in a hcol area the year before and I had to go to great lengths to get any help paying for $7k hearing aids.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ok-One-3240",
                            "body": "I took ASL in college and this blew my mind. It’s not an insignificant amount of Deaf people either.\n\nI have very bad vision, can’t drive without my contacts or classes. I’ve never taken any sort or pride in that, and if someone offered me lasik I’d take it in half a heartbeat.\n\nI do not understand why anyone would choose to have a disability.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CowboySocialism",
                                    "body": "I felt similarly until I watched sound of metal. I will never judge someone for refusing cochlear implants, they seem like complete ass. Not a solution like LASIK, more of a shitty imitation of what hearing is.",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "supercali-2021",
                            "body": "Hearing aids are very expensive and rarely covered by insurance. If parents can't afford them, or any medical treatment or procedure, what are they supposed to do? Until we have basic universal healthcare provided free of charge to all American citizens, I cannot see how parents can be held responsible for not getting care for their kids. But once it's free, there would be no excuse.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "guiltypleasures82",
                    "body": "Agreed. Similarly I'd be in favor of compulsory secular education for at least k-8. You shouldn't be able to homeschool a kid with nothing more than the Bible.",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "I would just put an end to homeschool and set up really strict requirements for private school.\n\nNot sure how I feel about requiring secular schooling only for some number of years. I’d have to think about that.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blaqsupaman",
                                    "body": "I'd do it the other way around. Ban private schools and have very strict oversight for home schooling and there must be a legitimate reason why the child can't participate in public school.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Strike_Thanatos",
                                            "body": "Eh, I get legitimate desires to use different methods of education, or ensure that instructors are available for fields where there aren't enough teachers, so I don't have as much of a problem with secular private schools. I do agree with the restrictions on home schooling, though.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MythologueUK",
                    "body": "To expand on this, vaccinations shouldn't be viewed as an optional thing in the same way that seatbelts, driving under the influence, speaking on a phone whilst driving, etc., shouldn't be viewed as optional. Namely, yes, you're placing yourself first and foremost in danger, but you're also risking the lives of others.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "blaqsupaman",
                    "body": "I generally agree with you. Right now I'm still figuring out where my line is, because I like to consider myself pretty absolutist when it comes to bodily autonomy, but at the same time I wouldn't necessarily have been against forcing people to get the Covid vaccine.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "madbuilder",
                            "body": "Do you mean at the time, or now, knowing what you do now?  You'd still force people to get a vaccine which was neither safe nor effective?  And their children too, who couldn't even get Covid?",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blaqsupaman",
                                    "body": "What the actual fuck?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "madbuilder",
                                            "body": ">  I wouldn't necessarily have been against forcing people to get the Covid vaccine.\n\nThis is definitely not a B.A. absolutist position.  Just asking you for some clarity around the Covid vaccine based on what we knew back then.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "blaqsupaman",
                                                    "body": "The vaccines are safe and effective and there have been many documented cases of children getting Covid and some even dying.",
                                                    "score": 5
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Fugicara",
                                    "body": ">You'd still force people to get a vaccine which was neither safe nor effective?\n\nTo be clear, you're talking about a hypothetical situation in the future?  Since it's extremely well known and documented that the mRNA COVID-19 vaccines were both very safe and very effective, and it was well known from the moment they were approved by the FDA (and earlier than that).  I'm just trying to get a feel for if this is a real question or if this is just someone trying to push their anti-vax nonsense.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CarrieDurst",
                            "body": "You realize healthcare includes therapy, right? Also so progressive",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blaqsupaman",
                                    "body": "Yes, I worded that poorly. I meant I'd make refusing appropriate affirming care legally defined as a form of medical neglect of a child.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sad_Lettuce_5186",
                    "body": "To be fair, thats kind of an anti-authoritarian stance because the parents are being authoritarians to their kids in that instance and you are arguing on behalf of the kids’ liberation.",
                    "score": -11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "islandofcaucasus",
                            "body": "I think it's petty clear that we're discussion an authoritarian government, not parenting styles",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Im not talking about parenting styles. \n\nIf a child can be denied lifesaving treatment due to their parents denying it from then, then that child is not free. \n\nIts like theyre property",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ok-One-3240",
                                            "body": "I mean… kids basically are property. Or for semantics, a legal obligation and something a parent holds liability for. \n\nChildren are not, and should not be free. That’s why we put so many rules in place for people under 18 (and 21).",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "I dont think that is a good set up and I wouldnt be shocked if that changes, similar to how women’s rights changed",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ok-One-3240",
                                                            "body": "… that is the most insane thing I’ve ever heard…\n\nWomen’s rights were suppressed using the argument that they were dumber, childlike, and couldn’t survive on their own… which is obviously not true for women. That’s why it changed.\n\nBut kids are dumb, childlike (kinda in the name there), and cannot survive on their own.\n\nAre you like 14?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sad_Lettuce_5186",
                                                                    "body": "No. Im a high school educator \n\nWe need to revise the custodial role so that children arent at the mercy of their parents.\n\nThey cant be expected to get jobs, pay bills, feed themselves, dress themselves, and live alone like adults, however, they ought to have free speech, freedom of religion, the ability to get the healthcare they need regardless of their parents views, they ought to have regulations on their household duties (no child should be forced to labor in the home doing things like construction maintenance), and they ought to have access to a high quality education & childcare regardless of their parents’ income.",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ok-One-3240",
                                                                            "body": "You’re not really arguing for restricting parental rights, you’re more arguing on removing responsibilities of parents. \n\nAlso, for the freedom of religion and speech, I’m not sure how you’d enforce that, specifically on the religious side. Can’t leave a kid home alone legally in a lot of places, nor should you, so I don’t think it’d be right to ban dragging your kid to a church. However I’d be for banning forced participation, but again it’s hard to police that and likely unconstitutional. \n\nFreedom of speech is already granted to kids. I think what you’re arguing for there is freedom from consequences. A kid can call his mom a bitch and the government can’t do a thing about it, however that kid can absolutely be grounded for it.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Fugicara",
                                                                                    "body": "The battles the right is fighting today are often predicated on \"parental rights\" which are effectively the rights of parents to deny those things to their children.  Parents go to school board meetings to fight to deny their kids access to quality sex education, for example.  Laws are passed requiring schools to out children to their parents if they're LGBT, because the parents feel they have a right to know those things about their children.  Book bans in school libraries and curriculum are often based on parents wanting to prevent their children from accessing certain information because the parents think they should have the right to dictate what information their kids get.  Parents are able to deny their children life-saving vaccines and other potential treatments for things like gender dysphoria.\n\nTruly the next battle after LGBT rights, a battle which has already started, will be the battle for children's rights not to effectively be the property of their parents.  This will require curtailing the rights of parents to treat their children like property.",
                                                                                    "score": 2
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Ok-One-3240",
                                                                    "body": "Before I go fully off, what do you mean by free? As I’m 100% for laws making it illegal to deny life saving care. How far ya talking here?",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "islandofcaucasus",
                                            "body": "What part of American society makes you think that children are free from their parents? Unless it's deemed abuse, neglect or the child is old enough to be emancipated, a child does basically belong to their parents. This isn't a novel concept. \n\nNot like that matters anyways because you're off subject. This discussion is about the authority of the government, not an individual parent.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "They arent. \n\nThats my point. \n\nWe’re saying ‘it’s authoritarianism for the government to impede on a parents ability to be an authoritarian towards their child’ \n\nWe do not consider children to be worthy of freedom. Thus, children being made more free is being seen as authoritarian. \n\nIts being treated as a given that children are not to be free. \n\nAs society becomes more liberated, theres a chance that that view will age horrendously\n\nThe government isnt making the child less free by stopping their parents’ authoritarianism. Thus, the government isnt being authoritarian. \n\nYoure effectively saying \n\n‘The authoritarianism is in the government intervening in the parents’ management of their property’",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ok-One-3240",
                                                            "body": "Do you live on some crazy world where you think children and parents are in any way equals?\n\nChildren are not capable of making decisions for themselves, they do not have the mental capacity for them, and they do not have the legal right to make them (generally speaking). \n\nChildren need authoritarians, that word isn’t always a bad thing. Making a kid be home by 8, or brushing their teeth is fine. It’s when that authoritarian abuses its power in extreme ways (conversion therapy, cults, denying medical care) that a state should step in and override the parent.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cabur84",
                    "body": "What about religious beliefs? One of the main reasons people immigrate to America is for religious freedom.",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CummanderKochenbalz",
                            "body": "Religious freedoms should not supercede the ability of someone who cannot consents general well being. \n\nI.e. religious freedom should not include denying life saving or essential treatment to minors, or people in care (unless that person in care is making that decision for themselves as an adult)",
                            "score": 19
                        },
                        {
                            "depth": 2,
                            "author": "Lamballama",
                            "body": "Your religious beliefs can be practiced until they conflict with the law",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "I find religion to be very silly but I am simultaneously a staunch defender of religious freedom.\n\nBut every freedom has limits and always has.  For me completely unjustified and intentional harming of one’s children falls into that category.\n\nWe are also talking about her immunity. Your freedoms end where myfreedoms begin.",
                            "score": 18
                        },
                        {
                            "depth": 2,
                            "author": "carlse20",
                            "body": "I know this isn’t what you’re suggesting, but I’m going to exaggerate to make a point - at what point do we tell people “fuck your beliefs, you can’t keep doing this?” If there were a religion that as part of their sincerely held religious beliefs they sacrificed a child on an annual basis I think you’d get near unanimity in the US that the government has an obligation to stop that from happening, even though it’s also preventing someone from practicing their religious beliefs.\n\nThere’s a saying - your right to swing your fist stops where my nose begins. You can’t use your constitutional rights to claim a privilege to harm other people, especially if those people are unable to defend themselves, like vulnerable children being denied medical treatment because of their parents religion. In my eyes it’s child abuse, plain and simple, and that it’s religiously motivated shouldn’t save the parents at all when it comes to legal culpability.",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "RPG_Vancouver",
                            "body": "You have the right to practice your religion, but you don’t get the right to neglect your child because your religion says so. \n\nIf YOU don’t want a blood transfusion and that will result in your death….that’s your choice to make. But you don’t get to let your child die because of that belief.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mitchell_54",
            "body": "Best thing(one of few good things) the former conservative government here in Australia did was tightening the 'No Jab, No Pay' policy.\n\n> To access family assistance payments, children (up to 19 years of age) must:\n\n> - meet the immunisation requirements for Australian Government family assistance payments (Family Tax Benefit Part A, Child Care Subsidy), or\n> - be on an approved catch-up schedule, or\n> - have a medical exemption recorded on the Australian Immunisation Register (AIR).",
            "score": 47
        },
        {
            "depth": 0,
            "author": "javi2591",
            "body": "Vaccinations for kids. Go to public school? Get vaccinated. No religious exceptions herd immunity is how we cured polio.",
            "score": 88,
            "replies": [
                {
                    "depth": 1,
                    "author": "vibes86",
                    "body": "And we almost had measles eradicated. And then that dumbass doc published his ‘paper’ about autism. Fuck that guy.",
                    "score": 48,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GabuEx",
                            "body": "It always is amazing thinking about inflection points like that.  Where would we be today had Andrew Wakefield not been an asshole?  Maybe anti-vax people would have still been as big, but it's entirely possible they would've have been.\n\nOur eradication of smallpox and our near-eradication of polio are two of the greatest medical achievements in human history.  Fuck anyone who wants to prevent us from doing it again with other diseases.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "vibes86",
                                    "body": "I think that vaccines would be fairly accepted still if that paper hadn’t come out. That paper came out at just the right moment when autism was being diagnosed in lots of children (bc we finally were using the diagnosis not because those folks didn’t exist before) and social media/internet. Too many uneducated folks read that and shared it all at the same time.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "javi2591",
                            "body": "Exactly! People are reversing a century of progress and ridding the country of measles, polio and other life altering illnesses which we have vaccinations for.",
                            "score": 17
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BraveOmeter",
                    "body": "For the record, we've only ever eradicated one disease: smallpox. And it was done using good old traditional methods.\n\nJust kidding it was vaccines.",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "rightful_vagabond",
                    "body": "Mandatory vaccination was literally the justification the Supreme Court used when they said eugenics was fine.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "javi2591",
                            "body": "George Washington locked down Philadelphia because of an epidemic hit the area. The Founding Fathers were keenly aware of vaccinations. Washington even mandated it.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rightful_vagabond",
                                    "body": "I think vaccinations are great, I'm just pretty torn about the slippery slope of mandating them.",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "INFPneedshelp",
            "body": "Everyone must vote,  even if turning in a blank paper",
            "score": 71,
            "replies": [
                {
                    "depth": 1,
                    "author": "DickieGreenleaf84",
                    "body": "One of the things I love about my country (Australia). You must be registered, and you must sign off at the voting booths. After that you *can* leave, but simply the act means most people take two seconds to think about it and most of *them* vote.\n\nBut it is also a social thing. When we had a recent voluntary vote on marriage equality, over 60% of the country still voted on it.",
                    "score": 39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "greenflash1775",
                            "body": "I heard there’s also a voting sausage you get after you’re done. Like there’s a bbq outside the polling place.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DickieGreenleaf84",
                                    "body": "Democracy sausages. Yep. Usually gold coin donation and goes to the local kid's sporting clubs or similar type of charity.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "greenflash1775",
                                            "body": "Brilliant. We should definitely co-opt this tradition in the US. I loved every minute I’ve spent in Australia and things like democracy sausage makes me want to go back.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SleepyMonkey7",
                                                    "body": "If we did, we'd end up passing a law banning voting sausages.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Gigachops",
                                                            "body": "The Voting Sausage Freedom Act\n\nNo sausages shall be cooked, prepared, held in inventory or sold within 2 miles of an urban polling place within 30 days before or after any election.\n\nAmerican country sausage or bratwurst may be served in rural districts.",
                                                            "score": 5
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Ok-One-3240",
                                                            "body": "They’re called freedom sausages, commie.",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Introduction_Deep",
                            "body": "I wish we'd do similar in the US.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "vibes86",
                    "body": "Agreed. If you’re of age, you need to vote, even if it’s blank. I think you should be fined if you don’t.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Ok-One-3240",
                    "body": "Is be for the carrot approach to this, like Australia.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "Agree 100%. Voter registration should be automatic at 18 and voting in every single election should be required by law.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Love_Shaq_Baby",
            "body": "You should be required to have a license to own a gun, the same way you need a license to drive a car.",
            "score": 110,
            "replies": [
                {
                    "depth": 1,
                    "author": "MollyGodiva",
                    "body": "Reasonable restrictions on dangerous items is not “authoritarian”.",
                    "score": 45,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ComfblyNumb",
                            "body": "Who defines “reasonable” though?",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gov_Martin_OweMalley",
                                    "body": "That's the crux of the issue isn't it? When you're dealing with people who think bans and confiscations as \"reasonable\", then the word has clearly lost all meaning.",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "Attack-Cat-",
                                    "body": "Courts and the law. Reasonableness is an objective legal standard.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Ok-One-3240",
                                    "body": "Society. That’s how democracy works.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ComfblyNumb",
                                            "body": "If only democracy actually existed.  When the people are forced to be represented by humans that are at the beck and call of lobbyists the whole idea is sort of moot.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "luckyassassin1",
                            "body": "I've had this conversation with some gun nuts and while most agreed with me some said they'd shoot law enforcement or gov officials who tried to push for that.",
                            "score": 28,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gothamtonian",
                                    "body": "“Thank you for proving my point…”",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "luckyassassin1",
                                            "body": "Yeah, i just walk away because they proved they over react and I'm not interested in having them get aggressive with me.",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "lesslucid",
                                    "body": "So, even just at the point of a person arguing in favour of it, they'd be ready to kill?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "luckyassassin1",
                                            "body": "Some did say that any politician who wants that should be shot, but didn't specify they would do it, most who had that stance just said they'd shoot cops or officials who were gonna confiscate unlicensed firearms, and 1 said he'd probably shoot the one pushing for it. Regardless it's kinda messed up to get that heated about about a hypothetical that most Americans do support, and most of those Americans are likely gun owners themselves and even most gun owners are in favor of it, if you believe polling data.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BackgroundBat1119",
                            "body": "It technically is, but that doesn’t mean it’s a bad thing. We do need SOME authority for things. Can’t have total freedom or else we can’t ensure things like equality, regulations, protections etc.  However as liberals we understand that freedom is also important. As important as air. But a healthy balance is key.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "lesslucid",
                            "body": "Sure it is. Any legal system at all invests authority into that system and says that everyone has to obey it, even if they disagree.  \n\nThe net result of that exercise of authority is, of course, an increase in the amenity, comfort, and freedom of opportunity of nearly everyone in society. It's a good thing. But we shouldn't hide from the fact that that freedom is created through the exercise of a form of authority.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Ok-One-3240",
                            "body": "One man’s authoritarianism is another’s prevention of mass murder in an elementary school.\n\nIt’s about cost benefit, the cost may be some random kids (i guess not random when it’s the leading cause of death in children but who cares) but the benefit is the ability for me to carry around a piece of metal that makes my pp feel at least 4 times bigger (3.2 inches, ladies) and allows me to protect my neighborhood from the “undesirables”. \n\nSo take that libtard, sure it may kill kids, but i have an erection.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hitman2218",
                    "body": "Guns is my issue. I’d be inclined to support mandatory licenses/permits if the process behind it was more stringent. Before a bunch of states went to permitless carry it was common for them to not even require any demonstration of live fire skill before issuing a permit. It’s a joke.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DBDude",
                            "body": "Really, this for most liberals. This is a massive authoritarian streak running through our liberal thought, where we suddenly don't care about any rights as soon as guns enter the picture.",
                            "score": -5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hitman2218",
                                    "body": "Sandy Hook was the last straw for me.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DBDude",
                                            "body": "Nothing could be the last straw for me to stop caring about rights.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "hitman2218",
                                                    "body": "Other than the victims’ right to life, that is.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DBDude",
                                                            "body": "They have a right to life that was violated, and we punish the violators. We don’t punish the innocent.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "hitman2218",
                                                                    "body": "Usually that punishment is death, which is what they wanted anyway.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "DBDude",
                                                                            "body": "At least they're still the guilty, not the innocent. \n\nBut now that you mention it, you are targeting the wrong right. Most mass shooters have one or more of the following motives:\n\n* Fame seeking\n* Direct copycat of another shooting\n* Copycat suicide (Werther effect)\n\nAll of these are fueled by the social and corporate media coverage of previous shootings. So where are the demands for laws to crack down on social and corporate media to remove the motive for these shootings? Mention the shooter's name and get a year in jail; post his picture and get two years. Why should free speech get in the way of saving lives?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "hitman2218",
                                                                                    "body": "Some media companies are now refusing to ID a shooter or focus coverage on him after the initial reporting. I support that. But a shooter doesn’t need corporate media to gain exposure. Anyone with a computer/phone and a social media platform can do the job.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "DBDude",
                                                                                            "body": "Some companies. Let’s arrest the reporters and editors who do. And we arrest the social media posters and execs when social media is used. You’ve already established that we can violate a right to stop the shootings, so why not do it to eliminate the motive and be more effective?\n\nThere were cheap actual military semi-automatic rifles available to the masses in the 1960s with no background check. Millions were sold. Why didn’t we have all these mass shootings with them back then? Simple, there was much less fame, copycat, and copycat suicide motive.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "hitman2218",
                                                                                                    "body": ">Some companies. Let’s arrest the reporters and editors who do. And we arrest the social media posters and execs when social media is used. You’ve already established that we can violate a right to stop the shootings, so why not do it to eliminate the motive and be more effective?\n\nSo let’s say there’s a mass shooting and a couple of students on scene tweet about it as it’s happening. Maybe they ID the school or the shooter or how many dead kids they see. You’re going to arrest them?\n\n>There were cheap actual military semi-automatic rifles available to the masses in the 1960s with no background check. Millions were sold. Why didn’t we have all these mass shootings with them back then? Simple, there was much less fame, copycat, and copycat suicide motive.\n\nOur attitude toward guns wasn’t the same back then as it is now. Back then there wasn’t this militant push to expand gun rights and push them into as many public spaces as possible. I have long said that instead of changing the laws, we need to change the culture and do to guns what we did to cigarettes and drunk driving.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "DBDude",
                                                                                                            "body": ">So let’s say there’s a mass shooting and a couple of students on scene tweet about it as it’s happening. Maybe they ID the school or the shooter or how many dead kids they see. You’re going to arrest them?\n\nI guess it would depend. Anything that makes the shooting make the news more fuels the next shooter, so maybe yes, in order to save the lives of children. Any rights violation is allowed as long as it's to save the children, right? \n\n>Our attitude toward guns wasn’t the same back then as it is now.\n\nIt's changed quite a bit. For example, you've moved to wanting to ban the scary looking rifles. Back in the 1960s much of the gun control that existed was often in reaction to black people owning and carrying guns (such as the Black Panthers). \n\n>Back then there wasn’t this militant push to expand gun rights and push them into as many public spaces as possible. \n\nBack then the gun control people weren't pushing so hard. What you see as a \"militant push\" is a reaction to a strong effort to encroach on the rights of the people. It isn't a coincidence that the same decade the Sixth Circuit finalized the new \"collective right\" theory that let the government violate the right as much as it wanted is the decade that the push against gun control really cranked up. \n\n>I have long said that instead of changing the laws, we need to change the culture and do to guns what we did to cigarettes and drunk driving.\n\nWhat culture? Mine is safe and responsible shooting with any gun I choose, and safe and responsible carry if I want. Why would I want to change that?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "hitman2218",
                                                                                                                    "body": "I wouldn’t stop with the scary looking rifles lol",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "DBDude",
                                                                                                                            "body": "Oh just go full on traditional and ban them for black people. It would probably lower gun violence.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "hitman2218",
                                                                                                                                    "body": "Lol",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "DBDude",
                                                                                                                                            "body": "Gun control has a thoroughly racist history, so may as well own it.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                    "body": "Why stop at Black people?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "DBDude",
                                                                                                                                                            "body": "Well, we did do Asians and others not considered white enough.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                                    "body": "Let’s do everybody, whites included.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "DBDude",
                                                                                                                                                                            "body": "That doesn’t fit with our history of gun control.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                                                    "body": "So what?",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "depth": 22,
                                                                                                                                                                                            "author": "DBDude",
                                                                                                                                                                                            "body": "It the possibility of disarming the common white man was never considered, always quite offensive. So show your true colors and keep with the tradition.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "depth": 23,
                                                                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                                                                    "body": "No.",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "depth": 24,
                                                                                                                                                                                                            "author": "DBDude",
                                                                                                                                                                                                            "body": "You’re right. We have to maintain the facade that modern gun control has no racist elements or effects.",
                                                                                                                                                                                                            "score": 0
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Ok-One-3240",
                                                    "body": "Why should a persons right to compensate for their manhood trump a 2nd graders right to life?",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DBDude",
                                                            "body": "Use of this sexist, projecting trope doesn't help your position. The gun is the right to protect your life, the greatest expression of bodily autonomy. We do support bodily autonomy, right?",
                                                            "score": 3
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "JohnLockeNJ",
                                                            "body": "Isn’t protecting one’s bodily autonomy a greater right than that of a baby’s to live?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[removed]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ok-One-3240",
                                                                            "body": "Sorry mods ❤️",
                                                                            "score": 2
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "AskALiberal-ModTeam",
                                                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Ptcruz",
                                    "body": "I think guns should be allowed, maybe. But I don’t think it should be an supreme eternal right like Americans treat it.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NPDogs21",
                    "body": "How would you make sure the licensing process was done fairly? I think some counties still have to do an interview with the sheriff who determines if you’re of “good moral character.” If a racist sheriff says more black people are not good moral character and deny their licensees, why should they be prevented from owning a gun? ",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Love_Shaq_Baby",
                            "body": ">How would you make sure the licensing process was done fairly?\n\nWe have drivers licenses, we have zoning permits, we have business licenses etc.\n\nI see no reason why licensing gun ownership would be inherently more onerous than any other license.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NPDogs21",
                                    "body": "And the rest of my question? ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Love_Shaq_Baby",
                                            "body": "Not mandating interviews with a sheriff based on good morsl character sounds like a pretty simple thing to include in state statute.\n\n\nI would note though, that the kind of legislation you're talking about having a racist impact is [highly speculative.](https://amp-newsobserver-com.cdn.ampproject.org/v/s/amp.newsobserver.com/news/politics-government/article272850810.html?amp_gsa=1&amp_js_v=a9&usqp=mq331AQIUAKwASCAAgM%3D#amp_tf=From%20%251%24s&aoh=17163860498765&referrer=https%3A%2F%2Fwww.google.com&ampshare=https%3A%2F%2Fwww.newsobserver.com%2Fnews%2Fpolitics-government%2Farticle272850810.html)",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NPDogs21",
                                                    "body": "You’d think but some liberals/Democrats think they’re necessary as owning a gun isn’t a right but a privilege. Its not that big a deal then as they believe no needs a gun. They’re actually talking about requiring social media background checks before buying a gun too, which I’m sure will be misused too. ",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "pupperoni42",
                            "body": "It should be a standardized, objective process similar to the driving test. In some states such as Colorado getting a concealed carry permit is done this way. A person must pass the Pistol Basics class - which teaches safety skills and includes a written test and live fire with decent accuracy and a written test, and the person must be fingerprinted and pass a background check.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NPDogs21",
                                    "body": "And if it’s found that people who are poor/can’t afford to take off work, disproportionately minorities, can’t take those classes, is that an acceptable outcome? Should owning a gun be something more accesible to wealthy/white people if a class and licensing fees are required? ",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pupperoni42",
                                            "body": "Safety / human life trumps class inequality in the case of guns.\n\nThe reality is that a decent quality gun, ammunition, and range time all cost money. Most people working the types of jobs you're referring to can't afford any of that. And if they're not practicing with weapon, they shouldn't own it, since they can't safely hit what they're aiming for and not shoot bystanders instead.  \n\nThe driver license issue definitely needs to be fixed because having a government issued ID is essential for so many basic services.  The fees for a non-driving ID are not cost prohibitive, and people do have the option to learn to drive from friends & family so that can be done at lower cost. I know one area that has each DMV office open 4 days / week for 10 hours/day, and the different locations take turns being open on Saturdays. Between the evening and weekend hours, it's much more accessible.  I realize that rural areas with a single office per county can't do exactly that system, but being open one Saturday and one weekday evening per month would be do-able and help tremendously.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NPDogs21",
                                                    "body": "Is there data that shows legal gun owners are a primary problem when it comes to gun related shootings or that your solution would fix it?\n\nIf we recognize how it’s wrong to treat people different based on race/class, why does it become okay when it comes to buying a legal gun? ",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cabur84",
                    "body": "You do in many states in the US, but not every state.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "MeatloafSlurpee",
                    "body": "It should also be required to register them, like cars.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pupperoni42",
                            "body": "I disagree with that, because if we do end up with a would-be dictator in office who really makes a grab for power, that list tells them exactly which houses to visit and how many guns to confiscate in order to quash the resistance movement. \n\nI'm in favor of mandatory training and skills demonstration to be eligible to buy / own a gun, but against having a registered list.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Fugicara",
                    "body": "On top of this, the license should include a description of the purpose of you owning a gun, and valid purposes would be things where you will be planning to actually using the gun, not things where you have the gun \"just in case\" and hope to never actually use it.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "thyme_cardamom",
                    "body": "I don't understand what about this is authoritarian. It feels like an acceptance of the libertarian framing on \"authoritarian\" meaning \"requiring people to do things\"",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Strike_Thanatos",
                    "body": "Additionally, every gun should be registered like a car, each gun should be locked up when not carried for use (with an exception for a single handgun holstered while sleeping, and possibly guns that are above a certain rate of fire have to be stored at a certified range or gun club.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "JohnLockeNJ",
                    "body": "You don’t need a license to drive a car. It’s only when you take it on public roads that a license is required.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "MemeStarNation",
            "body": "The closest you’d probably get for me is that I’m a-ok with interventionism, as long as war crimes aren’t committed, the cause is just, and the strategy is sound.\n\nIn terms of domestic policy, I don’t support punishing people who aren’t endangering others or our common resources. \n\nI do not, however, consider corporations people. One could argue it is authoritarian to disagree with Citizens United or break up monopolies. I disagree, of course, but you’d likely view things differently as a right-libertarian.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Breakintheforest",
            "body": "Gun control. There is way too many guns out there. It's way to easy to get your hands on a gun and go shoot up a school in this country.",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "islandofcaucasus",
                    "body": "I love that people argue about this by saying \"then only criminals will have guns\". Ok then, if it's so easy to find black market guns, then what are you concerned about. Go buy those.",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DBDude",
                            "body": "I don't think you understand. Let's say guns are banned. \n\nThe regular man, woman, or trans person with a job and a family would be risking it all to illegally buy a gun on the black market, so they are not likely to buy one. \n\nThe career criminal who's already been in and out of prison is not going to care at all about the illegality of buying a gun, so he will buy one. And then he will use it against the now defenseless person above. \n\nThe problem is, it's the criminal above who's committing most of the gun violence, and he's not deterred. You only deter those least likely to commit gun violence. \n\nAs far as \"why have any laws,\" that's easy. I love it when you people say \"Then why have laws against murder?\" There are two kinds of laws, malum in se (illegal because it's inherently evil) and malum prohibitum (illegal only because the government says so). \n\nThese kinds of gun laws are malum prohibitum, victimless crimes. People still want to do it because they know it's not inherently evil. They're along the lines of the old sodomy laws. Sex between consenting homosexual adults isn't inherently evil, but the government made it illegal anyway. So you don't want sodomy laws? \"Why have any laws?\" \n\nMurder is malum in se. Most people don't want to commit murder because they know it's evil, and then we punish those who do that evil. These two types of crimes should not be lumped together.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "islandofcaucasus",
                                    "body": "You know where the fault in your logic lies? That only a miniscule percentage of gun deaths are done by career criminals or from black market guns. The majority of gun deaths are suicide. The majority of gun murders are domestic violence. In fact, a woman is 5 times more likely to be murdered if her abusive partner happens to own a gun. \n\nThen when you talk about \"illegal guns\" you often refer to guns that were purchased legally elsewhere or by someone else.\n\nThis horror story you have in your head of seedy criminals browsing underground warehouses for a gun to come rob your family just isn't the case. \n\nAre there criminals that have guns? Of course. Would the amount of Americans who die from guns every year reduce by more than 50% if guns were banned on a federal level? I have zero doubt.\n\nIt would be painful to implement and maybe not worth the political cost. We've let our gun laws be determined by a bunch of cowards who think ms-13 is sitting outside their home every night ready to bust in. But gun violence can be dramatically reduced if we used some damn common sense.",
                                    "score": 17,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ok-One-3240",
                                            "body": "The cost of the policy would likely be a civil war, or at least a period of domestic terrorism and violence like we haven’t seen in over a century. \n\nBut that doesn’t change a thing about what you said, and I love to bring this part up with the illegal guns crowd. Do you happen to know where the *vast* majority of illegal guns on this CONTINENT come from?\n\nA gun store in the USA.\n\nI really, really think gun nuts think there is a physical black market in every major city you can go to and buy illegal weapons. Nah dumbass, it was bought from Cletus at the local gun store and the SN was scratched off.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "DBDude",
                                            "body": ">You know where the fault in your logic lies? That only a miniscule percentage of gun deaths are done by career criminals or from black market guns.\n\nNo fault because the context was criminal activity. This isn't just official gang members, who do commit a lot of the gun violence. It's the average criminal. Over a third of murderers were on probation or parole from a felony, even more from a misdemeanor (as in pleaded down). Even more were off that status at the time of the murder, and even more had a lengthy arrest record. \n\nPeople with such criminal histories make up a small minority of our population, yet they commit the majority of murders. \n\nOne interesting thing I found when reading the statistics on Milwaukee long ago is that the victim profile is very criminal too. One fifth of victims were themselves on probation or parole, and two thirds had an arrest record, usually lengthy. Other large cities aren't going to be very different. \n\n>We've let our gun laws be determined by a bunch of \n\n... people who actually respect rights.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ManBearScientist",
                                                    "body": "A third of the US has a criminal record (state criminal history repositories have over 100 million records). Nearly half of all black men and 40% of white men are arrested by the age of 23.\n\nOf course most murderers have a criminal record. Most murderers are men, and most murder victims are as well. There is not enough statistical distance between the two to act as if it is easy to determine which men will be responsible gun owners.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DBDude",
                                                            "body": "There certainly is a distance as people with clean records are a minority of murderers. Yet these are the people who gun control wishes to disarm, leaving them defenseless against those they know will not disarm because they don't care about the law.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ManBearScientist",
                                                                    "body": "Again, most of those \"with criminal records\" are just normal men. Most gun violence is not criminal on victim. It's one person shooting someone else they know.\n\nLess than 2% of gun deaths are attributed to gang violence. That's about 440 per year across the US. In comparison, the number of pregnant women murdered via gun was roughly 12,000 (5.23/100k, 68% of which were by gun).\n\nThe most dangerous aspect of guns, aside from suicide, is that they potentially escalate nonlethal interactions between otherwise normal people to lethal encounters. Statistically, people are at far greater risk of their family, friends, and associates with guns than from unknown criminals.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "DBDude",
                                                                            "body": ">Less than 2% of gun deaths are attributed to gang violence.\n\nDidn't I just say it's gangs *and other criminals* committing a disproportionate amount of the gun violence? \n\n>Statistically, people are at far greater risk of their family, friends, and associates with guns than from unknown criminals.\n\nI've seen some of those dodgy statistics. This is especially true since you add \"unknown\" in there, nice try. Most victims know their attackers. This is especially common since most criminals know the other criminals, so they end up knowing those criminals who shoot them. Quite often one of these inter-criminal shootings is due to perceived or real insult, so of course the victim knows the shooter. \n\nBut we don't violate rights based on statistics. I don't think the black community would be very happy if we violated the rights of law-abiding black citizens based on the statistics of the group.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ManBearScientist",
                                                                                    "body": "You are treating criminals like they are a small group of others. They simply aren't. It is reasonable assume that enough men commit crimes after 23 that the literal majority of men have an arrest record regardless of race.\n\nThe idea that we need guns for protection relies on the fear of an unknown stranger assaulting us. But that isn't who commits gun crime. Statistically, gun violence is committed by men we know. \n\nIf guns were massively rarer or harder to get, it isn't like the average man in the country would hold onto black market guns, salivating over the prospect of abusing women or shooting their gunless neighbors.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "DBDude",
                                                                                            "body": ">You are treating criminals like they are a small group of others.\n\nI'm not a violent criminal, I'm not associated with violent criminals, so they certainly are others. \n\n>The idea that we need guns for protection relies on the fear of an unknown stranger assaulting us. \n\nNo it relies on the recognition that many people are in fact assaulted by other people, known or unknown.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CarrieDurst",
                                    "body": "> The regular man, woman, or trans person\n\nWhy add trans? Most trans people are a man or woman",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DBDude",
                                            "body": "Being inclusive, and in this case ascending order of danger to innocents.",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "downvotefodder",
                                    "body": "“These people”",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DBDude",
                                            "body": "Where did I write that, and why would it be bad anyway?",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BrawndoTTM",
                            "body": "Because someone who just wants to be safe usually isn’t going to break the law, whereas criminals who want weapons to do harm will?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "vibes86",
                            "body": "Good point. I’m gonna save this comment for next time my gun but family members throw a fit.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "islandofcaucasus",
                                    "body": "I have, and it of course doesn't work. They'll argue that THEY aren't a criminal, so they'll be punished because they follow the law. You could kind of gloat that they just admitted that gun control would disincentivize an otherwise determined buyer, thus reducing the gun population by at least 1 gun, but they'll just repeat that criminals will still have guns. You could ask them why have any laws at all then, but now you're so far off topic that the argument is moot.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Would that really be less Freedom?",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Gov_Martin_OweMalley",
                    "body": "I'm just glad people are finally admitting the gun control schemes they want in this country ARE authoritarianism.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Silver_Discussion_84",
            "body": "I don't think parenting should be a right, nor should parents have rights over their children at all. Maybe I'm just cynical, but I think the majority of humans on Earth make terrible parents. Being a parent should require obtaining a license, taking mandatory parenting classes, and mandatory psychological screening. \n\nI know this would require a near-perfect government with high trust from its citizens, a negligible level of unwanted pregnancy, and a near-universal agreement in society on what makes a great parent. Because it requires these and other pie-in-the-sky preconditions, I don't bother trying to advocate this idea or believe that it can be enacted in an ethical way at the current time. But a person can dream, at least.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "7figureipo",
                    "body": "Both of my children are individuals, and we've had individual challenges raising them. There is no way on this earth you can convince me that what you propose will eliminate these challenges, or make parents better. Each kid is unique, aside from the basics like food, shelter, and attention given. And nobody knows how a person will act once they have kids--even the most psychologically well adjusted, educated person can be a bad parent.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Socrathustra",
                            "body": "There is such a thing as expertise in handling children. Children are not so unique that we cannot develop strategies to handle them. My partner is a preschool teacher, and it is scary how good she is at working around child behaviors. Our knowledge has improved in large part because we've moved past the model that says some kids are bad kids and others good.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "7figureipo",
                                    "body": "The dynamic between kids and teachers is completely different from that between kids and their parents. There are plenty of teachers that are excellent with their students and complete shit with their own kids. It has little to do with having moved past the model of \"good kids, bad kids,\" really. I won't argue against the notion that there are basics that can be covered, but I just don't see how that can rise to the level of requirement suggested by the GP. They even acknowledge as much in their second paragraph, indirectly.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "candre23",
                            "body": "> eliminate these challenges, or make parents better\n\nOf course not.  What it *would* do is help limit those challenges to those who are actually capable of meeting them, and preventing the bad parents from being parents at all.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ImDonaldDunn",
            "body": "Vaccines should be mandatory for everyone who is healthy enough to take them.",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bearington",
                            "body": "True, but it’s an honest answer to OP’s question",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Both-Homework-1700",
                                    "body": "Was merely giving my opinion",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bearington",
                                            "body": "Yes. And I don’t disagree with you. Know that I didn’t downvote you",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "islandofcaucasus",
                            "body": ">the government telling Americans what to do\n\nCongrats, you've just defined the point of the question",
                            "score": 14
                        },
                        {
                            "depth": 2,
                            "author": "FiveStarPapaya",
                            "body": "Good thing it wouldn’t be optional then lol",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FiveStarPapaya",
                                            "body": "Libertarianism is hilarious",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FiveStarPapaya",
                                                            "body": "Oh well I think progressive ideals and libertarian ideals have a lot of overlap (like letting people just be sexually free and identify how they want). But I def have an authoritarian streak when it comes to things that have a net benefit on society (like taxes, vaccines, laws)",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ImDonaldDunn",
                                            "body": "I could very easily make a “libertarian” argument for mandatory vaccination based on the fact that spreading disease to another person is aggression.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "7figureipo",
                            "body": "Under the hypothetical, it wouldn't be an option. I'd assume use of force, including strapping them down and forcibly vaccinating those who resist, is part of the \"authoritarianism\".\n\nAlso, I'd agree with this one. Vaccination isn't about *just* individuals' bodies, it's about our collective health and protection from fatal diseases. Not the same as other medical procedures.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "I’m for bodily autonomy, BUT if you refuse vaccines, you should absolutely be barred from public spaces.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "bearington",
            "body": "- Repeal 2A and have a steep requirement test for gun ownership. \n- No public funding of private, charter, or home schools. \n- Forced restructuring of the Supreme Court.\n- tax churches \n\nIf you disagree please say why. I’m responding to OP’s question in good faith. If you think these don’t represent authoritarianism, please scroll on. I may be pedantic, but not so much that I googled the term before responding",
            "score": 32,
            "replies": [
                {
                    "depth": 1,
                    "author": "PupperPuppet",
                    "body": "The only issue I have is with taxing churches.  Doing that will give them the right to representation and open up a shitload more lobbying attempts to push religious agendas.  That separation needs to be enforced much more heavily.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ok-One-3240",
                            "body": "I was going to say this. I don’t mind religious entities being tax exempt. I mind for profit cults using religion to get out of tax.\n\nEnforce the apolitical requirements, and set strict rules in the IRS for what is and isn’t a church. It’s the only part of our tax law that’s intentionally vague.\n\nThat and charter schools. Charters can be good, and I am a beneficiary of 2 of those schools. Some states have really good regulatory systems for charter schools and we should follow them on a national level.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kerplonk",
                    "body": "In what manner would you restructure the Supreme court and why do you think that would be authoritarian?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bearington",
                            "body": "Remove Thomas, Alito, and Kavanaugh and replace them with better people. Regardless my reasons for each of them, it would be authoritarian because my wishes would be to just do it, not go through constitutional processes to do so. The other changes I'd like to see would not be authoritarian",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pupperoni42",
                    "body": "I disagree with repealing the second amendment, but would like to see it interpreted more in alignment with the original intention. So an amendment to update the language would be good.  The key phrase \"a well regulated militia\" is overlooked by many. Militias trained together, which means that the members learned gun safety, marksmanship, and had a healthy respect for weapons. \n\nAnd the phrase \"bear arms\" had a distinctly military connotation at the time. It was not meant to imply that everyone should be able to carry a gun all the time and can't have that right taken away if they're idiots or dangerous. \n\nThat being said, January 6th shifted me a lot closer to your position. It's the one time in history that I'm aware of that the key scenario 2A was intended to prevent - a president declaring himself dictator and refusing to relinquish power - actually happened. And the gun nuts didn't use their weapons to stop him, but instead to help him.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "BackgroundBat1119",
                    "body": "I disagree with repealing the 2A. It sets a bad precedent. Instead we should simply interpret it as it was intended. It should also be further amended for the times. I even believe that individuals should have the right to defend themselves, sure, but nowhere does the 2A give us the right to *any and all* means of defense, such as mass lethality offensive weapons. Bearing arms could be anything, not everything…",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ok-One-3240",
                            "body": "I need a 2.7 megaton nuclear bomb to protect my home and family though.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Gov_Martin_OweMalley",
                    "body": "> Repeal 2A\n\nDon't disagree, that is peak fashie boot licking.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "CarrieDurst",
            "body": "I don't care about your religion, sending your kids to conversion camp should make you lose them, that is my authoritarian stance on the subjects that don't have a moratorium lol oh and a ban on religious exemptions. If we can make an exemption for religions we can extend it to everyone",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "Attempting to force a pregnant minor to give birth should also result in the removal of the child from your home.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "PeasantPenguin",
            "body": "The question \"Why do you want this job\" should be banned from job interviews.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Illuminati_Shill_AMA",
                    "body": "People would stop asking it if everyone in the world answered honestly: because you're offering me money to do it and I have expenses.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PeasantPenguin",
                            "body": "I'm autistic and have a complete inability to lie effectively for 30 minutes while maintaining eye contact. If it wasn't for the fact that I can work for the state, who the union bans stupid questions like this in the job interview process, I would be homeless and starve.",
                            "score": 10
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "Also, there’s a federal law that makes it illegal to tell employees not to discuss their pay, but it gets ignored all the time and employees are (especially in “at will” states where they don’t have to have a reason to fire you) basically under threat of termination if they get caught doing this. To combat this, it should be mandatory that all employers must have an up to date list of employee salaries posted in plain view at all times, just like the OSHA posters. And there should be random surveys conducted to make sure they’re in place.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "toastedclown",
            "body": "- I don't think private schools or home schooling should be allowed.\n\n- I think vaccinations should be mandatory in most public spaces, with only health exemptions.\n\n- We need more traffic enforcement cameras - a lot more - and penalties should escalate severely after multiple offenses.",
            "score": 31,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gov_Martin_OweMalley",
                    "body": "> We need more traffic enforcement cameras - a lot more - and penalties should escalate severely after multiple offenses.\n\nOnly if we make the fines proportional to a persons wealth. Otherwise, pass on the nanny cams.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "toastedclown",
                            "body": "It perfectly fine with that.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gov_Martin_OweMalley",
                                    "body": "Nice.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sevenorsix",
                    "body": "> We need more traffic enforcement cameras - a lot more - and penalties should escalate severely after multiple offenses.\n\nThis is mine. I know this can be abused but the way some people drive, they deserve to be thrown into an active volcano.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SuchRuin",
                            "body": "I really think repeated offenders of reckless driving, DUIs, street racing/sideshows and texting while driving should be sent to prison. Not jail, prison. Prison should be reserved for people who are a danger to society and those people are dangers to society.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "the_jinx_of_jinxstar",
                    "body": "I’m ok with traffic cameras but I feel like cities get reliant on that cash. There are road in the city near me that used to be 40mph speed limit. Now they are 20 because people started following the law and the ticket money stopped coming in. It’s annoying as hell driving on the few large roads and such. Slow speed for no reason.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "7figureipo",
                    "body": "* We need more traffic enforcement cameras - a lot more - and penalties should escalate severely after multiple offenses.\n\nFine: as long as they are used to equally enforce against assholes that putter along at 5-10 mph below the speed limit, take half a fucking minute to get through an intersection, and impede traffic in so many other ways as they are to get other violators, which is who they're usually targeting.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "toastedclown",
                            "body": ">as long as they are used to equally enforce against assholes that putter along at 5-10 mph below the speed limit, take half a fucking minute to get through an intersection\n\nAre those actually violations?  And if so, are they actually jeopardizing anyone's safety?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Socrathustra",
                                    "body": "I don't think they are considered violations, but they do make people less safe, because they are not predictable.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "7figureipo",
                                    "body": "When they're impeding the flow of traffic, yes to both. That's why they're violations.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "toastedclown",
                                            "body": "Ok.  Show me the relevant statute from a typical jurisdiction.  \n\nYour complaint about people taking \"half a fucking minute to get through an intersection\" makes you sound like one of those unhinged psychopaths that lays on the horn and cusses out people for doing idiotic things like making sure the intersection is clear, yielding to pedestrians, and trying not to get T-boned while taking an unprotected left turn.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "7figureipo",
                                                    "body": "Braking when a minor curve in the road occurs, taking forever to change lanes, getting on the freeway at half the speed limit, unnecessarily braking to a near stop before making a turn, slowing down before entering an exit ramp on the freeway, hovering in the blind spots of other vehicles, etc. \n\nThese are all bad driving habits and when they introduce abnormal flows of traffic and unpredictability that interfere with the normal flow of traffic, they're as dangerous as any lane weaving prick. And I see them every day, far more often than I see tailgaters and lane weavers.\n\nIn fact, I'd amend my initial comment: I think these drivers should be ticketed even if they don't impede the flow of traffic. If we can snag speeders just for speeding even when there is very little traffic, we can snag these jackasses, too, because they're: a) more common and b) at least as dangerous.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "toastedclown",
                                                            "body": "In case you are wondering (which I 'm sure you're not) this certainly isn't making you sound any less like the person I described in my earlier comment.",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "grolaw",
            "body": "1. Eliminate concentration of wealth in the hands of a few. We have no shortage of food, housing, education, healthcare, and general infrastructure but for the policies baked into our statutes through regulatory capture. \n\nThis sounds impossible but the U.S. has accomplished substantial retrenchment of concentrated wealth twice in the last 140 years. The first time was Teddy Roosevelt breaking up the business trusts. \n\nThe second time was under FDR. \n\nSocial Security cut the death rate of over 60 year olds by 70%. Not that hard when the primary causes of death for that age bracket was exposure in the winter & starvation in the summer. \n\nThe Fair Labor Standards Act of 1938 \n1. Set 40 hours in 7 days as the work week.\n2. Created overtime compensation for work more than 40 hrs/wk.\n3. Established the minimum wage.\n4. Abolished child labor. Nobody under 16 (farm work excluded) could work for a private employer. Mom & Pop shops were watched. \n5. Created the Unemployment Compensation System that required states to adopt legislation in order to participate. \n\nOne day you went to sleep in 1938 where you worked 80-100 hours at the bakery or in the mine/factory along side of 12 & 13 year olds. The next day the children were prohibited from working, your work week was cut to 40 hours, you had an income that permitted you to have a reasonable standard of living, and if the bakery burned down you could collect unemployment while looking for another job!\n\nWhat would happen to most of the problems in the USA if everybody had a job that provided the purchasing power that $150,000.00 /yr gives? \n\n[Rand Study Trends in US Income 1975-2018](https://www.rand.org/pubs/working_papers/WRA516-1.html)\n\nThis is where we would have been had the legislatures & courts not been captured by the very wealthy. In my lifetime the single most expensive component of my life in the USA is health care. I’m an attorney. My father was an attorney & my mother a physician. They lived through WWII & reaped the benefits of FDR’s New Deal. \n\nNobody I know, professional or otherwise, thinks our nation is providing for the general welfare of its citizens. It’s time to tax the billionaires out of existence.  UBI may well be the only way to get money back into the hands of the people who need it to raise a family and live a good life.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "RealDealLewpo",
            "body": "A company like Boeing where 2 people blow the whistle on its wrongdoing before dying under suspicious circumstances should be nationalized.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "pizza99pizza99",
            "body": "You should have to pass a basic morality test to be given any legal custody of children. I once said this in front of a teacher and she nodded her head… so take that as you will. But my general reasoning is way to many people want children to be miniature versions of themselves, or don’t have nearly a good enough grasp of the fact that this is an entirely separate living, breathing being. It is also way too incredibly normalized to give children outright cruel punishments that if given to any adult would be considered completely unacceptable, as well as completely ineffective. To have complete and utter legal control of someone with little oversight is waaaay to attractive to the wrong type of person",
            "score": 5
        },
        {
            "depth": 0,
            "author": "HerbertWest",
            "body": "I believe that if a private company cannot provide something that is an essential service, then the government should be able to seize their operations in that area. For example, there are many prescription drugs experiencing shortages right now, like Adderall. People are unable to get a drug they need. In cases like that, the government should be able to say, \"you have failed your responsibility to society; the formula is now public domain and we're going to start producing the drug ourselves to fulfill demand.\" \n\nI also believe that any industry that, if it failed, would cause a complete economic collapse, should either have a public alternative or be completely nationalized. One example is airlines. If they all went bankrupt, we'd be fucked, so we've been forced to bail them out over an over. Well, maybe give an industry one free bailout but with the stipulation that if they fail again they will be nationalized.\n\nEdit: As I understand it, the drug shortages have something to do with the fact that it's not profitable to produce them at the moment. That's the kind of scenario I mean; not something unavoidable, like a shortage of components.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "AutumnWak",
            "body": "I believe countries with a cartel problem should crack down hard with violence against the cartel, mostly by assassinating high ranking members. People say \"just legalize drugs and the cartel will go away\", but they don't realize that cartels operate in a manner similar to the mafia. Drugs are usually just a portion of their income. They make a lot of their money by threatening local populations with violence if they don't pay up, in addition with legitimate businesses.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "BalticBro2021",
            "body": "Schools should be allowed to vaccinate children with or without parental consent if they have not previously received their shots.  \n\nAlso repeat DUI offenses should be punished much more severely than it is currently.",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "beulahjunior",
                    "body": "i don’t think they should be allowed to vaccinate but i think they have the right to not let them go to school there",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BalticBro2021",
                            "body": "No because the kids' education is suffering as a result of their anti-vax parents then, the kids shouldn't be punished because of it.",
                            "score": 5
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FiveStarPapaya",
            "body": "Vaccine mandates without religious exemptions. Medical exemptions sure, but I think everyone should be vaccinated.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "allhinkedup",
            "body": "I would certainly favor absolutely brutal punishments, fines and sanctions for environmental polluters. Lock them up. Seize their property. Never let them work in the business again. We simply must stop corporations from destroying the one planet in the known universe that we know for a fact will support human life. It's mad.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "CraftOk9466",
            "body": "Nicotine should be a schedule 1 drug.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "beulahjunior",
                    "body": "can you expand on this? i’m curious",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GabuEx",
                            "body": "It has no medical benefits, it's highly addictive, and it is one of the biggest single causers of death there is.  If nicotine were a synthesized drug we invented today, rather than being grandfathered in, it *absolutely* would be schedule 1.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "beulahjunior",
                                    "body": "they are actually trialing nicotine in a series of neurological disorders. nicotine itself does not cause death, it’s the tar and chemicals.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Embarrassed_Put_8129",
                                            "body": "Nicotine causes hardening of the arteries leading to atherosclerosis and other heart disease, it impacts blood flow which leads to heart attacks and strokes and also impedes wound healing.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "beulahjunior",
                                    "body": "https://clinicaltrials.gov/study/NCT00873392",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "WingedShadow83",
                                    "body": "Also, it kills other people besides those using it. Second hand smoke can give you cancer even if you’ve never smoked a day in your life. But no one ever died from breathing the same air as someone who was shooting heroin.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SlitScan",
                                            "body": "thats not the nicotine, thats the Tar.\n\nnicotine itself isnt carcinogenic (unless you heat it to something like 600^0 and crack it (and even then its within the noise ratio on whether it is or isnt))",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "WingedShadow83",
                                                    "body": "Yeah, I was specifically talking about smoking. Was just expanding on the OP’s comment with an “authoritarian stance” of my own, ie, I think cigarettes should be outlawed because they harm other people and not just those who choose to smoke. I don’t care if people want to chew (other than how gross it is to see the spit) or wear 20 nicotine patches or whatever.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "arjungmenon",
                    "body": "+1. This would be great for health.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "Gov_Martin_OweMalley",
                    "body": "Id put booze up there too.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheQuadBlazer",
            "body": "Stay the hell off my lawn, kid!",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Maximum_joy",
            "body": "I mean all opinions are equal but mine are just the best, you know?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Kimmie_Morehead",
            "body": "pharma pricing regulation and single family home property ownership limitation.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Candid-Oven2951",
            "body": "Ban giant SUV's and giant trucks without a verifiable need. There are plenty of smaller SUVs that can be used for semi offroading, and plenty of smaller trucks that can be used for towing or hauling. Owning a business, being apart of a company can get you a license to own one. I'm tired of 90,000$ death machines on the road to haul 100$ worth of groceries.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "ThatMassholeInBawstn",
            "body": "Every child should be vaccinated. \n\nIf someone doesn’t vaccinate their child, they’ll loose benefits",
            "score": 3
        },
        {
            "depth": 0,
            "author": "mrprez180",
            "body": "There should be far worse consequences for student violence against teachers. Public school teachers are already criminally underpaid for how crucial they are to society, and it doesn’t help that it isn’t uncommon now for a teenager to physically assault their teacher and get off with suspension. I’ve met teachers who are scared to go to work for that reason.\n\nIf a student puts a teacher in the hospital, it should be an automatic expulsion and jail. Not some second-chance bullshit.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "My mom is a public HS teacher so I’ve said this before, but… I think there is a certain point where students should not be allowed to continue wasting educators’ time and state funds. If you have made it all the way to high school, and you are still refusing to turn in assignments on time, failing every test, being combative with the teacher and having to be kicked out of class all the time, (and your home life has been evaluated and there’s no good reason like abuse or neglect as to why you are unable to comply with the rules, or there is a good reason but you rejected the attempts at intervention) then you are a drain on the education system. You are a detriment to the students in the class who actually want to learn, because you are taking away the teacher’s focus from those students. After a probationary period, if you still don’t have your act together, you need to be permanently expelled from the school. You can try your luck at secondary school or a GED after that.\n\nMy mom has students that turn in 0/30 assignments every semester. For no other reason than that they just don’t care. They are wasting her time, and my tax dollars.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mrprez180",
                            "body": "God bless your mom, she’s probably a far more patient person than any of us. I’ve seriously considered becoming a history teacher before but I just can’t picture myself taking that route because the pay is awful and so many kids are impossible to deal with.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "WingedShadow83",
                                    "body": "She calls me every afternoon on her way home from work to vent her frustration. She spends more time dealing with difficult students than actually teaching. She gets cursed out/has things thrown at her for asking students to put their cell phones away in the middle of a test. She sends them to the office and the administrators do nothing and then send them back to class. She feels hopeless.\n\nI think she’s got four more years after this one before she can retire. I can’t wait. I think a lot of her health issues will probably improve once that stress is taken off of her.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "HerbertWest",
                            "body": "Where I'm from, there are already \"alternative schools\" for kids with severe behavioral issues. Perhaps more of those could exist instead of just kicking kids out? Perhaps they could create programs specifically for those kids you're talking about instead of just those with behavioral issues.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "Singapore had the right idea. Anyone who sticks chewed gum on the underside of a table or bench should receive public caning.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "TimTheRandomPerson",
            "body": "Everyone should be registered as an organ donor by default. If they opt out of organ donation, they should be sent to the bottom of the recipient list.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "fastolfe00",
            "body": "The only countries that will survive in the Age of Disinformation will be those that manage the flow of information. The First Amendment guarantees that the US will be the first to eat itself.\n\n(You can even find conservatives here who believe foreign-controlled bot- and AI-generated disinformation should be protected speech and the Foreign Agent Registration Act should be weakened to protect the privacy of foreign agents engaging in information warfare against the American people. It's like we *want* to be victims.)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Dr_Scientist_",
            "body": "There's no point trying to change human behavior. It's better to make the kind of behavior you want to stop impossible.\n\nSo like let's say for whatever reason you want people to slow down. No more speeding.\n\n* Reducing the speed limit is pointless\n* Encouraging people to slow down is pointless\n* Writing more tickets or increasing the penalties for speeding is pointless\n\nThe place you should *START* at is re-designing the roads so that speeding is impossible. It's the most intrusive, disruptive, and would likely only be accomplished through near dictatorial fiat - but it's the only solution that's actually going to achieve the stated goal.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "merp_mcderp9459",
                    "body": "You can do this pretty easily in residential and school zones by slapping some speed bumps down. But also, I think you can definitely discourage speeding without road redesign - you just need actual penalties for speeding instead of a $100 ticket",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kaka8miranda",
                            "body": "In Brasil they got speed bumps on highways so you can’t continuously speed and speed cameras. \n\nNo flash you just get a picture of you driving and a huge fine in the mail",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FiveStarPapaya",
                                    "body": "That’s fucking nuts. I need to see videos of people going 80 mph over a speed bump lol",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FreshBert",
                            "body": "Roundabouts can also help. You can't fly through them at high speeds and can't use them for sideshows. I live in SF and they've started placing them every few blocks in residential neighborhoods, along with more speed bumps.\n\nSo even if you're willing to fuck up your suspension driving over speed bumps at high speed, you can only run maybe 5 to 10 stop signs at most before you hit a roundabout and are forced to slow down.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Doomy1375",
                    "body": "You can change human behavior pretty easily actually- but fines and road signs are not the way to do so, and will do fuck all. You have to know why the behavior you are targeting is the way it is, and what steps you can take to reduce it.\n\nYou want people to slow down? You don't have to make speeding physically impossible, you can accomplish the goal by simply dissuading it by design. Make the roads narrower, put more stuff (like trees or buildings) on the side of the road with minimal setback, get some tree cover (or other structures, like walkways between buildings) hanging over the road. Do that, and people will *naturally* slow down, despite there technically being nothing stopping them from still blazing down the street at high speed. Because while you didn't make speeding impossible, you exploited the psychology of most people to make them reduce their speed to what they consider the proper speed for the environment they are driving in. Wide open spaces with wide lanes make people want to drive fast. Narrow lanes with not a whole lot of space between the road and the nearest tree/building, by contrast, makes people want to drive slower.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WingedShadow83",
                            "body": "And stop making non-emergency vehicles with the ability to go 120+ mph. The max speed should be much lower.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "candre23",
                    "body": ">  re-designing the roads so that speeding is impossible\n\nThat's a silly take.  The correct approach is to re-design the roads so that speeding is safer.  Germany has no speed limits on its autobahn, and the accident rate is lower than US interstate highways.  The roads were designed from the start to facilitate *safe* high-speed travel.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "beulahjunior",
                    "body": "there’s actually a bill introduced in PA legislation to offer community service OR a fine for traffic violations",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "feralcomms",
            "body": "No religious tax exempt housing zoning.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bthvn_loves_zepp",
            "body": "I recently visited a country I would categorize as a \"benevolent dictatorship\"--it's a very modern, wealthy country that does a lot of international business, is majority public housing, has tons of greenery, and is extremely clean.   \n  \nOne thing that impressed me is that they have compulsory individual financial savings--not just tons of public housing (which btw even with 90% public housing they STILL are in a housing shortage and having price issues, so building more public housing isn't THE ONLY ingredient needed to solve that issue like so many folks seem to think).\n\nI think the concept of an antidote to \"this is why we can't have nice things\" really hit me when I realized that this wet, tropical, hot, humid island country had NO bugs--even along the river--and it turns out it's because whoever is responsible for a property gets fined each time and increasingly if bugs are found--this IS important bc of dengue fever risks--but also a microcosm of how it's not actually that big of a deal to enforce rules if it is decided that that is the M.O.--this country now requires that developers replace 100% of developed land footprint with reciprocal greenspace in the design by law--without controlling something like bugs this would be a nightmare--in NYC it would be waterbug city.\n\nThis country definitely misses out on some civil liberties and freedom of speech--I'm not sure how a society can be built to allow dissent but also enforce quality of life laws that--like managing bugs  therefore having ample greenspaces bc they are manageable--do amount to systemic differences in our shared environment for the better, despite how I would imagine folks would overlook these quality of life issues in the shadow of individual rights on all sides of the political spectrum, both freedom from govt and freedom from law enforcement.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ManBearScientist",
            "body": "I think that a large portion of the Republican Party's leaders have factually committed crimes and use their political status to avoid being punished. An authoritarian move to actually jail them for their actions would probably help the country.\n\nFor example, the frequent trips to Moscow for funding and orders. Incitement and sedition related to January 6.  Insider trading. Campaign finance violations. Rampant use of drugs and prostitutes.\n\nFor an example of this, see Texas Attorney General Ken Paxton who was indicted on felony securities fraud, alongside allegations of bribery, whistle lower retaliation, and attempting to overturn the 2020 election in other states.\n\nPaxton avoids jail through political power. It has been nine years since he was indicted for securities fraud and he still hasn't even gone to trial. In March, he cut a deal with prosecutors to have his charges dropped and avoid a jury, after he flipped one witness and another literally died of old age.\n\nI would also probably crack down on quackery and scams. Chiropractic, fake supplements, 'alternative' medicine. People that aren't doctors, dieticians, or physical therapists shouldn't be allowed to act as one. Emotional support pets are not trained service animals.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BeneficialNatural610",
            "body": "Parental rights are overrated. Every kid deserves healthcare (vaccines, gender dysphoria counseling, etc), regardless of parental beliefs. Kids also need to learn about uncomfortable subjects in school like war, race, sexual orientation, sex, colonization, existence, etc. They need to be challenged so they can form their own opions. Sheltering them from these issues is doing them a disservice ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "twilight-actual",
            "body": "I don't have one.  And honestly, after the backlash of Covid, if we have another incident like it, where say, only 4% of the infected die?  I say we tell everyone what to do, and then just leave it up to the population to figure out how they want to live.  No more mandates, or passes or cards, or anything else.\n\nIf Republicans want to go to super spreaders and off themselves, especially the ones that don't take care of themselves, are obese, smoke, etc.  Good riddance.  I feel for the immune-compromised, but honestly the backlash is almost threatening to tear apart our society.\n\nIf we do ever have a plague where say, 50% die?\n\nThen I go authoritarian on lockdown and following protocols.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "DickieGreenleaf84",
                    "body": "The problem with this is that you can't have 100% protection so if 20% of the people around you have COVID you are in greater danger than if 2% do. Which puts the immunocompromised, especially the children, at *much* greater risk.\n\nSo is the backlash really that bad if it saves hundreds (or even thousands) of children?",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "twilight-actual",
                            "body": "The risk of concern isn't contraction.  It's the ratio of those infected to those who die.  And in retrospect, I don't think that ratio warranted the degree to which we shut everything down.\n\nAnd I don't think we've even begun to understand the backlash.  What happens if the next viral wave is really a killer, and the anti-establishment / anti-vax / anti-science crowd is so deeply entrenched that there's a complete mutiny against even the most sensible restrictions or changes?",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "I felt that anyone who refused the vaccine for non-medical reasons should have been denied care for the virus. It’s not fair to put the medical staff in jeopardy.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "SlopesCO",
            "body": "The rights of the many outweigh the few. So, I'd support mandatory vaccinations. Those unable or unwilling would be quarantined. Also, all citizens should serve their country for a couple of years like in Germany. If you're a conscientious objector, you could opt to teach or be a paramedic.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "prizepig",
            "body": "We should bring back the stocks as a form of punishment.\n\nSpecifically for crimes that can't effectively be punished by fines, but also don't warrant jail time.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "Many of them still believe that vaccines cause autism. How do you educate those people to get them to change their minds?",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "FiveStarPapaya",
                                            "body": "Okay but we’ve been educating people and not forcing  it and people are still not getting vaccinated",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LiamMcGregor57",
            "body": "Tax churches.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "PupperPuppet",
                    "body": "Had to paste my comment from another thread. \n\nThe only issue I have is with taxing churches.  Doing that will give them the right to representation and open up a shitload more lobbying attempts to push religious agendas.  That separation needs to be enforced much more heavily.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WingedShadow83",
                            "body": "Hmmm… how about instead of “taxes”, they get levied with some kind of private business fee? But the fee doesn’t go directly to the government, it gets earmarked for helping the homeless population. I mean, that’s basically still taxes, but without being called that. Are you entitled to representation if it’s not technically labeled a tax?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SlitScan",
                                    "body": "fines, you stick your nose in politics. then youre out a few million.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WingedShadow83",
                                            "body": "Good one!",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ptcruz",
                            "body": "How are taxes and representation linked? I don’t get it.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PupperPuppet",
                                    "body": "Remember the OG Boston Tea Party?  It was a revolt by the citizens because they were forced to pay taxes while not having representation in the government.  The last thing we need is to legitimize any claim churches have that they can impose their will on lawmakers.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ptcruz",
                                            "body": "But that’s for people. Do companies have a representative too? To NGOs have a representative? The clergy and the people involved in churches already have representation. They can vote and run for office.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gothamtonian",
            "body": "People that refuse to obey our laws must be contained if they won’t be corrected. The rest of us shouldn’t suffer because you refuse to be a civilized member of society.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Dell_Hell",
            "body": "Maximum voting age of 78 - After that, you are a \" Short timer\"\n\nCan't serve in an elected position after age 75.\n\nMandatory driving tests and medical checks every two years starting age 70.\n\nSevere penalties for doctors who fail to report patients who should not drive,  including losing the medical license or potentially being charged as contributing to the fatalities. \n\nBrutal enforcement of white collar crime laws - with draconian punishments. Like Trump's crap gets punished with brutal, horrific torture on live stream. Not just him, every person that was an accomplice in any way.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "NPDogs21",
                    "body": "Damn, even Bernie is on the chopping block. Why do you support regressive policies when it comes to taking away peoples right to vote or hold public office after an arbitrary “old” age? ",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "Agree, but I’d lower the minimum age for voting and I’d lower it even more for elected offices. You should not be allowed to write/vote on laws that you will not likely be alive long enough to be affected by. \n\nI think maybe 70 for voting? Or, better idea, you can keep voting… as long as you take and pass a competency exam before every election. For that matter, people of all ages should have to take a some form of IQ test every 5 years to be allowed to vote, and also a test proving competency in things like government and basic economics. And as long as you keep passing, voting is mandatory. \n\nI think the cutoff for running for office should be 60. Too many out of touch dinosaurs in office making laws about things they don’t understand because they stopped trying to keep up with the times. And it goes without saying that running for office should also require IQ and competency tests. \n\n\nAnd I wouldn’t call this authoritarian, but since we are on the topic of politics… I don’t think politicians should be allowed to change their political affiliations while in office. If you were elected as a Democrat/Republican, then that is what you should have to remain while you were in office. (And your voting record on bills should reflect it.) If you want to change it after term and run again, fine. But if people voted for you, expecting you to align with a certain set of ideals, you should have to uphold that. If you decide to change your designation while in office, you should immediately be replaced by someone of whatever party you originally claimed to be a part of, until a new election can be held.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "whitewail602",
            "body": "Chick-fil-A should have to open on Sundays.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "yaleric",
            "body": "Speed limits should be enforced by ubiquitous cameras that mail a ticket to the registered owner. Cops should aggressively ticket people driving without valid plates.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "All cars should have mandatory dash cams. All police officers should have to wear body cameras and have them turned on at all times while they are on duty, no exceptions. Politicians should have to do this as well. Noclosed door, undocumented meetings. Full transparency for anyone who draws their paycheck from tax dollars, be it federal, state, or local.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "WlmWilberforce",
            "body": "Most people who back into parking spots should get a ticket.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "cossiander",
                    "body": "Uh oh, I'm feeling called out. What's wrong with backing into parking spots?",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WlmWilberforce",
                            "body": "Personal pet peeve I guess, but here goes:\n\nNothing worse than a line of cars going into a parking deck, then seeing the car in front of you go past a spot (so you think maybe it's yours). Then they roll off to the side, and throw it in reverse.  More annoyingly, I see so many who can't make it in without a few tries while the rest of humanity waits.  I feel like you lose 10x the time going in that you save coming out.   \n\nThen there are the Al Qaeda sympathizers who back into a slanted spot facing the wrong direction.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "Hey, one of the privileges of my compact car (Honda Fit) is I can park horribly crooked yet still be within the lines.",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "vibes86",
                    "body": "I think it should be the opposite. Too many people not paying attention back into others in a parking lot bc they’re fiddling with stuff in the car and backing out. Back in first! 🤔",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "greenflash1775",
                    "body": "I recommend you never go to Japan, backing in was the norm.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WlmWilberforce",
                            "body": "Been to Japan, never noticed this.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "greenflash1775",
                                    "body": "Lived there for almost 5 years. What was funny was going onto American military bases where most people pulled in forward and then to off base areas where most backed in. No idea what drives the difference in behavior.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "growflet",
                    "body": "But backing in is safer in every situation - because you are driving forward when pulling out of the space.\n\nHave you ever parked head-in with a giant SUV on each side? You are backing into actual traffic 100% blind. Thoughts and prayers!\n\n* when I am reversing, I am moving into a reasonably protected space - an empty parking space - at a very slow pace.\n\n* when i am going forward out of the parking space, into actual traffic where cars and pedestrians are far more common, you have ten times the visibility and generally better control of the car.\n\nThe exception would be diagonal spaces. There is an intended direction for you to park, and you have a better view behind you due to the angle of the space.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WingedShadow83",
                            "body": "I’m glad you brought up giant SUVs…\n\nOutlaw them. They don’t need to be that big. Nor do passenger trucks if they aren’t for hauling farming equipment, etc. \n\nAlso, outlaw any vehicle modifications that cause ridiculous amounts of noise pollution. For motorcycles, too.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "growflet",
                                    "body": "I'm down with that.\n\nThe whole CAFE standards thing was good intentions, but ended up creating a worse problem with the SUV loophole.\n\nAnd there's absolutely no reason for incredibly loud performance modifications, or excessively bright additional light bars at eye level and such.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WingedShadow83",
                                            "body": "> And there's absolutely no reason for incredibly loud performance modifications, or excessively bright additional light bars at eye level and such.\n\nI’m convinced that people do this stuff for the sole purpose of bothering/inconveniencing other people. They *want* to disturb and annoy.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "growflet",
                                                    "body": "It's also showing off.\n\nHaving unrestricted exhaust from the engine improves performance in an internal combustion engine. The less restriction, the more horsepower.\n\nThe loud pipes are supposed to indicate how powerful the engine is.\n\nIt's basically a giant dick waving contest.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "rqwy",
            "body": "Homeschooling needs to be more regulated and those regulations need to be uniform across the country, not state by state. I don’t necessarily oppose homeschooling - especially given the state of the education system and school safety issues in this country - but believe that every kid deserves a basic education and the opportunity to really thrive. Some homeschooling parents are not providing that and are using homeschooling as cover for child neglect and/or indoctrination with garbage (e.g. flat earth). Depriving your child of basic knowledge and feeding them lies is abuse, IMO.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "GabuEx",
            "body": "A lot of liberals recoil at being called anti-gun.  And reasonably so, given that American gun culture is so thoroughly ingrained in society and proving your gun bona fides is a big part of being within American Overton window acceptability.\n\nBut what with my having no intention of ever running for office, yes, I am anti-gun.  Fuck guns.  I absolutely support repealing the second amendment so we could have actually reasonable gun control without the fucking crazies fucking it all up.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "InquiringAmerican",
            "body": "People who still believe racist and bigoted things, after their beliefs are explained to them as racist and bigoted, should be fired and canceled. The same for influential people who knowingly promote election fraud lies. All of them should be permenantly banned from social media.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "I think anyone who routinely posts bigoted things online (racism, misogyny, homophobia, etc) should have their name put on a searchable bigotry registry accessible by the public, and their name on the list should be linked to a document showing every comment they ever posted that landed them on the list.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "lordoftheBINGBONG",
            "body": "When the vaccines first came out and COVID was still raging I strongly believed anyone that refused it and caught COVID should be put on house arrest andenied medical service, also someone voluntarily unvaccinated visiting them would be a crime as well. It would weed out a lot of drags on societal progression as well.\n\nNot something that is necessary now.\n\nMandatory voting, even if you choose no one.\n\nI also dont understand how more people aren’t considered traitors for supporting Trump and the MAGA movement.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lordoftheBINGBONG",
                            "body": "It was a bigger waste on medical resources for people who actually needed them and the economy as a whole by dragging the epidemic out longer.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "I thought the “shut down” should have been much stricter. Everyone gets two days to secure enough supplies for two weeks, then go home and do not leave your house until the shut down is lifted. Absolutely no one out in public other than essential workers. Just a couple of weeks would have been enough if people had actually done it instead of absolutely refusing to stop going places for a short time.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "IamElGringo",
            "body": "I don't believe in gun rights\n\nBut I see that more as a Freedom from so not really \n\nJust like how I'm pro hate speech laws, that's more Freedom not less",
            "score": 1
        },
        {
            "depth": 0,
            "author": "islandofcaucasus",
            "body": "Most of these answers miss the point of the question and are basically just left wing ideas. \n\nHere's one that's unpopular: we decided what population growth we need to sustain our economy but not overburden it. To meet that amount, we offer people money to become surgically infertile. If that's not enough to get us where we need to be, then we have a lottery system where every baby born gets a number. If they're selected, they are made infertile at birth. \n\nI admit, this is a concept I've held onto for a long time and as I've learned more about economics, I realize population growth in the United States is not only that big of an issue, but might be the opposite: that growth is slowing in a bad way. But it is the most authoritarian belief I've ever had, so thought I'd share.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "FizzyBeverage",
                    "body": "My kiddo’s school is designed for 1500 kids and currently has 1100 enrolled.\n\nThere’s a shortage of kiddos born after roughly 2004 in most parts of this country. Their school bus is 2/3rds empty *at all times*. It’s going to make old age for millennials and younger potentially problematic. When I’m 77, I don’t want someone also born in 1984 to be my surgeon.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "_zjbusch_",
                            "body": "Why do the progressives and the left in general call them “kiddos?!” Where does this come from?",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FizzyBeverage",
                                    "body": "My boomer dad used it going back to the 1980s. He was center-right. Quick Google search dates it back to the 1890s.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "islandofcaucasus",
                                    "body": "Why do people who drink water and liquid in general call dogs \"doggo\"?! Where does that come from?",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "I believe in social programs to help those who are struggling, but I think in order to qualify you should have to submit to temporary birth control implants (male and female) for however long you’re going to be receiving it. You should not be allowed to collect taxpayer money while continually creating new mouths to feed.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "islandofcaucasus",
                            "body": "That's part of why I like the idea of offering people money to become surgically infertile. I'm talking a highly advertised program offering like $5,000 plus clean needles. \n\nI know it's horrendously inhumane, but my meth addict stepbrother had 2 kids while living in a car then killed himself shortly after the second one was taken away at 6 months. \n\nThat's 2 little kids that have no father and a loser meth addict mom that lives on the street. Life is already tough, but this 2 lost the fucking lottery of life. 10k to their parents to stop them from having those 2 kids is a small price to pay. And the parents could have had a blast with that money",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "WingedShadow83",
                                    "body": "That’s sad. 😢 \n\nYeah, I’d love that, honestly. I’ve never wanted kids and would love to have my uterus yeeted for free along with a nifty cash bonus.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "merp_mcderp9459",
            "body": "We should be aggressively auto-ticketing bad drivers. Red light cameras, speed cameras, automatically send them the tickets. If you don’t pay, the amount just gets added to your annual tax bill AND you’re barred from driving for the next year",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "This made me think about insurance for some reason (car, home, health) and I doubt this counts as authoritarianism because it’s putting people’s rights over a corporation, but… I think if someone files a claim and it gets denied for any reason, the insurance company should have to refund all the money paid in premiums up to that point (or at least since the last claim that was filed and paid). They can use that money to pay for whatever they’d been filing the claim for, or at least pay towards it. Then they can start over paying premiums until the next time they need to make a claim.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "merp_mcderp9459",
                            "body": "That wouldn’t work. You can just file for stuff you know you’re not covered for, get all your money back, then keep your coverage on the off chance that something you are covered for happens, which would wind up raising premiums on everyone. \n\nI do think there should be a penalty for fraudulently denying claims if there isn’t already one on the books though",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "WingedShadow83",
                                    "body": "Yeah, that’s kind of what I had in mind… stuff that should have been covered but they looked for some stupid loophole to deny you. \n\nA nurse friend briefly worked for an insurance company. She had to go through claim paperwork and would look for any reason to deny it. Literally, like an incorrect word used on the form, or an abbreviation, etc. And she wasn’t allowed to tell the patient what the problem was, just that their claim had been denied and they could try to resubmit it. She only worked for them for a couple of months because she said the immorality of it was too much for her to live with. \n\nHere’s another one: My parent’s house was struck by lightning. It destroyed their HVAC, among other things. Should have been covered. But because it was x number of years old, their HOI said “there’s no way to know if it was damaged by lightning, it could have just stopped working”. Parents explained that multiple other electrical devices in the home had been fried. Still the HOI said they couldn’t prove it. They even had a technician come out, inspect it, and provide written documentation that “yeah, this thing got fried”. They STILL denied it, saying there was no way to know for sure.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GreatWyrm",
            "body": "Authoritarians follow no rules, so there are no rules to follow when dealing with them. They must be crushed and discredited as the traitors they are by any means necessary.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Thorainger",
            "body": "I'd seriously/not so seriously like the death penalty for rubber necking.  I detest traffic and slowing it down because you're a moron who wants a better look at an accident drives me bonkers.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zlefin_actual",
            "body": "Nothing comes to mind, though it depends on what counts as 'authoritarian', I mean banning certain speech isn't necessarily authoritarian if there's very strong factual justification for it.  I have a hard time considering the German ban on Nazi stuff to be authoritarian, given the history there.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rogun64",
            "body": "Sometimes strict rules are needed for pandemics. If it's bad enough, I don't expect anyone will disagree.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "EchoicSpoonman9411",
            "body": "I think that people who have been convicted of crimes should mostly be the only people allowed to vote. I mean, they're the ones for whom the law isn't working out, they should be given priority in the discussion of changing it.\n\nI also think that anyone should be able to become a voter in this situation by voluntarily accepting a criminal conviction on their record and serving a jail term.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Regular-Suit3018",
            "body": "The popular and growing sentiment  in Mexico that longs for the admiral of the Mexican navy to seize power by force to dish out corruption and remove the cartels is not something I can blame Mexicans for wanting.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutumnWak",
                    "body": "I agree for the most part, but knowing the history of Latin American countries I could easily see the navy trying to permanently stay in power. \n\nI dislike the argument of \"just legalize drugs and the cartel problem will go away\" because drugs are only a portion of the cartel's income. A lot of their income comes from forcing civilians to pay them money and threatening those who don't pay with violence.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Regular-Suit3018",
                            "body": "Indeed Latin America has a highly unfortunate history with Cold War military dictators. Mexico somehow avoided that. \n\nYour latter point is exactly where the Admiral Ojeda appeal comes from. Mexicans generally aren’t the ones buying the drugs, and are indifferent to how the drugs affect the US, but they are the ones getting extorted, being forced to pay tribute, see their children become child soldiers, and are made examples of to establish fear with atrocities that would make medievals blush.\n\nMexico has a functioning democracy, but in the eyes of many Mexicans, there’s this idea of “Yes, and what exactly is it doing for us? What are we gaining?” The ultra wealthy of Mexico would love nothing more than a military junta, and the chaos and violence that common folk face daily make it much easier to market the idea.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "I don't believe the exercise of government power in a democratic society is authoritarian.  Outside of limiting democracy or treating people differently based on inherent characteristics societies should be free to do pretty much whatever they please via the democratic process.  I don't support implementing any policies if it doesn't have that popular support backing it so I don't have any authoritarian stances as I see it.\n\nTo your examples, free speech is necessary for democracy to function so it would need to be exempt from the democratic process.  Abortion is something I think should be left to the democratic process even if I personally opposed it being made illegal.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "wedstrom",
            "body": "I gain muscle easily",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jaanrett",
            "body": ">What is an authoritarian stance you have?\n\nNone that I'm aware of. I'd like to think my stances are based on good evidence based reason.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nrcx",
            "body": "I think that if you get 20 years for killing a human, you should get 40 years for killing a whale.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Muhabba",
            "body": "Would passing a civics test before being allowed to vote be considered authoritarian?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Weirdyxxy",
            "body": ">Examples would be banning certain speech \n\n\nWe might have a different understanding of the word \"authoritarian\", but okay... \n\n\nI have a lot of speech I believe should be banned. Probably most importantly, direct calls to criminal activity, especially orders to commit criminal acts; then, deliberately false statements under oath and deliberately false defamatory statements to police; abuse of emergency signals, for instance SWATting; using speech to commit a crime through an unwitting proxy (imagine a doctor telling a patient they have to take medication X once a day to survive, with the intention of having the patient die of an overdose of the once-a-month medication: I think that is and should be banned); deliberate deception for personal gain; unwanted violation of privacy; and then, less importantly than either of those, I also agree with us (Germany) criminalizing holocaust denial, the riling up of masses, and Nazi propaganda. \n\n\nI perfectly see how people disagree on the last one, but \"banning certain speech\" applies to every single point in this list\n\n\n\nAnother issue you might consider me authoritarian on is public health - long story short, I think letting disease run rampant is a really bad idea, and containing it is an important task that justifies a lot of restrictions. We are talking about human lives here, and a lot of them",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lesslucid",
            "body": "I think collective action problems should be solved via informed debate and then democratic decision-making, rather than being left unsolved.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kthrnhpbrnnkdbsmnt",
            "body": "- Assuming a society wherein the public schools are as safe as reasonably possible, provide a quality education, and foster genuine social growth with students; I would immediately ban private and home schooling unless there was a legitimate *medical* reason a student couldn't be in public school. \n\n- Fuck you. Get your vaccinations. \n\n- If you're rude to customer service workers who are just doing their best, you get stuffed in the contraption by Joe Biden.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WildBohemian",
            "body": "I'm unsure about exactly how it would work, but I like the idea of nationalizing the oil industry.  Fossil fuels are critical and dangerous, and I think it would be better if it didn't make people rich.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "downvotefodder",
            "body": "Young children should not be indoctrinated into religion. When they are older and can think for themselves, they can choose one on their own. Or not",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lucianbelew",
            "body": "People who talk in the theatre receive a one year ban with no warning and no chance of appeal.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "21redman",
            "body": "Poor people can't own guns, uneducated people can't own guns.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FeJ_12_12_12_12_12",
            "body": "------------------------------------------\n\nI will never defend the current application of the Second Ammendment in my country. I know this might sound weird, but I don't want to live in a community in which owning and carrying guns is seen as normal. I do want to legalize owning \"bludgeon\" which the police is already able to use and, of course, pepper spray or any self defense equipment. \n\nEvery citizen has the right to proportionally defend him or herself. I can't comprehend why Americans want to have guns while school shootings happen. Maybe that's something exclusively American that you want to be part of your \"values\". Maybe, if this were true, I'm in this aspect \"anti-American\", as I'll happily take a lack of owning guns over the scare of children be shot at in school. Call me authoritarian but I would never allow a Second Ammendment to take of. I much rather invest in a stronger police force than have individual gun ownership.\n\n-------------------------------------------\n\nAnother \"authoritarian\" stance would be my hardline immigration policy. \n\nI don't have any problem with detaining illegal immigrants, on the sole condition of it happening in the most humane way. What's the definition of \"illegal\"? Everyone who smuggles himself into the country without any papers or through human trafficking. They will be deported as soon as possible. \n\nIf you want to immigrate, you can go to the embassy of our country in the first, safe nation and apply there. A legal and efficient process (=> Europeans have a shorter process than non-Europeans) is started to allow you to immigrate and integrate in the nation. It will ensure that you're part of it and should prevent any segregation. Being a citizen is a privilege that should not be taken lightly, and being a citizen means that we, as a community, accept your children (Another thing: nationality/citizenship should be hereditary with this exception) as part of our people (Another detail: You can not have two nationalities.).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Wily_Wonky",
            "body": "I'm from Germany and I always quietly celebrate when I see news of a Holocaust denier or other type of neo-Nazi getting sucker punched by the law for openly displaying their rotten disgusting beliefs.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LifeExtraordinaryT",
            "body": "I want to blanket *public* spaces with camera coverage and drones and facial recognition. \n\nAuto-ticket undeniable offenses like traffic offenses and jaywalking. \n\nWith reasonable guardrails and the right to challenge it in court, of course.\n\nI also agree with the DeSantis policy on putting homeless people in camps (with medical care, job training, etc). I think it's more humane than letting them sleep on the streets and harass others. \n\nI *hate* crime and disorder, with a passion.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HerbertWest",
            "body": "Here's another one: we should attempt to shape prosocial behavior by instituting a system of rewards in addition to our current system of punishments, which would be lessened for many offenses and modified for others.\n\nEveryone would get a yearly payment based on things like hours of community service, going without having a car accident, being current in 1st Aid/CPR training, etc.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ManufacturerThis7741",
            "body": "The Book of Revelation and all other End Times media should be banned and burned. They're a direct threat to human advancement and life itself.\n\nHad the current interpretation of Revelation taken off before the Ozone hole was discovered, we wouldn't have had the Montreal Accords which banned CFCs. Meaning we wouldn't have an Ozone now and we'd all be dead. \n\nYou might think it's a strange connection but having grown up in these cults, I can break it down. \n\nMost hardcore End Times believers are really against all forms of international cooperation of any kind unless it involves bombing the Middle East because they think international cooperation is a secret plot for a takeover by some spooky New World Order. We dodged a bullet there. But because of End Times theology, we can't address any environmental crises today.\n\nNow we have them screaming that everything is the \"Mark of the Beast\" or whatever and it's fueling anti-vaccination now. I don't know what's going to happen when there's a more deadly pandemic than COVID but it'll be the crazy \"Mark of the Beast\" nutters that make everything worse.\n\nBut ok, let's say you don't believe that End Times theology will cause worldwide catastrophes. At the very least, it drives people insane. I've never met someone who started studying the Book of Revelation and ending their study being more stable, wiser, and compassionate. They always end up more unstable and unhinged. Revelation and its companion books are crystal meth in literary form. Which is no surprise.\n\nTake out the religious mumbo jumbo and End Times theology would get you 72 hours of grippy sock time because it's mass suicidal ideation.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bigbjarne",
            "body": "Dictatorship of the proletariat.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tetrometers",
            "body": "Ban homeschooling.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "panic_bread",
            "body": "Traffic laws for vehicle drivers should be much more strict and much more readily enforced.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mysterious_Donut_702",
            "body": "Everyone should be forced to retake a driver's test every few years (at little to no cost).\n\nSensors, accelerometers, and GPS built into cars should be used to automatically report aggressive driving to law enforcement.\n\nCameras at intersections and automated speed traps should be common.\n\nAny inept idiot that tries to merge onto a highway at 35 mph should immediately lose their license as well. Wrong-way drivers should be jailed. \n\nI don't feel like dying on my way to work because some hungover lunatic has Big Altima Energy. I also don't like being stuck in traffic for two hours after someone splatters themself and others. \n\nLess traffic after a solid 1/3rd of drivers get weeded out would also be nice. And hey, think of the environmental benefit of having less cars on the road!\n\nFeel free to be offended. I hate my commute and wrote this without any filter.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AutumnWak",
                    "body": "> Everyone should be forced to retake a driver's test every few years (at little to no cost).\n\nIt'd be expensive and way too time consuming, wait times would be very long too. I would rather just make the current driving test more difficult and detailed as pretty much anyone can pass the current one.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Lamballama",
                    "body": ">Sensors, accelerometers, and GPS built into cars should be used to automatically report aggressive driving to law enforcement\n\nAs long as there's also built in 360 dash cams so you can show them why you did something",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "LtPowers",
            "body": "No one should be allowed to indoctrinate a child into religion.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "StatusQuotidian",
            "body": "Gambling is terrible for society and should be banned if heroin is banned.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "If heroin is banned, cigarettes should be banned. If you want to crawl behind a dumpster and shoot up until your heart explodes, then you’re only hurting yourself. But secondhand smoke kills people, and you shouldn’t be allowed to do that. Your right to poison your lungs does not give you the right to rob other people of clean oxygen. Smoking in the house/car with your kids should carry you same penalties as cooking meth around them.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "StatusQuotidian",
                            "body": "I also think 20% payday loans and various other financial scams should be illegal. We ban cigarette advertising but the airwaves are saturated with gambling ads.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "CarrieDurst",
                            "body": "> If heroin is banned, cigarettes should be banned. \n\nAlso if alcohol must be legal then all the drugs less dangerous than it should be as legal and accessible",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HistoryWizard1812",
            "body": "Other people have talked about vaccinations so I won't go into that. \n\nInstead I'll harp on about how public education should continue to be compulsory. The children and future of our country need to be educated not only as a means of continuing the functions of a democratic society but also as a matter of national security as a digital psychological warfare becomes more common.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Socrathustra",
            "body": "All guns except hunting rifles should be banned, with mandatory buyback. Getting a hunting rifle should be subject to stringent background checks and storage requirements.\n\nGuns have no place in society and make everyone less safe, including the gun owner. If we want to do what the data suggests keeps the most people safe, we eliminate the role guns play in society.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "renlydidnothingwrong",
            "body": "Displays of racial bigotry should be criminalized.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lamballama",
            "body": "If your age is off the clock, you're ready for the stocks. Middle schoolers are strong enough to hurt their teachers, so them assaulting their teachers needs to be treated as such. Principals in general need less flexibility for internal issue management where they can just hide things away, as well.\n\nThe solution to crowded prisons is generally not to release prisoners, but to build more prisons. They shouldn't be shit unless you need to build them in an short order, but they need to be built\n\nThe law is the law is the law, and the law needs to be enforced to the letter at all times against all people as long as it is on the books\n\nMoral law should be consolidated nationwide - \"first degree homicide\" should have the same definition and punishment no matter if you're in the Keys or the far end of the Aleutians, and marriage should occur at the same time in all places. Several economic laws should also be consolidated - there's nothing truly different about a teacher or doctor or barber in one state to another aside from a piece of paper\n\nReligious exemptions should not exist - a behavior is either objectively good, bad, or neutral, and so should be encouraged, ignored, or dissuade or banned, respectively\n\nWe need to crack down on food quality. Maybe Sri Lankan \"everything organic\" would be suicidal, but somewhere between there and here is better. Also, stop growing alfalfa for export in the desert",
            "score": 0
        },
        {
            "depth": 0,
            "author": "ferrocarrilusa",
            "body": "there need to be serious limitations on the ability to use force in self-defense",
            "score": 0
        },
        {
            "depth": 0,
            "author": "spencewatson01",
            "body": "Only hot women can wear yoga pants.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CarrieDurst",
                    "body": "Which men?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spencewatson01",
                            "body": "Don’t care what men wear.  But if women/gay men want to pass a law regulating that, that would be ok.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Legally_a_Tool",
            "body": "All internet use should be a licensed activity that is based on taking a reading comprehension and media literacy test.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "WingedShadow83",
                    "body": "Anyone found spreading disinformation should be banned from the internet.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "supercali-2021",
            "body": "Parents should be held fully accountable for crimes committed by their children under the age of 18.",
            "score": -1
        }
    ]
}