{
    "title": "What does 'arguing in bad faith' mean to you?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nFor example, if you say conservatives tend to argue in bad faith, what exactly are you accusing them of? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pablos4pandas",
            "body": "Not believing what you're saying\n\n\nThat's how i'd describe it in a few words",
            "score": 48,
            "replies": [
                {
                    "depth": 1,
                    "author": "perverse_panda",
                    "body": "Or being unwilling to state what you believe. Being unwilling to answer certain questions.",
                    "score": 36
                },
                {
                    "depth": 1,
                    "author": "fox-mcleod",
                    "body": "It goes beyond this. \n\nAn apologist might believe in what they’re saying, but apologetics are a prime example of bad faith argumentation. \n\n“Good faith” argumentation goes beyond belief in one’s position to almost represent the opposite. It’s the central premise of liberalism — that neither of us know the truth and that by engaging in rational discourse we will both know it better than we did before. Good faith requires a *seeking out* from the dialogue. A person arguing something they truly believe and are not willing to change their mind on given any argument is not arguing in good faith. The “faith” in good faith is faith in dialogue.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "Hungry-Technology335",
                    "body": "Very well put. I'm taking that as mine now.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "paxinfernum",
                    "body": "Or when you know the \"proof\" you're using is rickety bullshit, but you purposefully don't mention counter-arguments against it that you found while \"researching.\"",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "To me bad faith implies not just a poor argument, a gotcha argument or a logical fallacy. It includes intent.\n\nSo when the current king of bad faith arguments, Ben Shapiro make an argument you should assume bad faith. He knows that he’s lying and manipulating and deceiving. He’s doing it on purpose.\n\nWhen someone on the right, believes his argument is valid and repeats it, you can’t always assume bad face. Most of the time you shouldn’t assume bad faith because they legitimately believe what they’re saying. They are simply making a bad argument and are wrong and using fallacies or misinterpreting information.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "polkemans",
                    "body": "Yup. Intent is the key here when talking about arguing in bad faith. It's the choice to argue in ways based on the outcome you want, and not based on landing where truth and reason will lead you.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "MAGA_ManX",
                    "body": "Just curious what does Ben Shapiro lie about ",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RsonW",
                            "body": "There was an open Q&A at a college campus with Ben Shapiro as is his MO. These are in themselves silly because college kids are, well, they're kids. They're largely parroting talking points and haven't thought them through. Which, I get it, that's the point. Point out that teenagers and young adults don't have fully thought out opinions. \n\nBut in this instance, the (Jewish) student asked if the Jewish community still bears the scars of the Holocaust. Shapiro agreed that it does. The student asked if the Holocaust and its legacy informed the Jewish community on how to interact with the world at large. Shapiro agreed that it did.\n\n The student then asked if the black American community still bears the scars of segregation, which ended twenty years after the Holocaust. Shapiro gave a dumbfounded \"well, uh…\" The student pressed with \"wouldn't it stand to reason that the legacy of segregation would continue to affect the black community like the legacy of the Holocaust affects ours when segregation ended twenty years later and lasted twenty times longer?\" Shapiro had no answer and moved on to the next question, giving a noncommittal \"I'll have to think about that, thank you for your question.\"\n\nThat was in 2013. Eleven years on, I have yet to hear him circle back to that. But he sure as hell continues to suggest that the black community should buck up and move on. \n\nThat, to me, is lying by omission. He pretends that he cannot understand how another group's history affects its present; but that he can when the group is his own in-group.\n\nIt's at bare minimum disingenuous — in other words, arguing in bad faith.",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "Eyruaad",
                            "body": "So an example of this was a more recent one.  Now Ben Shapiro really only actually engages in debates with college kids because they are easy prey to him and he can usually spout a few stats he has memorized that roughly apply to the situation, the college kid doesn't know any stats by heart, and Ben gets to pretend he's smart.  \n\n(it actually funnily goes back to the American Nazi party and how they started giving talks on college campuses because it was the only place that \"Free speech\" was still present and most other places refused to hold them.  Ironic how that works huh?)\n\nBut!  Kid stands up and asks Ben about his feelings about gay marriage.  Ben explains that gay marriage isn't right because a gay couple can't conceive a child and that's the point of marriage.  That's Ben's usual \"Gotcha!\" answer because he always ends it there with a simple biology fact and gets to be smug.  This time the kid asks Ben the follow up of will he get a divorce when Ben's kids grow up and move out, since his job as a parent is effectively done at that point.  It stunlocked Ben and he moved on to the next question.  \n\nNow ironically, because this is the kind of person Ben is, he since had an individual 1 on 1 (Months later when he had time to stew on the question), he had another kid ask the exact same question, and he could answer about how the parental relationship goes on past the kid leaving and therefore it's acceptable to stay married because he's still a parent even if the kid doesn't live at home.\n\nThat's Ben's style.  He knows his stats and gotcha answers to the \"Common\" questions, if he gets caught out, he moves on so he can't possibly be wrong, then goes back later to film a video about how he now knows how to continue to prove his point and puts it up so that when you google it, you find his nice clean version and not the original.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Unknownentity7",
                                    "body": "I think there's a better answer to Ben's argument on gay marriage, even under his own parameters his argument fails, because [married gay couples are almost twice as likely to have children compared to unmarried gay couples](https://williamsinstitute.law.ucla.edu/publications/same-sex-parents-us/). His smug answer that gay couples can't have children isn't even correct, it's at a smaller rate of course but a significant number of them do have children (and 68% of such couples with children are raising a biological child), and it's clear that gay marriage leads to more children being raised, so if his concern is about creating children then he should support gay marriage.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lemp_Triscuit11",
            "body": "Usually for me it's arguing one point- usually but not necessarily amicably- in order to elicit a response that one can take out of context in a totally different debate.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "johnnyslick",
                    "body": "That’s one form but you can stay “on point” and still be ridiculously bad faith. Witness Ben Shapiro.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "vibes86",
                    "body": "I agree. There was someone on the libertarian ideas response thread in here that was like that. Taking bits and pieces of someone’s opinion and just going after them and after them.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Oceanbreeze871",
            "body": "Intentionally twisting things around to do a gotchya that raises the stakes. The goal is to muddy the waters and slide the Overton window to aknowledge fringe positions as legitimate concerns.  Example:\n\n“How can any argument be in bad faith if you believe in free speech and the first amendment? Are you saying my argument is illegal because you don’t agree with me!?!? This is dangerous for democracy!!!”",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jagasaur",
                    "body": "Yup. Any conversation revolving around guns with conservatives always ends up like that. Especially when you bring in statistics from other countries that have incredibly strict laws, they will point to one flukey situation that happened halfway around the world or bring up the founding fathers.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "polkemans",
                            "body": "\"What part of 'sHaLl nOt bE iNfRiNgEd' do you not understand, libtard?\" Is a pretty comment one.",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "evil_rabbit",
            "body": "mostly being dishonest about what you believe and why you believe it.  \n\n\na common example is using arguments they don't actually believe in or care about. if you claim to believe X because of Y, and then i make arguments against Y that you have no answer to, that should weaken your belief in X at least a little bit, you shouldn't immediately move on to \"well actually, i believe X because of Z\" and completely ignore the arguments i just made.\n\nif you dislike immigrants, especially those with dark skin, don't pretend it's only about illegal immigrants. if you think trans people are mentally ill degenerates, don't pretend you only want to \"protect the children\". if you keep proposing laws that would make it more difficult for black people to vote, don't pretend it's about \"election security\". especially if you then reject any law that would actually make elections more secure.\n\nalso, accepting a source when it agrees with you and then rejecting *the same source* when it disagrees with you is unfortunately not uncommon. i've had this discussion way too often:\n\n\"being trans is a mental illness. the DSM-5 says so.\"\n\n\"so you trust the APA, which publishes the DSM-5, to decide what is and isn't a mental illness? cool, here's a link to them saying that being trans by itself is not a mental illness. on their own website. not all trans people have gender dysphoria, as defined in the DSM-5.\"\n\n\"wokeness! they only say that because \\[insert conspiracy here\\]. i don't believe them.\"",
            "score": 11
        },
        {
            "depth": 0,
            "author": "Late_Cow_1008",
            "body": "When an obvious MAGA comes here pretending to be a centrist just asking questions.",
            "score": 20
        },
        {
            "depth": 0,
            "author": "AmbulanceChaser12",
            "body": "Arguing things they don’t actually believe to sound more reasonable than they really are.\n\nCome on, you know you don’t ACTUALLY believe in “freedom of speech,” “states’ rights,” “small  government” or “religious freedom.”  You only believe in them when they align with the outcome you want. Which means, you don’t actually believe in them.\n\nA person who TRULY believes in “free speech” would protect speech they themselves don’t agree with. I think the ACLU truly means it when they say they’re pro-free speech, since they’ve gone to court to defend Nazis, the Klan, school children who want to pray, and people attacking the ACLU.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "CraftOk9466",
            "body": "When you have no chance of changing your mind on anything and are just arguing to look right instead of actually being right, basically. So, things like:\n\nGoing and finding a study to source a claim, and leaving out that the author’s conclusions actually disagree with the point you’re trying to infer. \n\nNever granting the other person anything, forcing the conversation to go further and further into rabbit holes until you’re arguing over the definitions of words instead of the actual topic. \n\nMischaracterizing the other person’s opinion. E.g. “Oh you don’t think a fetus is a child, so basically you want to genocide black people.”\n\nAny time anybody ever says “common sense” as if that means anything. \n\nBalking at hypothetical questions because you’re afraid of where your answer will take you. E.g. “ok you don’t think lockdowns were justified for COVID, but what if it had a 50% mortality rate?” “That’s ridiculous!”\n\nJust saying “that’s a logical fallacy” instead of saying what’s wrong with the logic.\n\n\nObviously there are cases where any of the above could be legitimate. But usually people who do them are bad faith imo.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "gettinridofbritta",
                    "body": "> Never granting the other person anything, forcing the conversation to go further and further into rabbit holes until you’re arguing over the definitions of words instead of the actual topic\n\n\nFisking! When someone pulls out miniscule points to refute, sentence by sentence, rather than the substance of the argument. Oftentimes very small things, like calling you out on a generalization or definitions. It's an easy way to avoid addressing parts of your own position that could use some introspection by overwhelming the other person. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Serventdraco",
            "body": "I think the Wikipedia definition is a pretty good general idea.\n\n>Bad faith is a sustained form of deception which consists of entertaining or pretending to entertain one set of feelings while acting as if influenced by another. It is associated with hypocrisy, breach of contract, affectation, and lip service. It may involve intentional deceit of others, or **self-deception**.\n\nI would consider unwillingness to be frank about their beliefs, selective or misleading consideration of evidence, unwillingness to engage in cursory research on a topic, and deflection/changing the topic to be examples of bad faith behavior commonly exhibited when I engage with conservatives.\n\nBeing mean, dismissive, or asking \"gotcha\" questions is not bad faith. Whataboutism is not intrinsically bad faith but it can be used that way and often is by conservatives.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Eyruaad",
                            "body": "See, that argument is always given.  Yet I've seen plenty of opinions given here that people always allude to \"Stating my real opinion will get me banned.\"  No it won't.  Stating it in a horrendous hateful way will get you banned.  \n\nSaying \"I believe biologically there are two genders\" won't get you banned.  Going off on a rant about how trans people are horrible, and freaks, and all sick perverts, ETC.  That will get you banned.  \n\nSaying \"I believe marriage should be between one man and one woman because I value the ability to produce children to continue society.\" won't get you banned.  Going off on a rant about how gay people are freaks and just want to groom children will get you banned.  \n\nThose people never seem to be able to express their opinions without breaking the rules, but their opinions aren't the issue, it's how they phrase it.  I have plenty of strong, semi radical beliefs.  I've said them up and down this site on a myriad of different subs.  Magically not once have I ever been banned because guess what, I never seem to call for violence against people or threaten them.  Wild how that works.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Serventdraco",
                            "body": "As a liberal I don't have a single belief I'm afraid of expressing on reddit, and can't think of any liberal beliefs that would fall into such a category. That *some* conservatives feel differently is quite telling.\n\nI'm not willing to give anyone that kind of leniency in conversation.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GabuEx",
            "body": "At least when I use the phrase, what I mean is that the person isn't actually interested in a genuine conversation.  They might be trying to play \"gotcha\", or they might be trolling, or they might be intentionally spreading misinformation, but the one thing that's common among all of them is that they have no actual interest in reading, understanding, or absorbing what you say and any new information contained therein.  They're talking at you, not with you.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "jauznevimcosimamdat",
            "body": "It means a ton of things but generally, I'd say it's about being dishonest in the debate or trying to win the argument rather than having a quality conversation.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Call_Me_Clark",
            "body": "Making an argument that one knows is false, but doing so because it’s easier than making an argument founded in fact and reason. \n\nI would distinguish that from people who genuinely believe stupid things - sometimes they can be tough to tell apart.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Leucippus1",
            "body": "Didn't we just have a thread like this posted by a right of center person? \n\nIf I say you are arguing in bad faith, as opposed to arguing from ignorance, then I am truly insulting you. What I am saying is that I know *you know* better but because people are dumb or non-experts you think you can get away with it. I am talking like a Jordan Peterson or a Joseph Lapado. They don't get to use the ignorance defense, so if they say something that I am well aware has no basis in their field of research (Peterson's big one lately is hypergamy - he really doesn't like women and Lapado is everything about vaccines) then they are automatically arguing in bad faith. They are taking advantage of the fact most people don't know. Most people don't know that hypergamy is not based in any real science. Most people would think a 'turbo' cancer (it doesn't) exists if a doctor says it. \n\nI haven't had a lot of conversations with conservatives where I really thought they were arguing in bad faith, 99.99999% of the time was ignorance. They are/were convinced something was true because their media echo-chamber pushes it on them, that isn't bad faith, it is being ignorant. My MILs big one (and she is more *boomer* than *conservative*) is that everyone is getting away with crime scott free. Like, we were watching 60 minutes and they were talking about how this lady was a double agent for Cuba for forever, she said something like \"With this justice department she probably got no jail time!\" I simply told her, \"she did 20 years federal time.\" Which means you do at least 85% of your sentence. She is simply ignorant of average sentences, it isn't bad faith.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "ZeusThunder369",
            "body": "0 interest in an actual discussion (without stating that up front).\n\nThings that tip me off: Moving the goal posts, and whataboutism in a non-sensical fashion. Also attacking the speaker rather than the argument.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "L4ckzi3",
            "body": "Whenever the person is knowingly making arguments using fallacies, or dismissive of evidence, or isn’t willing to clarify a stance, as well as not believing what you’re saying. I could go on and on.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Gilbert__Bates",
            "body": "When someone’s only goal in an argument is to try and find cheap gotchas that paint the other side in a negative light.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ecchi83",
            "body": "Purposely interpreting facts and arguments incorrectly is a big sign.\n\nAlso, arguing a point that you know has been debunked elsewhere.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TheSheetSlinger",
            "body": "It could mean a few things:\n\n- Trying to force the conversation into a \"gotcha\" moment. Ex: Someone arguing against the death penalty on the basis of a governmental power objection but the pro-death penalty person tries baiting them into arguing about whether or not some obviously terrible person deserves death or not because it's an easier argument to dunk on.\n\n- Cherry picking evidence. Ex: Half of X groups prisoner population in a certain country are convicted of sex crimes. The implications being made is that X groups must be predatory. But if it's ignoring that their total populations offense rate is actually lower than the general populations offense rate then its a bad faith argument. \n\n- Circular reasoning. Ex: Someone saying people are leaving an area because the schools are bad but when you ask how they know the schools are bad they use people leaving the area as their reason.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "beanofdoom001",
            "body": "I think an argument is bad faith when it's not entered into in the understanding of personal fallibility, when it's misrepresented, or when the argument comes from a place of ideology, not being even considered to be subject to challenge.\n\nA good faith argument is one that is entered in to in the spirit of better getting at truth or understanding. A good faith argument could, for example, be one that I'm willing to give up if confronted with a counterargument I can't refute. Or I could, while expressing my opinion, be engaged in a good faith endeavor of simply trying to understand where my interlocutor is coming from.\n\nWhen I argue because I'm emotionally attached to some idea and there's nothing that can be said to dispossess me of that ideology, that's not arguing in good faith. That's rather preaching something I see as being indisputable.\n\nWhen I misrepresent my beliefs as a means of proving them, this is also a way of arguing in bad faith. You see this in racist concern trolling all the time (example below).\n\nWhen I instead approach discourse honestly, as a means of testing my beliefs, and I'm open to having my mind changed, or at least conceding to a point I cannot refute, that is arguing in good faith.\n\n**Examples:**\n\n***1. Not entered into in the understanding of personal fallibility:*** \"Vaccines are wrong because they don't make sense to me. I don't care what you say.\"\n\n***2. When it's misrepresented:*** \"I'm the furthest thing in the world from a racist. I just want to help *\\[maligned group\\].* Maybe they're poor because they're stupid. This means their parents should not all be out doing illegal stuff but at home educating the kids. But the idea that racism exists is just *\\[maligned group\\]* trying to play the race card to get ahead. I mean I really care about people-- you can ask anyone in my klan-- but I'm sick of hearing about *\\[maligned group\\]* thinking they have it so bad. What about *\\[privileged group\\]?* We're not all rich and we don't get in any trouble because \\[we're basically intrinsically better\\].\"\n\n***3. Arguing from ideology:*** \"I just wanna know why you non-believers are so intent on going to hell; I don't wanna get into religion, you don't understand any of that anyway, I just wanna know why you love hell so much.\"\n\nAs for how we can know-- while sometimes it's pretty obvious-- we admittedly can't always know at first. But, engaging with people, we can know very quickly whether they approach discourse in good faith. Can they, for example concede a point? Can they refute a point without anger or personal attacks? These are dead giveaways as to who you're arguing with. For me, the first personal insult and I'm out. This person can't concede a point; they can't even hide their disdain for me disagreeing with them.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bcnoexceptions",
            "body": "Two common subcategories:\n\n\n1. Making an argument you know is bad, for the sake of wasting time. \n2. Engaging in an argument when nothing could possibly convince you of the other person's point of view. ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BigCballer",
            "body": "It means not trying to come to an understanding with people you disagree with, while pretending like you are.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "WeenisPeiner",
            "body": "Baiting the same question throughout the thread despite it being answered numerous times.\nThey're not really interested in the answer but are looking for a particular response.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "If I say someone is debating in bad faith I mean that they are using debate tactics to “win” rather than using critical thinking to evaluate a sincere question. This could include:\n\n- Asking a question they don’t actually want to answer.\n- Asserting facts they know to be false\n- Use of logical fallacies\n- Pretending not to understand something they actually understand\n- Faking insincere emotional reactions\n- Misrepresenting information by omitting or lying about context",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "vibes86",
                    "body": "Yep agreed. This is how that libertarian views thread ended up with some people arguing more for a win or an emotional reaction than anything.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "thyme_cardamom",
            "body": ">I see there's a lot of varying responses here, leading me to wonder if this phrase really means anything anymore\n\nThe top comments all seem to be in heavy agreement on the core concept, despite phrasing it in different terms",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Regular-Suit3018",
            "body": "When your goal in a conversation is not to the genuine pursuit of greater knowledge / enlightenment and instead is to belittle the other person or persons and be adversarial. \n\nBad faith discussions are a waste of time and predicated on dishonesty with oneself. It’s when you go into a conversation without being in any way open to changing your mind, which should be a prerequisite for any worthwhile discussion predicated on facts and evidence.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BlueCollarBeagle",
            "body": "From my experience, when one traps a conservative and exposes their hypocrisy, one is accused of \"acting in bad faith\".      \nAs as example, if I were to ask a conservative their opinion on financial assistance from the government to the working class and they replied that \"it creates a culture of dependency and robs the individual of the dignity of work\", if I were to follow up with asking why the same conservative supports the elimination of the Estate Tax, I would be accused of acting in bad faith.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "AddemF",
            "body": "No intention of learning, only promoting your own ideas or feelings, in the thin disguise of a conversation.  At worst it's trolling, with only the intention of hurting other people's feelings.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Thorainger",
            "body": "Being dishonest.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "johnnyslick",
            "body": "If im going to be honest, I don’t really think “debate” and “argument” generally accomplishes a whole lot. The way it’s supposed to work is, you need to come into the situation willing to understand the other person’s opinion and also to change yours or at least agree to review it if you don’t have good evidence. A person coming in with “oh yeah science? If evolution is real, why are there monkeys?” is clearly not coming in with that mindset, and that’s bad faith, or else the person in question has been very seriously down in their schooling in terms of what evolution is but also what monkeys are and maybe even what real means. What usually happens there is if you start to explain that evolution means change, not improvement, over time, boom, you get 5 more things. That’s the Gish Gallop and it’s a common but not the only form of deliberately invoking poor reasoning to “win” instead of asking probing questions to be better informed.\n\nThe “why are there monkeys” question is silly (I hope) but it’s based in reality and you see lesser versions of it all the time. Like I said, if you come into a debate with the idea that you’re going to “win”, rather than that you’re going to understand why the other side thinks what they do, you’re not really debating and anything you do from there is bad faith on some level.\n\nAnd don’t get me wrong, like, you 100% don’t have to have those conversations! If you are talking with a bigot, you absolutely do not need to come in with an understanding that maybe they’ll have something to say you didn’t realize about minorities or what have you. I’m saying, if you don’t want to do that, and that’s perfectly reasonable in the face of bigotry, don’t. Grey rock them if that’s your thing or, if you prefer being direct and confrontational, ridicule those ideas. People are worthy of respect but shitty ideas are absolutely not.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "P0RTILLA",
            "body": "“Democrats want to destroy this country” they don’t see policy differences as a just that different opinions on how to move forward they literally think if it’s not the way they want to see it then you’re destroying everything.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dutch_connection_uk",
            "body": "Good faith means you actually want to have a debate for the purpose of discussing the issues at hand. So you aren't trying to attack the character of the opponent, play devil's advocate, bait the other side into defending weird positions, etc.\n\nThe edit you made to this post is actually a hilarious working example of bad faith given that you were given a bunch of different examples of it and rather than identifying the pattern then said \"welp! the fact that a bunch of different things fit inside wanting to make the discussion about something other than the issue at hand means there is no definition at all!\".\n\nI'm not sure if you did this intentionally as a joke, but if so, I enjoyed it.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Pauly_Amorous",
                    "body": ">  \"welp! the fact that a bunch of different things fit inside wanting to make the discussion about something other than the issue at hand means there is no definition at all!\".\n\nThis was certainly not the only definition given. Some have said that even arguing the issue at hand but being stubborn about changing your views or only debating to win counts as bad faith. And playing devil's advocate is something I've done many times in the past, in order to try and steelman an opposing POV so that I could hopefully understand it better. I fail to see how that qualifies as bad faith.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dutch_connection_uk",
                            "body": "Devil's advocate isn't good faith because you're not arguing your own point of view. If you're being explicit about it, it can have its place, like in an interview where you're trying to elaborate and explore someone else's view. Not every situation is a debate. Doing it in a debate though is bad faith, you should stick to your own argument and not try to change the topic of discussion to something irrelevant, and devil's advocate can get in the way of that.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Pauly_Amorous",
                                    "body": "> Devil's advocate isn't good faith because you're not arguing your own point of view.\n\nArguing your own pov can sometimes be a bad strategy in a debate. Just to use an example in an attempt to not start any arguments here, if you're talking to a child, you have to be able to see the world the way a child does and come at them from that paradigm, instead of using words and concepts that only an adult would understand.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "polkemans",
            "body": "Intentionally choosing the least generous interpretation of an argument so you can pick at it and create a straw man is one example.  \n  \nOP you're getting a lot of different responses because it takes many forms. I think at it's most distilled, it's refusing to engage with a topic at face value - the refusal part is the key here. Like saying that liberals want \"open borders\" is a bad faith argument, because it cuts to what *you* want the message to be and not getting \"bogged down\" in the nuance of what liberals actually feel about immigration, or your issue of choice.   \n  \n\"Bad faith\" is the conscious refusal to engage with an issue on factual grounds because doing so might mean you lose the argument, or because you can elicit support via an emotional response where a rational one might not be so eager to take your side.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Pauly_Amorous",
                    "body": "> Like saying that liberals want \"open borders\" is a bad faith argument, because it cuts to what you want the message to be and not getting \"bogged down\" in the nuance of what liberals actually feel about immigration, or your issue of choice.\n\nSounds similar to 'Conservatives don't actually care about the unborn - they just want to control women ...'\n\nI would say that either of these examples only count as bad faith if the person doesn't actually believe that the other side believes what they are accusing them of.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "washtucna",
            "body": "Arguing in a manner that puts winning over the truth. Now, of course, most arguments and people in them have a perspective that they're promoting, but if your argument gives *no* credit to valid points of the opposition, then that's a bad faith argument.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zlefin_actual",
            "body": "We just had a very similar thread a few days ago, here it is\nhttps://new.reddit.com/r/AskALiberal/comments/1cwl45m/whats_a_case_of_people_you_agree_with_acting_in/",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DarkBomberX",
            "body": "Others have said, \"Not believing what you're saying,\" and I agree to that to an extent. I think you should still have proof of your claims. However, after your provide confirmed proof, if someone is still denying you, then it's pretty bad faith if they don't have any real push back beyond them, not understanding it.\n\nFor me, it would be \"making bad points that clearly are trying to blur the actual topic or make false equvlances.\" Like people comparing not wanting to wear mask during a pandemic to abortion.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Similar_Candidate789",
            "body": "Arguing with the intent to prove your point, not to listen to the other side and debate. Debating, contrary to popular belief, isn’t just about talking, it’s also about listening and responding. \n\nFor example, not providing sources or data. Manipulating data to make it sound good. Just plain lying. Using methods like gish galloping, flooding the zone, what about ism, goalpost moving, and false dichotomy to make invalid points.\n\nBad faith implies you’re there to force your point across not present data and facts to backup claims.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "libra00",
            "body": "Using straw-men, ad hominem attacks, moving the goalposts, throwing non-stop whataboutisms, and generally not sincerely engaging with the other person's arguments.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Personage1",
            "body": "Not believing what you're saying is the conscious way to do it.\n\nI think there are plenty of people who are taught to basically engage dishonestly in all their interactions, and aren't willing or able to step back and recognize it. A common one I see on reddit (and basically have a rule for myself that I end any interaction once someone tries it on me) is to quote one sentence from a longer comment and reply just to it, then take the next and reply just to that, so on and so forth. It shows they aren't engaging with the whole idea being presented.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Certainly-Not-A-Bot",
            "body": "I usually see the term used to refer to people who make arguments they don't actually believe. There's one case in particular that's very common, where a person is arguing for policy A and trying to justify it with some assertion B that does not justify policy A, but they do it anyways because what the actually believe, assertion C, is too socially unacceptable to publicly state as their reason for wanting policy A.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "Arguing in a deceptive manner.  Mostly making arguments you don't believe in.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Finalcountdown3210",
            "body": "Making up a person that doesn't exist and then pretending that's what \"all liberals\" are like. Even though they don't understand the difference between Leftist and Liberal in the first place.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Eyruaad",
            "body": "The two most simple versions of it come down to arguing a position that you don't actually hold, and beating around the bush to state your actual opinion because you know it's a terrible one.  Usually it involves twisting the question off the general stated purpose, and hoping to grab a gotcha question out of there to pretend that you won.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "conn_r2112",
            "body": "tbh I mostly associate bad faith with strawman arguments\n\nwhen someone is hitting you with the hard strawmen or is just generally, pretty blatantly lying... i consider that to be bad faith\n\nlike when pro-life people for example say that pro-choice people just want to murder babies... they know that isn't the case, they know that's not the pro-choice position, but they say it anyways because it's easier to argue against.  Thats bad faith\n\nconversely when pro-choice people say that pro-lifers just want to control womens bodies... they know that isn't the case, they know thats not the pro-life position",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HotStinkyMeatballs",
            "body": "Blatantly lying. Intentionally misrepresenting statistics and data. The \"So what you're saying is \\[insert thing someone never even implied\", demanding sources and then rejecting them on the basis of the source, intentionally dodging important and relevant questions or requests for clarification.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RigusOctavian",
            "body": "Having zero intention of actually listening to the other side of the conversation for one.\n\nFor two, refusing to accept any evidence or proof while simultaneously demanding more proof and refusing to produce any yourself.\n\nIt’s a nice way of just saying someone is trolling and/or shit stirring.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fugicara",
            "body": "Lots of answers here which amount to \"lying,\" but I don't think that's the most common example of bad faith argumentation.  I think the most common example is complete unwillingness to engage with what the other person is saying.  You might really believe you're right, but if the person you're arguing with presents evidence to the contrary and you don't even pretend to evaluate it and you just carry on with what you said before, that's bad faith.  Check the thread which included the three comments I made before this one for an example of this in action.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dog_snack",
            "body": "It’s when you ask questions/debate not in order to enlighten or be enlightened, but purely as a way to fight with someone or to be dishonest/disingenuous in doing so.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "EchoicSpoonman9411",
            "body": "Attempting to make your views sound more reasonable.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ausgoals",
            "body": "In this sub in particular I would include all those people who come in the hope of having themselves proven right - or really any other reason that isn’t to actually engage in meaningful and reasonable discussion, debate or even argument. \n\nAlso either not responding to the entirety of points, conveniently ignoring large swathes of things people have written because it’s inconvenient to the point they want to make, responding to linked evidence with feelings and/or dismissing linked evidence for no other reason than ‘I don’t like it’ or ‘I don’t want to believe it’, or otherwise twisting the meaning of something someone has said to be uncharitable, taking things out of context, or deliberately being obtuse. Also just being interested in winning above actually coming to an understanding.\n\nAn example of a bad faith argument would be:\n\nCommenter: Here’s a handful of different examples from different states that implemented voter ID laws only for said laws to be struck down as unconstitutional, or to otherwise have ended up only serving to disenfranchise the vote from certain demographics\n\nBad faith commenter: it’s racist to assume people are too stupid to get an ID.\n\nBad faith, to me, is also people who are able to think critically about something but who deliberately don’t or won’t about the argument they’re trying to prosecute because it would make the argument fall apart. Such examples would be things like: ‘Bill Clinton is a pedophile because he was friends with Epstein but Trump isn’t a pedophile despite also being friends with Epstein’ or ‘Joe Biden is a criminal despite no, or specious, evidence but Trump’s documented crimes that have plenty of evidence behind them and that he has no real defense for are not crimes because there’s no specific victim’\n\nThe reason conservatives often argue in bad faith is that modern conservatism is built on fear and so is by definition bad faith. \n\nLiberals can still, obviously, argue in bad faith. It’s just that ‘we must have guns because freedom’ or ‘the real racism is against white people’ and plenty of the other dominant lines in conservative circles are built on bad faith.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tidaltown",
            "body": "If the word \"woke\" is used unironically, for starters.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "-Random_Lurker-",
            "body": "Discussing something without intent to listen, communicate, participate in mutual discussion, or exchange information in both directions.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "zlefin_actual",
                    "body": "oh look, it's the same user that keeps engaging in bad faith over and over again.  I find your tendency to constnatly engage in questionable arguments then delte everythin and leave to be bad faith; especially since the argument chains prior to that often include at least one demonstrating deep flaws in your stance that you refuse to address or admit to.",
                    "score": 2
                }
            ]
        }
    ]
}