{
    "title": "How to discuss Project 2025 with family without seeming like a conspiracy nut? ",
    "comments": [
        {
            "depth": 0,
            "author": "FeJ_12_12_12_12_12",
            "body": "Do they know of it? If they don't, you can state it as it is. If they do, let them explain and follow the methodology of Socrates.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "FiveStarPapaya",
                    "body": "I doubt they know of it.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Persianx6",
                            "body": "Show them the website",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "graneflatsis",
                            "body": "Here's a well regarded guide:\n\nhttps://project2025istheocracy.substack.com/p/how-to-tell-your-friends-about-project\n\nCheck out r/Defeat_Project_2025 for more help.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "FeJ_12_12_12_12_12",
                            "body": "Then it's not a debate and you can just mention the stuff you don't agree with. \n\ne.g. How I would handle it: \n\nIf you ever talk about a social issue, bring on the arguments of project 2025. See if they agree or not. If they haven't read it yet, they'll be honest and you can simply state your opinion/convince them. You'll usually find a common ground or you can convince them if you're well read (usually, most people don't have the knowledge to debate/form a believable argument against a well read person), after which you state that it is from project 2025 which is funded and supported by official Republicans. \n\n------------------------------------------\n\nThere's only one thing you need to beware of: Do not lecture them. Debate, question their beliefs and explain your viewpoints. But do not lecture them. You're not in college and you're not talking to a political commentator, you're talking to your familiy. If they're interested, offer them interesting books/papers. But don't try to create a flood of information/facts/stats. It only results in them tuning out and stopping the conversation. \n\nI haven't fully read Project 2025 yet, but what I've read, makes me skeptical to say the least. I don't think they'll be able to pass the legislation they want and I don't think it will be \\*the\\* solution as they present it. \n\ne.g. Capital punishment\n\nCapital punishment is NOT the solution for the rise in crime. I'm a proponent of a quick and painless capital punishment for the most heinous crimes, but it will not be the solution for the rise as they state it. So, basics we agree with but the argument we don't. \n\ne.g. Christian nationalism. \n\nWhy should this even be a policy? The US is not inherently Christian, and christianity is not even one united thing... It has many different variations which don't even agree on basics like the Bible. (Protestants only have 66 books in the Bible.) Why should that be part of a nationalist, unifying agenda? I consider myself a nationalist/regionalist in my own, European country, but it's stupid to place \"Christian\" before it. Many have died over this religious conflict, and now they are going to state that Christianity is a unified or unifying religion? What a joke. (Oh, and what are we going to do with the Jews? Are they not part of this? How does this make the US different from any other religious nationalism?)",
                            "score": 9
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "molecularronin",
            "body": "How can it be crazy to discuss what supporters/architects of P2025 have proudly written? Literally just bring up the wiki page for it? It's absolutely 100% batshit insanity.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "DistinctTrashPanda",
            "body": "Why not just send them the report that they put out?  \n\nAt the beginning of it, there's a list of the organizations that participated in creating it; explain that these groups worked closely with the Trump Administration and are working with his current campaign, and many former Trump hires during his administration are working for these groups now--the authors list notes this as well. Combine that with many of the ideas (creating Schedule F civil servants) were things that Trump already tried to do and has promised to do again, and the fact his campaign has told reporters that Project 2025 is going to be the cornerstone of his next administration.\n\nThere's a line to draw, if you want to.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Kakamile",
            "body": "Why bother? Talk about the sussy election and government stuff they've already done.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "Just for clarity. This post did not break rule 3 or any other rule. \n\nApparently, I can’t properly hit tap targets while pouring coffee.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "jackshafto",
            "body": "It is a conspiracy. Their goal is to turn the country into an authoritarian, male dominated, nominally christian-fascist ethno-state governed by rich technocrats. The plan is being pushed by billionaire funded \"think tanks\" like Heritage, the Federalist Society and many others. There is Big Money behind it and they're deadly serious. They already control more than half of the State governments and a big chunk of the justice system, including the Supreme Court. They don't like democracy and they'll end it if they get their way.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "00Oo0o0OooO0",
            "body": "I'd avoid calling it \"Project 2025.\" Conspiracy theorists *love* [big ambitious plans](https://www.splcenter.org/20140331/agenda-21-un-sustainability-and-right-wing-conspiracy-theory) with names like that. Just refer to \"plans\" or \"goals.\"\n\nBe specific about *whose* plans and goals these are. Avoid the conspiracy \"they.\"\n\nBe sure to remember yourself that it's just ambition right now. Don't promise these are things that *will* happen or even *can* happen if Trump is elected. It's things specific people say they *want* to happen.\n\nBad: \"With Project 25 they're gonna put Trump in complete charge of the DoJ.\"\n\nBetter: \"Donald Trump and people at the Heritage Foundation say they want to eliminate the DoJ's independence from the presidency.\"",
            "score": 3
        },
        {
            "depth": 0,
            "author": "BlueCollarBeagle",
            "body": "Take small bites.\n\nStart with the plan to replace as many as 50,000 federal workers who are thought to be Democrats and/or not willing to pledge loyalty to Trump.    \nThen follow up with two US Supreme Court Judges who were in the least, sympathetic to the insurrectionists of January 6th, if not in full support of the attempt to overturn the elected government of the USA.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "HotStinkyMeatballs",
            "body": "Literally show them what it is. There's a formal website for it.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Multi_21_Seb_RBR",
            "body": "Warn them that a Trump admin - via Project 2025 - will easily reimplement and reinforce the Comstock Act and de facto totally ban abortion nationwide without a congressional law.\n\nThey totally will do it. The other aspects of Project 2025 may be harder to implement but this is easy and they know it and “good faith” conservatives pretending they are for “moderation” know it.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "foyeldagain",
            "body": "Explain that a really conservative and powerful think tank, an org that drafts policy for conservatives, has created a guide to dismantle government as we know it and recreate it in their likeness.  Then start in with some of the bigger details.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "HaveCamera_WillShoot",
            "body": "Start by getting them to listen to the [Behind the Bastards episodes on Think Tanks](https://podcasts.apple.com/us/podcast/part-one-how-conservatism-won/id1373812661?i=1000651167970). Then you're halfway there.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "blind30",
            "body": "Send them a link and let them read it. “Have you heard of this?” \n\nIf they’re the type who need convincing after reading it for themselves, you being the most well read and politically active might actually hurt the effort.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nFrom what I’ve read and heard about Project 2025 it’s really fucking bad. I’m the most politically active and well read and articulate in my family circle so I want to bring it up to them. But I also feel like “project 2025” sounds like a crazy conspiracy theory type thing. \n\nHow do you discuss it with them? Who do you find are the best sources to reference?  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DickieGreenleaf84",
            "body": "Honestly, I wouldn't. It's a Fringe project from the outer fringes of the right. That's not where you are going to find common ground to work from.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "itsokayt0",
                    "body": "The Heritage Foundation is everything but the fringe of the fringe of the right. Look how they are involved in determining judges in administration",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "MollyGodiva",
                    "body": "It is not fringe, it is embraced my many who would be in a Trump administration.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NPDogs21",
            "body": "Sometimes it’s not worth it potentially losing a relationship with your family over politics. Are they likely or open to changing their mind? You could reference it if politics was already brought up, but I wouldn’t bring it up out of nowhere ",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "FiveStarPapaya",
                    "body": "They are mostly all progressives and some independents. I only have one or two that are conservative leaning",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "I suppose it depends how often you talk about politics or how interested your family is. ",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "7figureipo",
                    "body": "This absolutely is worth burning those bridges. There are people I personally know who I will hold as having responsibility for this crap if Trump and his backers get their way, because they either turned a blind eye, denied the reality of it, or actively supported it. They will instantly become an enemy of the state in my eyes, and idgaf what their relationship to me is.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "Will people burning bridges with their family be better or make them change their beliefs? ",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "7figureipo",
                                    "body": "The bridge would have been burnt *because* they enabled fascism. It's post-hoc.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dannydevitosfluffer",
            "body": "Have you not learned yet that you’re not going to change anyone’s mind? Have you ever successfully flipped someone’s beliefs?",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "FiveStarPapaya",
                    "body": "These are mostly progressives. I just don’t think they know or heard about project 2025 because as far as I know it’s usually only talked about online",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PhylisInTheHood",
                            "body": "I'd say keep it that way. if they are already against trump and republicans then there isn't much need to go beyond just pointing out the obvious heinous shit they say and do",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Lemp_Triscuit11",
                    "body": "People change their minds all the time lol. And it doesn't happen in a vacuum",
                    "score": 1
                }
            ]
        }
    ]
}