{
    "title": "How much democratic oversight is there in reality over the federal bureaucracy and what can be done to expand it?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nSo there's something that's been troubling me a lot over the past few months.\n\nHow much democratic control actually exists over the federal bureaucracy? I.e. how much policy is actually set by unelected bureaucrats?\n\nSee, here's the thing. A couple months back I watched this video: [https://www.youtube.com/watch?v=tWxh2oS7Ays&t=20s](https://www.youtube.com/watch?v=tWxh2oS7Ays&t=20s)\n\nAnd I found it fascinating. I've also spent a great deal of time over the past few months reading up on various abuses of federal power during the cold war and war on terror, which has helped drive me to be a touch paranoid lol.\n\nThis lack of democratic oversight and the strong influence of the federal bureaucracy on actual decision making is something that's fundamentally anti-democratic no? Career bureaucrats building empires within their own departments and \"advising\" the politicians that we elect to help them in that quest.\n\nI mean, the old british sitcom *Yes Minister* is based around slight exaggerations of true stories from the british government and its civil service and it's shocking the extent to which the civil service influences democratic policy via empire building.\n\nMy dad is a right libertarian and he's convinced that the civil service and broader federal bureaucracy really is a \"deep state\" that sets policy outside of democratic oversight (and cause he's a right wing shit head, of course that means that they were just anti-trump). But like... he does kind of have a point. Federal bureaucrats did actively thwart a number of trump's policies. And, like, that's obviously a good thing in the short term cause those policies were terrible. But like.... I'm not generally a fan of bureaucrats snatching documents off a president's desk so they don't sign them (though I'm also not a fan of a president who forgets about documents unless they are literally in front of him).\n\nA big part of project 2025 is the idea that the federal bureaucracy should more or less be under the direct control of the president. Now, obviously, that's bad as well because it invests a whole lot of power in the hands of the executive and that could very very easily be abused. I mean it's basically an elected dictator (and dictators don't tend to tolerate elections long anyways).\n\n  \nWhat I am wondering about though is: what actually is the right answer here? We shouldn't have bureaucrats setting policy without democratic oversight regardless of who is president. Empire building, corporations funding and regulating themselves via regulatory capture, all of that is like... bad.\n\nAnd I'm not really sure what the actual solution is. Would it be better to transform the experts into advisory roles rather than in charge of actually implementing rules and then we could have elected councils to implement these rules? (So the EPA itself wouldn't set regulations, instead it would recommend them and then these would be voted on by subcouncils of elected delegates. You could hand this job to congress but given they only work for like half the year i doubt they'll be willing to do it). I'm not really sure.\n\n  \ntl;dr: How do we ensure the civil service doesn't interfere with democratic decision making? The examples of this interference are most egregious in the realm of foreign policy and national security, but bureaucratic empire building can be seen in every level of the federal bureaucracy no? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "toastedclown",
            "body": "The Federal bureaucracy is actually one of the few areas of government where the US gets it mostly right.  The various executive departments are overseen by Cabinet secretaries, who along with deputy and assistant secretaries, are appointed by the President and confirmed by the Senate.  Cabinet secretaries who have lost the confidence of the President are typically asked to resign.  \n\nCareer executive branch employees deal in matters too technical for elected or appointed officials to have the requisite expertise in.  But they also don't actually make any decisions.  Information flows up the chain of command and decisions flow down. Those decisions are ultimately made by a Senate-confirmed presidential appointee or the President himself.\n\nThe way all this stuff works is strikingly similar to how major corporations operate, but right-wing cranks would have you think it is all from outer space.  Do public companies put every manager- or director- level hire to a shareholder vote, much less every decision made by those employees?  Of fucking course not.",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "SocialistCredit",
                    "body": "Sure, but at the same time you can't deny that there is a large, unelected and largely unaccountable body of people with strong influence over policy in the United States. Are you entirely comfortable with that lack of democratic accountability?\n\nI mean look at the shit the CIA or FBI gets up to. Hell, the CIA hacked Dianne Feinstein's laptop WHILE SHE WAS INVESTIGATING THEM.  That's clearly not good.\n\n\nAnd like, fuck Trump and all, but are you honestly comfortable with bureaucrats setting policy by snatching papers or intentionally undermining presidential directives? I mean where is the actual accountability for that right?\n\nIt's not neccessarily about the cabinet secretaries but the guys below them. Cabinet secretaries have a modicum of accountability, but the guys in the video were not cabinet secretaries or ever appointed by any democratic body right?",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "toastedclown",
                            "body": ">Sure, but at the same time you can't deny that there is a large, unelected and largely unaccountable body of people with strong influence over policy in the United States. Are you entirely comfortable with that lack of democratic accountability?\n\nThey are accountable to their bosses.  \n\n>I mean look at the shit the CIA or FBI gets up to. Hell, the CIA hacked Dianne Feinstein's laptop WHILE SHE WAS INVESTIGATING THEM.  That's clearly not good.\n\nNo, it's not.\n\n>And like, fuck Trump and all, but are you honestly comfortable with bureaucrats setting policy by snatching papers or intentionally undermining presidential directives? I mean where is the actual accountability for that right?\n\nWhat?\n\n>It's not neccessarily about the cabinet secretaries but the guys below them. Cabinet secretaries have a modicum of accountability, but the guys in the video were not cabinet secretaries or ever appointed by any democratic body right?\n\nThose guys are accountable to the Cabinet secretaries.  Did you even read the last paragraph of my comment?  Do you think every single executive branch employee should be elected?",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SocialistCredit",
                                    "body": "I'm talking about guys like Sidney Gottleib or Frank Wisner and even their bosses didn't know all the details of what they were doing. That said cabinet secretaries and corporate big wigs play their roles too. But you'll often find a degree of continuity between administrations (see Allen dulles or some of the other names the video brings up). I mean hell hoover famously had blackmail on congress people to keep them in check. Not to mention the CIA hacking Feinstein right? I mean how much democratic accountability is there if they can blackmail you?\n\n\nI mean Schumer literally said that going after the IC is dumb cause there's a million ways they can hit you. That is fundamentally undemocratic no?\n\n\n\nDid you not hear about bureaucrats undermining his policies? Basically they'd steal documents or actively refuse to follow executive policy even if it was legal. Granted I'm glad they didn't cause the policies were dumb and harmful but I'm not totally comfortable with bureaucrats making that call alone without oversight. \n\nNo i don't think every single employee should be elected. I'm not really sure what the right answer is, but I am deeply uncomfortable with a large body of unelected career bureaucrats deciding federal policy and holding direct influence over democratically elected officials",
                                    "score": -5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DistinctTrashPanda",
                            "body": ">Sure, but at the same time you can't deny that there is a large, unelected and largely unaccountable body of people with strong influence over policy in the United States. Are you entirely comfortable with that lack of democratic accountability?\n\nIt's not unaccountable at all.  If an agency issues a new rulemaking, those with standing have the right to sue and the Courts get involved.  Congress also has the power to overturn rulemakings it does not like under the Congressional Review Act.\n\nEach executive branch department has an independent Inspector General who has the job of investigating the department to find waste, bad actors (including illegal action), etc.  The Government Accountability Office does reports on how effective agencies are at different things.  Congress also has an Oversight Committee in each the House and the Senate that can investigate what they want, as well as other committees that can do the same for agencies under their purview.\n\nIt's also worth noting that these agencies were created with the power that they have because of bills passed by both houses in Congress and signed by the president.\n\n>I mean look at the shit the CIA or FBI gets up to. Hell, the CIA hacked Dianne Feinstein's laptop WHILE SHE WAS INVESTIGATING THEM. That's clearly not good.\n\nYes, that is bad. And we know about it because Congress told us, both in hearings and through a 6,000 page report, IG investigations, oversight boards, etc., instead of just being ignored.\n\nBad things are always going to happen.  It's the reaction to those bad things that makes a difference.\n\n>And like, fuck Trump and all, but are you honestly comfortable with bureaucrats setting policy by snatching papers or intentionally undermining presidential directives? I mean where is the actual accountability for that right?\n\nDepends on the type of agency.  Independent agencies, for example, are designed explicitly to not follow the orders of the President or Congress, because those agencies have much more expertise in what they do.\n\n>It's not neccessarily about the cabinet secretaries but the guys below them. Cabinet secretaries have a modicum of accountability, but the guys in the video were not cabinet secretaries or ever appointed by any democratic body right?\n\nMany undersecretaries are appointed by the president and confirmed by Senate--these usually go very smoothly and quickly, and there's so many at the beginning of a new presidential term that there's not enough time to report on them all.\n\nBut political appointees can be removed or fired.  It takes a little more time for everyone else, but anyone in the federal bureaucracy for not doing their job.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Expiscor",
            "body": "Im a federal bureaucrat. Our directives change basically the instant a new administration comes in",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "Hey! Don't you bring \"facts\" or \"knowledge\" or \"actual experience\" into this! \n\n\n:P",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "SocialistCredit",
                    "body": "A staff member of the congressional investigation into Kennedy's murder was once told by a CIA official:\n\n\"So you're from Congress - what the hell is that to us? You'll be packed up and gone in a couple years, and we'll still be here\"\n\nThat's a fundamentally undemocratic sentiment is it not?\n\n  \nThat's the sort of thing I am worried about. Bureaucratic power that exists outside of directives or outside of any administration. Bureaucrats there for the long haul who may have different directives here and then but are largely free to pursue their own agendas.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Expiscor",
                            "body": "The intelligence community is an incredibly small portion of the federal bureaucracy ",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SocialistCredit",
                                    "body": "Sure I am aware.\n\n  \nBut that's not the point. I am just most familiar with the IC's abuses and they are by far the most egregious.\n\n  \nYou can find this sort of sentiment throughout different agencies because that sentiment is not inherent to intelligence, it's inherent to career bureaucrats right?\n\n  \nI won't lie, the old british sitcom *Yes Minister* is playing a role in my concern here. It consists of slight exaggerations of true stories from the british government. And the whole premise of the show is that the civil service is really the ones running the country, not the elected officials.\n\nThose stories, coupled with what I've read about the IC are really what's driving my concern here. The problem isn't necessarily the IC, but the way the IC works. It's a bureaucratic organization and therefore subject to the problems of bureaucracy like empire building and infighting.\n\n  \nI mean the FBI and CIA famously hate each other because they're constantly getting in each other's way. Because these are officials that will be in their posts for years and have to think long term, well past any particular administration's desires.\n\nThat means that they're free to pursue their own objectives (for the most part).\n\nMaybe electing bureaucrats is bad, but perhaps some sort of term limit? That what they're forced to think in the short term and can't empire build to the same extent?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Expiscor",
                                            "body": "A term limit for bureaucrats would result in a severe brain drain from the federal government. We want to attract the best and brightest to work for the government, not discourage them. \nThere’s already huge retention issues throughout most agencies because of private sector pay eclipsing Fed pay and benefits being cut after 2008. We don’t want highly specialized positions/agencies to have to undergo frequent flips in employees",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SocialistCredit",
                                                    "body": "I mean ok?\n\nI can stomache that if it means we can keep like...democracy and not have the shit the CIA pulls.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Expiscor",
                                                            "body": "The CIA, FBI, etc. do not have even close to the power they used to have. Look up the FBI under Hoover and the things they did. Again though, you keep coming back to the intelligence community. Most agencies are not as consequential. I work for the US General Services Administration and run several million square feet of buildings. If this was a job that you had people rotating in and of, you’d likely never be able to get anyone to fill the spot. Same with tons of other agencies like FCC, SBDSU, OIGs, etc.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "SocialistCredit",
                                                                    "body": "While I am less concerned with these agencies are you going to deny that there isn't a tendency, particularly amongst higher ups, towards bureaucratic empire buidling? To accumulating as much power, staff, and resources as possible?\n\nYes, the IC is more restrained now. But like.... in my lifetime we found out they were doing mass surveillance, warrantless wiretapping, and literally hacked a congressional investigation into them\n\n\nI mean Schumer himself literally said it was stupid to go after them cause they have 6 ways to Sunday to get back at you.\n\n\nThat's clearly horrifying in a democracy right? The CIA and FBI still get up to illegal and shady shit",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Expiscor",
                                                                            "body": "Sure, but again, the IC is not representative of the nearly 3 million federal bureaucrats. I’m in favor of reigning in the IC, that doesn’t mean other agencies also have to be reigned in the same way",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "Honestly probably too much.  A huge problem in our government is that we are micromanaging decisions with legislation that should just be handled by the experts in charge of implementing policy.  For example GPS satellites have to use this sub par outdated technology because 30 years ago congress passed a law explicitly naming it rather than leaving that decision to the people who had a better idea of what they were talking about/would be designing the system.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": ">unelected bureaucrats?\n\nI am absolutely sick of this. It is just \"Government Bad!\" in a silly disguise. \n\nI trust experts. Congress can barely get a fucking budget passed, and some people have this incredibly silly idea that we should put THEM in charge of every little regulation? NOTHING would get done. And that's the point. That's all this is. A back door to destroying a functioning government. \n\nI don't give a flying fuck if the person that sets seat belt safety standards is elected. I care that they did the math. I don't give a flying fuck if the person setting the allowed parts per billion of cancerous chemicals allowed in baby food is elected. I care that they did the math. I don't give a flying fuck if the person that created the safety regulation for safety harness usage is elected. I care that they did the Cthulhu damned math! \n\nAnd our elected officials? They're too *fucking stupid* to do the math, too unskilled to do the math, too busy chasing BS election conspiracy theories on Twitter (I'm not calling it X, that's a stupid name) to do the math. They're too BOUGHT to even care. \n\nYour magic counsel? That's just Congress doing it, with extra steps. It's a terrible idea. \n\n>We shouldn't have bureaucrats setting policy without democratic oversight regardless of who is president.\n\nWe abso-fuck'in-lutely should. The person deciding how much asbestos is acceptable in your baby formula shouldn't be swayed by politics. They should do the damn job that's in front of them. \n\nArgh!!!\n\nPicture the worst bible thumping MAGA Karen At A School Board Meeting imaginable. You want to put her in charge of deciding FAA regulations? No more food label regulations, Jesus will sort that out, and the free market will decide EPA regulations! That's .... Argh!",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "SocialistCredit",
                    "body": "A staff member of the congressional investiagtion into Kennedy's murder was once told by a CIA official:\n\n\"So you're from Congress - what the hell is that to us? You'll be packed up and gone in a couple years, and we'll still be here\"\n\nThat's a fundamentally undemocratic sentiment is it not?\n\n>I trust experts. Congress can barely get a fucking budget passed, and some people have this incredibly silly idea that we should put THEM in charge of every little regulation? NOTHING would get done. And that's the point. That's all this is. A back door to destroying a functioning government.\n\nIt's not really about \"trusting experts\". It's about the lack of democratic oversight within the enforcement and regulatory apparatus of state. It's not GoVeRnMeNt BaD or whatever. I'm just deeply uncomfortable with a large unaccountable body of people setting policy which have effectively no democratic oversight, like our CIA official previously mentioned.\n\nChuck Schumer himself once said that going after the IC is dumb cause they have 6 ways to sunday to take you down. And that's like.... really fucking bad. We can see the CIA hacked Dianne Feinstein's laptop while she was investigating them. I mean like..... that's fundamentally anti-democratic right?\n\nMy focus here is on the CIA, FBI, and other intelligence agencies, but you can still see this sort of bureaucratic empire building elsewhere (it's just most egregious with the IC).\n\n>I don't give a flying fuck if the person that sets seat belt safety standards is elected. I care that they did the math.\n\nI mean sure, but at the same time that's not really my concern. My general concern is that the civil service undermines democratic mandates by trying to maintain a status quo or expanding their departments. That's why I mentioned *Yes Minister*, as it tells many many stories like that.\n\nFor example, one of the episodes details a hospital that has no patients but is kept open because of civil service corruption. That's a problem right?\n\n>And our elected officials? They're too *fucking stupid* to do the math, too unskilled to do the math, too busy chasing BS election conspiracy theories on Twitter (I'm not calling it X, that's a stupid name) to do the math. They're too BOUGHT to even care.\n\nSure, but the solution to that isn't abandoning democracy right?",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tonydiethelm",
                            "body": "You don't have the foggiest bloody clue what you're talking about and your \"solution\" would be the end of all regulations, for everything. \n\n\nYou want to reign in the CIA? \n\n\nWe have congressional committees for that, and the CIA heads can be fired. Tell Congress to get off their asses and do their job instead of destroying the entire federal government because of a problem that exists only in your head and some shitty right wing blogs.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "moxie-maniac",
            "body": "The elected leadership sets the policy and provides the budget to advance that policy.  The bureaucracy implements that policy, which often consists of creating rules and regulations so that the \"worker bees\" are buzzing in the correct direction.  The elected leadership should not be micromanaging the system, but of course can hold the bureaucracy's leadership accountable.  \n\nI recall talking to an educational consultant a few years ago, who was going to be doing a day-long workshop for the incoming state legislature, basically \"Education 101,\" for people who (a) set policy and (b) have little or no idea how the system actually works.  So that's an issue, too, with elected leadership, knowing enough about the topic at hand to actually set policies.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "SocialistCredit",
                    "body": ">The elected leadership sets the policy and provides the budget to advance that policy. The bureaucracy implements that policy, which often consists of creating rules and regulations so that the \"worker bees\" are buzzing in the correct direction.\n\nI mean that's how it works in theory, not practice.\n\nA staff member of the congressional investigation into Kennedy's murder was once told by a CIA official:\n\n\"So you're from Congress - what the hell is that to us? You'll be packed up and gone in a couple years, and we'll still be here\"\n\nThat's a fundamentally undemocratic sentiment is it not?\n\nDianne Feinstein's laptop was hacked by the CIA while she was investigating the CIA.\n\nHoover famously had blackmail on Kennedy and various members of Congress.\n\nThere can't be oversight in a situation like that because the civil service has influence over the democratic body.\n\nIf you want more benign examples, watch *Yes Minister,* which are full of slightly exaggerated examples from the British government.\n\nHere's a favorite example of mine: [https://www.youtube.com/watch?v=JAk448volww](https://www.youtube.com/watch?v=JAk448volww)\n\nOr this one: [https://www.youtube.com/watch?v=rvYuoWyk8iU](https://www.youtube.com/watch?v=rvYuoWyk8iU)\n\nOr: [https://www.youtube.com/watch?v=pGJH\\_-S\\_MGs](https://www.youtube.com/watch?v=pGJH_-S_MGs)",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "I think there’s a basic premise here that is wrong—the idea that the masses know what’s best and  are capable of making all decisions of government. I don’t think this is true at all. The masses are often ignorant, shortsighted and easily manipulated. And even if they *were* brilliant and capable of performing literally every government job, how would they ever efficiently do so? What would we do, daily elections with hundreds of thousands of ballot issues?\n\nI would think of the country like a ship. The voters set the course and elect a captain to get the ship there. The captain oversees professionals who will work together to steer the ship in the direction the voters have chosen.\n\nBut imagine if the voters were micromanaging every single decision on this ship. They vote to turn the wheel clockwise but also to turn the rudder to starboard. They vote to randomly raise and lower sails on whims. They vote to drop the anchor too early sometimes and too late other times. Such a ship is unlikely to get anywhere close to its course, and it runs a high risk of getting stuck or sinking altogether.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "SocialistCredit",
                    "body": ">the idea that the masses know what’s best and are capable of making all decisions of government.\n\nThat's literally the whole point of democracy. What are you talking about? It's true that individual people may not have the knowledge to govern on specific issues, but that's why we have experts play an ADVISORY role. Let the tradeoffs of any particular regulation be known and the people decide whether it's worth engaging in for the cost.\n\n\n\n>But imagine if the voters were micromanaging every single decision on this ship. They vote to turn the wheel clockwise but also to turn the rudder to starboard.\n\nI mean this already happens within the federal bureaucracy. I'll give an example I'm fairly familiar with. The DEA kept catching coke smugglers and having to let them go. Why? Because they were working for the CIA in Iran-Contra. The FBI had to do a similar thing with various different test subjects and aides to the MK ULTRA program.\n\nThe CIA and FBI literally hate each other because they're always stepping over one another in initiatives (you should see some of the shit Hoover said about Bill Donovan, it goes far back in their respective histories, since before the CIA was even formed and it was still the OSS).",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "letusnottalkfalsely",
                            "body": "The point of Democracy is to give the citizens influence over government, not to crowdsource all government decisions. Something like a realistic and informed cost-benefit analysis for a specific regulation is waaaayyy outside the abilities of most Americans.\n\nGovernment certainly can make mistakes but I would much rather have the flawed CIA of Iran-Contra than have the voters deciding how to dismantle cartels or which governments to overthrow. That would be an utter disaster.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SocialistCredit",
                                    "body": ">The point of Democracy is to give the citizens influence over government, not to crowdsource all government decisions. Something like a realistic and informed cost-benefit analysis for a specific regulation is waaaayyy outside the abilities of most Americans.\n\nI mean can you maybe see why the right views liberals as elitist when you say shit like this?\n\n>Government certainly can make mistakes but I would much rather have the flawed CIA of Iran-Contra than have the voters deciding how to dismantle cartels or which governments to overthrow. That would be an utter disaster.\n\nI mean maybe? I'm not necessarily saying bureaucrats should be elected. I don't know the solution. What I do know is that there is a very large body of people outside of democratic oversight that have a massive influence on policy. That's the problem I am concerned about. I mean i prefer not doing Iran-Contra right?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "letusnottalkfalsely",
                                            "body": "I don’t think it’s elitist to say that 100 random people off the street wouldn’t be experts in public policy. Most people don’t even know 5% of the information they’d need to make these decisions effectively because it’s never been their job to know.\n\nThey’re not outside of democratic oversight. They can be removed by democratically elected officials.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tbtc-7777",
            "body": "For the federal government to function, there have to be some areas where process is driven by subject matter expertise rather than the Lauren Boeberts of the nation.",
            "score": 1
        }
    ]
}