{
    "title": "Do you believe there is any legal recourse to the states disallowing Biden for the late convention?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nThe state of Ohio, among possibly others, is denying Biden from being on the presidential ballot because the Democratic Convention is technically beyond the date at which state law says a candidate can be certified. Past Republican and Democratic conventions have also violated this law, but were \"waived\" in some way to allow balloting. I'm not sure if those past waivers were official acts, or something that falls more into a grey area of discretion. \n\nEither way, this is predictably outrageous, morally if nothing else. But many fellow liberals seem to think Biden should act/sue over this violation. I'm not really sure I agree that there is a case. It's more like the opposite of a violation. They *stopped allowing* violation at a strategic moment of harm. It's not really the same thing. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PlayingTheWrongGame",
            "body": "The Democratic Party can just nominate him ahead of the convention. It’s not like there’s a challenger.\n\nLike people getting legally married before they have the big ceremony. \n\nThis whole effort is designed to produce a popular vote win for Trump, regardless of EC results, so they can contest the election more. ",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "fttzyv",
                    "body": ">The Democratic Party can just nominate him ahead of the convention. It’s not like there’s a challenger.\n\nThey can't do that under the [DNC bylaws](https://democrats.org/wp-content/uploads/2022/03/DNC-Charter-Bylaws-03.12.2022.pdf), which require the Convention to nominate the president and VP.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PlayingTheWrongGame",
                            "body": "Changing that simply requires a majority vote by the delegates, who will be known by mid-June. The deadline is August. That gives them a month to have the delegates vote, and Biden has nearly all of them. ",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "loufalnicek",
                                    "body": "Yes, this seems like the most obvious way around this. Just do whatever is required for Ohio to recognize him as the candidate in advance. The convention this year is just for show anyway.",
                                    "score": 10
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "I think Democrats if they are smart about this type of situation, citation very much fucking needed, they would turn this into an opportunity.\n\nBiden is almost certainly not going to win Ohio. But Sherrod Brown might keep his seat. Talk obsessively about how Ohio is using democratic tactics and talk a lot about abortion rights. Then let Brown do his fighting for the working man thing on top of it. \n\nOn the national level, it is a great example of how Republicans do not believe in democracy and use bullshit arguments and technicalities to cheat",
            "score": 24
        },
        {
            "depth": 0,
            "author": "FizzyBeverage",
            "body": "The devil is in the details. Trump will most likely win Ohio, he’s up +9.6. \n\nThe thing is though… RFK Jr is also polling at 10% here. The feckless Ohio GOP is concerned that if Trump underperforms and RFK overperforms, Biden could sneak by. \n\nThey’ve been shitting their pants ever since we passed recreational weed and abortion rights to 22 weeks last year. Sherrod is polling well ahead of the MAGAt Moreno and they’re looking to stifle Democrat turnout there too. \n\nThe GOP is a little worried it’s not a ruby red state, because we’re not. Not to say this state will swing to Biden, it won’t, but it’s enough to make the GOP nervous. Plus, Frank LaRose got fucked in the ass on his senate primary run and finished dead last after Moreno and Dolan. Ohio repubs blamed him for this state becoming pro weed and pro choice overnight. He has 3 million reasons to be salty.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "postwarmutant",
            "body": "I'm not a lawyer, but it seems to me that the Ohio board of elections would need to provide a clear reason in court to prevent Biden from appearing on the ballot, when in previous circumstances they declined to enforce the provision.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "fttzyv",
                    "body": "It's not a discretionary decision by the Ohio Secretary of State.\n\nIn the past, the Ohio legislature has passed waivers [by enacting one-off laws](https://www.cleveland.com/news/2024/04/the-ohio-law-that-could-keep-joe-biden-off-the-ballot-has-been-in-place-for-years-why-wasnt-it-an-issue-until-now.html).  The Secretary of State just follows those as written.  They didn't decline to enforce it in the past.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "loufalnicek",
                            "body": "This is true. I don't think Ohio is under any obligation to pass such a waiver.",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kingding_Aling",
                    "body": "Would they? The text of the law is already clear. The way they allowed violations in the past in no way informs the future. Or at least, this is the point of my question. IS IT a fact that past violations means Ohio needs to explain itself in court?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "postwarmutant",
                            "body": "Like I said, I'm not a lawyer. But it's my understanding that executive action has been considered precedent in some cases.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CG2L",
            "body": "This is nothing but the GOP playing games bc Trump was removed for 1/6 in some states.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dr_Scientist_",
                    "body": "Only Trump wasn't actually removed from any state. DNC should sue Ohio on exactly the same logic SCOTUS handed down for Trump, that no one state should unilaterally decide whether a presidential candidate is on the ballot or not.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CG2L",
                            "body": "It will get struck down. It’s just games",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "loufalnicek",
                                    "body": "On what basis?",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "loufalnicek",
                            "body": "Eh, I don't think that reasoning works. SCOTUS's reasoning was with respect to the 14th amendment and how it is to be enforced; clearly, though, states can make basic rules about elections and how long in advance of an election a candidate has to be registered.\n\nKind of a dumb self-own by Ds here, in my opinion. Especially if you're going to play hardball, make sure you're not in obvious violation of pre-existing election laws yourself.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fastolfe00",
                                    "body": ">Kind of a dumb self-own by Ds here, in my opinion. Especially if you're going to play hardball\n\nThis isn't team sports. The people challenging Trump in some states have nothing to do with the people deciding convention schedules in other states. There isn't a shadowy cabal deciding to play hardball that failed to effectively coordinate two workstreams under their control.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "loufalnicek",
                                            "body": "Biden's campaign team should have been \\*way\\* in front of this.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RockinRobin-69",
                                    "body": "Except on 2012 and 2020 both conventions were after the deadline and the ohio legislature just changed the deadline. With a history of changing the deadline often, I’m not sure they could make the case that this isn’t targeted. \n\nStill considering this crooked scotus, I’m not sure how a case would go.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "loufalnicek",
                                            "body": "I can't imagine on what basis they would be *required* to make an exception to the law. If the law was created after the Democrats announced their schedule, or if it was being enforced just for the Ds, then sure. But if the law was pre-existing and is being enforced consistently, this year, I don't think there's a strong case.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "RockinRobin-69",
                                                    "body": "With a history of changing the law to accommodate schedules in the past it seems less than the Colorado case. They were applying the existing law consistently but could not do a major party candidate.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Kingding_Aling",
                            "body": ">DNC should sue Ohio on exactly the same logic SCOTUS handed down for Trump\n\nThe DNC should sue Ohio for supposedly misusing the 14h Amendment provisions against insurrection?",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kakamile",
                                    "body": "Why did you not read the words after your quote?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kingding_Aling",
                                            "body": "Because those words are also irrelevant. That isn't what the SCOTUS decided.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kingding_Aling",
                    "body": "We know *why* they are doing it. That is not the question.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Remarkable_Plastic75",
            "body": "This is a stupid tit-for-tat response to the 14th amendment cases, but it goes way beyond those. Those cases were brought by independent groups, not parties or state legislatures. They also didn't keep Trump off of any ballot, and it was pretty clear from the start that they had no real chance of doing so.\n\nThe national conventions have settled into a July and August timeline since the 1950's. It's just absurd that any state would have a deadline before the end of August, even if they usually waive it, and yes I'm levelling that as much at Washington as Ohio. If a state pushed back from the first time there was an August convention they'd have an argument, but none did and it's been 75 years, so any change now is purely partisan bullshit.\n\nOne nitpick: we don't directly vote for the president, we vote for a slate of electors. The state party would already know who they're using for electors, so the argument should be if Biden's name appears, not if there's a Democratic slate on the ballot. I can't tell if that's the real argument or not.\n\nI hope somebody blinks and Biden is on the ballot.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DBDude",
            "body": "Years ago I was mad because one state allowed Bush to be on the ballot despite it being illegal (too late like now). Meanwhile, the same state, with the help of party operatives, had done everything it could to keep a third party off the ballot. Oh yeah, I was seriously bitching about the corrupt state hijacked by party interests.\n\nIf they allow Biden, am I to believe differently because this time it's a Democratic candidate?\n\nEdited for clarity.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SovietRobot",
            "body": "Didn’t this happen before and the States just arranged for an exception?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "fttzyv",
            "body": "There might be, but I imagine the DNC might rather give in than sue if those end up as the options.\n\nCourts have historically and routinely upheld ballot access restrictions in the past when those challenges came (as they inevitably do) from third party candidates.  It's a very different thing, though, to keep the sitting president off the ballot than to keep some random candidate.  The constitutionality of these restrictions is dubious, and a court would be highly inclined to find a way to get Biden on the ballot whereas courts are rather quiescent when it comes to Joe Exotic's inability to get on the ballot.\n\nBut... if they do that, they end up setting a precedent that makes it much easier for third party candidates in the future.  And that is very much not something they want do, so I think that either some kind of creative arrangement will get worked out, or Biden will just use this as a talking point on his stump speech about unfairness but not raise a serious challenge given that if he manages to win Ohio, he's already won in a landslide.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "AskALiberal-ModTeam",
                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "California_King_77",
            "body": "Ohio isn't \"denying Biden from bneing on the presidential ballaot\".\n\nBiden neglected to get his paperwork in on time, and therefore doesn't meet the legal requirement to be on the ballot.\n\nGiven the Democrats did their level best to prevent Trump from being on the ballot in many states, the Democrats won't be able to garner much sympathy here.",
            "score": -5,
            "replies": [
                {
                    "depth": 1,
                    "author": "tjareth",
                    "body": "What paperwork did Biden \"neglect\" to get in on time?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "California_King_77",
                            "body": "He didn't get the required paperwork in to qualify to be on the ballot.  I think they actually scheduled their primary too late.\n\nHe's not being denied by the Republicans like Democrats tried to do with Trump.\n\nThis is an administrative error on the Democrats part.  The Republicans are just following the rules.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kingding_Aling",
                                    "body": "Nothing you have said is even close to correct.\n\nThe supposed reason is because the whole DNC nominating convention itself is too late in the year. There is zero Ohio-specific \"paperwork\" that has been neglected.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "California_King_77",
                                            "body": "There is a requirement for the DNC to have their nominee in place and submitted with the State by a certain time.  The state must be notified by the party in writing 90 days in advance of the election.\n\nThe DNC scheduled their primary too late - they neglected this rule, and now, by rule, they cannot field a candidate.\n\nThey're not being \"blocked by the Republicans\".  It's their own fault\n\n[https://theconversation.com/an-obscure-provision-of-ohio-law-could-keep-biden-off-the-ballot-there-in-november-229871](https://theconversation.com/an-obscure-provision-of-ohio-law-could-keep-biden-off-the-ballot-there-in-november-229871)",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "tjareth",
                                                    "body": "They didn't \"neglect\" the rule.  It's been at issue multiple times in past elections and each time Ohio's legislature was willing to accommodate BOTH the Republican and Democratic primary to manage this deadline.\n\nNothing changed except the Ohio Legislature deciding, after the conventions were scheduled, that they would no longer do this.  Maybe they can, and maybe you're OK with them playing this game just because they can.\n\nDon't try to sell it as Democrats' neglect, because I'm not buying it.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}