{
    "title": "\"Adopt vs Shop\". but to what end?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nHi everyone,\n\nI've been thinking about the \"adopt vs shop\" debate for pet owners and I'm curious to hear your thoughts. When do you think it’s acceptable to \"buy\" a puppy or kitten? For instance, if all the shelters in your area were empty and had a wait list, would it be okay to go to a breeder? Or, imagine if the US government outlawed the breeding of dogs and cats – would people have to wait for a stray to show up with a litter?\n\nI’m leaning \"Team Adopt,\" but I'm wondering at what point buying might become a consideration for me.\n\nI'm trying to get an idea of what the future would look like if all dog/cat breeding were outlawed, and then these animals were given extinction risk protection by various federal wildlife agencies.. like how far are we going with this?\n\nLooking forward to hearing your perspectives! \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "cossiander",
            "body": "The push for adoption is *because* of the problem with shelter pets in need and too many strays. If that problem was gone, then there would be no impetus to adopt.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "Ahh.. I assumed the people who were vehemently against buying would hold that argument even if there were no shelter animals.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "My sister volunteers at a dog shelter. And when I mean volunteer, I mean she is served on the board and helped run fundraisers and is there multiple times a week. \n\nShe has never owned more than one dog at a time, but there have been times when there’s four dogs in her house because the overflow at the shelter is so great that people just start taking them home temporarily.  And occasionally it’s situations like the dog she brought home because he was old and blind, and there was zero chance anyone was going to adopt him so essentially it was hospice care.\n\nBut most of the time it’s a young healthy dog that would do well in any family with or without kids. They have the same situation with cats and birds and so many rabbits every Easter. \n\nI don’t think she’s going tell you that they should shut down all breeders even now while she has a surplus. However, she has a passionate hatred of puppy mills that pump out purebred dogs that are genetically unstable due to inbreeding. \n\nHonestly, I think it’s more a issue of much stronger regulations being needed",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "toastedclown",
            "body": "I think we should close down puppy and kitten mills but I am okay with letting reputable breeders continue to operate.  These are the *only* people who should have unneutered dogs or cats.\n\nAs far as shelters go, dogs are an iffier situation because they come in all shapes and sizes and each has specific traits, but I don't think there is a single animal shelter in the US that doesn't have more cats than they know what to do with.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "Agreed.\n\nWhat if there was an adoption agency that specifically worked directly with breeders, and facilitated direct from breeder adoptions of purebred dogs/cats?\n\nFor instance.  A breeder has a female Goldendoodle.  Its 3 years old and had 2 litters. The breeder wants to retire the Goldendoodle, but doesn't want it to go to a shelter (wants to know that its future family will care for it and send updates).\n\nBut still there's an adoption fee..  like maybe $900 instead of $6000 (or whatever the going rate for a goldendoodle puppy is)\n\nWould you adopt from that \"direct from breeder\" agency? or would you wait for the dog to arrive at the ASPCA?\n\nFYI i'm not pitching anything or any business.  I was just wondering if people would be open to a gray area adoption in which you're picking up a retired breeding dog directly from a breeder.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "toastedclown",
                            "body": "I don't see a problem with any of that.  My family got our golden retriever from a breeder that didn't want to breed or show her.  I think we paid something like $200 in 1998.  She was an awesome dog and lived to the ripe old age of 16!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "The simple answer is: Don't worry about it.\n\nWe don't foresee any reasonable possibility of us getting *so good* at preventing the birth of unwanted pets that we will run out. \n\nHeck, animal shelters simply don't empty out.\n\n--------\n\n>I'm trying to get an idea of what the future would look like if all dog/cat breeding were outlawed...\n\nBut we haven't outlawed it, nor do we have any plan to outlaw it.\n\n...and similar moral 'should nots' -- like 'you should not litter' -- *have* been outlawed, without completely eliminating the outlawed act.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Oceanbreeze871",
            "body": "I’ve adopted 5 dogs in my life and I think it’s the best way. I have many dog park friends who have pure breads and no judgments I guess, but I don’t love it. Nice dogs, cool people. i paid $20 for my dog you paid $2500. Cool. \n\nIf you have a strong conviction to own a specific breed of animal then i guess it’s ok but I think it’s odd.\n\nI just find the practice of breeding purebred pets to sell for profit be a bit….ugly. Esp in some cases like bulldogs and frenchies actually cruel, as they have major quality of life issues and defects due to decades of breeding for aesthetics that locks in inherited problems.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "Purebred anything have issues... as the breeding pool is significantly smaller than the mating partners available to a mutt (a mutt can breed with any mutt) but a Goldendoodle has only a select few breeders with a breeding partner available (and that dog may be a second cousin of the on that wants to produce a litter to begin with)",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Oceanbreeze871",
                            "body": "I know a few doodles and they are all completely different dogs depending on if bred with full true doodles or halfsies and all that stuff. So odd. Cool doggie though",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tjareth",
            "body": "I'm more used to \"have more pets than you really want because one of your kids brings a stray in and you grow attached trying to find a shelter that won't kill them.\"\n\nMy most recent kitten was an adoption, but it's the first time I've said \"Let's go get a cat\" intentionally in more than 20 years, because for once we moved into a place and only brought one with us.\n\nThat said, if someone had adopted/rescued many pets in their life, and just once or twice decided to go for that perfect kitten I wouldn't think much less of them.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "deepseacryer99",
            "body": "Our dog is a purebred Cairn Terrier, but we looked all over the state to adopt first.  We got him during the pandemic and our apartment at the time restricted weight to under 35 pounds.  We found a few over the course of looking, but they got snapped up really fast.\n\n\nWe ended up going with the Cairn from the hubby's aunt for free, so I guess it worked out.\n\n\nOur cat is from the local shelter, though, and she's also amazing.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TreebeardsMustache",
            "body": "With respect to dogs, (and because I care about cats about as much as they care about me...) I'm leery of adoption.   Dogs are just bundles of empathic energy... and a dog that's been abused, abandoned and/or just  plain had a bad/clueless owner is going to be more effort.  Bad habits, anxiety, willfulness, having had no discipline, or the wrong kind of discipline, etc, takes time and resources to overcome.  It breaks my heart to say no to that, because those are the dogs that need love and training the most, but I don't feel capable of properly giving it.  I like the idea of getting a puppy immediately after weaning, start training right from day one and developing a bond with it without any intervening owners having bonded or given it bad habits or the wrong kind of discipline.\n\nOn the other hand, getting a dog from a breeder is a whole other kind of hassle.     I was looking to get a boxer, pre-covid, and trying to find a breeder that didn't dock the tails and/or the ears was nigh on impossible.  It is a ridiculous and cruel standard of breeding and I don't think any dog ought be deprived of its tail or have its ears reduced.   My living situation changed when covid hit, and suddenly I didn't have the space to have a dog, so I'm glad I didn't get one.    But I'm rebuilding and maybe sometime soon can find a boxer or two to bring into the family. \n\n  \nThe other thing to think about is the possibility that the dog you adopt from the shelter might have been a breeders dog whose previous owner just didn't know what they were doing or ended up in the shelter through a possibly bizarre set of circumstances.  So you could, in adopting, be putting your feet in both problems... \n\nThat's my two cents on the debate.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Kakamile",
            "body": "Yeah if the shelters are empty sure ofc\n\nOr if you want a baby\n\nThough even if you want a special breed, there are often still rescues or off breeds that need a home because they were not \"pure\"",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "Wouldn't it be up to the USDA? Pets aren't wild animals. Breeds of dogs definitely go extinct. But it's not like they were natural creations to begin with.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "True, they are all wolves at the end of the day.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "PepinoPicante",
            "body": "I do some volunteer work with shelters and rescues. Here's my perspective:\n\nShopping is toxic under pretty much every modern circumstance. There are too many animals, the breeders are exploitative/badly regulated/cruel, etc., the costs of buying are huge compared to adopting, people who are not disciplined enough to go through an process probably purchase a decade+ commitment. The hyper-bred dogs have all kinds of bonus, costly health issues as well. And, even worse, the breeders constantly dump unsold \"inventory\" into the wild, increasing the need for adoptions or just creating food for the coyotes.\n\nPlus, there is just too much need for adoptions. Animals often outlive their circumstances and need somewhere to go. They don't die just because their owner died or has to move to another country or whatever.\n\nAnd if you're not sure about it, sign up to be a foster. You'll get to be a little picky, they usually give you free supplies/food/etc., and you get to \"test drive\" the animal to see if it's a good match. If not, it will get adopted and you can try another one. Make friends with the people who run the shelter and, if it turns out you were looking for some specific kind of dog, you'll be the first person to get the call for it.\n\n---\n\nSure, if your hypotheticals came true, maybe there are rare circumstances where you'd be in a situation where adoptions weren't available. But we are not anywhere near outlawing breeding or anything like that for pets. And the shelters are nowhere near empty. They only had a real shortage when Covid happened and everyone suddenly wanted a pet. After Covid, *plenty* of those animals were returned or dumped.\n\nObviously, a lot of the rescue animals are \"suboptimal\" (most people want cute babies/youth in specific breeds or colors... so that can be fairly hard to accommodate in a pure adoption situation). Lots of animals are older, may have some behavior issues, lack training, etc. - but most of those will be overcome by a good home... and shelters are understanding when someone adopts a pet and is overwhelmed by the issues that come with it. \n\nShelters would rather you bring the animal back than dump it or neglect it. \n\nAnd there are shelters all over. It would be cheaper to fly to Hawaii or Puerto Rico, spend a week on vacation and adopt an animal than to buy some very in-demand pets.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "xynix_ie",
            "body": "I've noticed that purchased \"pure bred\" dogs have funky diseases and die pretty young. My assumption is low genetic diversity.\n\nOur 15 year old mutt has outlived two of my mother in laws French Bulldogs, not at the same time, back to back. One had problems from 2 years until 4 and died real young. The other managed to make it to 7. She's on her 3rd now.\n\nThe other set of parents had two other special breed dogs, neither made it to 10 years old. My other mutt, a Jack mix, lived until she was 17.\n\nSo source is probably a big issue here and genetic diversity is obviously super important for the long term health of the animal. I don't think anyone cares about that though. Buyer apparently, or seller.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "Inbreeding of purebred dogs (especially newer popular breeds) is a real problem.   Even if they aren't direct siblings, they are often distant cousins due to the lack of viable \"like for like\" breeds that aren't from the same tree despite being from opposite sides of the globe.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Space_Pirate_R",
                    "body": "A lot of people will talk about how no responsible breeder would make a hybrid like a doodle because there's no way to know what health problems they might have.  But it's well known that mixed breed dogs on average live longer than purebred dogs.  There's no shortage of sources for that.  [Here's one](https://pubmed.ncbi.nlm.nih.gov/37483958/).\n\nIt's pure snobbery masquerading as concern for animal welfare.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "throwdemawaaay",
            "body": "I think at the very least you should check out adoption. There's many wonderful animals that would be great companions that will be killed otherwise. Be open to the idea that you may find one that's perfect for you even if it's not the idea/breed you're initially interested in. An animal is not something you should choose like a fashion accessory.\n\nIf you want a cat please consider a simple all black one. They're the most commonly euthanized ones because people want something that looks more exotic.\n\nWith breeders it's very important to find someone reputable and ethical. \n\nThere are a lot of backyard breeders that don't know what they're doing and don't provide for the animals properly. This is especially a concern with breeds associated with dog fighting, like pits, rottweilers, etc. These can be absolutely wonderful animals but a bad breeder when they're a puppy can set them up for lifelong behavioral issues.\n\nObviously don't support puppy mills and similar stuff that's just horrid.\n\nSo in summary, prioritize adoption, be open to the idea that the perfect companion for you isn't necessary what you initially imagine, and if you do go to a breeder be very choosy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "As many stray cats as exist in the world I have a hard time imagining there will ever be a shortage of them.\n\nI don't see that many stray dogs so that would be a different story, but I think in practice we're a long way from that being a concern.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "taming a wild stray cat, vs raising one from scratch is a different level of commitment and patience.  Thats after you wait for a random stray cat to arrive at your back door begging for food, or waiting on a list to adopt one from Animal Control.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "HotStinkyMeatballs",
            "body": "I grew up with dogs. I have no problem buying them from breeders due to the huge differences in temperments and needs between breeds. My friend bred rotties and if he didn't have a nursery (plant type) the dogs would be fucked. They need exercise/space etc.\n\n  \nNow I have cats. Adopted two, fostered two (kept the second). I lean towards adoption because it's easier and there's no shortage. \n\nBreeders aren't evil. Breeding isn't evil. There's shitty breeders just like there's shitty...any profession ever.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RedditLife1234567",
            "body": "Curious why shop vs adopt doesn't apply to human babies. There are so many babies/children that need adoption, but we are okay with \"shopping\" (making new) babies",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "Exactly, the same people that scream \"adopt, don't shop\" are the first people to make their own babies instead of adopting. Even LGBTQ couples are using one person's sperm (one partner, or one friend), instead of adopting from a shelter.   But they would NEVER buy a dog from a breeder because that's against their morals.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BeneficialNatural610",
            "body": "For cats, adopt. For dogs, shop. There are too many problem dogs in the shelters with bite histories. Shelters intentionally mislead adoptees on the breeds and pasts of the dogs, which usually ends in disaster. We need to bring back kill shelters and euthanize the problematic dogs.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pablos4pandas",
            "body": "> I'm trying to get an idea of what the future would look like if all dog/cat breeding were outlawed, and then these animals were given extinction risk protection by various federal wildlife agencies.. like how far are we going with this?\n\n\nThat does somewhat feel like worrying about what if we beat climate change too well and the amount of Carbon in the atmosphere gets too low. The problem at the moment is immensely the opposite. There are about 6 million pets that go through the shelter system in the US every year and 1 million of them are euthanized from [this source](https://www.aspca.org/helping-people-pets/shelter-intake-and-surrender/pet-statistics). With those numbers I would not be worried about cats and dogs going extinct anytime soon, and if the numbers to plummet in the future then policies could be changed. We're not locked in forever",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "The concept of pet owners is strange to me. But it is for your enjoyment, so if you want a specific kind of dog or whatever, buy it. Because you want it is justification enough, IMO. \n\nThat being said. There are a lot of animals that need to be adopted. So adoption would be my recommendation. Especially if you are in a position to adopt an older pet. They seem to be the hardest ones to find homes for.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sad_Lettuce_5186",
            "body": "Yeah it does feel like the terminology of buying living beings wont age well. \n\nLike, do we buy orphans, or do we adopt them? \n\nI think it’s probably for the best to stick to a shelter",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bushwick_Hipster",
                    "body": "Maybe there's a better term for it? For instance i've always wanted an African Gray Parrot, which is \"the most talkative\" and quickest learning of the breed.\n\nNever got one as I never really felt prepared for the responsibility.\n\nBut if I did, i'm not sure there's another term to describe my acquisition of one.  I'd have to whip out a thesaurus to figure out a better way of saying \"buying a bird\"\n\nmaybe \"buying caretaker rights\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Odd-Principle8147",
                            "body": "'Buying a bird' is the appropriate way to say it. A pet is legally property.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "My point wasnt rooted in legality, but rather morality.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Odd-Principle8147",
                                            "body": "If you have to come up with phrases to get over a moral objection, you should evaluate if that thing is moral. I don't own pets because I think owning a living thing for entertainment/enjoyment is distasteful. \n\nThat said, there are a lot of pet owners who absolutely love their pets and couldn't imagine not having one. Most of my extended family, for example. But that doesn't change that that pet is property. Often bought and paid for.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "Are adopted kids property? Theyre paid for and bought too arent they? Also you dont, “adoption” exists",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Odd-Principle8147",
                                                            "body": "I'm against adopting children as pets.\n\nHumans and animals are recognized differently in the eyes of the law. If you are uncomfortable with animals being property, take it up with the courts. But until you change that legal precedence, pets are property.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sad_Lettuce_5186",
                                                                    "body": "Would you say the law determines morality? \n\nI wouldn’t say that. My argument hasnt been about legality at any point",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Odd-Principle8147",
                                                                            "body": "I would say morality is subjective. That is why the law exists.  \n\nAlthough I dont personally like the concept of pet ownership. I don't see owning a pet as immoral. I don't see using the phrase 'buying a pet' as immoral. If you enter into a monetary transactions for a pet. It is literally what you are doing. You need a euphemism to be comfortable with it?",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Sad_Lettuce_5186",
                                                                                    "body": "> I'm against adopting children as pets.\n\nBut not against adoption. Which requires a monetary transaction \n\n> **Humans and animals are recognized differently in the eyes of the law.**\n\nThats the distinction you laid out \n\n> I would say morality is subjective. That is why the law exists.\n\n> Although I dont personally like the concept of pet ownership. I don't see owning a pet as immoral. I don't see using the phrase 'buying a pet' as immoral. **If you enter into a monetary transactions for a pet. It is literally what you are doing.** \n\nIt’s literally the exact same for adopting children. Yet, you dont call it buying a kid, because you dont personally see kids as property. \n\nShould we be seeing any living beings as property? Probably not. Is that something you disagree with morally?",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Odd-Principle8147",
                                                                                            "body": "The legal system lays out that humans and animals are different. It's not something I laid out. \n\nI have no moral objection to animals being property. \n\nThe reality of the situation is that, in America, at least, pets are your personal property.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                    "body": "Hows this: America at one point labelled Black people in the south as property. Did that make it true? \n\n> i have no moral objection to animals being property\n\nThen thats the distinction. It has nothing to do with transactions or law. **You personally see them as being property**.  \n\nIts reasonable to disagree with that perspective and it doesnt require any mental gymnastics",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Odd-Principle8147",
                                                                                                            "body": "But it requires euphemism for you to be comfortable with it. At least I am being honest with myself about what is going on.",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Bushwick_Hipster",
                                                                                                                    "body": "Angelina Jolie \"adopted\" several kids from all regions of the earth overnight, 0 of them being from America.   The marketing pamphlet maybe have portrayed the glossed over backgrounds and import logistics but at the end of the day, it was easier to import than adopt locally.   So who is to verify whether the countries they came from were willingly looking for American's to offload their overwhelmed shelters, or whether or not they are selectively advertising the \"prettiest, sellable kids\" to move fast to America or the UK?  and at that point, the only word you can take for the source of these kids is the adoption agency itself.. which is providing a premium service to get an Asian kid overnight, vs going through a 7 month interview process for a US kid.",
                                                                                                                    "score": 2
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Bushwick_Hipster",
                                            "body": "Acquiring \"legal guardianship rights\" to said animal via a nominal fee of \"exactly what it would have cost to buy one\"",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "I mean, adopting kids isnt free either. But unless you call that buying kids too, then you know exactly what im saying",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Bushwick_Hipster",
                                                            "body": "but also you can \"adopt\" a kid from India, Africa, China.. and feel good about it... absent real regulations, you just \"bought the child\" to dodge the US regulated red tape.  (See all celebrities with 5 African and Asian kids acquired almost overnight)",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "Probably “adopting” or “seeking”. Cool bird choice too",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ElboDelbo",
            "body": "As long as a breeder is reputable, I don't see a problem with getting a dog from one.\n\nHowever, I do think if you are getting a dog for the first time, you should adopt.  \n\n1.  Breed standards can create health problems.  Not all the time, and of course adopted shelter dogs are also susceptible to health problems as well...but take the bulldog, for example:  their short noses and faces make them at higher risk of heat stroke (they can't pant enough to reduce temperature) and other breathing problems.  I don't think that possible health issues is a reason not to buy a dog from a breeder, but if you are a first time dog owner, you might want to hedge your bets with a dog that is less at-risk.\n\n2.  You might not be a dog person (and that's okay!).  Say you get a dog and realize \"Oh fuck, I thought this would be a lot easier.\"  It happens.  So, sadly, you have to rehome the dog...but would you rather be out a few hundred dollars or a few thousand?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TopazWarrior",
            "body": "Some of us have working animals and breed conscientious litters with health testing and performance testing. A pound puppy ain’t cutting it.",
            "score": 0
        }
    ]
}