{
    "title": "Who are some liberal commentators that I should pay attention to during this election?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nI have been a conservative most of my life but am interested in expanding my view of US politics, especially with the upcoming election. I am eager to listen to some left-leaning commentators, and am wondering who this sub would recommend. \n\nI have lots of time at work to listen to radio / podcast content. For reference, in the past I have listened to Ben Shapiro, and enjoy his format.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Trung_gundriver",
            "body": "Last Week Tonight's overwhelming theme is how problems that you don't pay attention to are in suckass situations due to lacking proper regulation. Very fun jabs at authoritarianism as well",
            "score": 7
        },
        {
            "depth": 0,
            "author": "waterboyh2o30",
            "body": "David Pakman. While he's left wing, he criticises both sides of the political spectrum. He comments fairly on whatever anyone has to say.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "luckyassassin1",
                    "body": "Yeah I really like his commentary because he doesn't just pander to his side.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "A-passing-thot",
            "body": "As others have said, Beau of the Fifth Column is excellent.  For some further left perspectives, *It Could Happen Here* is worth a listen.  Their target audience is activists/people who want to make changes around specific issues that they cover.  Because their target demographic is to the left of progressive, their stances on things like Palestine, police, and such may be a turn off but I would guess you're likely to agree both on the principles (small government, non-hierarchical organizing, charity, collaboration, community preparedness, etc.) and on the issues they raise (people dying at the border, suppression of free speech, climate change, and so on.)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Judgment_Reversed",
            "body": "Pod Save America\n\n\nBeau of the Fifth Column\n\n\nDavid Pakman\n\n\nAnd oddly enough...The Bulwark (a podcast by center-right, NeverTrump, socially liberal-leaning former Republicans)\n\n\nAll of the above are on YouTube.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "StatusQuotidian",
            "body": "You might enjoy the new Beutler / Yglesias podcast: [https://www.politix.fm/](https://www.politix.fm/) \n\nAlso Ezra Klein's a good centrist one.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "othelloinc",
                    "body": "Yglesias and Klein are very good on serious policy matters.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "StatusQuotidian",
                            "body": "5-4 is really good if you want to laugh and be angry about things you cannot do anything about",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "grammanarchy",
                    "body": "I’m happy that Yglesias has a new podcast!  I miss the glory days of *The Weeds.*  Also, my impersonation has been getting rusty…",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "PlayingTheWrongGame",
            "body": "Paying much attention to political commentators in general is a mentally unhealthy activity. Regardless of their specific politics. ",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "NPDogs21",
                    "body": "It’s not the best, I agree, but political commentators have millions upon millions of followers and a lot of influence. People want to listen to others they enjoy or reinforce their ideas ",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "lionmurderingacloud",
            "body": "Try the Bulwark. They are all.never Trump Republicans and pretty conservative, resume and policy wise. Tim Miller, Jonathan V Long (known as JVL) and Sarah Longwell are the main publishers and podcast hosts.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "serephita",
                    "body": "They have also had some overlap with the Pod Save America crew, Tim has been a guest I think twice in the last 1-2 months. So both might be worth a listen.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "e_hatt_swank",
            "body": "I would recommend Chris Hayes’ podcast Why Is This Happening?  Was just listening to the latest episode while mowing the lawn… he’s talking to climate writer David Roberts about comparisons between Trump’s and Biden’s climate policies. Very in-depth discussion & more nuanced than a conservative might expect! It’s a really smart, informative show.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Target2030",
            "body": "Heather Cox Richardson does a lot of research and cites all her sources",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheHowlinReeds",
                    "body": "She does excellent work",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kakamile",
            "body": "If you listen to Ben Shapiro, even just npr would be an improvement\n\nLast Week Tonight and Some More News do comedy and politics deep dives, Beau of the Fifth is like rural left libertarian, Crooked Media like pod save America is ex-Obama staffers stuff. I like the npr economics podcasts",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "DickieGreenleaf84",
                    "body": "> Some More News\n\nAs much as I personally love Cody (and Warmbo), I think this would be a bad call for someone coming from a far-right perspective. He definitely \"preaches to the choir\". Which is sad because his piece on conservative comedy, and his one on Shapiro as a failed actor were both brilliant pieces of analysis.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "I dunno what Beau would think of being called a libertarian. I deeply suspect he's... VERY left. :D\n\nBut DAMN are his takes on stuff usually pretty damn good. And it's nice to get news in a slooooooow southern drawl instead of the edited quick cuts so many use on Youtube. Ugh.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "A-passing-thot",
                            "body": ">I dunno what Beau would think of being called a libertarian.  I deeply suspect he's... VERY left. :D\n\nHe doesn't like to label himself because it turns people off but as I understand it, he considers himself to be a libertarian socialist.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "twilight-actual",
                            "body": "I think he's a half-hearted lefty, of the benign-anarchic varieties, but you'd have to ask him to really specify.  He knows the score, and what is possible, and while he's not a Democrat or a Republican, he reports on goings on with amazing alacrity.  He's also seemingly well connected with DC folks, and is fluent in foreign diplomacy, military topics, etc.  He's pretty well plugged in, and you will often hear things from him before you'll see it anywhere else.\n\nDon't let the southern drawl fool you, or the simple structure of the garage in the background.  That's all planned.  He's built a set apart from his house so he can have a team working crazy hours to pump out material that looks like his garage. His demeanor and appearance have been calculated to appeal to the people that he feels need to hear his message the most.  Dude is probably pulling down nearly seven figures per year by now.  \n\nI respect the hell out of him, and will continue to do so as long as he stays true.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tonydiethelm",
                                    "body": "Oh, I know. :D",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": "https://www.youtube.com/@BeauoftheFifthColumn\n\nHe looks like a redneck, talks like a redneck, but is VERY left. \n\nHis videos are not editedforspeedlikesomanyotherswiththedamnquickcuts. You get commentary on news and politics in a sloooow southern drawl, and dry wit, with the occasional eyeroll thrown in for good measure. \n\nHe knows his stuff, and is pretty good about separating his opinion from the facts. His Ukraine coverage has been absolutely fantastic. He usually tries to look behind the scenes on world/political news. I value his takes.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "The left doesn't have a real equivalent to Ben Shapiro, thank god. Closest in format *might* be Pod Save America. I don't really listen to it unless there is a specific guest I hear about. I can't recommend to much on YouTube type format.\n\nEzra Klein. Maybe start with some of his interviews with right wing people. Since you are on the right maybe subscribe to the main Bulwark podcast and get Never Trump voices. Though the host Tim Miller also has left wing people on. Jamelle Bouie and Paul Krugman are good at the Times. Clare Malone at The New Yorker is excellent. Matt Yglesias is behind a paywall now but he's good.\n\nI would suggest the left leaning writers for The Atlantic. The right leaning ones at there as well. ProPublica is great for long form investigative journalism. The main politics section of the NYT, WSJ and WP are all fine.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "Maybe? I don’t know Destiny at all. I know he falls into the space of treating people like Ben Shapiro and Jordan Peterson as if they should be debated with which is a huge knock against him.\n\nDoes he copy Ben Shapiro’s faux intellectualism model?\n\nI think the biggest reason it’s safe to say the left doesn’t have a Ben Shapiro is that the left doesn’t have someone like Ben Shapiro with that level of influence.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "NPDogs21",
                                            "body": "Do you believe people like Shapiro and Peterson shouldn’t be debated? They clearly are popular and have a lot of influence. Why should they not have their awful ideas pushed back against? ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ButGravityAlwaysWins",
                                                    "body": "You can push back on dishonest actors without actually having them on to “debate“. That’s especially true of someone like Ben Shapiro whose skill is engaging in fake debates where he gish gallops and performs strength and certainty better than most.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "NPDogs21",
                                                            "body": "Shapiro has been doing his thing for like 10 years now. Where are those people, and has his audience gone away? He’s more popular than ever and his a whole media company. If his ideas are that bad, which I think they are, it’s beneficial to have pushback from a liberal perspective that isn’t just college students making surface level arguments ",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "An_Absurd_Sisyphus",
                                    "body": "Yes, he absolutely copies Ben Shapiro's faux intellectualism. Destiny recently debated a historian who happens to be an expert on the modern state of Israel. It was very clear that Destiny spent a week or so reading Wikipedia articles and was lecturing this legitimate and well respected academic in the field he holds expertise. But its 2024 and the internet, so the actual argument and evidence isn't seen as important by the audience, its just about who's opinion you already supported.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "NPDogs21",
                                            "body": "This is the debate you’re referencing: https://m.youtube.com/watch?v=1X_KdkoGxSs&pp=ygUVZGVzdGlueSBub3JtYW4gZmlua2Vs \n\n>It was very clear that Destiny spent a week or so reading Wikipedia articles \n\nhttps://www.reddit.com/r/Destiny/comments/1coih9u/destiny_only_reads_wikipedia_as_4thot_requested/\n\nAll his research is streamed, so claim something that isn’t true? \n\n> was lecturing this legitimate and well respected academic in the field he holds expertise.\n\nDo you believe you should have to hold advanced degrees to be able to debate someone or that having those degrees necessarily means they’re right? As an example, one of the experts you reference, Norman Finkelstein, said the Houthis deserve a Nobel Peace Prize. \n\n>But its 2024 and the internet, so the actual argument and evidence isn't seen as important by the audience, its just about who's opinion you already supported.\n\nIs that true for you? Would learning new information here change your mind, or is your opinion already made up and unchanging? ",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "An_Absurd_Sisyphus",
                                                    "body": "So, you are completely provied my point for me.\n\nOne of the frustrating tactic Destiny uses, and many of the \"debate bros\" use is inconsistently holding others to be hyper-literal, while them themselves get to dismiss things as figurative. Me saying that Destiny spent a week reading Wikipedia was a figurative statement. I dont believe he literally spent a week reading Wikipedia. Obviously my statement was about his lack of actual background knowledge.\n\nAnd so, sure, rhetorically....you got me. Congratulations. But as a matter of substance, you achieved absolutely nothing except forcing me to clarify a statement which didn't actually need clarification. But for a \"debate bro\" this is exactly what matters.\n\nI never stated anything about advanced degrees. No, I don't believe that you must hold an advanced degree to debate. However, especially in the humanities you need to have a similar amount of background knowledge and at least a reasonable agreement on the facts in order to have a meaningful debate.\n\nFor example,  my degree is in history. I cant have a debate about a chronology of events with someone who doesn't acknowledge that radio carbon dating is a reliable means to provide dates to something. In stead of debating the topic we want, we would need to settle radio carbon dating first. If we don't agree on the basic facts underlying the debate, then we are having a different conversation entirely.\n\nThis is what Destiny did (and often does) in that \"debate\". Sure, it makes him seem like he has a counter argument, but it really is just obstruction, not a counter argument.\n\nFinkelstein's views on the Houthis is absolutely irrelevant to the facts about a debate about Israel.\n\nI am always happy to change my mind, but what you presented doesn't do it. Whenever that happens, I always try and give a reasonable and respectful reason why I didn't change my mind.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "NPDogs21",
                                                            "body": "I believe everyone should be held to the same standard. Substantively, what was said that showed he did not have enough reading and understanding of the issues to have a proper discussion? \n\n> For example, my degree is in history. I cant have a debate about a chronology of events with someone who doesn't acknowledge that radio carbon dating is a reliable means to provide dates to something. In stead of debating the topic we want, we would need to settle radio carbon dating first. If we don't agree on the basic facts underlying the debate, then we are having a different conversation entirely.\n\nDid you watch the debate itself or any other ones, not clips? If we’re operating under your framework, we should be able to point out where he clearly doesn’t understand what he’s talking about. He debated one of the far-right Zionist members of Israelis government about how the expansion of West Bank settlements is preventing peace and he supports a 2 state solution. I don’t understand how someone with so little knowledge can be having these high level debates and not be easily shown he’s factually incorrect on fundamental positions. \n\nI have my biases, I admit, but I was open to hearing what Norman Finkelstein had to say that would lead to a better understanding of the conflict and how it may be resolved. What was his approach to talking about those issues? He pulled out individual quotes from Benny Morris’ books to attack him over (so much that the moderator had to tell him to stop) when he had that author right there that could explain the context. If he has spent his whole life to the I/P conflict, I would expect he would be able to properly educate Destiny on how he was factually incorrect. Instead, he spent the whole debate slinging insults and calling him different names. \n\nhttps://m.youtube.com/watch?v=Fls1z4e4nvo&t=136s&pp=ygUXbm9ybWFuIGZpbmtlbHN0ZWluIGxleCA%3D\n\n>Finkelstein's views on the Houthis is absolutely irrelevant to the facts about a debate about Israel.\n\nIt’s relevant when he appeals to international law. Is there not a glaring contradiction when you claim Israel is breaking international law and we should respect the rules/laws in place yet his position is that it the Houthis breaking international law is acceptable?  \n\nI think it’s fine not to like him or prefer scholars instead. The issue is when people only trust or listen to scholars who ideologically agree with them, ignoring contradictory facts. ",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "An_Absurd_Sisyphus",
                                                                    "body": "Can we start by outlining what I am saying vs what I am not saying? \n\nI'm not saying we should hold people to different standards. I am not saying what we should and should not be able to point out. I am not saying Finkelstein handled the debate well. I am not saying anything about the Houthis or international law. I am not saying I only trust scholars. \n\n95% percent of what you wrote has nothing to do with my point at all. It sounds to me like you want to debate the debate, and I am just not interested. I simply don't care. \n\nWhat I am saying is that Destiny, and many other \"debate bros\" are faux intellectuals who are trying to win debates, but not necessarily winning arguments. And so, Destiny employs rhetorical tools to make his argument seem more valid than a simple discection of the facts would. Destiny is a good rhetorician, but that doesn't mean he actually has a perspective or knowledge that adds to the understanding of the issue. He masks his ignorance about a topic with rhetoric, and he is very good at it, but never the less, that ignorance just muddies the water. Meanwhile, it contributes absolutely nothing to the discourse. This is a common debate tactic, even Plato complained about the sophists doing this.\n\nI watched the full debate because I wanted to specifically see how someone defends Israel. What arguments were they going to use? Destiny, by and large, did not argue in a way the disputes the facts of Israeli genocide. He made a rhetorical argument about why Israel commiting genocide is justifiable. I only care about the factual basis, which Destiny didn't meaningfully dispute. I wasn't interested in justification. Similarly, I only care about the factual basis of the October 7th attack. I am not interested in Hamas' justification. I can think for my self. \n\nA good debate gives you the tools to reinterpret the evidence for yourself. You should learn from an intellectual debate. Destiny isn't trying to do that. Destiny is trying to sell an idea and the Israel debate is just one example. He isn't an intellectual, he is a salesman.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "NPDogs21",
                                                                            "body": ">What I am saying is that Destiny, and many other \"debate bros\" are faux intellectuals who are trying to win debates, but not necessarily winning arguments. And so, Destiny employs rhetorical tools to make his argument seem more valid than a simple discection of the facts would. Destiny is a good rhetorician, but that doesn't mean he actually has a perspective or knowledge that adds to the understanding of the issue. He masks his ignorance about a topic with rhetoric, and he is very good at it, but never the less, that ignorance just muddies the water. Meanwhile, it contributes absolutely nothing to the discourse. This is a common debate tactic, even Plato complained about the sophists doing this.\n\nIm asking for the arguments. Concrete examples you can point to and say “This is his argument and this is why it’s wrong.” I would understand then where you’re coming from. Saying someone just uses rhetoric to win but their arguments are fake or faulty shows but people aren’t willing to provide those examples is lazy at best and dishonest at worst. An example would be Ben Shapiro and Steven Crowder types saying they can debate/own “the left” but will mainly debate college kids. \n\nhttps://m.youtube.com/watch?v=6VixqvOcK8E&pp=ygUcYmVuIHNoYXBpcm8gYnJpdGlzaCByZXBvcnRlcg%3D%3D\n\nHere is how Shapiro reacted when he got pushed too much by a BBC host, by ending the interview. \n\n> I watched the full debate because I wanted to specifically see how someone defends Israel. What arguments were they going to use? Destiny, by and large, did not argue in a way the disputes the facts of Israeli genocide. He made a rhetorical argument about why Israel commiting genocide is justifiable. I only care about the factual basis, which Destiny didn't meaningfully dispute.\n\nDid he not talk about the specific intent required and necessary as a component of genocide, dolus specialis? Is that international law and intent merely a rhetorical argument and not a factual component of genocide? \n\n> Similarly, I only care about the factual basis of the October 7th attack. I am not interested in Hamas' justification. I can think for my self.\n\nA group kills the most amount of Jews since the Holocaust, records themselves doing it, shares it with the world, claims they do it and why, and you aren’t interested in their justification? That’s wild. \n\n> A good debate gives you the tools to reinterpret the evidence for yourself. You should learn from an intellectual debate. Destiny isn't trying to do that. Destiny is trying to sell an idea and the Israel debate is just one example. He isn't an intellectual, he is a salesman.\n\nWhere are these intellectual debates happening? Where are these long-form academic discussions happening that can better inform a broader audience? ",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "An_Absurd_Sisyphus",
                                                                                    "body": "But I am not interested in debating this. Debating a debate seems absurd to me. I am totally fine if you like Destiny. It doesn't shatter my world at all. It's fine that you disagree with me. This is exactly why I don't like debate bros.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "NPDogs21",
                                                                                            "body": "Then why make claims that are factually incorrect and say people who ask for supporting evidence are debate bros? \n\nYou said you have a degree in history. If someone makes a historical claim, they are generally required to provide sources and evidence. If people don’t like sourcing their arguments or data, they aren’t or shouldn’t be believed by the broader historical community.\n\nThere’s plenty of reasons not to like Destiny, including a bunch of drama or streaming, rather than things that didn’t happen ",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "An_Absurd_Sisyphus",
                                                                                                    "body": "You take this way too seriously. This is reddit, not an academic journal. This is Destiny, a person I don't even like listening to, not a historical topic I actually care about. Of course I am not going to waste my time rewatching the debate so that I can appease some random redditors. I am not even really trying to convince you of anything. Believe whatever you want, I honestly couldn't care less.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "NPDogs21",
                                                                                                            "body": "You wrote more than I did and hold stronger opinions than me lol it only became an issue for you when I asked for a source for your claims or any examples",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "An_Absurd_Sisyphus",
                                                                                                                    "body": "I also don't like Tayler Swift. I think her music is overly simplistic and hasn't evolved all that much over the years. Do I need a well written argument with citations to make those claims? \n\nYour position here is absurd. If I was interested in convincing you or if I had a particular axe to grind against Destiny, sure, specific examples would be beneficial. But in this case I made a point about Destiny to someone else, and you jumped in the conversation demanding sources and wanting to debate the legal understanding of genocide. Buddy, I don't really care.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "NPDogs21",
                                                                                                                            "body": "You’re in a liberal sub as a communist saying a liberal commentator/debater is factually wrong and making bad arguments lol Of course I’m going to ask you to back it up. \n\nI think it’s interesting how misinformation spreads, and if I didn’t care I wouldn’t comment. ",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "An_Absurd_Sisyphus",
                                                                                                                                    "body": "You have really been all over the place this whole conversation. What does me being a communist have anything to do with this? What does this have to do with misinformation? \n\nLook, you asked me to back up my claims. I declined. I don't expect you to accept my position at face value. I'm not asking you to do so. I am totally fine with you profoundly disagreeing with me. Yet, I stand by everything I wrote previously. \n\nYou being upset about this is both ridiculous and humorous. Misinformation is not some dude not liking Destiny and refusing to offer evidence on why. You don't need to police the internet. And in any other setting, you would be considered an absolute lunatic for the position you staked out here. My friend, it's ok. Everything will be fine.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "NPDogs21",
                                                                                                                                            "body": "You hit the nail on the head for why it’s interesting to me in the original comment. \n\n>But its 2024 and the internet, so the actual argument and evidence isn't seen as important by the audience, its just about who's opinion you already supported.\n\nYou demonstrate that perfectly without seeing the irony at all. ",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "An_Absurd_Sisyphus",
                                                                                                                                                    "body": "So....I am wrong for having different standards for a formal and agreed upon debate than I would for a pretty superficial conversation on Reddit which I actively don't want to turn into a debate?\n\nOk buddy.",
                                                                                                                                                    "score": 1
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "LOL that sounds about right from what I’ve heard. I tried checking him out once or twice, I can’t remember since I can’t keep these streamers straight, and my takeaway is that he was less informed than I was so why would I listen to him.  \n\nLike why not just go listen to a lecture from whatever historian he had on? Or three historians with different perspectives?\n\nThis whole genre of streamers summarizing articles that they skimmed while playing video games for three hours just baffles me.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "An_Absurd_Sisyphus",
                                                    "body": "At the end of the day, some people enjoy having their minds changed. Most people dont. Destiny and his ilk (to include Ben Shapiro) cater to an audience that wants to have their opinions legitimized, not challenged. \n\nThat being said, Destiny is good at what he does. But that isn't a good thing.",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "washtucna",
            "body": "PBS News hour is a good jumping off point. Same for CBS Sunday Mornings. Not exactly \"leftist\" but if you're used to Fox News, it should be palatable for centrists",
            "score": 3
        },
        {
            "depth": 0,
            "author": "the_jinx_of_jinxstar",
            "body": "Should follow the bulwark. They are actual conservatives that aren’t populist.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "NPDogs21",
            "body": "I know this will get a lot of heat but I’d definitely recommend Destiny. He’s the closest to a Ben Shapiro on the left, I’d argue better as he will talk to/debate almost anyone, not mainly college students, and has pulled more moderates/conservatives over to the liberal/Democrat side than anyone I can think of. He’s very much abrasive, has a platform where he will talk to controversial figures, and is willing to call out the more radical side of the left, which makes him hated by a lot of them. \n\nHe had a discussion/debate with Shapiro recently: https://m.youtube.com/watch?v=tYrdMjVXyNg\n\nIt’s easier to watch his content/debates if you already like Shapiros stuff. ",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Kakamile",
                    "body": "That debate was nauseating.\n\nDestiny: well what if we ensure kids in school have air conditioning and lunch?\n\nShapiro: look we can't just give everyone ipads\n\nShapiro: It's not Trump's fault he couldn't work with the GOP or Dems, but Biden is \"divisive\" even though he had successes with both parties\n\nWhat a fucking coward. So many vague concerns without tangible moral solutions while throwing double standards on the left.\n\nu/Due_Box3123 you listen to this guy?",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "MrTachyonBlue",
                    "body": "I would second Destiny. He is very independent and focused on the truth, rather than just reflexively towing the party line. This gets him into trouble with people in every political camp, because he doesn’t 100% agree with any faction. I’m much the same way in how I approach things with my own approach to politics as a political commentator.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "I’d say he’s very principled on the ideas of liberalism, supportive of American/liberal institutions, and against misinformation. Online, those things are incredibly unpopular to support and it can be easy for people to end up in hot water real fast.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "idowatercolours",
                            "body": "But he does all of his research on Wikipedia lol",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MrTachyonBlue",
                                    "body": "I assume you’re just saying that because of the meme, but for anyone who doesn’t get the context, he’s probably the most prolific researcher among all the pundits.\n\nFor anyone interested in the meme / his process:  https://youtu.be/8c1wR47Z3iA",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "idowatercolours",
                                            "body": "It’s not just the meme. The guy literally did research on Wikipedia live  as he debated Norman Finkelstein on Israel vs Palestine lol",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "MrTachyonBlue",
                                                    "body": "Oh you’re serious, lmao. Well anyone can see for his research for themselves in the video linked above. Or on the thousands of hours of research streams he’s done or the public notes he releases for all to read.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Fugicara",
                                    "body": "I wish I could find where this meme started, can you tell me where you first heard this?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "VeteranSergeant",
                                            "body": "Destiny got wrecked by Norm Finkelstein in a debate between him and three well-educated scholars on the Israel-Palestine conflict.  Even the guy on his \"side\" (Benny Morris) seemed embarrassed by his lack of functional knowledge.\n\n\"Between us (meaning Finkelstein and the two other scholars) we have read maybe ten thousand books on the topic, and you've read two Wikipedia entries\"\n\nMaybe Destiny does better research on other topics, but he was rightfully dragged on that one for just jibbering entry-level knowledge that definitely sounded like someone who had only read a Wikipedia article on it without having even delved into the article's sources.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Fugicara",
                                                    "body": "Benny Morris agreed with him on everything he said in that debate.  This comment just tells me you didn't watch it so there's not going to be much value in your commentary about it.  I wish I could find out where you actually heard the things you're saying with so much confidence though, because I know for certain it wasn't a conclusion you came to from watching the entire debate yourself.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "VeteranSergeant",
                                                            "body": "Oh, you kids with your revisionist history.  \n\nOh, hey, just like Destiny on Israel.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Fugicara",
                                                                    "body": "What?  I don't even know what you mean by this.\n\nHere's a compilation someone made of Benny Morris agreeing with him that I just found by searching \"Benny Morris\" in his subreddit: https://v.redd.it/yoowqvz9p7pc1  I'm aware you aren't going to watch it because you're not here in good faith, but maybe other people who are just reading and are capable of good faith will.\n\nSomeone had to make this compilation because people like you uncritically parrot the idea that Benny Morris wasn't constantly agreeing with Destiny during the debate because someone you like told you that's how it went.  The idea that he wasn't constantly agreeing with him is just dumb and not based in reality.  Anybody who **actually watched the full debate and not just clips**, which it's clear you did not, is aware of this.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "idowatercolours",
                                            "body": "I heard it from norm finkelstein when they debated on lex’s podcast about Israel vs Palestine. But someone responded to this comment linking the source of the meme",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Fugicara",
                                                    "body": "The meme is much older than that, people have said it to me in the past before that ever happened.  The video they linked wasn't its source, it was just an example of some random idiot saying it and then demonstrating how stupid it is to say.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "idowatercolours",
                                                            "body": "He does do his research on wiki though. Lol Norm is not onto that meme, Destiny was \n wiki searching and quoting from it during the debate. And norm was losing his mind about it calling him imbecile",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "punkinholler",
            "body": "Beau of the 5th column on YouTube. He's a middle aged military vet from either Alabama or the Florida panhandle. I'm not sure what branch of the service he was in or what his job was, but he seems extremely intelligent and well informed on foreign affairs. His videos are short and to the point, but he puts out at least 4 or 5 of them every day. He's really knowledgeable about the topics he discusses, and, judging by the comments he gets, I think his channel must be popular with conservatives who are looking for some variety",
            "score": 2
        },
        {
            "depth": 0,
            "author": "lesslucid",
            "body": "If you're interested in courts, the law etc you might enjoy **Amicus**, Dahlia Lithwick's podcast.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "e_hatt_swank",
                    "body": "Dahlia is the best!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "alpacinohairline",
            "body": "Destiny is my go to. He’s more alive than most commentators. I’d recommend the majority report of years ago but it’s obvious that their quality has dipped for quite some time.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PlayfulOtterFriend",
            "body": "Jon Stewart came out of retirement this year to host The Daily Show one night a week. Usually it is on Mondays, but he switched it one week. The other days it is hosted by other comedians. Jon’s episodes are fantastic! They air on Comedy Central and Paramount+.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SundyMundy14",
            "body": "For Podcasts, I would start with FiveThirtyEight. They have gone through a shakeup over the last two years, but they try and take a left-leaning data/statistics-driven approach to topics.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "I gave up on that podcast after Nate Silver left. In retrospect I feel like I should’ve quit when Clare Malone left.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "greenflash1775",
                            "body": "Clare carried that podcast, it went to absolute shit after she left.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ButGravityAlwaysWins",
                                    "body": "Yeah, I think it’s a combination of her being very smart and being very funny but also how she handled Nate Silver. \n\nI think Silvers are really smart guy and I wanted to listen to his ideas but he’s kind of an asshole. She had this ability to humble him and straighten him out sometimes and the show needed that.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "greenflash1775",
                                            "body": "Nate and Galen think they’re funny. Clare would show them what was actually funny.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bearington",
            "body": "Looking at your flair, you may enjoy [Breaking Points](https://www.youtube.com/@breakingpoints). It's my go-to for non-MSM analysis. The comment section and reddit sub trend significantly right but the hosts themselves span the political spectrum. They all agree on hating MSM though.\n\nFor more strictly liberal and less serious analysis I would suggest [Secular Talk](https://www.youtube.com/@SecularTalk). I say less serious because he's more casual, but he covers everything from serious topics to nonsense that's just fun.\n\n[The Majority Report](https://www.youtube.com/@TheMajorityReport) is also a really good one for liberal analysis. Unlike Breaking Points their opinions are strictly liberal, but they're also more professional than Kyle over at Secular Talk.\n\nI have others that I follow but I only really watch them when the link is interesting. I usually catch everything the above puts out on youtube though. Also, note that I don't pay for any subscriptions or premium content\n\nI should also highlight Morning Joe over on MSNBC. I know he's a conservative and it's a mainstream morning show, but it is THE source for knowing where the Biden administration is at politically. Similar to how Trump watched Fox and Friends daily, Biden watches Morning Joe and according to reporting, speaks with the hosts on the phone fairly regularly. They're not nearly as honest about the facts as the people on youtube, but you know when you're watching that this is where the Biden team's head is at. I guess I could just watch the daily press briefing and get the same, but I don't hate myself that badly",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dj_Fabio",
                    "body": "Breaking points is a great show!",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "beulahjunior",
                    "body": "Sam Seder 🩷",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cyclotrom",
            "body": "Pretty unique take on politics, they talk about overarching ideas but also get into light hearted commentary on the political news, very funny at times.   \n[Americans by Choice](https://open.spotify.com/show/1a8ucwhqfkNmEPeZlCdu2N?si=44a9a4a02e2948cc)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zlefin_actual",
            "body": "Personally, I'd recommend someone other than a commentator; I've heard good things about the podcasts Pew puts out, I'd try those.\n\nhttps://www.pewtrusts.org/en/research-and-analysis/articles/2017/01/after-the-fact",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mitchell_54",
            "body": "Not necessarily liberal commentators as such.\n\nMaybe one is what Americans would call a liberal and the other is a former Republican leaning centrist.\n\nIt's an Australian podcast that is an offshoot of a TV show. The podcast usually goes for about 3 hours and is very good. Talks all about American politics.\n\nAnyway. The podcast is Planet Extra Podcast(PEP)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "twilight-actual",
            "body": "[https://www.youtube.com/c/BeauoftheFifthColumn](https://www.youtube.com/c/BeauoftheFifthColumn)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kay312010",
            "body": "Thom Hartmann is my guy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "oryngirl",
            "body": "Texas Paul",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dj_Fabio",
            "body": "I would go to breaking points. Ryan grim and krystal ball are great commentators and there arguments are more fleshed out due to having republican counterparts on their show.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "engadine_maccas1997",
            "body": "Bill Maher is a great bridge for someone who might be on the right but wants a more grounded viewpoint from the left. He’s against the excesses of the left, but still a principled liberal.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fugicara",
            "body": "Leeja Miller has good analysis of different issues from the perspective of a lawyer and tends to be able to provide different perspectives.  She tries to give a pretty holistic perspective of issues and provide solutions rather than just saying \"this is an issue.\"  Definitely recommend for high quality analysis of various topics.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Unlikely-Turnover744",
            "body": "I used to listen to Krystal Ball. she is very intelligent, but can't really stand her co-host so I quit.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "essenceofnutmeg",
            "body": "The rational national\n\nThe humanist report",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "Uhhhhh try Joe ",
            "score": -2
        },
        {
            "depth": 0,
            "author": "rqwy",
            "body": "If you’re looking for views on the left of the spectrum, Cenk Uygur/The Young Turks, Kyle Kulinski/Secular Talk and Democracy Now are some you could look at. My friends/family who skew Republican actually find them more palatable than some of the big neoliberal and centrist commentators who come off as pretty condescending to any non-Democrats, IMO.",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "I used to really like TYT, but... I dunno, for the last few years their stuff has been less informative and more... \n\n\nCircle jerky? \n\n\n2 minutes of talking about content, 8 minutes of commentators agreeing with each other. Meh.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rqwy",
                            "body": "Yeah. I wouldn’t call Ben Shapiro very informative either though. They’re commentators, not a news outlet.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "I know that Ana says she could never vote for Joe Biden and implies for others to do the same. Cenk did something trying to run for President and may be trying to prop up RFK. It’s crazy they say Trump is a threat to democracy yet refuse to praise Biden/vote for him or encourage their audience to ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tonydiethelm",
                                    "body": "Yeah. The shark. They jumped it.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheFireOfPrometheus",
            "body": "Bill Maher",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Kakamile",
                    "body": "Lol pass. He's the conservative's lefty, having done nothing but existed through the times of left social movements so that he can sit in his chair and grumble about the \"kids these days\" without having learned a single lesson.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheFireOfPrometheus",
                            "body": "He’s from back when normal men could be democrats, aren’t many left",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kakamile",
                                    "body": "\"Normal\" lol all he does is whine about the kids and brush off scientists.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "LakeGladio666",
                                    "body": "Bil Maher is not a normal man lmao",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}