{
    "title": "From a strategic standpoint, who do you think Trump should select for VP in order to maximize his chances of winning in November?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nIt’s clear that Trump values loyalty of competence, but could a certain VP pick help him gain an edge in certain battleground states? \n\nWho would help him the most and why?\n \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "chadtr5",
            "body": "Haley is a ridiculous suggestion; you don't want to let your opponent run ads of your own running mate saying you're unfit for office.\n\nFilling that same niche -- a young, female, somewhat moderate contender -- is Elise Stefanik who is also slavishly loyal to Trump, which means he might actually pick her.\n\nGiven the importance of abortion in this race, I think he has a strong strategic incentive to pick a woman, and given the centrality of age, someone young and energetic helps draw a favorable contrast.  Katie Britt would be another good prospect along those lines, maybe Kristi Noem given that the dog thing will inevitably blow over.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Unknownentity7",
                    "body": "The problem for Stefanik is that she has also said negative things about Trump in the past (something which made her very upset the other day when a Fox News anchor brought that up).",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chadtr5",
                            "body": "In the much more distant past, though.  Just about everyone in the Republican Party had negative things to say about Trump in 2015-2016.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WlmWilberforce",
                    "body": "Didn't Kamala basically accuse Biden of being a racists in the Democrat primary debates?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Independent-Stay-593",
                            "body": "Of supporting racist policies, yeah. The problem with that is black voters already had enough experience with Biden on policy to keep it from sticking. Biden was a supportive VP for Obama and Jim Clyburn's endorsement in South Carolina solidified Biden's support from black voters. The accusations have to be believed by the people who would be affected by them. Kamala's didn't stick and making them hurt her more than Biden.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Smoaktreess",
                    "body": "Katie Britt blew it with her state of the union response. And the Noem thing might blow over but if Trump picks her, Biden will just run non stop ads about the dog thing and not let the public forget.\n\nI agree Haley would be a ridiculous choice. Biden would just use her words against Trump. Plus Trump already tried to say imply the birther conspiracies against her. Not a great look to pick her after all that. \n\nI think he’s going to pick Tim Scott or JD Vance at this point.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Similar_Candidate789",
                            "body": "The only woman in the running at this point is probably Elise stafanik.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Eyruaad",
            "body": "Well it depends on who you think Trump has to sway.  \n\nI personally believe he will try to find the most \"Yes man\" in human history, and could go the route of MTG/Boebert/Gaetz/ETC.  Someone who will make the MAGA people happy and agree to anything Trump says without any thought at all.  In Trump's mind if Pence had done that he would still be president, so I can't see him picking anyone with a backbone again.  \n\nIf he's trying to win over the moderates, then he needs to pick someone that isn't MAGA, and will show people there's hope for normalcy.  I'd assume that person would be Haley, since she seems to be the most well known Republican that is capable of human thought and will at least question \"Hey, should I just appoint this guy dictator?\"",
            "score": 11
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "Trump seems to really like people who have opposed and insulted him in the past, but not too much. I think Nikki Haley went over the line for him so it can’t be her. But he really likes somebody who opposed him bending the knee so he can perform strength by pointing at them and saying even this person submits to me now.\n\nHe is also going to require that they are fully bought in on anti-Democratic  and illiberal tactics. He learned from his first administration that you can’t choose people who actually value democracy, or have any patriotism or think that the rule of law is more important than individual objectives of Donald Trump. \n\nHe cannot have a John Kelly or Jeff Sessions. And he absolutely cannot have a Mike Pence. He needs somebody who would not just follow the order not to certify the election but would have suggested not certifying the election.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "-paperbrain-",
            "body": "Mike Pence \"No hard feelings!\"",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Odd-Principle8147",
                    "body": "Mike 'the un-hangable man' Pence...",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "L4ckzi3",
            "body": "From a strategic standpoint? Republican voters love white people, and trump needs a yes man who doesn’t or hasn’t opposed him. Factor in that some voters may be misogynistic. My best guesses are JD Vance or Tom Cotton.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Roughneck16",
                    "body": "Republicans love *their* minorities. \n\nTim Scott trounced Strom Thurmond’s son in the GOP primary when first elected to the House. White Republican voters like Scott and men like him because he doesn’t fit any of the negative stereotypes.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "L4ckzi3",
                            "body": "Maybe, but Scott and Ramaswamy both got mopped up in the presidential races, with Haley using the nickname “Nikki” to appear more white than using her actual name. From my understanding, Scott’s district isn’t as deeply red as other Republican districts. They certainly love a token minority though.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Roughneck16",
                                    "body": ">  with Haley using the nickname “Nikki” to appear more white than using her actual name.\n\nFalse. She's gone by her middle name since she was a baby.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lyman_j",
            "body": "Haley because she might be able to court the non-MAGA Republicans.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheWagonBaron",
                    "body": "She lost A LOT of her luster when she announced that she was still going to vote for Trump though.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lyman_j",
                            "body": "She can run as a VP candidate in the “I’ll rein him in” lane.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheWagonBaron",
                                    "body": "Only an idiot would still believe that anyone is capable of reining in Trump. There's a reason he didn't testify in his trial after all.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "She can run as the “this unhealthy fuck isn’t gonna make it to 80” VP",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "lyman_j",
                                            "body": "I didn’t say she could do it. I said that would be her lane, and plenty of people *want* to believe he can be reined in despite evidence to the contrary.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheWagonBaron",
                                                    "body": "I don't think they do anymore. If you honestly look at the previous eight years and still hold out a shred of hope he can be reined in then you are simply delusional. Most of his voters want him to be even more extreme. They don't care about reining him in which is exactly why they're so enamoured with him in the first place.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Independent-Stay-593",
                            "body": "I think Haley going with Trump as VP will alienate the anti-Trump wing more, not bring them into the fold. She'll be a sell-out, even more than she is for endorsing Trump already. Trump will lose enough of those voters to hurt him.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NPDogs21",
                                    "body": "You underestimate how easily Republicans fall in line ",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Independent-Stay-593",
                                            "body": "Yeah. For all that talk about being independent thinkers, they are pretty good soldiers. I know enough Haley voters IRL though that I don't think they're going to go for Trump as they would have in the past. It's taken more for them to admit the GOP is what it is today. I think fewer of them will fall back in line than in the past.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "To be fair, falling in line doesnt mean they arent thinking independently",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "NPDogs21",
                                                    "body": "Remember that she recently came out and said she would be voting for Trump. I’m sure some of her supporters will still not vote for him. The question is how many follow what she says ",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Independent-Stay-593",
                                            "body": "I said she won't bring her voters into the fold. Trump won't get enough of them.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Independent-Stay-593",
                                                            "body": "That's not even close to what I said. Read it again. You get the logic. You explained it.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[deleted]",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Independent-Stay-593",
                                                                            "body": "The people in the audience aren't representative of all her voters, not even necessarily the ones that support her ideologically the most. Those are probably the people who support the party the most and wanted a path other than Trump. Of course they'll applaud her for supporting the party. We'll see what happens. I don't think Haley is going to be as helpful as others think she will be in the end.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "[deleted]",
                                                                                    "body": "[deleted]",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Independent-Stay-593",
                                                                                            "body": "I don't think she'll increase it though, not with moderates or independents or really anyone that wasn't already willing to vote for Trump again. I also don't think she'll pull enough of her supporters back to Trump to help him at all. She's going to be viewed as a giant hypocrite. They'll run ads of Haley attacking Trump in the primary and end it with \"If VP candidate Haley doesn't even think Trump was a good president, why should you?\" And that shit will work. She'll be a liability. She's not going to be the VP pick.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Sad_Lettuce_5186",
                                                                                                    "body": "> Wait, you think Trump will lose those voters by bringing Haley into the fold more than if he didn’t?\n\n\n> I don't think she'll increase it though, not with moderates or independents or really anyone that wasn't already willing to vote for Trump again. I also don't think she'll pull enough of her supporters back to Trump to help him at all. **She's going to be viewed as a giant hypocrite. They'll run ads of Haley attacking Trump in the primary and end it with \"If VP candidate Haley doesn't even think Trump was a good president, why should you?\" And that shit will work. She'll be a liability.** She's not going to be the VP pick.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Independent-Stay-593",
                                                                                                            "body": "Hey, sad lettuce! I love that you are favorite fan of mine now.",
                                                                                                            "score": 2
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "[deleted]",
                                                                                                    "body": "[deleted]",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Independent-Stay-593",
                                                                                                            "body": "I don't think he will pick any of them that have openly attacked him in public or ever ran against him in the primary. He'll parade them around at campaign events and fundraisers and on his social media account. He'll use them. But, he's not taking a chance with any disloyalty the next time around. There will be no gods above him. Pence turned out to be too principled and dedicated to the Constitution in the end. He'll pick someone else. Someone with less spotlight, but not too much of an obvious bootlicker. We'll see what happens.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "lyman_j",
                            "body": "There were plenty of reasons that VP Harris made sense, fwiw. “Home state advantage” for a VP pick isn’t actually rooted in data. Demographic advantages are, though.\n\n**EDIT:** there were more reasons to pick Kamala than demographics.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lyman_j",
                                            "body": "Democrats don’t like Kasich though lol. Why would his 4-D chess move involve moving to the right when the majority of his base already viewed him as a centrist? He needed to find a progressive, and Harris’s voting record as a senator is quite progressive.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Daelynn62",
                                                    "body": "As a Democrat, I didnt agree with Kasich’s union busting and his position on abortion, but I remember thinking in 2016 during the debates and interviews with Kasich, that he was the only sane one of the bunch. \n\nHonestly, I think he would decline the offer . I dont think he wants to go down in history associated with Trump. Who has it ever worked out well for?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lyman_j",
                                                            "body": "He appeared sane, but his platform was more or less the same as the others (like Glenn Youngkin in VA). He was extremely anti-labor and extremely anti-choice, among other disqualifiers for the Democratic base.\n\nIt was a complete nonstarter, and “unity tickets” are stupid. Anyone suggesting them is either uninformed or deeply unserious.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Daelynn62",
                                                                    "body": "Yeah, it didnt work out well when Lincoln did it, either.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lyman_j",
                                                            "body": "Please tell me how to win elections. I, a person who does that for a living, have no idea what electoral strategy looks like.\n\nYou’re also [wrong](https://amp.cnn.com/cnn/2020/08/17/politics/kamala-harris-most-liberal-senator-fact-check) about her record in the [Senate](https://amp.sacbee.com/news/politics-government/capitol-alert/article244908657.html).\n\n\nAlso, from our last four VPs:\n\n* Harris, not from a purple state.\n* Pence, not from a purple state.\n* Biden, not from a purple state.\n* Cheney, not from a purple state.\n\nWe haven’t had a purple state VP this century!",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[deleted]",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lyman_j",
                                                                            "body": "Biden selected partially for these reasons (though there are more, I’m operating under the parameters you gave): demographic (women, AfAm, and AAPI), as well as the progressive block since he was viewed as a centrist, Blue Dog Dem. \n\nPurple state “criteria” was the prevalent thinking in the 80s / 90s, but it has not been relevant this century. It’s really just about counterbalancing perceived weaknesses on the top of the ticket, whatever those may be. State, purple or not, has nothing to do with it.\n\nVP is not the be all and end all, no. The median voter doesn’t think twice about the second name on the ticket; it *may* mean more this cycle given the age of both candidates.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "islandofcaucasus",
                                            "body": "Yeah, if only Biden had picked a better vp, he would have won",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Sad_Lettuce_5186",
                                            "body": "Nah. If Biden chose a Republican, people would have just accepted the loss.",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Willing_Cartoonist16",
                                    "body": "I wouldn't call \"being a woman\" and \"being black\" as plenty of reasons.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lyman_j",
                                            "body": "There are other reasons, I suggested two potential electoral advantages. But go off.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BattlefieldNiblet",
            "body": "Tim Scott",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "ohioismyhome1994",
                    "body": "That one makes a lot of sense.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BattlefieldNiblet",
                            "body": "I feel like he could fail the loyalty test (isn’t he not an outright election denier? I might be mistaken him for someone else though) but he’s been sucking up to trump hard lately",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ohioismyhome1994",
                                    "body": "I googled some interviews.  During the primary he gave nothing but half answers on his stance.  He refuses to say whether he would accept the results of the 2024 election.  He denies it was stolen, but also says there was wide spread cheating.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BattlefieldNiblet",
                                            "body": "Gotcha, trying to thread the line there like a typical coward.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "johnnybiggles",
                            "body": "Why?",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CG2L",
                                    "body": "He’s black. It’s like saying I’m not racist bc I have a black friend",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Roughneck16",
                                            "body": "Trump is only racist against black people he dislikes.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "WlmWilberforce",
                                                    "body": "Isn't that more about being a Likist than a Racist?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Roughneck16",
                                                            "body": "Conservatives are only against black people who fit a certain stereotype. Tim Scott is a well-spoken, well-dressed, Christian conservative. White Republicans in SC watch him and think \"that's my kinda guy!\" If they see an obese single mom named Shaniqua buying herself bottles of Coke with food stamps at Walmart, they'll be less charitable.\n\nIt's just like how liberals aren't biased against Christians...they like *their* Christians. Jerry Falwell was a Baptist minister, but they couldn't stand him. Sen. Raphael Warnock is also a Baptist minister and liberals love him.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "johnnybiggles",
                                            "body": "Fair point.  At first, I had thought that since Trump is pretty racist (as is the base), no one would want that (which might still be the case for many) and that would *cost* him votes.  \n\nOn second thought, though, one of my tin-foil hat beliefs is that one of the criteria for why seemingly terrible or milquetoast VPs get selected and tend to be super contrasting to the Prez is that they are a shield to them of sorts, against potential assassins or even impeachment.  \n\nFor example, who the hell would off or eject Trump knowing Pence would be the fill-in as president?  Everyone except evangelicals hates Pence.  Same with Biden/Kamela, as it would also be for Trump/Scott.  \n\nThe racism would actually work there in that case (Trump/Scott), where it would be like, \"Do you guys really want to off me and get a black guy (for racist Repubs) or an Uncle Tom (for Dems who hate Scott)\"?  It's a layer of protection, qualifications and palatability be damned.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "citrus_sugar",
                    "body": "Skeletor would be perfect to battle Kamala.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Independent-Stay-593",
                            "body": "That's Rick Scott. But, damn, the names are about impossible to keep straight with the faces. Tim Scott, Rick Scott, Scott Perry, Rick Perry. I have to look them all up almost every single time.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "citrus_sugar",
                                    "body": "Dammit, that guy; he would be perfect as well, there’s a long list of rich while guys that screwed over the tax payers in the R party.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "scsuhockey",
                    "body": "Disagree. I think you underestimate the amount of racists in Trump’s base (not to mention the rumors of his sexuality).",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "srv340mike",
            "body": "Someone like Haley, who can appeal to non-Trump wing GOP and alleviate concerns the center might have, would probably hep him out.\n\nHowever, his focus this time around seems to be loyalty over anything else, so I'm sure whoever he chooses will be idiotic.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Icolan",
            "body": "RFK Jr.  It would end the spoiler campaign which seems to be more of a risk to Trump than Biden currently and convincing RFK to join Trump might actually bring the left voters who have gone to RFK's camp to Trump's camp.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Roughneck16",
                    "body": "Hmmm. That’s clever thinking.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Icolan",
                            "body": "Let's hope no one in Trump's camp thinks of it.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Roughneck16",
                                    "body": "Which pick would sink his campaign?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Icolan",
                                            "body": "I don't think there is any pick that will completely sink his campaign.  His followers will rationalize any choice he makes that doesn't seem to fit with the narrative as some kind of 3d chess move meant to expose some corruption or prove his opponent unfit or something. \n\nBasically most of his followers are too much of a cult to really abandon him.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "From_Deep_Space",
            "body": "Joe Biden. An unbeatable ticket!",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "pablos4pandas",
                    "body": "\\#RepealThe12th",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Similar_Candidate789",
            "body": "If he wanted to maximize his chances, someone similar to Mike Pence. \n\nEvangelical but “moderate”. Someone who could be perceived as taming him and moderating him.\n\nHowever we all know that isn’t trump, and after pence “betrayed” him, he will choose some sucking sycophant who gushes over him like Tim “I just love you” Scott or some psycho like Marjorie space lasers Greene.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "xynix_ie",
                    "body": "Evangelicals don't need anyone else, they have Trump. He's their useful idiot that's doing gods work like having abortions banned.\n\nToo many Democrats have made the mistake in thinking christians have morals and will only vote for a person who has morals. Demonstrably false.\n\nThey'll vote for anyone who will do their bidding and that man is Trump.",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "FizzyBeverage",
            "body": "He'll pick Haley. It's his surest way to grab moderates who falsely believe she can keep his balls in her purse.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Roughneck16",
                    "body": "Haley is no moderate. Also, would Trump want someone who doesn’t kiss his butt? \n\nAlso, SC is in the bag for Trump. Wouldn’t he want someone from a swing state to help balance the ticket?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FizzyBeverage",
                            "body": "I mean Tim Scott is also from SC and he's a favorite pick for the collegeless black male vote.\n\nHis likely plan is to appoint Don Jr president in 2029 if he wins 2024 so Jr can partner him for his many crimes incurred '24-28.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Weirdyxxy",
            "body": "Probably someone like Nikki Haley, an olive branch to his opposition within the GOP. From the shortlist that seems to have surfaced, I guess Burgum could be chosen to fulfill that role, but he's not that major a figure",
            "score": 5
        },
        {
            "depth": 0,
            "author": "spencewatson01",
            "body": "Tulsi.\n\nFor Democrats she can make a case that the Democrat party left her, she didn't leave the Democrat party.  \n\nFor women she signals that Trump can't really be misogynistic as the media claims because Tulsi would never board the ticket.\n\nShe appeals to the younger voters because of her age and fitness.\n\nThe Fox News crowd has seen her for years and she's well received.\n\nShe just brings a level of excitement that can't be found in Trump, Biden or Harris.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "BoopingBurrito",
                    "body": "I honestly can't think of many people who'd be excited by Tulsi Gabbard.\n\nMany on the right like as a talking head, but if she was on the ticket she'd be seen as a Dem plant. Her 2016 endorsement of Sanders would definitely make the rounds as would get membership of the House Progressive Caucus. \n\nMany on the left see her as either a right wing sell out, or as a traitor to the left. \n\nAnd many moderates see her as badly qualified for executive office, with just 9 years as a Congresswoman. They also see her as an unreliable flipflopper who went from far left is solid right as soon as it was financially sensible. \n\nAbout the only folk who really like her are a small number of right wingers who want to feel like they aren't quite as extreme in their beliefs as they really are, who use their agreement with a former democratic party  Congresswoman as a way of rationalising their extremity.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spencewatson01",
                            "body": "I wonder how she fares with blue collar Dems?  If she could get just a few Reagan Democrats it would be worth it.\n\nI heard her just last week explain that she endorsed Sanders because he at the time was anti-war.  Which fits Trump perfectly.  \n\nI could see her experience being an issue for vp.  Trump has also signaled that he's going to announce the cabinet members before the election.  VP or not, she'll end up somewhere in the trump administration.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "Mike Pence. It's a proven winner of a ticket. Plus, it would be hilarious.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Tommy__want__wingy",
            "body": "Haley or Scott.\n\nScott would be a better chance.\n\nIf he goes with anyone who leans anywhere close to Freedom Caucus or MAGA he has worst chances.\n\nWhy?\n\nThey scare the hell out of moderate voters.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BenMullen2",
            "body": "this is one case in which it literally does not matter.  cults are cults, not committees.\n\nNobody ever joined Christianity because they though Paul was cool, lol\n\nEither his cult is big enough, or it is not.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Independent-Stay-593",
            "body": "Throwing a wrench in this and saying Mike Johnson. Johnson isn't stupid and he's clearly shown he'll out maneuver the MAGA Twitter fools. Mike also appeals to that old school Republican game of putting a nice smile and pretty words to horrible actions. Johnson hasn't ever challenged Trump publicly and can play like he is a Trump loyalist. Also, Johnson would be willing to play the game to make sure Trump wins. There won't be any moral duty to the Constitution keeping Johnson from power moves the same way Pence refused to on J6.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlueCollarBeagle",
            "body": "Taylor Swift.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DarkBomberX",
            "body": "I think a woman would be best for him, but there isn't a single good VP pick. He needs someone who can appeal to women voters.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KingBlackFrost",
            "body": "I don't think Trump stands to gain much from his VP pick. Nikki Haley possibly could sway some voters, but she could also be seen as a sellout, and it might be a hard sell to his base. Tulsi Gabbard was formerly a dreaded democrat, and that could scare some Republicans off. I feel like Noem was the shoe-in until she announced to the world she's a puppy murderer.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "I think under the best of circumstances a persons VP choice makes very little difference and that is more so true with Trump than average.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Baldemyr",
            "body": "I would go with Harley Quinn",
            "score": 1
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Tiger King.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NoExcuses1984",
            "body": "N.D. Gov. Doug Burgum.\n\n\nPragmatic and inoffensive.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Roughneck16",
                    "body": "Plus he'll secure ND and its wealth of electoral votes.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gsomethepatient",
            "body": "I'd say vivek ramaswamy would be his vp",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mrmfrides",
            "body": "Haley",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CaptainAwesome06",
            "body": "It has to be Haley, right? She is pro-Trump but also someone that the non-MAGA republicans and maybe even centrists can get behind. I don't think she's much of a centrist but there are a lot of neo-conservatives out there that seem to think they are centrists. There are also centrists who seem to think anything left of center is super extreme for some reason.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Numerous-Chocolate15",
                    "body": "Yes and no. Haley attacked Trump too much for her to be in the running for VP. Would it be the smartest move for Trump to make in picking her as his VP? Yes. Is he going to do it? No.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CaptainAwesome06",
                            "body": "Well yeah, but the question was who is the best VP to help Trump win. Not who is the VP that will pledge the most fealty to Trump.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "fttzyv",
            "body": "In any given American election, more people stay home than vote for either candidate.  You don't win by flipping centrist voters from one side to the other.  You win by making sure the people on your side get out to vote.  This appears to be something that Trump intuitively understands.\n\nThe optimal VP is not someone who pulls towards the center.  It's someone who energizes evangelicals (especially in the swing states) and MAGA types.  Maybe Tucker Carlson or Ron DeSantis.",
            "score": -1
        }
    ]
}