{
    "title": "Who was the weaker Democratic presidential candidate: Hubert Humphrey, Jimmy Carter, or Michael Dukakis?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nSo as a sequel to my last thread, I would like to throw in other failed Democratic candidates, two of whom faced off against the same opponent earlier and one in an entirely new election after the second term of the ruling party's predecessor, and so I will ask the following questions:  \n1) Who was the weaker Democratic candidate between Hubert Humphrey and Jimmy Carter and why?  \n2) Who was the weaker Democratic candidate between Jimmy Carter and Michael Dukakis and why?  \n3) Who was the weaker Democratic candidate between Michael Dukakis and Hubert Humphrey and why?  \n4) If you had to rank from strongest to weakest between three?  \nBonus Questions:  \na) How well do you think Hubert Humphrey would have done if he faced off against Ronald Reagan in 1980 and George HW Bush in 1988 compared to Carter and Dukakis respectively and why?  \nb) How well do you think Jimmy Carter would have done if he faced off against George HW Bush in 1988 and Richard Nixon in 1968 compared to Dukakis and Humphrey respectively and why?  \nc) How well do you think Michael Dukakis would have done if he faced off against Richard Nixon in 1968 and Ronald Reagan in 1980 compared to Humphrey and Carter and why?\n\nd) How strong or weak do you think Humphrey, Carter, and Dukakis were compared to Adlai Stevenson II, George McGovern, and Walter Mondale?   \nI'd like to know your thoughts and input. Thanks. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "grammanarchy",
            "body": "Hubert Humphrey was probably the weakest Dem candidate in modern history.  His nomination was the product of a historical train wreck.  The incumbent, LBJ, withdrew from the race.  Eugene McCarthy came in strong as an anti-Vietnam candidate, but was elbowed out of the lane by RFK, who then got shot.  Humphrey was, at best, the fourth best candidate to run against Nixon.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Imjokin",
                    "body": "And yet he still came pretty darn close to winning",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "jyper",
                    "body": "Humphrey came within 0.7% of the popular vote and if there was another week in the race might have gotten the plurality of the popular vote. Of course he lost the electoral vote by large margins but that almost lead to the end of the electoral college and shows he was still competitive despite all the things making it difficult for him",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Arthur2ShedsJackson",
                            "body": "Also, he lost six states by 3% or less. Those states accounted for 98 electoral votes. If he had a little bit more edge in that final run, he would have held on to those states and we'd have President Humprey.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bigedcactushead",
            "body": "I would say Jimmie Carter was the weakest because he was the only sitting president of the three. Ted Kennedy's primary challenge did extensive damage to Carter's popularity. The economy was in recession with unemployment skyrocketing and the federal funds rate at over 15%.\n\nIt's hard to separate the candidate from the challenges of the times. But Carter's incumbency should have put the wind to his back.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Arthur2ShedsJackson",
            "body": "It's very hard to disentangle the candidates from the political reality of the years they were running. All three were really running against the odds. The question can be reframed as: given their individual things that were negatively impacting their campaigns, who overperformed? With that framing, my ranking from stronger to weaker is:\n\n1) Humphrey. He could have won against Nixon if Vietnam wasn't a thing. Considering how the country and the Democratic Party were in 1968, he actually came very close.\n\n2) Dukakis. Reagan in the White House, Democrats in disarray, and he manages to hold an early lead in the polls against the annoited VP? Pretty respectable in my book.\n\n3) Carter. He was the incumbent in 1980, so the issues the country was facing (Iran, stagflation) were partially his responsibility.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "chadtr5",
            "body": "Hubert Humphrey was one of the most masterful politicians of the 20th Century. \n\nHis personal skill and charisma was sufficient to re-establish the Democratic Party as an active force in his home state of Minnesota, and he became the first Democrat elected to the Senate from MN since the Civil War.  Robert Caro's literary brilliance has convinced the world that LBJ was the master politician of the era, but it was actually Humphrey who did many of those things.\n\nIt was Humphrey who, in 1948, convinced the DNC to include Civil Rights in their platform.  It was Humphrey who authored the Civil Rights Act of 1964, whipped the votes to pass it, and broke the filibuster against it.  And it was Humphrey who first proposed Medicare and pushed arms control through a reluctant Senate.  \n\nHumphrey came into the 1968 presidential election unexpectedly at the last minute and with every possible disadvantage.  He still finished within a single point of Nixon in the popular vote.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Imjokin",
            "body": "I think Dukakis just because his gaffes totally flushed away what was going to be a landslide win at the beginning of the campaign",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "SpaceSeal1",
                    "body": "What gaffes?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Imjokin",
                            "body": "His response to the death penalty question in that debate, failing to shut down the rumors that his wife burned an American flag, and the tank photo shoot",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SpaceSeal1",
                                    "body": "so in other words, being a spineless coward who couldn't stand up for himself.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Imjokin",
                                            "body": "I wouldn’t call the tank photo shoot that exactly. Also he referred to himself as a “liberal” which was a dirty word at that time.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SpaceSeal1",
                                                    "body": "so calling yourself a \"liberal\" in 1980, 1984, and 1988 would be the equivalent of calling yourself \"MAGA\" or \"fascist\" in 2016, 2020, or 2024.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Imjokin",
                                                            "body": "Yeah kinda. Overall he ran a bad campaign even though he had a winnable situation (consider how it was after 8 years of Reagan, and every other 8 year presidency since has made the other party win)",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Weirdyxxy",
            "body": "Humphrey was an incredibly strong candidate, he started with a dismal situation and still clawed his way back into striking distance. \n\n\nI think Dukakis was a weaker candidate than Carter, he just wasn't prepared for the all-out attack strategy of the GOP and had nothing to push back against it. \n\n\nSo that's answer 4, it's also answer 1 and 3, and I think it's answer 2 as well. But we're only talking about 1968's HHH, 1976's or 1980's Carter, and 1988's Dukakis here",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "SpaceSeal1",
                    "body": "How about the bonus questions lmao?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Weirdyxxy",
                            "body": "I'll try to do it piecemeal \n\n\na) I believe Humphrey pivoted to the right in some weird way after 1968? He lost a lot of his appeal, I'll ignore that again. I guess he was a very good speaker and might have held his own against Reagan on paper, the happy warrior wouldn't be a good foil for Reagan to play his optimism against, but at the same time, the winds had shifted and Carter, who was much more in line with those shifted winds, still lost. Although Humphrey was good at regaining support an unpopular incumbent lost, so it might be close. In 1988, he probably was a bit old, but ignoring that, I don't think he would have won. It was after the Reagan Revolution, and Humphrey was one of the most adamant New Dealers",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Weirdyxxy",
                            "body": "b) if Carter hadn't been President, I believe he would have fared well in 1988 - still probably not won, but closer. He was big on deregulation, which might have combined well, and he wasn't from New England. 1968, I can't see him faring nearly as well there",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SpaceSeal1",
                                    "body": "I would have liked to see Jimmy Carter go against Dukakis in a primary and beat him there and then face off against Bush Senior.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Weirdyxxy",
                            "body": "c) Dukakis was mostly a pragmatic, administrative type? Ill be clear, I like pragmatic, administrative types, but I don't think anyone else does. He would have still fared better than Carter in 1980, I guess, but in 1968, he would have just been a worse Humphrey in some sense. Maybe some advantage from being less connected to the Johnson administration? But still",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SpaceSeal1",
                                    "body": "I thought if Dukakis ran in 1980, he would have been crushed harder than Carter against Reagan in a landslide.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Weirdyxxy",
                                            "body": "He would have had the advantage that at least he wasn't the incumbent who would be blamed for everything. Maybe I overestimate that factor",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SpaceSeal1",
                                                    "body": "What if Dukakis was the incumbent president instead of Carter and Dukakis beat Gerald Ford in 1976?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Weirdyxxy",
                                                            "body": "Then I probably agree with you, unless he handled the presidency way better... Which is possible, to be fair",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Weirdyxxy",
                            "body": "d) Stevenson was not impressive, but alright (however, he was running against Ike, so no surprises as to who won), McGovern was worse than anyone else on this list, I think, Mondale I don't know - probably closest to McGovern. ",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SpaceSeal1",
                                    "body": "Maybe I should start a series of new threads pitting all these six failed Democratic candidates in each other's differing election years.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Past-Bite1416",
            "body": "looking at it from a conservative angle\n\nI do not remember Humphrey. \n\nHowever, I was in school when Carter was in office.   He was honest and if he were running today he would win. He was weak, he got chased by a rabbit while canoeing.   He would beat Trump today.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Past-Bite1416",
                    "body": "I might even vote for a democrat that you could actually trust like Carter.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "SpaceSeal1",
                    "body": "Carter today even in his old age would be an infinitely preferable option over both Trump and Biden and anyone else from both parties, both Establishment and MAGA/Bernie wings alike.",
                    "score": 1
                }
            ]
        }
    ]
}