{
    "title": "What does a “classless society” even look like?  ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nIn today’s installment of stuff I hear from women on dates but can’t conceptualize: a “classless society”.  \n\nSocioeconomic class is born out of several factors in my opinion. Your starting point in life, how you were raised, your innate skills, internal drive, etc.  \n\nSo many factors go into it, but how can you equalize even most things? It’s easy to say “oh everyone can start from the same place”, but  can they? The social and professional connections your parents make as well as how they raise you definitely play a factor in your life circumstances.  \n\nLet’s say there’s a guy who bakes the most amazing cakes. It isn’t a secret recipe either so the office of resource management can’t beat it out of him and make it public knowledge. He uses his skills to curry favor with people who provide other luxuries. His kids through exposure and their own innate abilities also learn these talents, but he doesn’t bother to teach anyone else. He spends time with other people with talents like his and they enrich each other’s lives but *not* the general public.  \n\nIsn’t that the same class-based system we have now, substituting money with talent?  \n\nBonus Question: straight ladies do you expect a dude to pay on the first date? I generally just ask to split but this date was the first time someone said they thought I would have covered it. \n\n\n\n\n\n\n\n \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "fttzyv",
            "body": "You're trying to map the idea of a classless society onto a society that looks basically like ours but is somehow economically tweaked.\n\nThe Marxist idea of a classless society is something that exists under fundamentally different circumstances than we have; it's part of a communist utopia where economics and politics operate on completely different principles.\n\nHere's my ultra streamlined summary on Marxist theory:\n\n* People take inherent joy in production.  You probably know people who grow vegetables in the garden or knit sweaters or build things or bake cakes as a hobby.  I have an aunt who is retired and does nothing but crochet; she is desperate to find things to crochet for people, find people who will take sweaters, etc. so her house doesn't overflow\n* Capitalist industrial society alienates people from that joy of production by turning everything ugly and transactional.  Work is needlessly unpleasant under capitalism.\n* But what if (in part because technology helps to solve issues of scarcity) we could reclaim that joy of production?\n* Then we enter into a utopia where each person produces according to their ability (and desire) and consumes according to their need.  The people who take joy in baking bake to their heart's content, and then people who need something to eat take the baked goods and eat them.\n* This is a classless society because with everyone taking delight in production, there's plenty to go around, and everyone has enough of everything quasi-effortlessly.  You don't need to curry favor with anyone because there's abundance.\n\nDoes that work out? Not really.  There's no reason to suppose that joyful production will match the things we need, and there are jobs in society that need to be done that will probably never provide joy.  But Marx was certainly putting his finger on some things that are real; in a utopia, my aunt would crochet sweaters for all who wanted them.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "jauznevimcosimamdat",
                    "body": "You put forward great \"good feeling\" answer where all people find joy in their own livelihood but I dare to say there's a more down-to-earth practical explanation that's often only implied:\n\nThat there's not a group of people standing out above others, mostly materially.\n\nWhen we usually talk about classes we refer to different material environments groups of people live in. It depends on economic contexts but like, an upper class is often understood as a group of people who can comfortably afford a pretty luxurious life and so on.\n\nBased on this, there's the assumption that class differences cause power inequalities that are for one reason or another considered to be unjust. For example, people born into poor families have lower chances of becoming successful in their job industry.\n\nSo the promise of classless society seems to be the image of society mostly without material differences.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "-paperbrain-",
                    "body": "Going beyond that though, your examples of \"joyful production\" were more like hobbies.\n\nBut you don't need tasks to be fun in that way to not be alienating.\n\nTake a household, a family, a group of roomates, a village. People do tasks that are even individually pretty unpleasant because they need to get done. Because what we can value is helping people around us, because we have a sense of valuing things running smoothly and having a nice shared space. There are lots of situations where people are connected to their labor regardless of whether it's fun.\n\nThere are lots of things that can make us connected to our labor. Check out how Japanese fans clean up after a sports event. It's not that cleaning is a fun hobby, it's that they have a sense of community, a pride in the place, a respect for each other. etc.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Sleep_On_It43",
                    "body": "Plus, there’s a difference between doing something for pleasure and doing it for work. For instance, I love playing guitar and singing. I am pretty good at it too. I played in an acoustic duo(sometimes trio) for over 15 years. \n\nGranted, we all had day jobs, so that’s a factor…we also weren’t to the level of having roadies and whatnot so we were schlepping all our gear, setting it up, doing sound checks, playing the 3 hour gig, tearing back down, packing it up and putting it all away once we got home by ourselves….so that’s another factor…\n\nBut that was exhausting…fun, but exhausting. Towards the end, I was dreading gigs and quite sick of it.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Bushwick_Hipster",
                            "body": "By the time I was 13-14 I was writing code, building networks and playing around in virtual machines for fun. I was proficient in several different types of code.   My parents urged me to study computer science in college, and I dreaded the idea of making my side passion \"work\".\n\nfast forward and going into Bus Admin was the worst mistake I ever made..  lol.   Probably should have just went into Computer Science..",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "I have the same thought every year when my friends and I discuss comps packages LOL. The stuff they pay kids coming out of undergrad is eye-watering too lol.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lobsterharmonica1667",
                    "body": "I don't think its necessarily about production that you enjoy for its own sake. There are plenty of things that folks will happily do in order to just \"do their part\" or contribute to something. Like I don't *enjoy* picking up trash on the sidewalk but I don't mind doing it when it makes the sidewalk look nice and I can take some pride in that.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gilbert__Bates",
            "body": "Why are you asking here and not on a socialist sub? Most liberals don’t believe in a classless society.",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "1. Theres a lot of Communists here.  \n\n2. On top of that a lot of Liberals here do seem to agree with Communism in theory. I can DM you links to comments I’ve seen because I don’t want to single people out.  \n\n3. Internet Communist spaces don’t really seem conducive to discussion lol. This place is reasonable.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lemp_Triscuit11",
                            "body": "I think when you see liberals say it- or, when *I* say something similar- it's not about pretending that there wont be different segments of society with different lifestyles and concerns. What I/we call for is an elimination of the *gaping disparity* between how much the government works for the interest of and protects people of different classes.\n\n\nI honestly don't care if someone is richer than someone else. I just don't think that money should change their judicial outcomes, the weight of their vote, or their potential to utilize all of the benefits that America has to offer.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ausgoals",
                                    "body": "Yeah, the same goes for inequality.\n\nPeople don’t generally care if someone has a billion dollars. They care that someone has a billion dollars and they, or others, have nothing.\n\nIn a theoretical society that existed exactly as ours, but everyone was gifted $500k and a house when they turned 18 and it had no distorting effects on any market, the ‘eat the rich’ and ‘billionaires shouldn’t exist’ crowd would be a tiny fringe minority, if it existed at all.\n\nPeople don’t necessarily care about class/classes existing, they care about the imbalance between classes. Which is why proletariat revolutions don’t happen simply because the proletariat exists; generally they happen when conditions and the imbalance gets to a certain level that it becomes unacceptable.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bigedcactushead",
                            "body": ">On top of that a lot of Liberals here do seem to agree with Communism in theory.\n\nSo you confirm what the radical right has been saying since forever: that liberals are nothing but a pack of commies.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IndWrist2",
                                    "body": "I’m a communist now?!",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Scalage89",
                    "body": "\\*communist sub. It's a communist concept.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Meihuajiancai",
                    "body": ">Most liberals don’t believe in a classless society.\n\nSeriously?\n\nMost people, in theory, wholeheartedly agree with and want a classless society. They just disagree on the path to get there.\n\nEdit; I should add, people also disagree on what a classless society means. To some, it would mean every person, regardless of contribution, skills or talent, would receive exactly the same compensation or access to resources. Others would say classless doesn't mean levels of compensation would be exactly equal but that the disparity would not be drastic",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thebigmanhastherock",
                            "body": "Liberalism is about breaking down arbitrary hierarchies. Like for instance the first iteration of liberalism was a criticism of monarchy and how monarchies are arbitrary and flawed. Concepts like nobility and birthrights were BS. That things like free enterprise, individualism, democracy, science, expertise, expertise, merit based rewards were superior to a presumed \"natural order\" the history of liberalism is basically a fight between conservatives that at every turn conservatives freak out and think that society is going to crumble if some tradition or old hierarchy is disbanded and resisting liberal attempts to upend it. \n\nLiberalism expanded into ideas like race/ethnicity shouldn't hold people back, that the government should work to make accomodations to advance human potential like the \"ADA, Civil Rights, Healthcare, Welfare.\" While maintaining a market based competitive society ultimately based on merit. \n\nConservatives have evolved in the west to adopt some liberal positions in an assumed consensus, established by previous waves of successful liberalism, but they stand against whatever the newest strand of liberalism is, and potentially even against recent(in living memory) liberal successes. \n\nA \"classless society\" is a pipe dream that will never happen, at least not any time soon. Most people know this liberal or conservative. We can see the monumental failures in mid century communism to achieve this. We can look at every human civilization that has ever existed and conclude that realistically people will categorize themselves and others into groups. Liberalism isn't terribly concerned with making everyone equal in outcomes. In fact liberals believe in the \"profit motive\" as a positive thing. Modern liberalism however does want to give everyone a chance at competing for profit and being rewarded. \n\nLiberals will often look at disparities between groups and look to government policies to bridge those gaps. This is not done with the purpose of eliminating rich people or even poor people(as these concepts are relative) but to identify ways in which people are disadvantaged and then try to bridge that gap so that everyone is starting from the same point. This doesn't mean that in the end everyone will be equal. \n\nConservatives are often accused of believing that there is no point to this because groups of people have different innate traits, either generic or cultural that give them advantages or disadvantages and that this is not up to government policy to change.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Meihuajiancai",
                                    "body": "I appreciate your well thought out post. Although I disagree to an extent with some of your analysis, in general I agree. However\n\n>Conservatives have evolved in the west to adopt some liberal positions in an assumed consensus, established by previous waves of successful liberalism, but they stand against whatever the newest strand of liberalism is, and potentially even against recent(in living memory) liberal successes. \n\nLiberal and conservative are broad categories, especially in the US. You identify as a liberal so I don't expect you to market positively for conservatives. But I think this characterization really gets to the heart of the issue. Conservative could mean any number of ideologies. I'm not going to deny that there is a branch of conservativism that is simply reactionary. But there are other branches that genuinely believe their policies will lead to a more equitable and prosperous society. Not every conservative is a knee jerk reactionary. \n\n>the history of liberalism is basically a fight between conservatives that at every turn conservatives freak out and think that society is going to crumble if some tradition or old hierarchy is disbanded and resisting liberal attempts to upend it. \n\nThis is the righteous narrative that liberals generally present, but it's not true at all. History is rife with policies that liberals advocated for that were opposed by conservatives. Some, like restrictive zoning, or prohibition, or sterilization of mentally handicapped people became law and proved to be monumentally destructive. Others, like free silver, never became policy. \n\nThe common response is a disingenuous form of the no true scotsman fallacy, which would be to claim that 'the majority of liberals in 2024 don't support those policies, therefore they weren't liberal policies'. However, by that standard, your above statement would be incorrect, as conservatives today support an established liberal policy, therefore the opponents years ago weren't true conservatives. \n\n>Conservatives are often accused of believing that there is no point to this because groups of people have different innate traits, either generic or cultural that give them advantages or disadvantages and that this is not up to government policy to change.\n\nThe key word is accused. And the other key word is groups. Yes, conservatives are often accused of that by liberals. But that's usually because it's easier to call them a racism than to debate in good faith. While some people identify as conservative and also believe certain 'groups' have certain innate traits, it's a minority. The majority of conservatives believe *each individual* has different traits. A subtle, or not so subtle, distinction.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thebigmanhastherock",
                                            "body": "Something that should be noted is that Republicans and Democrats do not equal Liberal or Conservative. Some Republicans especially in the past were more liberal than conservative. The past had many Democrats that were more  conservative than liberal. \n\nSome policies, let's take the idea of prohibition would be considered a conservative progressive policy. Undeniably the thought of restricting personal use of alcohol is illiberal, however it's also progressive because the aim was to use government policy to improve the country through government intervention.  \n\nEven a liberal like myself has conservative views in some areas. Plenty of people on the left are not exactly liberals, some openly oppose liberalism as an ideology. \n\nLiberalism has utterly failed to achieve its own goals plenty of times. However forced sterilization, restrictive zoning and prohibition are not liberal policies. Did liberals support them at times yes. Particularly Eugenics, many otherwise liberal people supported Eugenic policies. The question I have with that is...how is Eugenics liberal aside from liberal intellectuals supporting it? Sometimes it gets complicated. For instance being pro-choice, that is liberal under the fact that it falls under personal choice and individual freedom. However forced sterilization of poor or infirmed people for the good of society is the opposite of liberal. Did liberals and people on the left support this illiberal policy for a time...yes. \n\nZoning laws are illiberal. Generally speaking the entire zoning process is trapped into less partisan, even more special interest influenced local politics sphere. \n\nWhat is liberal which also causes problems regarding housing is community hearings. One way that I break with liberalism and would welcome a more centralized system is this overly beurocratic and obviously liberal policy of community input for local building projects contributed to housing shortages and infrastructure building. \n\n\"Free Silver\" is also not at all liberal. It was a populist left-wing nonsense policy that is irrelevant. \n\nLiberal is more often than not left-wing but not necessarily. Conservatives sometimes support liberal ideas. There is a liberal consensus on many issues meaning many conservatives do hold liberal views. \n\nI think a better way of honestly looking at conservatives is to say they want to protect the status quo and promote a unified culture that is heavily reliant on traditional values. Not every conservative is even into this collectivist type thinking. \n\nMy point is that modern partisan US politics and politics in most liberal democracies are by definition done in liberal spaces. Many conservatives hold liberal views. Liberalism is in many ways a consensus. So...you are going to find a lot of liberalism within conservative ideologies. Less conservativism in liberal ideologies. However there are right wing and left wing illiberal ideologies. The far right and far left reject liberalism because it is the consensus.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "rethinkingat59",
                            "body": "Income alone doesn’t denote class or power. If you are the only trained doctor and have helped/saved many people in a village, you will be held in higher regard than a street sweeper, even if your income is the same. \n\nIf another village tries to lure the doctor and his family away, promises will likely be made to keep the doctor, they will not likely do the same for the street sweeper. One has more power than the other and is seen as in another class, even if equally poor.\n\nPower and class evolves naturally in human societies.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Meihuajiancai",
                                    "body": ">Income alone doesn’t denote class or power\n\nMost liberals hold a Marxist view on class. I do as well. From that perspective, there are really only three classes; capitalists, bourgeoisie and proletariat. Your example isn't really an example of class, it's just someone with an important skill. In this case, a doctor.\n\nWhich is why I added my edit. To many on the left, a classless society genuinely means some form of 'from each according to their ability, to each according to their need'. To many on the right however, a classless society doesn't have a pithy phrase to encapsulate it, but means essentially 'without government imposed structures that allow rent seeking wealth accumulation, we can reach a point in which all people will live prosperous and productive lives. And, importantly, extreme disparity in wealth would cease to exist, because, at its core, that disparity is caused by government structures'. \n\nSo, yes, a doctor would be compensated more than a street sweeper. But the disparity between both the street sweeper and doctor, and importantly, the disparity between those two and the uber wealthy capitalist, would be much smaller and much more equitable. \n\nDo you disagree? Most people I know on the right, at least those who pay attention to things, hold the position that, while free markets are positive, as is generating wealth, the massive amount of wealth held by guys like Bezos, Musk et al, is a direct result of government policies, namely central bank led expansionary monetary policy, copyright and trademark law, and regulatory capture.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "rethinkingat59",
                                            "body": "Capitalist have an absolutely vital role. To provide and risk capital for economic growth.\n\nYou can not dream up how a a modern economy would work without a source for capital (capital is required outside the employees, Co-OP’s only work for small scale enterprises)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Meihuajiancai",
                                                    "body": ">Capitalist have an absolutely vital role. To provide and risk capital for economic growth.\n\nI'm scratching my head wondering why you thought this was a valid response to what I wrote. Nowhere did I say anything that would prompt a response like this. Yes, capitalists play a vital role. When did I say otherwise?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lucille12121",
                    "body": "Because he doesn't know much but he argues a lot. I have nothing by empathy for these supposed women who will never get their time back.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Important-Item5080",
                            "body": "When did I say I argued with them lol?  \n\nWhy are you being so rude, like I don’t know what I said where you’re making the assumptions that I’m a misogynist who wants to domineer over other women.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lucille12121",
                                    "body": "Who is being rude here? \n\nYou came to a subreddit about the believes and values of a political position and bafflingly felt compelled to share how you went on dates with an \"installment\" of multiple women who argued a position so poorly that you couldn't manage to even \"conceptualize\" what they were advocating for. If it looks like and smells like a misogynist…\n\nIf you truly wanted to understand what a “classless society” might involve in good faith, you could have just asked that question and not burdened anyone with your unfortunate romantic life. But instead you sent out a dog whistle.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Important-Item5080",
                                            "body": "I like to go out and meet people lol, does that make me a misogynist?  \n\nYou’re the one adding “argued a position so poorly I couldn’t conceptualize it”, I clarified it’s the opposite. Just because I’ve had a few experiences where they argued poorly doesn’t mean they’re *all* like that, I literally mentioned just 2 experiences out of like 40 this year.  \n\nI certainly haven’t said anything about you, or really even the women I’m meeting. You said I want essentially a child bride with no opinions.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lucille12121",
                                                    "body": "Who said anything about a \"child bride\"? Only you. \n\nLet's get back to your intentions here: If you truly wanted to understand what a “classless society” might involve, according to Liberals in good faith, why did you not ask that question without mentioning your many dates? \n\nBonus answer: I can't speak for anyone else, but you should pay for the date, because you're an exhausting attention seeker and in need of constant affirmation. The women you date have earned it.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Important-Item5080",
                                                            "body": "It says baby voice in the definition lol, and the show it comes from is about some religious cult that does child marriage I think (the Duggars).  \n\nPersonal flavor lol. That’s it.  \n\nI mean I’d like to defend myself if someone is characterizing me as the opposite of what I’m actually like.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "lucille12121",
                                                                    "body": ">…someone is characterizing me as the opposite of what I’m actually like.\n\nAre you not actually like your original post, which was pretty douchey? That's how you've expressed yourself, but it's not really you?\n\nHow should people determine what others are like if not by their behavior?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Important-Item5080",
                                                                            "body": "Is it “pretty douchey” or “wants a traditional homemaker for a wife”?  \n\nYou can think I’m a dick, totally subjective and doesn’t bother me. I don’t get the point in you trying to turn me into everything you hate about men, our Patriarchal society, whatever it is.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "lucille12121",
                                                                                    "body": "Wanting a trad wife isn't douchey. Wanting a trad wife but lying about it and dating women who are not traditional is douchey. \n\nJust be honest about what you want. And what you have to offer. Because you don't seem like partner material, as \"partner\" implies equal. \n\n>our Patriarchal society, whatever it is.\n\nWow. You have so much to avoid learning while pretending you know what you're talking about, huh?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Important-Item5080",
                                                                                            "body": "I don’t want a traditional wife. Why would I go through the effort of finding a woman who isn’t that but changing her into one insidiously. I can just find a traditional wife if I wanted to find one. \n\nAnd I’m not implying that our Patriarchal society doesn’t exist. I’m saying idk what issues you’re trying to project directly onto me.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "thebigmanhastherock",
            "body": "Well I am a liberal. It's impossible to not have class in a society. People always find a way to categorize themselves. I mean we should all probably try our best to not care about class and to not treat people differently based on their income. That's a personal values thing. We are all going to care about certain attributes people have, and it's our values that kind of dictate that. I don't really want the government to impose values on society to an extreme degree.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "-Random_Lurker-",
            "body": "It's a fantasy. Even without social pressure, humans instinctively self-segregate even in small groups.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "YourHuckleberry97",
            "body": "It’s not a real thing. \n\nThe idea of a society absent class or hierarchy is a Marxist dream. As soon as a society values a given thing, people will naturally be separated into classes and hierarchies. \n\nIf society really values art then the best artists will stand in a class separate from the average Joe Schmo with his doodles. \n\nIf society really values agriculture then the people who work the hardest and produce the most will be in a class separate from slackers\n\nHumans are just like this. Hierarchy exists across the animal kingdom. It’s just natural. Lock ten strangers in a house for a few months and when they come out there’ll be one person the others are deferential to because he/she happened to be more competent at something that was important inside the house. Maybe they were great at conflict resolution, maybe they were great at organising things, maybe cooking, etc.\n\nIt’s just a thing",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Breakintheforest",
            "body": "I guess it depends on if you could bake a cake well enough that you could transfer that skill into help shape oppressive polices, and become a ruling class.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "It’s not just baking a cake in a vacuum, it’s a unique skill or talent, that is only offered to other people with unique skills or talents you associate with the. Then your kids are in that circle as well to where there’s a tangible lifestyle difference.  \n\nI would guess that as long as you aren’t profiting off someone’s labor that it would be fine.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Breakintheforest",
                            "body": "What \"unique\" skill could one possibly have that others can not have or learn? \n\nProfiting off the labors of others is key to becoming a member of the ruling class in which your value to society. People who are rich through their own talents tend to only be that way because generate a lot of capital for someone else.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "Plenty of them lol?  \n\nPro athletes, Michelin star chefs, people who are math geniuses. Etc, etc. There are plenty of innate talents you can’t teach people.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Breakintheforest",
                                            "body": "But the things you've listed aren't unique to anyone individual. Anyone can replicate those abilities if one trains.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Important-Item5080",
                                                    "body": "Strong disagree.  \n\nI will never ever be as good at basketball as LeBron James is. The size, speed, processing power, and special awareness he has can’t be replicated.   \n\nI can’t learn to cook and create food like Thomas Keller either.  \n\nI’ll never have the intuitive understanding of math and physics men like Hawking and Einstein had. Can I understand their proofs after studying them, sure? Will I be able to do what they did? Nope.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Breakintheforest",
                                                            "body": "You can't doesn't mean others can't. You know what the difference between LeBron James is and some random high-school student to wakes up and lives breathes and eat basketball is? Some talent scout never saw that random kid play.",
                                                            "score": 5
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "pablos4pandas",
            "body": "> In today’s installment of stuff I hear from women on dates but can’t conceptualize: a “classless society”.\n\nAsking the people using the phrase is probably the best way to get what they mean. \n\n> Isn’t that the same class-based system we have now, substituting money with talent?\n\nI don't think every dollar someone has puts them in a different class compared to when they had one less dollar. I would probably think of a classless society where there are not people who choose to not perform work because they are sufficiently wealthy that they do not require a wage to sustain themselves. \n\n\nIn your example the fantastic baker would probably have a better life compared to the baker who uses gravel as their secret ingredient, but they're both working to sustain themselves and in that sense are in the same class",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "I used to ask! I’m a genuinely curious guy lol. But half the time they turn into lectures and they seem mad that I’m even asking lol. The anonymity of the internet makes it way easier to play devil’s advocate.  \n\nSo the world I’m thinking of would already be Communist, so no one would be working to sustain themselves. You work if you want, otherwise basic needs are met.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pablos4pandas",
                            "body": "> But half the time they turn into lectures and they seem mad that I’m even asking lol.\n\nSure, but I'm not in your date's mind(that I know of) so I don't know what these people in particular meant with their statements. \n\n> So the world I’m thinking of would already be Communist, so no one would be working to sustain themselves.\n\nI don't think that is a tenet of most Communist systems I have seen, but I haven't read 'em all. \n\n>  You work if you want, otherwise basic needs are met.\n\nIf you're in a post-scarcity society then yeah that seems obvious, but I don't think most plan for Star Trek level tech",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "Fair enough, I just was curious what other people’s thoughts are on it. It’s an idea of seen before online.  \n\nMaybe I’m confusing communism with something else, but I thought “everyone’s basic needs are met” was a core feature of the ideology.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pablos4pandas",
                                            "body": "> Maybe I’m confusing communism with something else, but I thought “everyone’s basic needs are met” was a core feature of the ideology.\n\nWhere are you getting that understanding? \n\n'He shall not eat who does not work.' was in the soviet constitution\n\nhttps://www.marxists.org/history/ussr/government/constitution/1918/article2.htm",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Important-Item5080",
                                                    "body": "It’s either I’m conflating Socialism (is that a core feature of socialism?) with Communism, or the type of person who labels themselves Communist in this climate also agrees that your basic needs should be met.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "pablos4pandas",
                                                            "body": "> is that a core feature of socialism?\n\nIt is not\n\n> the type of person who labels themselves Communist in this climate also agrees that your basic needs should be met.\n\nTo me it feels more like the propaganda view of communism you get in an elementary school a la 'Everyone gets a C on the test no matter how well you do\", but I don't know your life",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "So its post scarcity?",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "Yes.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "PuckGoodfellow",
                            "body": ">half the time they turn into lectures\n\nDid you listen to what they were saying?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "They honestly aren’t very coherent or point driven, just snarky lol. And they don’t really leave much room for questions either.  \n\nLike one girl went off on imperialism after I said India should have had a more market economy post-Independence. It was pretty uncomfortable and felt real pointed lol.  \n\nI’d rather just ask online than risk making my evening a drag.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lucille12121",
                                            "body": "Try more conservative dating sites. Maybe you'll find a nice demure woman with a baby fundie voice to smile and nod as you talk.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Important-Item5080",
                                                    "body": "I’m not conservative though, if anything I try to seek out career-driven women (but I like to meet all types of people to expand my horizons).  \n\nWhat is “baby fundie voice” lol? You’re making a lot of weird assumptions I don’t even understand.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ResponsibleAd2541",
            "body": "The answer is no, there is no way you are going to get a society without class along the line of socioeconomics. I can’t think of a large modern society with a control, market or mixed economy that has done anything approaching that.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "You sound like a joy to date.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "Why the condescension?  \n\nIs it the money splitting thing, should I be offering to pay for the first date? That’s what my friends think after I told them, but idk if they’re representative of all women.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Frank_The_Unicorn",
                            "body": "I've always felt like I'd prefer to split the bill. That said, I recently started dating someone and he insists on paying. When I said no, I'm fine splitting, he explained that he understands that in our society, women have to pay for so many more things. Our clothes are generally more expensive. Our hair and makeup is much more expensive. The time it takes us to do things is generally longer. We typically make less than men. If you live in a city, it's often not the safest for women to take public transportation at night, so often, I have to pay for Ubers. Birth control is generally the financial responsibility of women. I don't mind splitting the bill, but I also appreciated him acknowledging that. Just food for thought",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "Ahhhh you know one of my friends did say something like that in a jokey manner (“Patriarchy Tax” in her words), but that is very nice of him. I might start using that, it makes sense!",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "letusnottalkfalsely",
                            "body": "It was more:\n\n>today’s installment of stuff I hear from women on dates but can’t conceptualize\n\nAs for the bill, there is no rule. Different women feel differently. You have to ask the woman you’re dating what she prefers, and communicate what you prefer.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "Ah, that was meant self-deprecatingly if anything. As in my mind isn’t creative enough to conceptualize what they’re talking about.  \n\nI genuinely didn’t have a preference but someone else brought up a good reason why men might offer which resonated with me, I’ll probably at least start offering.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "letusnottalkfalsely",
                                            "body": "Then I apologize if I misinterpreted you. It came off to me as condescending toward women and their opinions.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Important-Item5080",
                                                    "body": "I can see how it could come across that way, I should probably learn how to phrase things less ambiguously lol.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "lucille12121",
                            "body": "Let me guess: there were no second dates, right?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "With this lady nope, I have a 50% success rate for second dates/hookups though. Pretty good for a dude!  \n\nDate 3/4 is when mutual interest starts to drop.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lucille12121",
                                            "body": "Augh. Feel free to not share your score with me.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Important-Item5080",
                                                    "body": "Then why did you ask lol?",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheFlamingLemon",
                            "body": "Saying “this installment of stuff I hear from women on dates but can’t conceptualize” feels condescending, and I don’t feel great about your saying “The odds are good but the goods are odd” either. It doesn’t make it seem like you really respect women. The first part feels like “y’all know how women are, with all their silly little ideas and notions. Check this one out.” The second literally calls women goods.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "back_in_blyat",
                                    "body": "Have you tried dating in 2024? Me and all my single friends could each easily write a book with the same title, people (either sex, any political persuasion) just seem outright goofier across the board compared to 10 years ago",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "Oh, well that’s not what I meant at all. I was trying to imply the opposite, as in “my silly brain can’t comprehend this, here’s how I interpret it, where am I going wrong”.  \n\nI can see that, genuinely it’s a unisex thing haha the fellas can be plenty odd too (per discussion with my lady friends).  \n\nHonestly it’s hard to talk about modern dating without sounding a bit dehumanizing, it really is a meat market out there for men and women lol.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Butuguru",
            "body": "> In today’s installment of stuff I hear from women on dates but can’t conceptualize\n\nJesus Christ lol.\n\n> Socioeconomic class is born out of several factors in my opinion. Your starting point in life, how you were raised, your innate skills, internal drive, etc.  \n\nThis is where you run counter to (what I believe is) the comment. They (again assumption) are probably not talking about socioeconomic class. They are probably talking about a Marxist definition of class which is **much** less wholistic. It is purely about a person making money from _owning_ business(es) verses a person making money for _working at_ businesses. A classless society (in a Marxist pov) would be a society that has collapsed this distinction so all workers are owners and all owners are workers.\n\n> straight ladies do you expect a dude to pay on the first date? I generally just ask to split but this date was the first time someone said they thought I would have covered it. \n\nthe energy here is just wild.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "StatusQuotidian",
                    "body": "wammin be critiquing socioeconomic stratification",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Important-Item5080",
                            "body": "Did it come across as gendered? I didn’t mean it that way at all lol.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "wizardnamehere",
                                    "body": "It did. Look don’t worry about it. But always a good idea not to ‘pollute’ or mess up a question or topic with hot button issues which are not really relevant. Gender and dating is going to distract. You now know that mixing up discussion of what women want on dates with questions of political ideology is a cringe topic to the left. \n\nSeparate out dating discussion from political philosophy questions on the basics of political economic superstructure.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Butuguru",
                            "body": "💀💀💀",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "I’m seriously asking lol, one lady here keeps saying I’m a misogynist who only wants submissive women with no opinions (I think).  \n\nI’ve never heard that in real life, but if I come across like that I’d like to know.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Butuguru",
                                            "body": "> I’ve never heard that in real life, but if I come across like that I’d like to know.\n\nYou do lol but it’s might be because the colloquialism in your speech are… very old lol. It comes across as a misogynistic boomer.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Important-Item5080",
                                                    "body": "Was it the “goods are odd but the odds are good” comment?  \n\nIt’s something friends of both genders use frequently lol. We’re all late 20s people, none of us are conservative either.  \n\nIn light of how women have been objectified and still are I can understand how it could come across as misogynistic when posted online. I’ll use my words more judiciously in the future.  \n\nJust don’t get why people are getting so extreme lol, like the type of guy who *is* a misogynist or some sort of alpha bro is probably *not* going to even bother couching it like that.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "Dating in San Francisco is wild dude I fuckin love it lol. The odds are good but the goods are odd y’know?  \n\nHmm, so as long as someone’s work isn’t being profited off of all of the “issues” I mentioned would be a non-concern is how I’m reading it. As in everyone doesn’t need to have the same life, if you have a unique talent you can use it to improve yourself *as long as* you are not profiting off of someone else’s labor.  \n\nI don’t mind paying if that’s the expectation lol, but I’ve never heard anyone say that to me before.",
                    "score": -4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "Well, since socialists divide society into classes based on their relationship to the means of production (owners vs. laborers), they likely mean a society where there is no difference between owners and laborers ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "RocLaSagradaFamilia",
            "body": "I'm not a Marxist, but it's worth noting that Marx was writing during a time and in a place with far more rigid class distinctions than we have today. Short answer: we kind of do.\n\nToday we have sociocultural/economic class, but it isn't explicitly enshrined by either the state or those who practice it. \n\n19th Century Europe, on the other hand, was just starting to get over a society/economy that was fully dominated by landed aristocratic that derived their wealth from agricultural holdings and who passed their wealth and titles of nobility onto their heirs. The only people who lear ed to read were either this ruling class, merchants, or clergy.\n\nThere was no \"get good grades, become a lawyer, make partner, and retire with a $6m net worth.\" \n\nOf course, there are ways to replicate dynastic wealth (boarding school, trusts, etc.), but class divisions (to the extent they exist) are highly permeable. \n\nMarx was talking about a communist, non hierarchical society, where everyone works and received UBI.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "wizardnamehere",
            "body": "A classes society is a Marxist concept. Don’t make the mistake of coming from a social-economic class perspective. That is a different framework which will not work here. \n\nClassless is about not having Marxist class distinctions between capital ownership and proletariat (those who must sell their labor to live). It’s definitionally a property distinction. It means a society without private property. Everyone would have the same relationship to society in how they must secure their means of subsistence and social reproduction. \n\nIf you own enough property. Your life’s needs (bought on the market) is secured through income based on rents and or property sales. If you rent property, you must sell your labor to an employer to get enough income to rent that property and other means of living your life. These are the two classes. \n\n\nTo answer your question. Several communities have had classless societies throughout history. Famously many North American tribes had semi nomadic and settled agricultural societies without property. Meaning they were classless. The distribution of resources and property was a matter of social arrangements inside and between families as well as convention be politics at the clan and at the tribe level. Social position (NOT class) was generally inherited. This is pretty normal in all societies. \n\nAs you can see… There lots of different answers to your question of what a classless society might be like. The only examples of modern industrialised class society we have are the Comintern countries. Now these didn’t have class distinctions (though arguably in different settings party membership construed a social class separation; but that risks making this discussion too long). Of course they still had inequality and hierarchy, if much less than say the US has now. It still saw patterns of social advantage being inherited (as all societies see to some extent). \n\nThere is always a distribution of power in any setting you look at, and it’s never equal. This is not some utopian switch between utopia and capitalism. What changes here is the structure in which resources like land and leadership or management of organisations such as business are allocated and controlled. How is a factory run? How is a local government run? Who controls a river? And so forth. And the system of management has enormous material impact; or no one would care about questions around property. \n\nThen ultimately, socialist will argue, those who control politics; what logic do they make decisions on? What is their aim? \n\nThe core promise of socialism (Marxist/classless or not) is that the economy will be shaped, organised, and regulated by human agency so as to serve society and human needs. And not so as to run under its own accidental historically produced logic’s which produce inhuman ends (capitalism).",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SovietRobot",
            "body": "It’s an idealistic idea. But in practice it’s hard to realize. \n\n\nFor example. Let’s say we start with everyone neutral and everyone gets allocated an equal and fair X amount of food. \n\n\nThen let’s say one person starts selling his food (so he eats less than everyone else) and in return he collects pieces of paper IOUs. Then let’s say after a year he has enough IOUs to do something like get labor help to build his own farm. Then with that farm he starts overtaking everyone else in terms of being able to produce his own food. \n\n\nWell now you have classism in a sense. Who decides how much food to allocate? Who decides if this person can do what they did with selling food and building their own farm? Who decides on how to stop this person if they feel it’s classism?\n\n\nPeople who say want a classless system will say that the people in general should decide but direct democracy with everyone voting on everything doesn’t work. And if it were the case , we would actually probably never have passed LGBTQ rights back in the day. \n\n\nIt’s going to end up being a small set of representatives that decide on allocation or resources and what people can or cannot own. And that kind of power leads to authoritarianism",
            "score": 2
        },
        {
            "depth": 0,
            "author": "renlydidnothingwrong",
            "body": "Class in marxist thinking refers to one's material position in society and more specifically their relationship to the means of production. So in marxist terms all that is required for a classless society is to make everyone's relationship to the means of production comparable. No more bosses and owners, only workers.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">What does a “classless society” even look like?\n\nAs others have pointed out, you are probably looking for an explanation from a socialist; classless societies are one of their big goals.\n\n...but I'll give you the closest 'liberal answer' that I can.\n\n-----------\n\nThe best definitions of 'classes' are probably:\n\n* **Upper Class:** Can live on investment income, alone.\n* **Middle Class:** Needs to work in order to earn enough income, but can/does gain wealth from investments.\n* **Working Class:** Near zero investment income. They make money from labor, alone.\n* **Lower Class:** Includes the working class, but also people who don't make enough income from labor.\n\n-----------\n\nThe middle class has expanded dramatically over the last century.\n\nIf a “classless society” were my goal, I would aim for *further* expanding the middle class as much as possible.\n\n...because, if everyone is in the same class, then class is irrelevant.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lionmurderingacloud",
            "body": "I think the idea of a classless society is nice, but unworkable. The best we can do, and IMO probably what most proponents of socialism or social democracy are advocating, is a society where the rich are not obscenely, inhumanly wealthy (i.e. no billionaires- I mean, a 20 yo billionaire could spend nearly 35k *every day* if they live to 100, and that's only including the principal); everyone has equal access to justice (reduced police abuses of power, publicly funded legal aid, restorative justice instead of incarceration for NV offenders, etc), free quality healthcare for all, free quality education for all who want it, and regulatory barriers preventing businesses from dumping the costs of environmental harm on taxpayers. Im sure there are other points but those would be the biggies. \n\nAs for paying for women on dates, my policy was that as a man, you insist on paying on the first date. It shows generosity and allows you to say \"you get the next one\" as an end run around asking for a second date. If she's really keen on gender equity (or really emphatic that there won't be a second date) she can insist on separate checks. Occassionally you get stuck with the bill for someone you'll never see again, but it's erring on the side of caution vis a vis your date's expectations, and a good reminder not to pick super expensive spots unless you are really trying to impress.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "A classless society isn't one where everyone is exactly equal, but one where the differences are not so large that people view themselves as categorically different from one another.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "not_a_flying_toy_",
            "body": "we do not have a real life example of a classless society, so admittedly its more of an ideal than a realistically achievable thing with perfection\n\nA society with no class would be one where, regardless of situation at birth and income, nobody wields more power than anyone else on that basis.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "monkeysolo69420",
            "body": "I’m assuming you were talking to a Marxist or leftist of sone kind. The Marxist definition of class isn’t about how much money you have but your relationship to capital. The bourgeoisie own land and capital and make the proletariat work for a living so they get a meager wage while the bourgeoisie takes the lion’s share of the profit. Marxists who say they want to live in a classless society mean these class distinctions shouldn’t exist because they create contradictory interests in both classes. The working class wants to do the least amount of work for the most amount of money, while the bourgeoisie wants to pay the least amount of money for the most amount of work.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "monkeysolo69420",
                    "body": "Also whoever asks the other person out should pay. Splitting is for when you’re dating already.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "anarchysquid",
            "body": "So according to Marxism, our society has two main classes: the bourgeoisie and the proletariat. The first own the \"means of production\", and the second own only their labor. The means of production refers to resources and tools that, through labor, can be turned into useful products or services. This can be things like raw resources, factories, shipping vessels, all the way to proprietary software nowadays. The bourgeoisie make their money from selling stuff other people made, basically. \n\nOne class owns the stuff, the other works with the stuff, according to Marxism. Everything about socioeconomic class you mentioned is pretty irrelevant. If the baker is selling the cakes he made, he's proletariat. If he buys a commercial bakery and pays other people to make cakes for his company to sell, he becomes bourgeoisie.\n\nMarxists, then, advocate taking the means of production and giving them directly to the proletariat. Everyone at the cake factory would own it jointly and share the profits of their labor. There would be no class divisions, since everyone would be proletariat. In theory since the workers are now running society, they would structure it to their interests and needs, not the bourgeoisie, making a society that works for everyone. \n\nAnd then we all get rainbows and unicorns and live happily ever after, of course. It's all a bit utopian for me. But that's what people believe.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Regular-Suit3018",
            "body": "It can be whatever you want! Your imagination has zero bounds, go crazy, you have as much autonomy as imagining pink flying elephants, because its just as real as that. It will never ever happen",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jon_hawk",
            "body": ">straight ladies do you expect a dude to pay on the first date?\n\nI'm a straight dude but I'll be sharing this opinion anyway; just pay for the dates dude, especially if you're the one who asked them out. It doesn't matter what they \"expect\". If they don't expect it, be the one who exceeds expectations.\n\nIn terms of a classless society, no idea. I'm a liberal. But had I been in your position I would have used that opportunity to ask her to expand upon it and try to learn what values, life experiences, and influential figures led her to that conclusion. A classless society may be a little \"out there\" for some of us, but it's far from the worst political opinion someone could have... and doesn't come close to the worst I've heard on a first date.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "I’ll start offering at least to pay first. I didn’t want to come across as condescending or misogynistic but it seems like it won’t be interpreted like that.  \n\nI’m kind of conflicted averse irl, and my date didn’t seem to be LOL. Funnily enough we had almost the same exact background, like our parents even did the same job. I should probably start just asking and working on that though.  \n\nThis is definitely not the worst thing I’ve heard on a date, just the one I understood the least. That distinction goes to “maybe the caste system has some merits” lady for 2024. Strong front runner, really hoping nobody tops her.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "throwdemawaaay",
            "body": "> stuff I hear from women on dates\n\nKinda weird bro.\n\n> It’s easy to say “oh everyone can start from the same place”, but can they?\n\nThis is a strawman. What matters is equal opportunity and social justice, not literally uniformity of origin. Two simple examples of this that are lacking in US society atm are universal healthcare and education. These are things other nations have figured out. We can do the same thing.\n\nI have no idea wtf you're trying to communicate with this contrived master cake baker that somehow becomes an aristocrat. It's a preposterous hypothetical.\n\n> straight ladies do you expect a dude to pay on the first date?\n\nAgain, pretty weird bro. Typically the person that made the invitation should pay, but splitting down the middle is fine too. You can use your words and figure it out. It's not a problem.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "Fair enough, I can see how that can come across as a little conceited and potentially sexist.  \n\nJust to clarify though I am *not* a misogynist, I don’t want a traditional wife, if anything being the main bread winner if we had kids or a mortgage would stress me out.  \n\nWell that’s what I thought “classless society” implied, but I can now see it doesn’t. It was a pretty dumb example lol but I was trying to couch it in simplistic terms for my own understanding.  \n\nI got some good advice from that question! I always thought it was sexist to even offer to pay. The “invitee should pay” thing isn’t something I’ve heard before so I’m glad I asked.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "throwdemawaaay",
                            "body": "Look on the last thing just talk about it. If you're gonna have a successful relationship with someone you have to figure out how to communicate with them. Maybe their expectations are different from mine but you can talk about it and figure it out. If you can't even communicate over a dinner tab there's zero chance you can have a relationship with the person.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "Fair enough, I appreciate that advice too. I’m honestly a little too conflict averse in real life, especially with strangers, and that probably isn’t serving me too well in terms of a seriously finding a partner.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "StatusQuotidian",
            "body": "I'll take a whack at it:\n\n- minimum living standard and a reasonably generous welfare state.\n\n- class mobility both up and down\n\n- seriously restrict intergenerational wealth transfers\n\nDone.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "lucille12121",
                    "body": "Yeah, it's hard to see what part of that cannot be conceptualized intellectually…",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Megalomaniac697",
            "body": "A gulag.\n\nA classless society is impossible in a natural state, and it's also impossible in a merit based society. Somebody who has a job that takes two hours to train for cannot be in a similar income bracket as someone who had to do ten years of medical school. It cannot even be close. Consequently, those people will belong to different social classes and the longer they go on their trajectories, the more they will diverge in terms of their assets and status.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "lucille12121",
            "body": "This is [r/AskALiberal](https://www.reddit.com/r/AskALiberal), not r/AskTheWomenWhoRegretGoingOnADateWithMe",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important-Item5080",
                    "body": "Just a bonus question lol, most of them seem to have a pretty decent time.  \n\nAre you projecting your own experiences and opinions of a guy you met in real life that you think sounds like me?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lucille12121",
                            "body": "Lol. A \"bonus question\"? Who gets a bonus for answering it? \n\nMy opinion of you is based entirely on what you've written. Just as your opinion of me is based on what I've written. So no need to winge about it.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important-Item5080",
                                    "body": "No one? Bonus as in “additional”, idk just seems like a fun way to say it.  \n\nIt just seems so extreme though, like you’re talking about me wanting shit I don’t even know about. You mentioned “baby fundie voice”, I looked it up, it’s a “sweet, childlike baby voice used by Fundamentalist Christian women”.  \n\nWhich part of my comment implies I want a fundamentalist Christian traditional wife? It sounds like you pick one thing you don’t like about someone and decide all the things you hate also apply to them.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lucille12121",
                                            "body": "If you need people to like you this badly, why not be more pleasant? Getting hysterical is not going to endear you to me or anyone. \n\n>Which part of my comment implies I want a fundamentalist Christian traditional wife?\n\nAre you kidding? You would enjoy a fundie wife. They will give you what you need: a women to agree with you, regardless of how uninformed your opinion is.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Important-Item5080",
                                                    "body": "I don’t need people to like me, I just don’t want people to assume things about me I don’t even think I’m putting out there. Why do you feel the need to denigrate people you don’t know?  \n\nWell I apologize if it came across that way. To clarify though I’m not Christian. Nonreligious and would prefer my partner to be. I would like to settle down with someone who makes a similar amount, the more the better. I like strong, independent, and smart women who have their own jobs, friend groups, and lives. I’m not even sure if I want children yet.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lucille12121",
                                                            "body": "You don't need to be Christian to be a misogynist. Plenty of super progressive atheists out there are waving an ally flag while enjoying patriarchal privilege. \n\nYou wrote this, which was dripping with contempt: \n\n>In today’s installment of stuff I hear from women on dates but can’t conceptualize: a “classless society”. \n\nAnd this, which assumes all the \"straight ladies\" are single monolith: \n\n>straight ladies do you expect a dude to pay on the first date? I generally just ask to split but this date was the first time someone said they thought I would have covered it.\n\nIt's revealing. Others have pointed this out and you responded with defensiveness. So I can't help but question your claim to be in search of a strong, independent, smart, employed woman. I think you'll be better matched with a woman who will cater to your need to be told that you're right, which is a form of dominance based directly on everything you have written here.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Important-Item5080",
                                                                    "body": "Well I apologize if it came across that way, but again there is no contempt towards any of them. The “baker” example I gave is my thought process trying to reason it out.  \n\nIt’s just a request for general advice, in the past I’ve been told it’s sexist to just pay. I’m glad I got someone’s *individual* perspective on it though because I will change my behavior now based on what they said.  \n\nI’m right when it comes to myself. Either I defend myself and it’s “oh you’re too argumentative you must hate when women have opinions”, or it’s let people think what you’re saying about me is true.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lucille12121",
                                                                            "body": "Your baker analogy was silly and revealed a juvenile understanding of economics. But it wasn't misogynist. These statements were: \n\n>\n\n\n\n>\n\nSo let's address those. Why did you chose to include them? What value did they bring? And who did you include them for?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Important-Item5080",
                                                                                    "body": "I can accept that, I was just trying to dumb it down for myself.  \n\nThe things about my dating life? No particular reason, just for fun. Also a bit of an explanation of why I didn’t ask a clarifying question: it was just a casual date.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "lucille12121",
                                                                                            "body": "Don't cop out. Be honest. You bothered to write it all out in your posy, so you had a reason. Who would find these details \"fun\"? \n\nAnd you included the \"bonus question\" that happens to be common fodder for guys who begrudge some perceived entitlement women have, which makes them all suspect gold diggers. That comment didn't happen in a vacuum. So why did you include it here? \n\n>Also a bit of an explanation of why I didn’t ask a clarifying question: it was just a casual date.\n\nThis date was too \"casual\" to ask a follow up question? But reddit is not casual? \n\nThis is usually called conversation and welcome on dates. By your own account you date a lot and are more successful than most men, so you would know this, no? Why else might you not have asked a clarifying question to your date? Could it because you are not comfortable admitting you are less familiar with a topic than she is? Your baker analogy hints at that.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Important-Item5080",
                                                                                                    "body": "If I was a misogynist obsessed with a submissive wife why the fuck would my default be to offer to split the bill? I explained that I don’t want to be insulting by offering to pay.  \n\nI’m **positive** she knew more about it than I did lol. This *individual* woman however, based on my other interactions with her when we met in person, seemed fairly argumentative and not very receptive to discussion. So I didn’t ask because I tend to get a bit of anxiety in situations like those. My opinion of this *one* individual are not applied to women as a whole, or Liberal women, or even radical Left women. Just this individual person that I met.",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}