{
    "title": "Who do you think is going to win the U.S. Presidental Election? ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nAs the title says, I'm kind of interested to know this. As a European, I kinda want to believe Biden is going to win, but I am also extremely worried that Trump is going to. And based on the opinion polls it can go either way. So what is your view on this? Who do you think is going to win this year's U.S. Presidental Election? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "The correct answer is almost certainly “no fucking idea”. The electoral college makes the whole thing come down to a few states and it’s too far away to know. \n\nThe voters that actually matter are the types of voters that don’t really pay attention until September and they are very low information and vibes based.",
            "score": 114,
            "replies": [
                {
                    "depth": 1,
                    "author": "chadtr5",
                    "body": ">The voters that actually matter are the types of voters that don’t really pay attention until September and they are very low information and vibes based.\n\nI think this year is probably different in that respect.  In an ordinary cycle, you've got the known incumbent and then the unknown challenger who people don't know much about.  But, this time around, you've got two extremely well known candidates; everyone has an opinion on both of them.  There's no unknown quantity in the race.",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "twilightaurorae",
                            "body": "Hmm but isn't 2020 the same though? Just that Trump was the incumbent and Biden was well-known.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "chadtr5",
                                    "body": "There's an ocean of difference between a former VP and a former president.  People are going to know a former VP's name, but they're not generally going to have much more than that, and there's a lot of space for a VP to chart a different course than the previous administration.\n\nTo be a credible presidential candidate in the first place you have to have fairly high name recognition; it's pretty rare for someone obscure to win a primary.  But there's still a big difference between what the mass public thinks about a former president vs. what they think about someone they've heard of but who is still defining their public stances.",
                                    "score": 8
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "simokonkka",
                    "body": "I guess.... I'm just VERY pessimistic usually lmao.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kckaaaate",
                            "body": "There’s good reason to be, sadly. Our last 2 elections were, in a sense, decided by about 60k votes in 3-4 states, despite Biden getting more overall votes in the millions. That is NOT a lot of wiggle room for swing voters, and unfortunately people have very short memories when it comes to politics. I’m American and I’m certainly worried….:",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "clce",
                    "body": "I would argue that there are two ways to win elections. One is to capture those low information or at least ambivalent voters. But the other is to get out the vote. I think this election is going to be decided by who can get out the vote. \n\nNow, you can argue that these are still ambivalent or unmotivated or low information voters. But I think it's a little different than the middle. Maybe not so much. But it seems it's one thing to be undecided about who you're going to vote for. It's another thing to decide if you love a candidate enough to bother going to vote, and another thing to decide if you hate a candidate enough to go out and vote. \n\nI don't think there's many people in the middle. I think people made up their mind about whether they were going to vote for or against Trump long ago. \n\nAnd make no mistake. They are voting against Trump or for Trump.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Roughneck16",
                    "body": "Do you think Trump’s selection for veep will affect his chances of winning?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "blind30",
                            "body": "After Jan 6, I can’t imagine Trump picking a VP who isn’t basically googly eyes on a sock with his hand operating it.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "emu4you",
                                    "body": "Thanks for my official laugh out loud moment of the day!",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "blind30",
                                            "body": "“Trump/Addidas Men’s athletic cushioned crew sock 2024!” It’s funny because the reality of it is definitely not funny.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "P0RTILLA",
                                    "body": "Candice Owen",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ChasetheElectricPuma",
                                            "body": "People can never spell her name correctly, lol.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "P0RTILLA",
                                                    "body": "Candida Owens",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ReneMagritte98",
                                    "body": "To be sure, almost all Republicans still embrace Trump. My prediction is he finds another generic republican to fill the spot.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Similar_Candidate789",
                            "body": "I certainly do. If he nominated Marjorie Green or Kari Lake he would lose a whole hell of a lot of voters. He would lose Arizona over Lake. \n\nIf he nominates a “moderate” (there are none but the ones faking it) then he does better.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "Normally, I don’t think the VP choice matters.\n\nThe thing is is that Trump seems to have completely bought in on his lies and propaganda, and that could put him in a position where he pick someone completely insane.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Smoaktreess",
                                    "body": "Imagine if he picks Kristi Noem after the dog shooting story came out.\n\nI’m expecting he chooses JD Vance or Tim Scott though.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "JD Vance is my best guess. The guy has insulted Trump in the past, but he is fully bought in on MAGA and nationalism.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Paca54",
                                                    "body": "Wouldn’t he feel threatened by Vance?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ButGravityAlwaysWins",
                                                            "body": "Vance has made it very clear he is submissive to Donald Trump.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "NocturnalLightKey",
            "body": "Jeb Bush. All will clap.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "playball9750",
            "body": "I think Biden. Trump has only lost support since he lost his last election. Even with Haley saying she will vote for Trump, I don’t see her supporters voting for him.  I think 3rd party votes to RFK will pull votes from Trump from frustrated non-Trumper conservatives.  The more left voters frustrated with Biden over Gaza won’t vote  and historically haven’t voted, so they were never going to make much an impact anyways.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "throwaway472105",
                    "body": "Do you base all your statement on the feeling in your gut? Because they just aren't supported by the data.\n\nPolls do show that Trump gained significant support among certain groups (minorities, young men) compared to 2020. Even if Biden wins, if will almost certainly be closer.\n\nRepublicans generally fall in line, they did it in 2016 when the division was bigger than now.\n\nAnd most of the polls show that third party candidates hurt Biden more, he is doing consistently worse in polls that include a third party option.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Castern",
            "body": "Ignore polls. Watch elections. \n\nRepublicans seats in lost the Alabama and New York special elections this year.\n\nThat’s a really, really, really, bad sign for Trump",
            "score": 29,
            "replies": [
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "Are you talking about George Santon’s seat in Long Island? Didn’t the republicans end up running an anti-Trump Republican candidate for that seat and ended up losing? Not sure how that’s bad news for Trump",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bossk538",
                            "body": "They ran Mazi Pilip. She is a pro-life Republican running in a bluish district. She is also a Jewish, black immigrant woman with a heavy accent so i couldn’t see republicans getting excited about her either.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "Castern",
                            "body": "It’s bad because the Dobbs decision was a clear decider in both cases. Particularly striking in Alabama. \n\nTrump can’t win the election on his MAGA base alone. He must pull independents. Absolute must.\n\nAnd elections are showing that independents are voting on abortion rights.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Trump is putting up historic numbers with regards to black and Hispanic voters. \n\nAs for abortion, Trump is probably the most liberal  of all recent republican candidates or presidents",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Castern",
                                            "body": "Point of my post is those polls are worthless media bullshit. \n\nIf he actually pulls those “historic” numbers in an exit poll after an election then you’ll have my attention.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "Didn’t you just point to the poll saying that voters care about abortion ?",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Castern",
                                            "body": "As for Trump being “liberal” on abortion. lol hell no. He literally fought to appoint justices who would overturn it. He is directly responsible for Dobbs. And he’s paying the price. \n\nThe problem is, he says anything to please whatever crowd he is in front of. Because Trump only cares about one thing: himself. And getting back into power at whatever the cost.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "Trump is not an ideologue when it comes to abortion. He’s not an evangelical Christian, he measures the temperature of the public and goes that way\n\nAs for Roe, that was always gonna go. It’ was matter of time. Most developed nations in the world even the most liberal ones, gave term limits on abortion and don’t have abortion listed as a constitutional right. Roe v Wade should have never been a thing to begin with",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "throwaway472105",
                    "body": "Special election electorate is very different from presidential election electorate.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Orbital2",
            "body": "Biden.\n\nI think the issue with looking at opinion polls/Biden’s approval ratings is that people are ignoring the context when drawing historical comparisons.\n\nIf Biden were just an unpopular incumbent running against a challenger it’s one thing, but Biden is an unpopular incumbent running against a failed 1 term President that already had their leadership rejected at the polls.  There is almost no precedent for a previous president running again in modern American politics (Teddy Roosevelt I believe was the last one in 1912, and ofc Grover Cleveland before that)",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gertrude_D",
                    "body": "Oh lord. My dad (Trump supporter) always talks about how unpopular Biden is and can't understand why people would bother to vote for him. It doesn't get through to him that it's not about Biden at all, it's about people absolutely loathing Trump.",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Roughneck16",
                            "body": "Your dad probably only consumes media that supports his point of view and only discusses his views with likeminded friends. \n\nI moved from rural West Virginia to California (Berkeley!) for work in the summer of 2016 and roomed with some Cal grad students. \n\nI went to an election watch party on election night and I remember one distraught friend was like “how could Trump win?! I don’t know anyone who voted for him!” \n\nI felt like Dave Chappelle in that SNL sketch.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gertrude_D",
                                    "body": "Yes, but we have this discussion all the freaking time. We have major fights over politics and I am a pretty moderate dem voter. My brother is a Republican and also hates Trump and will push back against him. If he's getting this pushback from his kids with whom there's a lot of general political agreement, I don't get how he can ignore how much hatred there is for the man. \\*sigh\\* I fucking hate cable.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "timeflieswhen",
                                            "body": "Yeah, but either can win, they just need some fraction of 6 or 7 specific states.  It’s crazy.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Ok-One-3240",
                                    "body": "ya know, that sketch almost made the whole thing worth it.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Threash78",
                            "body": "Yeah, Biden has been running for president something like 40 years with almost zero traction. Then suddenly he gets 80+ million voters? come on. Maybe half of those were Biden voters, the other half are anti-Trumpers.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "blind30",
                            "body": "Yes. Biden might be unpopular, but if there’s anyone who could beat him in an unpopularity contest, it’s Trump. That’s my opinion at least, and part of how I came to it is by not taking the actual poll numbers too seriously. \n\nYes, it’s anecdotal, but I have seen SO MANY people just get tired of talking about Trump and his constant drama for so many years- myself included. What I’m hoping is that on a larger scale, enough people have simply tapped out of debating/voicing their opinions online and in real life, and will just quietly show up and vote without all the circus. \n\nThe constant arguments between his supporters and their opponents became a weird part of everyday life during his term. It was EVERYWHERE. I’m glad it’s over, and I’d like to hope more people want it to stay that way.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fttzyv",
                    "body": "I think that's a fair point about approval ratings, but I don't really see how it's applicable to the head-to-head polling.  The head-to-head polls already show Biden's support slightly outperforming his approval (i.e., that some people disapprove of Biden but plan to vote for him).",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "Grover Cleveland was actually successful. Teddy ran for a 3rd term as a 3rd party.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Orbital2",
                            "body": "Correct, I’m not sure there is much to take from an election that happened 120 years ago though",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RealTwo",
                    "body": "Teddy Roosevelt is a bit different though. He groomed Taft to take over in the 1908 election. Roosevelt, also felt that a limited number of terms was a good check against dictatorship opted to not run again in 1908 as well, despite high popularity and wanting from his party for him to run again.\n\nRoosevelt then grew disillusioned with Taft, and opted to step back into the political arena. Roosevelt also dominated in the primaries, winning 9 contests, but failed to win to win the nomination at Convention. \n\nRoosevelt then formed his own party, created a Republican vote split that led to a Democratic landslide victory. Roosevelt also garnered 4.2% more of the popular vote than Taft, and carried 4 more states.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "Grover Cleveland was actually successful. Teddy ran for a 3rd term as a 3rd party.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "VV1TCI-I",
            "body": "Boe Jiden",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ok_Panic4105",
                    "body": "Boe sounds like an interesting guy",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "fttzyv",
            "body": "If you look at people who have [put money on this](https://electionbettingodds.com/), they're putting it near a coin flip with Trump slightly favored over Biden.  If you're confident that the race is a lock one way or the other, there's a lot of money to be made by betting on that outcome.  \n\nBeyond that, it's possible to make a few observations:\n\n1. Trump holds a [small but consistent](https://www.realclearpolling.com/polls/president/general/2024/trump-vs-biden-vs-kennedy-vs-west-vs-stein) polling lead over Biden nationally, and a slightly larger lead in the key swing states.\n2. Biden has a [lower approval rating](https://projects.fivethirtyeight.com/biden-approval-rating/) at this point in his presidency than any other president in history.  \n3. But, Trump is [nearly as unpopular](https://projects.fivethirtyeight.com/polls/favorability/donald-trump/) as Biden.  The race will likely be decided by how voters who disapprove of both candidates end up breaking.\n4. A lot can change in 5.5 months, and there are a number of lurking factors out there with the potential to fundamentally reshape this race.\n5. RFK is polling better than any third party candidate since Ross Perot.  That makes this race even more unpredictable than normal.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ut_Prosim",
                    "body": "> RFK is polling better than any third party candidate since Ross Perot. That makes this race even more unpredictable than normal.\n\nThe craziest part of this entire mess. Who could possibly vote for RFK? It boggles the mind. How many people out there are like \"*I want all the craziness of Trump, but without any of the charisma and the right-wing community*\"? \n\nFFS a worm literally ate part of his brain *and* he also had mercury poisoning that affected cognition. It's obvious when he starts talking about how COVID-19 was probably made in a lab because Asians and Ashkenazi Jews are less likely to die from it than white folk. \n\nI would sincerely be worried if he became my HOA president.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "NicoRath",
            "body": "Biden.\nI'm European, and I have a degree in American Studies and follow American politics closely \n\nWhile Biden is unpopular, a lot of people who voted for him didn't vote for him because they liked him but because they hated Trump, are Democrats, or just because of the fact that any Democrat is better than a Republican.\n\nThe state Republican Parties in a number of swing states are in trouble, many lack money. The Arizona GOP had to sell their headquarters because they didn't have the money to pay the rent, and the Michigan GOP might go bankrupt because of their money trouble. That's a problem because state parties are important for elections, and the lawsuits have cost them a lot of money. The National GOP might have to bail them out, and that, combined with paying Trump's legal fees, makes it even worse.\n\nTrump also doesn't have many good allies in swing states.\nIn Pennsylvania, the Democrats have a popular Senator up for re-election and, a pretty popular governor, and another reasonably popular Senator.\nIn Michigan, they have a popular governor, two Senators, and an open senate seat with a strong candidate.\nIn Wisconsin, they have a reasonably popular governor and a very popular Senator up for re-election. The Republican Senator is pretty unpopular, and while he has won re-election, it was by a very small margin, whereas the Democrat won her last election handedly.\nNevada has two Democratic Senators, one up for re-election, with the likely GOP candidate being weaker than in the last election, where the Dems won. While the state has a republican governor, he is relatively moderate and has tried to distance himself from Trump, so he likely won't help much.\nIn Arizona, the reasonably popular governor is a Democrat, one senator is a Democrat, the other independent (elected as a dem) that caucuses with the Dems, and an open Senate race that leans Democratic given the fact the Republican is crazy and the Democrat is a relatively strong candidate. The former Republican Governor also has a bad relationship with Trump after he acknowledged Biden's victory in the state, so he won't help, abortion is also on the ballot, which might help Biden.\nIn Georgia, both senators are Democrats (both reasonably popular), and while the governor is a Republican, he has a frosty relationship with Trump for acknowledging Biden's win in the state, so he probably won't help much either.\n\nI'd say a combination of these factors will probably mean that Biden wins Pennsylvania, Michigan, Wisconsin, Nevada, probably Arizona, perhaps Georgia, and Nebraska's 2nd congressional district. Winning the states, I believe he will, is going to guarantee him a win. As long as he wins the Midwest states and Nebraska's 2nd congressional district, he has won the election, though just barely.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "javi2591",
                    "body": "You have a lot of hope that he will win these states without looking at how American people of color feel about Biden and how angry they are about his actions regarding Israel. People on here want to autofellate themselves about how Biden maybe severely unpopular, but average Americans will turn out for Biden in spite is racist actions against Palestinians and what Blinken said to the Arab American delegation or how Biden hasn’t materially improved the lives of most Americans who feel that they’re not making headway in the American dream and most of us struggle to pay rent and maintain our way of life. Most people blame Biden for the terrible economy for middle and lower class people. Those here only factor their own wealthy positions and ignore the average cries of their fellow Americans.\n\nThe anger many have because of Israel and us sending billions of dollars to fund a genocide in Gaza. The fact that people on here think they’re in the majority and don’t want to talk to people who would agree 90% of the time and only fellate themselves and Biden’s illusionary success as president. He’s been mediocre to absolutely terrible for people of color, for immigrants and for those who wanted higher minimum wages, paid family leave and universal healthcare. He can’t even meet us on these issues let alone grasping the fury many young people and people of color feel about Israeli war crimes. Just go to r/israelcrimes r/israelexposed or go on TikTok, Telegram or follow people on WhatsApp. Everyone who is younger and especially black/brown/ Native American are absolutely against the USA stance on Israel.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Legally_a_Tool",
            "body": "I think overall Biden is likely to win… but probably by just a hair. My prediction is that Biden will win within 10 electoral votes. \n\nTrump has SO MANY negatives dragging him down, even with an uncharismatic shambling corpse like Biden, Trump is not likely to win. \n\nGood news for Biden is that he has a huge war chest, and Trump’s war chest is mostly paying his legal fees. Also, Biden’s popularity appears to have bottomed out before most voters decide who to vote for. Short of a catastrophe at the debates, Biden will likely be increasing his support and momentum through Election Day.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "nakfoor",
                    "body": "I think another thing Biden has going for him is time and time again people describe him as \"a shambling corpse\" or \"doesnt know where he is\" yet he always performs fine in debates and the state of the union.  By exceeding expectations he will inspire enthusiasm.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "ageofadzz",
            "body": "Biden. \n\nThe Democrats have exceeded expectations in every election since 2016 (with the exception of maybe 2021). I think Biden’s poor polling as a lot to do with people not thinking about the election until Labor Day. Trump has a very strong base, but a ceiling. Biden has no real “base” but a lot of voters who will vote for him to stop Trump.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "HistoryWizard1812",
            "body": "We don't really know for certain. However, Biden just has to keep the states he won before, he could even lose one if it isn't a swing state. Trump however has to gain three states with enough votes. So, on a numbers level Biden does have the advantage.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "FungolianTheIIII",
                    "body": "He can lose Arizona, Wisconsin and Nevada and still win. He can definitely afford to lose a swing state (not ideal ofc, but not the end of the world.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HistoryWizard1812",
                            "body": "It all depends on which swing state it is. Hopefully with Trump's and the GOP's abortion blunders Northern swing states will stay with him.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Darwin_of_Cah",
            "body": "It's not the idea I want to promote, but I have a legitimate fear that Trump will win.\n\n1. Republicans rally while we split and fight amongst ourselves.\n\n2. Blame or anger over Isreal policy by possible democrats will lead many to stay home. We need just about  everyone on \"our team\" to show up in order to win.\n\n3. A secret enjoyment of the outrage. Fox and AM radio have found that people like, no LOVE being upset about something they have no real control over. It's kinda baffling, but people get addicted to the feelings of rage and superiority that comes with being \"right\" in the face of \"wrong\". Part of me worries that unconsciously, many of us like Trump being a foil and a direction for our fingers to point. I hope I'm wrong about this.\n\n4. Democrats are a large tent party. That means some of our  people will not see their desires met nor their policy dreams realized. I worry that the very structure of our party leads to division in the ranks.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "rthomas10",
                    "body": "Good read on the situation and a level assessment.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ElboDelbo",
            "body": "I say 55% chance of Biden, 45% chance of Trump.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "whozwat",
            "body": "Crazy country where a candidate can earn 7 million plus votes over a competitor and still lose the election.  Seriously, MAGAs how is this fair?",
            "score": 4
        },
        {
            "depth": 0,
            "author": "not_a_flying_toy_",
            "body": "Joe Biden is lagging in the polls, but democrat senate candidates are doing well in many states that Biden struggles in (WI/PA/AZ/NV). so it kind of comes down to which polls are more accurate and how many democrat senate voters split tickets.\n\nmy gut says its about 50/50. maybe a slight edge to trump. Biden's inability to retain energy from his base is a bad sign",
            "score": 7
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "I think Biden. In the last month he’s cut Trump’s lead in half. If he continues on this path he’ll pass Trump this Summer.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "WeenisPeiner",
                    "body": "If Michael Cohen was hiring IT firms to inflate the polls for Trump. There's no reason to believe that Trumps people are not doing that again.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "letusnottalkfalsely",
                            "body": "I don’t see any evidence that the polls have been inflated at any large scale. Buffing up a small online poll is possible but simultaneously influencing dozens of polls from different pollsters, many of which are not online, would be an astronomical feat.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "simokonkka",
                    "body": "I guess... I'm just being cautiously optimistic but slip into pessimism.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "letusnottalkfalsely",
                            "body": "I don’t think it’s about optimism or pessimism I’m just being realistic.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hodgkisl",
            "body": "No idea, it’ll really come down to what happens in the world over the next few months.  Many voters think only of the immediate situation, 3 + years of awesome losses all value with a couple months of bad.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "LobsterPowerful8900",
            "body": "I don’t know for sure but logically, Trump lost the last election and has lost support since then so I would say that he is going to lose again. Biden isn’t my favorite but in this case, is the guy I have to vote for.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "simokonkka",
                    "body": "I mean same lol. I don't like either of the parties but objectively you vote for the less bad one (Democrats).",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LobsterPowerful8900",
                            "body": "Exactly. Like Biden is far too old and he’s not been the best with some foreign policy issues but the other one is pushing for a fascist theocratic dictatorship so… ehh I’ll take my chances with the stuttering old man that isn’t pushing to have ultimate immunity for himself over the one that is.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SirOutrageous1027",
            "body": "I think Biden probably wins. Opinion polls at this time suggest he loses. And if it were some new challenger, I think he'd be in trouble.\n\n\nBut I'm not sure Trump wins back anyone. Like how many of these Wisconsin/Michigan/Pennsylvania voters are going Trump 16, Biden 20, Trump 24? I'm sure those people are out there, but I can't imagine there's many of them.\n\n\nNotably, I think Jan 6 hurt Trump more than anyone realizes. My anecdotal evidence is my dumb-as-shit Trump supporter cousin, who proudly voted for him in 16 and 20, has said he won't vote for him in 24 because of Jan 6. He won't vote for Biden either, so he'll just stay home.\n\n\nSo break it down...\n\n\nTrump 16, Trump 20, likely goes Trump 24. This group isn't losing many voters, but Jan 6 may have made a small difference. Their alternative is going to be not voting in 24. Though I'd love to chat with a person who ends up Trump/Trump/Biden. \n\n\nHillary 16, Biden 20, likely goes Biden 24. I don't think this group loses many voters. I'd be very curious to meet a Hillary/Biden/Trump voter. Rejected Trump twice, but 3rd time's a charm? There's some Israel related blow back on Biden in this group. But this is also the group that has been either Democratic loyalists or holding their nose to fight Trump since 2016. \n\n\nTrump 16, Biden 20, likely goes Biden 24 or doesn't vote. These voters rejected Trump once already. Trump/Biden/Trump would be a very odd pattern - if you've already rejected Trump, and you also want to reject Biden, I'd imagine you don't vote. \n\n\nHillary 16, Trump 20, likely go Trump 24. I'm not sure how large this group is, but these people clearly changed their mind and thought Trump was doing a good job.\n\n\nEither 16, didn't vote 20. Those people likely don't vote again. They rejected both options in 20 and it's the same choice in 24. \n\n\nDidn't vote 16, either 20. Either stick to their choice or don't vote. If you didn't vote in 16 and voted for Trump, likely you felt he was doing a good job. If you didn't vote in 16, and voted for Biden in 20 then likely you had a concern about Trump. My guess is this is the demographic that will tell us who wins. \n\n\nDidn't vote 16 or 20, for the sake of completion, I'd guess most of this group continues to note vote.\n\n\nBiden voters weren't necessarily Biden supporters, but rather Trump haters. That's not usually a way to win an election, but Trump created a very unique set of circumstances. None of that has changed. And while the basket of deplorables are still out there and as loud and fervent as ever, I don't know that they've really grown in the last 4 years.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Shirley-Eugest",
                    "body": "Good analysis. If anything, Trump’s pool of voters has only shrunk…as they are disproportionately older, the actuary tables have shaved off a not insignificant number of Trump 2020 voters. I personally know of 5, 6 people whom I strongly suspect voted for him in 20’, who have since passed away.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "srv340mike",
            "body": "Biden.\n\nHe's got an incumbency advantage against a very polarizing candidate who he not only beat before, but who was previously in office and as such isn't the slightest bit of an unknown quantity. He also has a pretty good set of policy accomplishments.\n\nTrump is popular and energizing among the people who like him, of course. But everybody basically has an opinion on him already. That all bodes well for Biden.\n\nHowever, inflation is a major kitchen table issue and economic sentiment is bad. This will be a major boost to Trump, especially compounded with the perception that the GOP is better for the economy that a lot of voters have. So while I think Biden has a strong chance of reelection, I don't think it's a slam dunk.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Mysterious_Tax_5613",
            "body": "Idk who will win. I do know if Trump loses again he’ll repeat 2020 all over again. He won’t concede and say the election was rigged. God knows his supporters will go ape shit.\n\nBut, if he wins he’ll say it was a fair and balanced election. And, he will never give up the Presidency.\n\nJust listen to him. He’s telling us exactly what he will do.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Jernbek35",
            "body": "It’s a toss up at this point. Trump is insane but he’s got real momentum and for some reason it really seems like people just hate Biden. I can’t explain why but I’ve never seen such universal disliking for a president outside of liberal circles, most moderate voters I see everywhere don’t seem to like Biden.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "robby_arctor",
                    "body": "A lot of the same reasons they disliked Hillary Clinton - they both are the face of a system many people are dissatisfied with.\n\nObama was a new face, he could credibly sell messages of hope and change. Biden has been in D.C. so long that he spoke to *President Nixon* on the phone as a Senator. It's not really a mystery imo.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ut_Prosim",
                            "body": "There are a lot of reasons to hate the current system, but the alternative is Trump's \"unified reich\" so I hope people realize what is at stake.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "robby_arctor",
                                    "body": "If you can't talk about your candidate's unlikeability without deflecting to someone else, I think you're just pissing against the wind in the long run.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ut_Prosim",
                                            "body": "In normal cases I'd agree with you 100%, but this is not normal. \n\nI do not think it is hyperbole to suggest this one guy could permanently destroy the democratic institutions of the US. If he wins there may never be another real election in our lifetimes. \n\nI don't think any of his peers are a similar threat. They'll still do all sorts of evil things if they win, and the Heritage Foundation will keep trying to take us back to the 1940s. But none of the other candidates are wannabe dictators like Trump (maybe DeSantis). And for whatever reason, Trump has a near magical hold on his base. Nobody has ever been able to replicate it.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "robby_arctor",
                                                    "body": "What I said is true regardless of how devastating the alternative is.\n\nTrying to motivate people to eat shit by comparing the varieties of feces available to them isn't going to make anyone feel hungry.\n\nIt's a testament to the corporate-imposed paralysis of the Democratic Party that Joe Biden and \"business as usual\" politics are the best they can muster in this dangerous moment.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FizzyBeverage",
            "body": "Trump is almost certainly getting convicted in NY after the defense couldn’t even muster a defense. Prosecutors canceled McDougal and a few other witnesses because they have the jury where they want them. \n\nThere’s *2 attorneys on that jury*, **one is a trial lawyer** — sure as the sun rises that guy is going to steer the entire deliberation. If you’re the son of a doctor and got sick as a kid… you already knew that your dad and your pediatrician would run the whole show without a word from you — you would just take the medicine prescribed.\n\nMerchan will delay his sentencing about 3-4 weeks (instead of New York’s usual 1 week lag time)… this is for Merchan to broker the possible incarceration arrangements between the bureau of prisons, New York state and the secret service for Trump’s protection. Trump isn’t going to gen pop at Rikers, but he’d be held in isolated custody or some kind of house arrest, almost certainly.\n\nThere’s enough moderates in the 5-6 essential swing states who won’t tip it to a convict not free until 2027. Merchan isn’t going to let him out pending appeal (appeals take 18 months in NYC)… if you look at Merchan’s historic sentencing, he’s pretty by the book but leans harsh.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "nakfoor",
                    "body": "I think the \"troll\" vote is much weaker this time compared to 2016.  I think one of the things that helped carry Trump across the finish line was the few percent who voted Trump \"because it would be funny\".  I don't see many people going the same length to vote for someone who has been criminally convicted.  In fact I do see it turning people, even Republicans, off completely.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "robby_arctor",
                    "body": "I don't share your belief that the legal system matters this much. The real principle underpinning American \"democracy\" is might makes right.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FizzyBeverage",
                            "body": "It matters if he’s convicted. Obviously the 40% of Trump supporters are too far gone, but the 10-12% he needs to win elections… would care about this.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "robby_arctor",
                                    "body": "And on what basis do you believe that?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ausgoals",
                    "body": ">Merchan isn’t going to let him out pending appeal\n\nI’m in no way convinced that you’re right about this. And while I agree that I’m not sure there’s enough support in swing states for Trump as is, let alone if he’s convicted (at least assuming the Democrats can get people to turn out again), I’m also not convinced that actually sending Trump to prison as opposed to some kind of house arrest or having him live as a free man pending appeal would do anything other than shore up further support for the guy.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FizzyBeverage",
                            "body": "What’s the alternative? He goes free and picks up even more support because they run with the “see, election interference!” narrative *anyway.*\n\nI suspect that *if he’s convicted*, Merchan is going to throw the book at him to teach him a lesson.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ausgoals",
                                    "body": "‘They tried to gag me’ and ‘they’re trying to steal the election’ just hits different when it’s at another deranged rally vs from a jail cell. \n\nThat said… it’s not like he could hold press conferences. He could, I guess, dictate letters or something.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ThrowawayOZ12",
            "body": "Not Trump. If a desk lamp ran against Trump, I'm confident every person with an ounce of Blue in them will turn out for the desk lamp. I really don't know how Trump could gain more support than he had in 2020.\n\nNow having said that, I really think Biden is the worst candidate to run against Trump solely due to his age (Weirdly, I think Trump is also the worst candidate to run against Biden due to his age and that he will give his opposition so much support). I truly believe that anyone younger, regardless of party affiliation, would win this election easily.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sadistmon",
                    "body": "Trump doesn't need more support than 2020, Biden will have less.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "loufalnicek",
                            "body": "Trump will lose some people because of Dobbs, I think. He hasn't faced voters since that decision, yet.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sadistmon",
                                    "body": "Fair but Biden will lose a ton of people because no special rules for mail in ballots this time around.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "loufalnicek",
                                            "body": "Perhaps. I think people will be pretty motivated to vote this time, regardless of format.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ThrowawayOZ12",
                            "body": "Like I said: if Biden ran against anyone else he'd lose. Things are \"ok\" and Biden isn't at all exciting. His only appeal is that he's Trump's opposition. The closer we get to the election with Trump the greater that appeal will be.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Thorainger",
            "body": "I think Biden will.  The country is no longer under the delusion that Trump can't win.  Hopefully, he'll be convicted, and the independents who somehow haven't made up their mind to this point will pick the obvious choice.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Tommy__want__wingy",
            "body": "Trump if the apathy and protest voting matches 2016.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "3Quondam6extanT9",
            "body": "I do think it'll end up being Biden.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ShibaInuLover1234",
            "body": "It's close but I give the edge to Biden. When you look at Trump's path to victory, not only does he have to win back reliable Republican states that he lost last time like Georgia, he also needs to flip back Arizona and most of the rust belt like Wisconsin, Michigan, and Minnesota. When you look at how elections have been going in these states the past few years, the Democrats have been doing quite well. There's always the possibility of Trump winning PA which could throw a wrench in things, but that state is far from a guaranteed win for him.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "washtucna",
            "body": "I don't know.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ShookSamurai_",
            "body": "Some jerk",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Personage1",
            "body": "I think that barring any major surprises, Biden will win the election.\n\nAgain, this is assuming no major surprises. Don't tell me I'm wrong by bringing up some change to the current trajectory of politics.\n\nBut with Roe v Wade overturned and attacks on voting rights happening across the country, Democrats have been over performing expectations for the last several elections cycles. Further, Trump no longer benefits from being an unknown factor like in 2016.\n\nThings I think are most likely to change that. The economy taking a turn or turmoil in the Middle East.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Pesco-",
            "body": "I would like to think that Biden will win, but after 2016 and a too close for comfort 2020, I will take nothing to chance. There can be no complacency, and maximum effort must be made to stop Trump from entering office again.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "I think that it is going to be a very close election and would not be at all surprised either way who wins.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "sunflower53069",
            "body": "I live in trump country and am not seeing the Trump signs yet. Just a couple of F*** Biden signs.  Hopefully this means they get an apathetic turn out and Biden wins.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BiryaniEater10",
            "body": "I think Trump will clear easily. The Dems are in a situation where a large portion of their base won’t vote for them barring them taking specific actions, *but* they will lose a lot more votes if they take those specific actions.  This is a nightmare scenario for Dems and a dream one for the Rs. \n\nThat being said, there is the potential a lot of moderate Rs stay home but super unlikely.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Man-o-Trails",
                    "body": "And huge tip the media is being very well managed by our enemies...all of them...and these days, there are a lot.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "W1neD1ver",
            "body": "Biden, and both chambers of the congress flip leadership.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "To-Far-Away-Times",
            "body": "Trump lost to Biden with the incumbent advantage. Incumbents typically pull 4-5% better. Now Biden has the incumbent advantage against Trump. \n\nSince 1933 only four presidents have not won re-election, Trump being one of them. \n\nEven W. Bush, with his War on Iraq in full swing, was able to win reelection due to his incumbency.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Jaanrett",
            "body": "Normal people, people who are not in the trump cult and who recognize the harm that trump is, outnumber MAGA republicans by a rather large margin.\n\nHowever, those MAGA cult members are motivated and will vote. So we need to make sure we get proper turnout, we can't sit this one out, every decent person needs to vote, in which case Biden will win. \n\nNot voting is the same as casting a ballot for trump and his marginalizing and vilification of over 60% of the country.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Similar_Candidate789",
            "body": "Biden. \n\nHouse will go democrat.\n\nSenate is 50/50 tossup leaning Republican.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Smoaktreess",
                    "body": "This is where I’m at. The senate map looks better for Dems in 2026 so hopefully it’s close enough after 2024 for the Dems to take all three houses for the last two years of Biden’s presidency.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "MaggieMae68",
            "body": "I think Biden will win, but not easily.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Impressive_Heron_897",
            "body": "I think there's a good chance Trump is dead or truly incoherent by November. Court every day followed by campaigning; all combined with amphetamines and fast food while being old and obese.\n\nIf he's alive, not a veggie, not in prison...I'd say 75/25 Biden wins.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "spencewatson01",
                    "body": "Good thing Trump demanded a drug test before the debate.  Then we’ll finally know that trump’s on speed and Biden is clean as a whistle.  His bug eyes and fast talking is just because he stutterers or something.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Impressive_Heron_897",
                            "body": "Biden probably barely drinks coffee. I bet he did a bong rip in 1960 and said \"woah that's crazy!\" \n\nTrump is up at 3am speed tweeting in all caps about his trials and conspiracies against him. That's Amp behavior for sure.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "spencewatson01",
                                    "body": "I heard he played gold one time and shot an 18.",
                                    "score": -1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "WeenisPeiner",
                            "body": "Yeah, I'm sure Trump would definitely not have someone do the drug test for him.\n\n\"Hey Baron. Pee in this cup for me.\"\n\"Ok daddy.\"",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NATOrocket",
                    "body": "Well, Biden is even older than Trump. You could say the same thing about him.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Impressive_Heron_897",
                            "body": "Well, I think Biden is in better health, has a good diet, and isn't under the stress of going to prison for being a traitor and superfelon. \n\nHowever, I take your point. But I'm fine with that. Dems have a solid agenda right now and can draw from a wide pool if Biden's health fails.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "harrumphstan",
                            "body": "There is little comparison in physical health between the two.  I’d say the same with mental health, but I think it’s hard to attribute every pause and mistake that you see in Biden’s speech to a lifetime stutter.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "STS986",
            "body": "Sadly Trump will likely win, project 2025 is inevitable and fascism not far behind it.  ",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Atticus104",
                    "body": "I think you are right, unfortunately.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "bootybuds",
            "body": "agreed with 50/50 which is not reassuring",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Gertrude_D",
            "body": "Ugh. I think it's too close to call right now and there are more variables than normal that could swing it. Biden is old and a bit fragile (comparatively). There's lot's of time for a health scare or major flub from him. Trump is facing criminal charges and even if he doesn't have them resolve by election time, the stress might cause unforced errors. We just got a new detail about his documents case so I have to believe that we will be hearing more before November.\n\nI wish I could answer you, but I honestly do think it's too close to call right now and we are too far out from the election to have any confidence in what the landscape will look like then. Remember we are also bound by the electoral college, so national polls are largely worthless.\n\nGun to my head, I say Biden inches over the finish line.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ScubaCycle",
                    "body": "Biden may be old, but the man rides a peloton. He looks really fit too. I do not get where all this fragility talk comes from. Trump is fat and rolls around in a golf cart. These two are not the same.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Gertrude_D",
                            "body": "Let's not kid ourselves - the man is too old for this job and his best years are behind him. He is fragile in the sense that at that age, small health problems can snowball and come out of seemingly nowhere. His cognition isn't as sharp as it used to be and a prominent misstep could have disastrous optics.\n\nI absolutely think he is a better person for the job than Trump. Aside from the fact that Trump is an obvious crook IMO, Biden can run circles around him mentally and probably physically, but again, let's not kid ourselves that this is a good position for the country to be in.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ScubaCycle",
                                    "body": "My point is that the \"Biden is too feeble to be President\" rhetoric creates a false equivalence between him and Trump. Maybe he is too old, but for his age he is in great shape and he runs circles mentally and physically around Trump. You want a younger candidate, field them in the primaries. We are long past that.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mrciv6",
            "body": "I think this sub is a little too comfortable with Biden's chances.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "beulahjunior",
            "body": "IMO it comes down to whether or not democrats show up to vote. republicans do.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "johnnybiggles",
            "body": "Trump has effectively *zero* chance at winning fairly.  Keyword *fairly*.  However, as our general presidential election isn't fair to begin with (EC, FPTP, etc.), that changes the odds significantly.  \n\nI think Biden will still win, given that Trump hasn't yet won a popular vote, and managed to lose the second election and even caused others to lose in 2022.  I can't fathom how he could've possibly *gained* any new support, but then again, another anomaly was that in 2020, he managed to *gain* support after 4 years of insanity.  It's so hard to process how stupid and forgetful people are in this country.  \n\nThat being said, since he's also on trial and there are at least *some* people who have realized from this trial - the supposedly weakest one - that he pulled one over people's eyes in 2016, there's hope that people are done with the \"baggage\" as they had also said in 2022 after getting shellacked and there being no \"red wave\" then, in much part, on his behalf.  \n\nThe caveat is, he already tried to steal an election, and the fucked up thing is, every single major player who participated in that scheme (minus Navarro) is still free as a bird, and able to engage in more fuckery, with the mistakes of the past registered to learn from.  The more sensible ones will stay away from it, knowing Trump is at the front end of it again (\"Mierdas touch\"), but we've learned from history that hasn't stopped anyone from trying to use him for money or power or fame, anyway.  \n\nSo I expect fuckery, especially if he loses, but I think he will try some new scheme we haven't thought of, since no one saw \"fake electors\" nor an actual violent insurrection in 2020 as a possibility.  Apart from all of this, Biden wins.  Best case scenario, Trump gets sentenced for this trial immediately and has to wait in jail for his appeal, while he gets shut down by the Supreme Court for immunity, and the DC and FL cases move on, one or both completing before the election anyway, exposing more of his shenanigans.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SativaSammy",
            "body": "Elections are always a referendum on people’s perception of the economy so I don’t like Biden’s chances. People are fucking pissed about inflation and regardless of everyone’s thoughts on the causes, most voters blame the person in charge. \n\nI also strongly disagree with Biden’s campaign strategy of touting the stock market and GDP. \n\nWe’re seeing those metrics not mattering as much to working Americans for the first time in decades. Who cares what the GDP is if a 24 pack of soda went from $8 to $13 in 3 years? Whether YOU drink soda is irrelevant. Millions of Americans are obese and drink it daily. It hurts at the checkout line.\n\nPerception matters. And Democrats continue to suck complete ass at messaging.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Man-o-Trails",
            "body": "The Dem vote is so shaky/shady on the far left and among the youth, they hate Israel and Biden's strong support for them, and they don't care about Ukraine at all (all blatantly due to foreign influence, and the Dems literally sitting mute because the don't want to lose more of their left), so I think the left will leave the space blank or write in Bernie.  Bernie needs to get out and fix this, but he won't.  I think he's in the \"leave it blank\" group.   \n\nTLDR: Trump will win.  \n\nI don't like it one bit, I'm just answering the question honestly.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "supercali-2021",
            "body": "Whoever has a concrete plan to improve the economy and bring back the middle class.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ok-One-3240",
            "body": "Not RFK Jr.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "roastbeeftacohat",
            "body": " I am confident in Bidens chances at the moment, with how much democrats have been outperforming polls overall since 2016. we'll have a much better idea after Trump's convicted, how much impact that will have is a huge X factor.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Threash78",
            "body": "Biden. Democrats have been crushing elections they had no business even being close in ever since Trump won in 2016.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PedanticPaladin",
            "body": "Biden.  This election really reminds me of 2012 where the media was trying to make it a tighter horse race than it actually was.  I see the polls and the media coverage and I get anxious, then I hear about a special election and see a Democrat demolish a Republican by an absurd margin and feel more at ease.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": "Biden\n\n\n* Jan 6th turned some independents and Republicans away from Trump. \n* Roe turned a lot of women against Republicans. \n* this new weird anti contraception thing isn't helping either. \n* Biden is quietly doing a good job. \n* Student debt relief looks good for Biden. \n* Trump had months of course cases to go, making him look bad. \n* Trump says stupid shit, is Trump. \n* Most Americans can't point to Israel on a map and don't care. And Trump would be worse. \n\n\nI'd be worried if Biden was facing someone else. But he's facing Trump. \n\n\nI would walk on broken glass to vote for BUSH over Trump and sleep well that night knowing I had made the best choice available. \n\n\nTrump. Can't win a Republican primary without him, can't win a general with him. \n\n\nBut.... we don't win by popular vote. The only way Trump can win is some electoral college BS. Still...\n\n\nBiden.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Outrageous-Divide472",
                    "body": "We will hold hands and walk on that broken glass together to vote BLUE in November.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kineth",
            "body": "Some old honkey, most likely.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FlintBlue",
            "body": "Gun to my head: Trump. At some point, polls become meaningful, and they've been bad for Biden. Combine that with the baked-in disadvantages of the electoral college and it leaves me cautiously pessimistic.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AwfulishGoose",
            "body": "Biden, but I also thought Clinton had it in the bag. While I'll more than readily admit Clinton had shortcomings, she is one of the most experienced politicians we had for the position of President. The same applies to Biden. I find it astounding how people make the most bullshit of excuses like he is the salt of the earth when we have seen a complete 180 on Trump. It's like the difference between fire and ice yet some people are doing their damnedest to convince others they're the same. \n\nThe alternative is Trump whose administration is already considered one of the worst this country has ever seen in its history. The only thing that could trump that is 4 more years. \n\nSo in November I'm voting for Biden. Hopefully others will too.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Outrageous-Divide472",
                    "body": "People are stupid.  Back when the election was Bush vs Gore, I had a stupid fucking co-worker tell me she was voting for Bush because, “Gore has a funny shaped head.”   I swear, I can’t make this shit up.   Stupidity is rampant in the US.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "FurryM17",
            "body": "Trump for two main reasons:\n\nPutin doesn't want another 4 years of someone who doesn't him to have Ukraine.\n\nThe Heritage Foundation wouldn't have just broadcasted Project 2025 to everyone if they didn't know they were going to win.\n\nI'm voting for Biden but Trump will win.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WildBohemian",
            "body": "I think Biden will win but it's far from being a lock.  I think reproductive rights are going to be the deciding factor but Biden may underperform with misguided younger voters due to the Gaza situation.  Nail biter but if I had to guess Biden wins out.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "moonflower311",
            "body": "Win or be put in power.\n\nBiden will win the popular vote.  If I had to guess I’d say there’s a 60 percent chance he wins a majority of the votes in the states he needs.  However there’s a whole process including certification etc.  I live in Texas and I have absolutely zero faith that the state would certify an election where the democrat came out on top.  They’d find some way to throw out some votes from Houston or claim fraud or something.  They’re not afraid to play dirty.  Texas is unlikely to flip (though there is a small chance) but I could see a similar situation playing out in Florida or other swing states.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jasper_bittergrab",
            "body": "Right now, Trump. The country has gone crazy from… inflation, of all things. The white people love how Trump makes them feel. And Biden’s record of accomplishments is not a factor because he’s just a terrible communicator, maybe the worst we’ve had since Bush I (another single-termer)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "iamjohnhenry",
            "body": "I’m hoping for the competent old man. I fear that the incompetent grifter old man will win.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "maineac",
            "body": "Definitely not the people.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Outrageous-Divide472",
            "body": "I’m hoping Biden wins, and I’m definitely voting for him, as is my family and friends.  I don’t know anyone that likes Trump. Well, maybe I do and they just don’t tell\nme because I’ll go off on them.  I’ve little tolerance for idiots.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "squashbritannia",
            "body": "Biden, especially if Trump is convicted next week which I hear is very likely.\n\nhttps://en.wikipedia.org/wiki/The_Keys_to_the_White_House",
            "score": 1
        },
        {
            "depth": 0,
            "author": "xoxosydneyxoxo",
            "body": "I honestly think Biden will win. During the Trump era America got far too divided, too messy and too weird and I don't think that the average American capable of swinging the election wants to go back to that at the end of the day\n\nAlso Biden is an incumbent and it's always more difficult to beat an incumbent. 2020 was a special case.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "I_Am_King_Midas",
            "body": "Most people will say what they are hopeful for but Im going to try to give you some information outside of bias as best I can. [270towin.com](http://270towin.com) is a website whose intention is to aggregate polls and show how things currently look.  The hope for sites like this is that by examining a bunch of different polls instead of just one, you're more likely to remove bias that single polls might have.\n\nHere is a map that shows what the election looks like if you apply current-day polling onto a map with the Electoral College.   \n[https://www.270towin.com/maps/biden-trump-2024-map-based-on-pollscurrent-day](https://www.270towin.com/maps/biden-trump-2024-map-based-on-pollscurrent-day)\n\nHere is a bunch of different information on the forecast for 2024 if you want to see that too.   \n[https://www.270towin.com/2024-presidential-election-forecast-predictions/](https://www.270towin.com/2024-presidential-election-forecast-predictions/)\n\nthe TLDR; that likely won't be popular here is that Trump is currently ahead.  Note though that's just based on current polling data and there's a lot of time till November.  We haven't gotten into the real intense election push just yet where things can change wildly.  So even if Trump is ahead at the moment, everything should be taken with a grain of salt.  There's a lot of time before the elections and a lot can happen in the coming months to shake things up.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thoughtsnquestions",
            "body": "Biden will win",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OnlyAdd8503",
            "body": "Trump. \n\n\nBiden won because of 44,000 votes in 3 states. Nobody voted FOR Biden, they voted AGAINST Trump. \n\n\nAnd that was when it had never been easier to vote (because of the pandemic). It's harder now. \n\n\nNobody is excited to vote FOR Biden and 4 years later most Americans will have forgotten what an incompetent boob Trump was.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Butuguru",
            "body": "65/35 Trump/Biden.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "CTR555",
                    "body": "That’s about where I’m at these days.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Butuguru",
                            "body": "Oh damn, well welcome to anxiety for the next couple months",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CTR555",
                                    "body": "Election anxiety and I are dear old friends, so nothing new there.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SovietRobot",
            "body": "Also ask this of r/AskConservatives",
            "score": 0
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "AskALiberal-ModTeam",
                    "body": "The original post must have a question in the title of the post with the possibility of fruitful and constructive discussion. Posts that are deemed similar to a recent question may be removed.\n\nComments that belong in a megathread may also be removed.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AskALiberal-ModTeam",
                                    "body": "The original post must have a question in the title of the post with the possibility of fruitful and constructive discussion. Posts that are deemed similar to a recent question may be removed.\n\nComments that belong in a megathread may also be removed.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AskALiberal-ModTeam",
                            "body": "The original post must have a question in the title of the post with the possibility of fruitful and constructive discussion. Posts that are deemed similar to a recent question may be removed.\n\nComments that belong in a megathread may also be removed.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bushwick_Hipster",
            "body": "I honestly believe that electing Joe Biden for another 4 years is akin to \"elderly abuse\".   If your grandfather was suffering such dementia or cognitive decline, would you force him to work another 4 years at his \"insert career here\" job?  or would you convince him to just relax on a beach in retirement?\n\n  \nWhy are we willing to sacrifice his last years to just to avoid trump?  as if Trump can't just run again 5 years from now?",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Outrageous-Divide472",
                    "body": "You know nothing about dementia. If you did, you’d know what it really looks like, and you’d know Biden doesn’t have it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Biden by quite a bit.\n\nWatch.",
            "score": -3
        },
        {
            "depth": 0,
            "author": "IamElGringo",
            "body": "Easily Biden",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Scalage89",
                    "body": "I dunno man, I think it's going to be close as usual.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "simokonkka",
                            "body": "I guess we'll just have to hope for the best",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "IamElGringo",
                            "body": "I bet it won't be as close",
                            "score": -2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "simokonkka",
                    "body": "Could you elaborate?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MelonElbows",
                            "body": "Its Biden because since 2020, there has been a lot of smaller local elections.  Democrats have been cleaning up in those, flipping districts that formerly went big for Cheeto Benito in 2016.  Polls are one thing but the best determination for who's going to win is to see who is currently winning special elections or midterms or other elections.  Not who is answering polls, but who actually gets out to vote when the time comes to do it.  \n\nAnd Democrats are generally less active in non-presidential elections too, so the fact that they are coming out and voting before Nov 2024 means that there's going to be an even bigger number of them in a few months when the big election arrives.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "the_jinx_of_jinxstar",
                            "body": "All the polling has not matched the results since 2018 and the left has gotten stronger every election. Look at the recent congressional vote in New York’s 26th. The Democrat was supposed to win easily. 8 points was the polling. He won by close to 30 points in an off year special election…. Notoriously low turn out for democrats in these elections. \n\nBiden going against the ICC as hard as he has is splitting some people but really… the polls have been wrong consistently for a while…",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "IamElGringo",
                            "body": "Remember the mid term?\n\nTrump is a proven loser vs Biden is a proven winner",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "simokonkka",
                                    "body": "Hmmm.... I guess... Opinion polls kinda scare me though considering how often they have (at least here) reflected the results of elections. (I.e. in Finland, this year, in Presidental Elections Stubb was leading polls for months and guess what, he won the actual election)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "IamElGringo",
                                            "body": "Really?  It's my understanding they're very unreasonable, especially this far out.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "simokonkka",
                                                    "body": "Maybe I'm just being too pessimistic.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "IamElGringo",
                                                            "body": "Perhaps",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ohioismyhome1994",
                    "body": "I disagree.  I think it’s going to be much closer this time around.  I think Arizona and Georgia will go back to Trump, so Biden will have to find a way to hang on to Michigan, Pennsylvania and Wisconsin.  Those states are going to be razor thin either way.  \n\nIf the economy keeps trending upward I think it will be Biden.  \n\nGaza, abortion, Hunter, and Trump’s cases will have an impact.  But at the end of the day, the economy is always the single most important factor in reelection campaigns.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "rthomas10",
            "body": "The politicians, the US voter is screwed again. It's a choice between a turd and crap sandwich.\n\nIt all comes down to independent and swing voters. Hard to swallow but things were very very good under Trump and Bidenomics is not doing well. Purchasing power is down and while inflation may have slowed it has not reversed course. We are about 40% higher prices than the last administration and the economy is what will drive this election.",
            "score": -4
        }
    ]
}