{
    "title": "If you wanted to convince a conservative/leftist of one leftist/rightwing opinion using one argument, which one would it be?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nIf you wanted to convince a conservative/leftist of one leftist/rightwing opinion using one argument, which one would it be?\n\nIn my case, I would argue stragetic independence. We simply cannot become too dependent of other countries which might not deliver as they've promised. Case in point: Inflation of 2021-22 and the current war in Ukraine, which might lead to food prices rising if Russia succeeds at winning it. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">If you wanted to convince a...leftist of one [arguably] rightwing opinion using one argument, which one would it be?\n\nIf you are a socialist who believes that socialist government officials should be intervening more in the economy, then one of your highest priorities should be getting an extensive economics education for all of those socialists.\n\nWe don't let people tinker with human bodies if they didn't go to med school. We don't let people tinker with aircraft engines if they never learned how they work. You shouldn't be meddling in the economy unless you have learned how it functions.\n\nSocialists need to understand economics *more* than laissez-faire Capitalists.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "A-passing-thot",
                    "body": ">then one of your highest priorities should be getting an extensive economics education for all of those socialists.\n\n>We don't let people tinker with human bodies if they didn't go to med school.\n\nI see your point but politicians aren't climate scientists yet pass laws that affect the climate and pass laws on healthcare without being doctors.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> I see your point but politicians...pass laws on healthcare without being doctors.\n\nYes, and some infamous examples of that include:\n\n* Fetal personhood bills which banned IVF, being supported by politicians who did not know that they were banning IVF.\n\n...and...\n\n* A state mandated that ectopic pregnancies be re-implanted in the correct place; a procedure *that has not been invented by medical science*.\n\nThat is why so much of our rhetoric says 'that should be between you and your doctor', because the legislators don't know better!",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "AllForMeCats",
                            "body": "I, for one, would love to prohibit politicians from making laws on things they aren’t educated about",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Fugicara",
                            "body": "This is why maintaining the Chevron Doctrine is extremely important.  Instead of Congresspeople who are not educated about issues trying to make laws on them, they can instead say \"the air needs to be kept free of pollutants\" and form an agency with people *actually* educated on the topic which has the ability to determine what that means and how to accomplish it.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheOneFreeEngineer",
                    "body": ">If you are a socialist who believes that socialist government officials should be intervening more in the economy, then one of your highest priorities should be getting an extensive economics education for all of those socialists.\n\nNot a socialist but that leads to a big claim many socialists have. Current econmic theory is heavily ideologized from a right wing perspective and both doesn't match the real world effects and doesn't give space for other economic knowledge that used to be more available for learning and discussion before the neoliberalism takeover of academic economics in the 1980s.\n\nSocialists dispute the idea that current economic education is even as good as a soft science in terms of matching reality.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> ...Current econmic theory is heavily ideologized from a right wing perspective and both doesn't match the real world effects and doesn't give space for other economic knowledge that used to be more available for learning and discussion before the neoliberalism takeover of academic economics in the 1980s.\n> \n> Socialists dispute the idea that current economic education is even as good as a soft science in terms of matching reality.\n\nFYI: Your information on this is about a generation behind.\n\nThe empirical revolution changed the fundamentals of the field, steering it away from theory, and making it less *soft* of a science. The ideological claims about those theories fell apart around that same time, probably because the theories were being disproven.\n\nFor example, in 1990 an economist would tell you that the minimum wage is a price floor, and we should expect it to create inefficiencies like other price floors. In 2015 an economist would tell you that the had studied the actual data and proven the opposite, arguing that the theory needs to be updated as it was not borne out by experimentation. (The new theory is based on monopsony, but it is a young theory, still being questioned.)",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SleepyZachman",
                                    "body": "In fairness these new more Neo-Keynesian shifts in economics are happening in just the past two decades and most of the people in power came into power during the height of neo-liberal economic theory. It’s gonna be a while until these ideas funnel up into the minds of those in power as well as down into the minds of the general public. I’d say a lot of average people outside of politics still think about economics policy in a very right wing way.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "TheOneFreeEngineer",
                                    "body": "It's not my argument I'm just pointing out a core complaint of socialists and their distrust of formal economic education.",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "libra00",
                    "body": ">We don't let people tinker with human bodies if they didn't go to med school. We don't let people tinker with aircraft engines if they never learned how they work.\n\nWe do, however, let CEOs, commercial bank executives, hedge fund managers, etc tinker with the economy without said extensive economics education.  I definitely agree, anyone who tinkers with systemic things that affect lots of peoples' lives should absolutely have the best education we can give them, but to insist on it for socialists and not capitalists is absurd.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "wizardnamehere",
                    "body": "Isn’t Marxism economic theory? By the that logic Marxists definitionally fulfil your requirement of wanting socialist advocates of state planning (certain Marxists) to have education in economics. \n\nPerhaps you bite the bullet here?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> Isn’t Marxism economic theory?\n\nNo. It is social theory and theory of history.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "courtd93",
                    "body": "I get your point but I think more is too far-I think they all just need to. Capitalists intervene through deregulation, socialists intervene through regulation. Both need to understand it at equal levels to do either.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ewi_Ewi",
            "body": "> If you wanted to convince a conservative/leftist of one leftist/rightwing opinion using one argument, which one would it be?\n\nHave empathy for your fellow fucking man.\n\nThe rest will follow if they could just be convinced to have that one thing.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "willpower069",
                    "body": "Woah whoa, but what if they are lgbtq?!?!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Butuguru",
            "body": "> In my case, I would argue stragetic independence. We simply cannot become too dependent of other countries which might not deliver as they've promised. Case in point: Inflation of 2021-22 and the current war in Ukraine, which might lead to food prices rising if Russia succeeds at winning it.\n\nI’m gunna be honest this is not really a conservative position. A lot of us lefties agree, it’s just a matter of disagreement on implementation of solving that issue.",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "I've remarked that there's a difference in how they view it: \n\nLeftists do it to fight against the multinationals, while people like me argue it out of a more \"nationalistic\" standpoint. In the mean time, you have the liberals who go on about their neoliberal model.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Butuguru",
                            "body": "It’s more nuanced than just “multinationals [sic]” it’s also about supply chain resilience, national security policy, supply-constrained-inflation hedging, environmental policy, and labor policy.",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "I always suggest a slow deglobalization as a way to strengthen our own economy, allow the economic power to stay in the hands of the national government and to ensure we're not as sensitive to bribery or events happening internationally. \n\nIn the process, we're helping the environment as everything is closer to us (even though that's not the main thing I would be after.). If I'm truly honest, but this is from the perspective of living in a rather small country, I would leave the Paris agreements, to protect our sovereignty.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheOneFreeEngineer",
                                            "body": ">we're not as sensitive to bribery\n\nEverything else I can see but this doesn't follow to me. Can you expand on that?\n\n>I would leave the Paris agreements,\n\nThat would fundmentally hurt the environment which you say your hope is to improve. Climate change is one of the major things there needs to be US leadership on globally.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Butuguru",
                                                    "body": "Agreed^",
                                                    "score": 8
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "Ukraine is one of the biggest exporters of grain. If Russia decides to pull its strings and keep the export tight and specific, it will make the grain prices rise. It's one of the reasons to help Ukraine against Russia. \n\nI personally don't like US leadership, and I would love to do a \"De Gaulle\" and tell them Europe will function on its own. I'm skeptical of the EU, but it does allow us to pull more diplomatically speaking. I want to work with the US, but I don't want to need/be dependent of the US.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TheOneFreeEngineer",
                                                            "body": ">Ukraine is one of the biggest exporters of grain. If Russia decides to pull its strings and keep the export tight and specific, it will make the grain prices rise. It's one of the reasons to help Ukraine against Russia. \n\nThat doesnt seem to address my question at all.\n\n>I personally don't like US leadership, and I would love to do a \"De Gaulle\" and tell them Europe will function on its own. I'm skeptical of the EU, but it does allow us to pull more diplomatically speaking. I want to work with the US, but I don't want to need/be dependent of the US.\n\nSo you want to weaken EU leadership on a global problem and concede massive climate change that will weaken the EU greatly to the Chinese and Americans? Your stated goals and your stated positions don't seem to match",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FeJ_12_12_12_12_12",
                                                                    "body": "It does: But I'll add blackmail/bribery to the list. If someone controls the import of grain, you'll see that they can use this power to weaken their perceived enemy. It puts them in a relatively good position for economic warfare. \n\n--------------------------\n\nI want to work with the US, not for. This means that I think we should take up military strength by creating atomic bombs ourselves (France has it thanks to De Gaulle, but these are mainly defensive), we should strengthen our economies and we should drive in the middle lane. Don't allow the US to force or pressure us in any law or policy and push to become equal partners. \n\nThat's independency and that would be better than the current position. The US is not the superpower it once was and the EU has a chance to push itself. \n\nClimate change won't be \"solved\", it can only be stabilized which isn't happening any time soon if we're being honest. So, are we going to, similar to Caligula, fight the ocean or are we going to strife for independence  and reaching our full potential, as an organization of independent nations? Are we going to push ourselves in the picture and make it a multipolar world?",
                                                                    "score": -2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TheOneFreeEngineer",
                                                                            "body": ">Climate change won't be \"solved\", it can only be stabilized which isn't happening any time soon if we're being honest. So, are we going to, similar to Caligula, fight the ocean or are we going to strife for independence  and reaching our full potential, as an organization of independent nations? Are we going to push ourselves in the picture and make it a multipolar world?\n\nI don't think you understand why climate change is already a major EU problem and why it will continue to get worse. You just seem to like aethestics more than reality. Your stated positions make the EU weaker while creating a mythologized idea of Europe instead of actually creating a better and stronger and safer Europe. \n\n>If someone controls the import of grain, you'll see that they can use this power to weaken their perceived enemy. It puts them in a relatively good position for economic warfare. \n\nGreat but that's not what you said that I was asking about. Nor how you cam make the EU or even just France  less suseptible to commodity price raising even if you have internal production enough to met domestic needs. The Russian invasion of Ukraine spiked food prices across the world because of commodity pricing even effects markets that don't import ukrianian grains. Like how the US has enough petrol production to satisfy all domestic needs, but the Saudis independently cutting back production still means Americans are paying more and creates perverse political incentives to appease Saudi Arabia.\n\n>I want to work with the US, not for.\n\nLike I saidbi think you prefer how thinks look to what they actually are. Pushing back on good cooperation that already exists because you percieve it as a lesser partnership even if it's not",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "FeJ_12_12_12_12_12",
                                                                                    "body": "Climate change is a global problem, not specifically a EU one. It is a problem that cannot be fixed: We can only stabilise it at best but we can not, in any shape or form, reverse it. Even stabilising will probably fail as certain processes will start at 2*C that keeps itself going. We'll probably reach 1,5*C betwen 2030 and the early 2050s, but we'll see. Cynical me says we'll end up between 2 and 3*C, pessimistic me says we'll end up dying before we reach 1,5*C and optimistic me says we'll invent technology to reduce and stabilise it back to 0*C at the end of the century.\n\nIf you produce enough grain internally (if the French ever learn to work, but that's another story ;) ), you can cut off Ukrainian/Russian import to counter them. It would effectively stop further inflation if stability is guaranteed through such a system. Try the same with the Saudi's. Cut them off if they're too busy filling their own pockets. The politician that does that, would end in a lake downstream, but the truth is that reducing these ties would help them. \n\nIf you guys elect Trump, we'll have no other option than to be independent. It's not about a strained relationship, it's about the fact we need to be able to keep ourselves together even if the US lacks behind. That's what fully independent means. You choose to work with them, but when they end it, you can continue without too much of a trouble. It's a choice we, as Europeans, need to make.",
                                                                                    "score": -2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "TheOneFreeEngineer",
                                                                                            "body": ">Climate change is a global problem, not specifically a EU one.\n\nNo one is suggesting otherwise. But it does and will continue to effect the EU in worse and worse ways.\n\n>We can only stabilise it at best but we can not, in any shape or form, reverse it.\n\nOk? Stabilizing is what solving climate change means at bare minimum. I'm not sure why you seem to think differently.\n\n>If you produce enough grain internally (if the French ever learn to work, but that's another story ;) ), you can cut off Ukrainian/Russian import to counter them. It would effectively stop further inflation if stability is guaranteed through such a system.\n\nI'm sorry you are just incorrect. That's not how commodities like grain work. \n\nEspecially since France is one of the few states that is already producing enough food for itself and we already see how that doesn't protect against pricing being effected negatively by global affairs.\n\n>Try the same with the Saudi's. Cut them off if they're too busy filling their own pockets.\n\nThat doesnt change that their production still effect global commodity pricing and thus domestic pricing. The USA barely imports Saudi oil at al currently and we are still massively effected by Saudi production. \n\nNever mind that there are about hundred countries including the majority in Europe who simply can not possibly become oil and gas self sufficient because they have no access to sources, the same with grain. There is only so much farmland and so much food that can be produced on that land. France is already fine in that regard but most of Europe isn't. \n\n>The politician that does that, would end in a lake downstream, but the truth is that reducing these ties would help them\n\nConsidering the massive investments in climate change stabilization directly combats the oil demand that Saudi relies on that seems like an uninformed statement. The US and EU are directly combating their addiction to oil already but that seems to be against what you want given that a major effect of the Paris agreements you want out of.\n\n>If you guys elect Trump, we'll have no other option than to be independent.\n\nFrance is independent already.\n\n>It's not about a strained relationship, it's about the fact we need to be able to keep ourselves together even if the US lacks behind\n\nFrance can already do that...\n\nAgain you seem to care more about appearances than reality. France is independent and already only works with the USA to benefit itself.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "FeJ_12_12_12_12_12",
                                                                                                    "body": "France is a specific example, and now we should apply it to the rest of Europa. Have the least possible leverage and the most possible benefit. It's an ideal we should strife for and it's something we're building towards. \n\nStabilising is not solving climate change. \"Solving\" it would be to push the temperature it would've been without human interference. Considering we were slowly evolving toward another ice age, it might be colder than expected. Stabilising with current/realistic actions would mean a global temperature of more than 2*C, which ensures that humanity has failed and natural processes will take our role over. \n\nOf course the global commodity influences us, but that doesn't mean we can't soften the blow. If we produce more ourselves, we could keep the prices lower AND prevent a possible famine.\n\n  (If you ever found a graph that compares the food prices with the amount that one produces between each country, that would be interesting to say the least. It sounds quite reasonable to me, but facts don't care about reason.)",
                                                                                                    "score": -1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "TheOneFreeEngineer",
                                                                                                            "body": ">Stabilising is not solving climate change. \"Solving\" it would be to push the temperature it would've been without human interference\n\nNope that's not what people are advocating for. You are deciding someone else's position and not listening to what they actually are arguing for. \n\n>Of course the global commodity influences us, but that doesn't mean we can't soften the blow\n\nOf course not but that's not what you said or claimed. And it would keep prices low.\n\n>  (If you ever found a graph that compares the food prices with the amount that one produces between each country, that would be interesting to say the least. It sounds quite reasonable to me, but facts don't care about reason.)\n\nYou are conflating like 3 different ideas into one here and claiming its reasonable.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "FeJ_12_12_12_12_12",
                                                                                                                    "body": "I'm stating what \"solving\" would mean. Use instead of \"solving\", \"stabilising\".\n\nI advocate(d) for building up independency through local production/stimulation to help us be more resistent to international events. \n\nThe hypothetical graph would find a relation between a) domestic production and b) food prices per country. After that, you can see if producing more domestically protects the customers and improves our resistance to economical warfare/blackmail by other countries. It sounded reasonable to me that if you produce more domestically, you are less dependent on other countries.\n\nAnd I asked you if economical research has disproven this or not. Something can be as reasonable as it possibly sounds, but still a fallacy/mistake.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "TheOneFreeEngineer",
                                                                                                                            "body": ">I'm stating what \"solving\" would mean. Use instead of \"solving\", \"stabilising\n\nSo you don't seem to have ever listened to people on this topic at all and just made your own assumptions that you refuse to examine. Again you seeming care more for aesethics than reality.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "FeJ_12_12_12_12_12",
                                                                                                                                    "body": "No? It's always important to use exact terminology. \n\nSolving climate change is not possible. Stabilising is. Reversing would be with the correct, future technology. If you equate solving with stabilising, ok. Then it's possible. If you equate solving with stabilising AND reversing, then no. Not yet at least.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "TheOneFreeEngineer",
                                                                                                                                            "body": ">No? It's always important to use exact terminology. \n\nBut you aren't. You are making assumptions and ignoring the actual issue. Which is why again I point out you don't seem to have a real opinion. You just want a vibe that you agree with",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "FeJ_12_12_12_12_12",
                                                                                                                                                    "body": "Yes, I do. \n\nMy opinion is that the government shouldn't do a lot for the climate change, and instead focus on domestic issues. We've had an inflation of 12% (with food inflation going to 17%) thanks to the Ukrainian War, and I think we should prevent that.  \n\nIt's one of the reasons why I've gone from \"no government intervention\" to \"limited government intervention\".  We should promote our local industries over the international, and will indirectly help climate change. But that's where it ends, as I believe a country, as small as we are, can not make a real ecological difference. \n\n*Example given for an opinion:*\n\nWe should invest in nuclear energy (one of our biggest mistakes was to sell Electrabel to the French Suez thanks to Verhofstadt; The produced electricity should've been privatized but not to one, foreign company. That's subsidized monopoly and should be prevented at all costs.) and into research toward  nuclear fission. \n\nIt's not a vibe, it's the red thread that runs through my specific opinions: \n\nProtecting our (near Westphalian) regional - national as soon as possible - sovereignty, economic freedom limited by the morality as Burke would state it (Liberty does not exist in the absence of morality) and relative social conservatism. Welcome to an ideology, which isn't the same as an opinion. It's an ideal that you want to reach and connects all your opinions.",
                                                                                                                                                    "score": 1
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "tonydiethelm",
                                            "body": ">deglobalization\n\n\nYeeaaahhh... \n\n\nThat's *never* going to happen, you realize that, right?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "Never say never. \n\nDeglobalization sounds like a revolution, but it only truly increased since the 90s and has been even declining/stabilising a little. \n\nhttps://www.imf.org/en/Blogs/Articles/2024/01/12/charts-spotlight-inflation-economic-growth-globalization-and-climate-change",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tonydiethelm",
                                                            "body": "The only way to end globalization is to find a source of near slave labor at home. \n\n\nNot exactly a good thing...",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FeJ_12_12_12_12_12",
                                                                    "body": "We will never be able to fully end globalization, but I do see a decline happening due to protectionist/nationalist policies. It's an easily explained reaction to the neoliberal model of Reagan and Thachter of the 80s- early 10s\n\nBut for that  \"near slave labor\", I think Trump has a solution for that🤔. And maybe that solution is one of the reasons not to get him in office, as that would lead him further down the path of a certain man.",
                                                                    "score": 0
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Nobhudy",
                            "body": "The issue that I feel like I don’t see talked about on the right is that the globalism thing is all about business interests. It seems like conservatives read it as some malign influence from a regime that wants to introduce all this *foreign*-ness and integrate with other nations out of malice toward American identity and individualism.\n\nSomehow the democrats are the party of this creeping (capitalist) expansionism while also being communists.\n\nIt’s just that corporations get a sweetheart deal with globalism. Americans are too rich and too proud to work in sweatshops, but we can’t sustain our capacity and keep prices low without them, so we shipped everything overseas. It started in the late 20th century and we’re getting the downstream effects of it more than ever- hollowing out former American manufacturing cities and raising nations like China out of mass poverty and toward superpower status.\n\nI know the late history of the democratic party is all about how the Clinton generation courted those business interests to get a majority over the Reaganites, but how many young democrat-leaning leftists do you are happy about all of that?\n\nThink of how divorced the modern GOP is from its very recent past- George W. Bush went from the warrior of Christendom to a deep state trickster who probably did 9/11 over the course of like a decade.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "The fear in my vision is not \"the other\". It's when a country like the US only receives and stops producing. This leads to the government having no say in economical policies altogether and to other countries being able to take advantage of them. That dependency, that's what I would want to combat. Prevent that we import every product necessary and who we import from. In the mean time, we might want to keep a close eye on what might happen if a situation like the pandemic happens once more. \n\nHow could we prevent the sudden recession and inflation that came with it? It's a question we have to solve, and it will break left/right/center  once more: \n\nThe nationalists (rightwing) vs. Environmentalists/marxists (leftwing) vs. Neoliberal globalists (center)\n\nBut that's a story for later on.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Nobhudy",
                                            "body": "We’re in complete agreement that it’s a bad thing that we’re betting everything on external supply lines, I just think the majority of conservatives blame liberal government policies and regulations alienating corporations from investing in American communities and workers, and leftists blame the corporations themselves.\n\nThe unfortunate truth is that they don’t have any obligation to the American people, they have an obligation to American currency. And with our current system of legalized corruption between those business interests and elected officials, we’ll never shake the status quo where these corporations can enjoy their cheap labor and still charge high domestic prices for a shit product because they put a fortune into stifling all the competition around them.\n\nI just get the sense that conservatives still think government intervention in markets portends the slippery slope of communism, but it just sets a dismal trend toward corporate oligarchy, and it’s exactly whats driving young people to look into communism.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "Government intervention is similar to pepper or salt. A pinch will flavor your dish, while a bucket effectively ruins any taste.\n\nCertain conservatives will argue against government intervention in the economy but then, almost paradoxically, have old, interventionist wine in new bottles. They agree to not intervene until it directly affects them. There hasn't been any government that did not intervene somewhere in the economy. You may correct if I'm wrong.\n\nWe may be glad that the US has evolved away from the cheap, sweatshop-like labor. But that doesn't mean it's disappeared. It's been directly transported to other, even more corrupt countries and they'll directly argue for globalisation and neoliberalism to profit and benefit from it. Classic \"Not in sight, not in mind\". It's unsettling, but truth often is. There's only one disadvantage. The countries that we used in the past are now emancipating and improving their social economic situations, to the disgust of the multinationals who'll lobby against protectionism and finance local conflicts. \n\nGovernment regulation has killed off the industry in Detroit, but it increased the wages and it moved the production line out of the VS and toward other countries. Have we truly solved the issue? *Can* we solve this by regulation or by deregulation? Or are we just handing out the economical \"soft power\" we once had?\n\nYoung people are looking into communism because it formulates an easy answer: \n\nAn international revolution in which the Workers will take the power from the Bourgeoisie and establish a classless and truly \"equal\" society under a proletarian, global dictatorship. Sounds easy right? \"Revolution\", that means we can act now by any means necessary? Isn't that what young people want, fast change leading to a \"utopia\" that will realistically prove to increase instability and lead to many thousands of deaths?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Fugicara",
                            "body": "Honestly I might argue the opposite.  Every country should be highly dependent on every other country because it creates very strong pressure toward peace.  If one country produces all of our microchips, we would be highly disincentivized from going to war with that country because we'd be screwing ourselves over.  If we're totally self-sufficient, all of a sudden war looks much more doable.\n\nObviously it's a lot more complex and there are tons more variables but you get my point.  Being reliant upon each other can be very good for creating lasting peace.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Butuguru",
            "body": "I’ve spoken to a lot of conservatives over the years and one thing remains almost entirely consistent: you can’t convince them of something they don’t think they came to themselves. Honestly that (paired with conservative opinions aren’t particularly complex/interesting) is why I don’t think there’s much point in discussing things with conservatives unless there’s some willingness to learn shown on their part. Usually, however, if a conservative is open to hearing other opinions/changing theirs they don’t remain a conservative for long.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "What you're describing, is what I would assign to the more radical variations of both the right and leftwing. Most centreright to rightwingers will listen if you're prepared to engage as well. I engage with you so that you may engage with me.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dell_Hell",
                            "body": "I'll intensely disagree - they only listen to respond and usually with false equivalency. \"BIDEN HAD CLASSIFIED DOCS TOO, WHY U NO HAVE HIM ON TRIAL???!\"",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "If they do that, I would advise them to calm down or they might have a cardiac arrest. Most of the people that react this way, are retired or retarded. It shows they're the end of their arguments and don't know how to continue. (AKA you've won.)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Weirdyxxy",
                                            "body": "What have you won when they make the conversation run into a wall instead of allowing it to change their mind? Bragging rights?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "Intellectual rights. It shows you're the rational one and they are the ones using a defense mechanism to fight it.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Weirdyxxy",
                                                            "body": ">Intellectual rights\n\nThat's still only personal satisfaction",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bearington",
                            "body": "Maybe it's because I'm in Indiana but I'm going to have to disagree. I've never once seen a conservative change their position on a policy until it negatively affects them personally. I've met more than a few people who became pro-choice after their loved one required an abortion, pro-social safety net programs when they lost their job and/or got injured, pro-universal health care when they went bankrupt due to medical debt, etc, Gay marriage and LGBT rights are the best example here than we all saw play out before our eyes over the past 2 decades. \n\nFWIW, I don't think people on the left are all that flexible either. I've found they usually have a better thought out reason for their position though. In the cases where they don't (usually a purely emotion based opinion), they're open to alternative solutions than the one they hold in their head so long as the same ends are met. \n\nLike I said though, my geographic location probably heavily influences these dynamics. To be a liberal in Indiana is to willfully choose to other yourself from your community, so we have usually thought through our positions and hold them out of principle. Most conservatives I know hold those positions because it's just how they were raised so why question it",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Maximum_joy",
                            "body": "How can you speak for most center right, that's a really strong claim",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "paxinfernum",
                    "body": "Yep. Gotta a better chance of teaching a 20-year-old dog to shit in a litter box.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "hitman2218",
            "body": "I’d tell a conservative that the poor/disadvantaged/foreign are not the enemy. You’re mad at the wrong people.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "HuckleberryLou",
                    "body": "Exactly this. Instead of looking at victim of the problem, look at who benefits from the problem.  Start there for fixing it.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "pudding7",
                    "body": "Who should we be mad at?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hitman2218",
                            "body": "The people exploiting them.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pudding7",
                                    "body": "Who's that?  All business owners?  Just some business owners?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "Not just business owners, no.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "pudding7",
                                                    "body": "I swear it's like pulling teeth.  So who then is exploiting people?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hitman2218",
                                                            "body": "The so-called ruling class.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "pudding7",
                                                                    "body": "And who is in the so-called ruling class?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "hitman2218",
                                                                            "body": "Lol. I’m not doing this dance. If my answers haven’t satisfied you that’s fine.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "pudding7",
                                                                                    "body": "Cheers!",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheOneFreeEngineer",
            "body": "Leftist opinion to conservatives: The seeking of profit above all else is a net negative.\n\nConservative opinion to Leftists: Rural issues are real issues even though they effect less people than urban ones.\n\nThe first one would be helpful to start breaking down the oligarchy and power of super large companies in the USA. The second will help deal with chronic issues that drive people to the cities and increase housing costs",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mein_Kaiser_II",
                    "body": "I don't necessarily get why you claim that it's a conservative opinion that \"Rural issues are real issues\", in fact that is much more of a Leftist opinion.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheOneFreeEngineer",
                            "body": "Mainly because I can't think of anything else and Left wing action in the USA is overly focused on urban issues and people. Any good about conservatives is mostly from a libertarian bend and as you know the actual libertarian movement is a left wing movement so it didn't feel appropriate to say that",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mein_Kaiser_II",
                                    "body": "Green Energy is moreso coupled with Rural Development \nThe https://en.m.wikipedia.org/wiki/Minnesota_Democratic%E2%80%93Farmer%E2%80%93Labor_Party \n\nAnd the fact that Conservatives really don't care about rural issues either, they've been uniquely slashing farmers subsidies and food programs on the ready.\n\nNote: this is moreso a small list of things, not quite an in depth explanation.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">In my case, I would argue stragetic independence. We simply cannot become too dependent of other countries which might not deliver as they've promised. \n\nYou must love the CHIPS ACT.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "While I'm highly skeptical of the EU, that might be one of the better things they've done. It release the diplomatic pressure China could put on us if they ever invade Taiwan.\n\nThe addition to make it even better would be the slow removal of governmental intervention if the industry is strong enough to compete with the others.",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheOneFreeEngineer",
                            "body": ">While I'm highly skeptical of the EU, that might be one of the better things they've done.\n\nThe CHIPS Act is Ameeican not the EU. It's one of Bidens signature legislations",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "I was referencing this: \nhttps://www.european-chips-act.com\n\nDo you mean the tariffs he placed on electrical cars? I honestly think it won't help out a lot. But we'll see. It'd be better to import the resources and attract the production line to the USA/Mexico than just tariff it.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheOneFreeEngineer",
                                            "body": ">I was referencing this: \nhttps://www.european-chips-act.com\n\nEveryone else is talking about the CHIPS ACT in the US that Biden pasted a year before the EU Chips act version.\n\n>Do you mean the tariffs he placed on electrical cars? I honestly think it won't help out a lot.\n\nNope that literally has nothing to do with what I'm talking about. And I also greatly disagree about that recent slate of tarrifs. It's bad protectionism, not good protectionism.\n\n>It'd be better to import the resources and attract the production line to the USA/Mexico than just tariff it.\n\nYou do realize that the point of the tarrifs right? To make that a profitable option for companies in the USA (since the US government doesn't run companies to do that).",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "That's the point of tariffs, but the question is if it's going to work. \n\nI much rather attract businesses than use tariffs on a specific country. That's how you should do protectionism: \n\nNot targeted at a specific country, but by undermining them. Make it more favorable to import the resources and produce the car than to import the whole car. \n\nIt makes me think of the original version proposed by Colbert, even though his system did have flaws which were criticised by e.g. Adam Smith.",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "L4ckzi3",
                            "body": "The chips act was not passed by the EU, try again.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "https://www.european-chips-act.com\n\nYou try again. It seems to have an American version with exactly the same name. Confusing to say the least🤔",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "L4ckzi3",
                                            "body": "European chips act is different from the CHIPS ACT. When something is spelled in all caps, I would think you would take notice it’s different.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "Of course. Maybe you should try to talk Biden into taking classes by Donald Trump to learn how to (nick)name things. \"No cap\" he would fail the class for (re)tardiness. But then I would suggest it is almost the pot calling the kettle black. Marx would applaud this, as long as we forget about the Jewish question that is midly antisemite. Just mildly.",
                                                    "score": -2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "wizardnamehere",
                                            "body": "The EU version is named after the American Act. \n\n\nDo you really not know about the chips act?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "I've just researched it somewhat. I knew about the Inflation Reduction Act, but that one didn't catch my eye. Which is strange, as it has a clause for DEI which surely would've been demonized by the sources I used back then. It proves that information travels slowly when you're not explicitly looking for it. \n\nIt's never been mentioned in anything, but the CHIPS act of Europe has been/was a small article in a newspaper I read a year ago.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "wizardnamehere",
                                                            "body": "Hmmmm. Well it was a 280 billion dollar research and subsidy bill for manufacturing semiconductors. It was pretty big news at the time. The whole purpose being to on-shore semiconductor manufacturing (to beat china at it essentially). \n\nFor context. The EU chips act is 50 billion dollars.   \n\nNow you know i suppose.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FeJ_12_12_12_12_12",
                                                                    "body": "\"I know that i know nothing.\", derived from Plato.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "wizardnamehere",
                                                                            "body": "Hahahaha I'm not sure that epistemological witticism fits in here but i appreciate it, it's a good one. \n\nBy the way (for next time!) Plato is quoting Socrates there (Plato is one of the main sources of what we know of Socrates).",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "FeJ_12_12_12_12_12",
                                                                                    "body": "Socrates is one of the Greeks that I would love to meet if Emmet Brown had a Delorean on spare. It'd be interesting to see how much Plato has been influenced by Socrates and how much Socrates differs from Aristotle. \n\nIt does fit here, because it's one of the things we have to accept: We will never know everything and therefore everything we think to know, could be wrong or an illusion. We don't know. It's one of my favorite quotes because it's honest & modest and gives us a reason to get educated. There's always something we don't know, even if we think we're experts in a certain field. The philosophical nerd will see himself out. ;)",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrsDanversbottom",
            "body": "I refuse to argue/debate/convince anyone on the right of anything.\n\nYou can’t. My aunt is a MAGA supporter. I love her.\n\nBut when it comes to politics I just ignore what she says. We’re from Washington state (I’m now in the UK) and she has no real political power there, so I don’t contradict her.\n\nIt’s not worth wasting your time.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheDoctorSadistic",
                    "body": "Is this something that you do personally, or do you recommend that everyone stop debating with people they find it difficult to argue with? I get it if it’s causing you serious stress, but I still think we should debate with people with whom we disagree, or else we risk getting trapped in an echo chamber. I love talking with people on the political left, I find that these discussions help me refine and challenge my own beliefs.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WeenisPeiner",
                            "body": "Not OP. But there's people I can debate with like my conservative libertarian cousin. He's open to hearing other ideas and injects his own thinking into them. But doesn't try and shut down the way I think. We ultimately always come to the conclusion that we want the same things. We just disagree with how to go about it. Then there's my MAGA father in law who injects politics into any conversation, is always repeating right-wing talking points, Fox News, or right-wing radio is always blaring in his house. He can be insufferable, so it's not worth debating with him. I guess you just need to know your audience.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "24_Elsinore",
                                    "body": ">We ultimately always come to the conclusion that we want the same things.\n\nThis is the fundamental thing that people need to understand if there is to be a productive politic discussion. You need to know how congruent your political values and the other person's political values are. If both of you share the values of making sure people have the opportunity to live happily and have their rights protected, then the discussion is one of how do you get there while doing your best to respect everyone's needs.\n\nOTOH, if the other person is a believer that the US should be a WASP ethnostate or a person whose chronic stress have made them gone full MAGA, then there really isn't any opportunity for a productive political discussion because you have fundamentally different beliefs about US governance than the former, and the latter isn't following a cohesive political ethos.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MrsDanversbottom",
                            "body": "I’m very much set in my own beliefs and I don’t find it stressful talking with someone who is having a discussion in good faith, but I don’t believe most people on the right aren’t conversing in good faith.\n\nYou aren’t doing to educate someone who doesn’t care whether or not you exist. As a queer person I just don’t like wasting what little free time I have, debating people who aren’t going to change.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "stinkywrinkly",
                            "body": "It’s useless to debate brainwashed MAGA folk.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "lobsterharmonica1667",
                            "body": "Having a debate or discussion is fine, but in many cases those are near impossible to have. Like if someone honestly looks at Donald Trump and thinks that he's someone who should be in charge of something then I'd say that debate or discussion is not possible.  \n\nThe only time it is consistently possible is around issues for which there is no established position for the groups that either side identify with.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "I think we should debate with people we disagree with, but you have to know if the person you’re debating with is even capable of changing their mind. Part of that is having a shared sense of reality and what counts as valid sources of information.\n\nI had a conversation here Recently, probably 10 of them like this recently to be honest, where somebody dismissed a source of data because it comes from economists. Not a specific economist, economist as a whole.\n\nThat’s not an uncommon thing. People who will show up here and disregard the entire consensus of economist and just state that Thomas Swalwell is the only economist to listen to. During the pandemic, there were people would point at one or two scientist as valid sources of information and disregard entirety of the rest of the field.\n\nThere isn’t a point in having a conversation with somebody who could just disregard all of journalism except for Fox News and OAN or worse. If somebody thinks that Project Veritas has value, there is no debate to be had.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Maximum_joy",
                            "body": "On the one hand, I see where you're coming from, but on the other, debate is an objectively bad way to approach truth that rewards confidence and eloquence over veracity. \n\nSimilarly, many on the right seem to have a position of \"you don't exist, convince me otherwise,\" and it's like......... awesome Christmas this turned out to be.....",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "NPDogs21",
            "body": "I’d convince conservatives that Trump, a billionaire from NYC born with a silver spoon in his mouth, fundamentally does not care about nor respect American values. He has openly stated he wanted to suspend the US Constitution over allegations of voter fraud, does not respect the rule of law, and has done irreparable damage to our trust in the electoral process with his continued, unfounded claims of voter fraud. \n\nI think it’s fine if people want to support him, but they should at least understand what they’re voting for. Jon Stewart summed it up well, which is that wanting the leader of our country to be above the law, immune from all criminal is not something we want or should tolerate from a President. What people who support that want is a monarch, which goes against what we fought to free ourselves from during the Revolutionary War. ",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "If they don't want to believe that Trump doesn't care about the constitution, they're either ignorant or foolish. Pick your poison.\n\nSmall sidenote: If the Republicans ever openly argued for a monarchy, that would be the biggest joke ever. The Revolutionary war might not have been fought to become one, but it was the result thereof. (e.g. George Washington being asked to become the monarch)",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sevenorsix",
                            "body": "> e.g. George Washington being asked to become the monarch\n\nConservatives during the time of the Revolutionary War were the loyalists. Representational government was a pretty progressive idea for the time. Of course the people fighting the war to remove a monarch wouldn't want another monarch. The people that wanted a monarch (conservatives) didn't have a say in how our new government was set up.\n\nThe idea of conservatives supporting a monarchy/class-based system continued through the course of our country. Quick examples being:\n\n- Conservatives supported a slave-based society that was very similar to England's.\n- Conservatives today support authoritarianism in Trump.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "The problem is there are conservatives who recognize all those but will still make justifications for why they have to vote for him. Do you? ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "I hate a monarchy and would make my country a republic any day of the week. Even if I could, I wouldn't vote for Trump. He's a populist and a narcissist that is better kept out of office. But would I want Joe Biden? Meh. Third party vote, knowing the US will last another 4 years.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "Well, it sounds like you’re not from the United States. So it’s important to note that the way our system is constructed, there is no such thing as a real third-party. The only way a third-party has value is in the rare times, basically twice in our history, when a party completely collapses and is replaced by another. The last time it happened in the United States was before the Civil War when the whigs were replaced by the Republicans. \n\nThere are only two choices in the United States as to who will be president. So voting third-party is at best saying that you don’t give a shit and will let other people decide but with extra steps or at worse you know that Trump is an existential threat to the United States and the world order but you’ve decided you are so morally pure that you can’t vote for Biden.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "Wasn't one of the two times in '92? \n\nThe lesser of two evils would be Biden, but his age truly concerns me. Look at every video you see. It's almost sad and Biden isn't getting any younger. \n\nIs/waa there truly not any centrist, young charismatic opponent that is a Democrat and can play the agecard back to Trump?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ButGravityAlwaysWins",
                                                            "body": "No. There is a persistent mistake people are making where they think Ross Perot running as a third-party affected the election strongly. All evidence points to pulling almost equally from Bill Clinton the Democrat and George HW Bush the Republican. And after that election was over, the parties remained the same with the same level of power.\n\nSo even if your age issue makes you not like Biden, if Biden loses there is a 100% certainty that Trump will win. The Democrats are not going to change the nominee and there is a 0% chance a third-party wins. And I’m not being hyperbolic. There is a 0% chance a third-party wins and a 0% chance that Joe Biden steps aside. \n\nThe problem with Trump is that while he is showing lots of signs of his age, either his nature or the drugs he’s on make him an energetic speaker, and so people do not perceive his age being an issue. Meanwhile, Joe Biden is showing normal signs of age plus he has always had a stutter and been awkward.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FeJ_12_12_12_12_12",
                                                                    "body": "I know there's 0% he steps away, but isn't there anyone in the Democratic Party that could have a better public image than him? Say Joe Biden runs 4 more years, what then? Will you hand it to the Republicans or is there someone developping I don't know off?\n\nTrump is naturally energetic and quite charming, he knows what he has to say to trigger his voters. I would even suggest it might work with the Democrats.... Populism works both ways after all.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ButGravityAlwaysWins",
                                                                            "body": "If you search the sub for 2028 you will see dozens of threads discussing a future nominee. Some common memes that get discussed our Gretchen Whitmer, Andy Bashir, Jared Pollis, Josh Shapiro, Gavin Newsom and Pete Buttigieg. \n\nAlso remember that almost nobody was talking about Barack Obama being the 2008 nominee in 2004. Even at the start of the race, he was considered a longshot.",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "HMSphoenix",
                                                            "body": "Trump's conservative policy wouldn't make him the lesser of two evils against Biden? That seems like a weird perspective if you consider yourself conservative in an American sense",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FeJ_12_12_12_12_12",
                                                                    "body": "I consider myself a conservative, but I will state I'm European. Trump is a populist, while Biden is sleeping/awkward. Choose and loose. \n\nEDIT:Trump may be the closest to my ideology, I will not support someone that uses the rhetorics that have historically led to more than one genocide. Listen to how he phrases and frames everything. You'll see a few basic techniques returning that has/can le(a)d to a radicalisation and even form a cult (e.g. QAnon and Pizzagate).",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "HMSphoenix",
                                                                            "body": "I disagree but I see your point.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "luckyassassin1",
            "body": "I learned pretty recently that you're not gonna convince anyone with 1 argument. There is no magical gotcha winning argument. Whenever I've poked holes in someones premise or showed it doesn't make sense they always either shift to a different topic, get angry and rude and go for personal attacks, or move the goalposts.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "Wouldn't there be one argument that you would be able to sell? Presuming you're a socialist, I'd assume something like a cooperative (e.g. \"Vooruit\" in Ghent) would be able to open their minds if you do it correctly, stratigically and rationally.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "luckyassassin1",
                            "body": "Have you ever spoken to a maga supporter? When i go through with carefully explaining things as to why this thing they support doesn't work and has been shown not to and do so in a respectful and easy to understand way while also showing how mine does and how it's backed up with evidence all they do is get mad, get aggressive, move the goalposts, call me names, and go off on some rant about how i must hate America or some shit. Telling people I'm a socialist is actually dangerous for my safety in my area. I've tried having respectful discourse, but it doesn't work if you both don't agree on the fundamental facts of reality.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "How can that be dangerous? Try it where I live and, at worst, you'll be laughed and, at best, you'll find yourself to be a centrist. It's much more \"dangerous\" to speak out about Israel-Palestine, for example, than it is to say you're a socialist. Hasn't the Red Scare yet settled?\n\nUsually, when respectful discourse doesn't work and you don't agree on anything, you need to pull back and talk more abstract. It's what I do with my socialist friends and it makes sure we can agree on things. The \"de facto\" is different, but the fundamental aspects are very, very similar. \n\nIt does help I know enough about socialism and they know enough about conservatism. Maybe that's lacking in the US.\n\nEDIT: I usually chose to treat MAGA like I would toddlers. They know the basics but phantasize everything around it. They repeat what they've been told without a critical approach and it lends me the opportunity to push the enveloppe. \n\nDon't blame the victim of indoctrination, blame the one who indoctrinates.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "luckyassassin1",
                                            "body": "I live in the state that produced McCarthy, the guy who used the red scare to get rid of people he didn't like and until recently lived in an area where fox news was the main source of news for most people. And when i say we disagree on fundamental facts i mean that some people here believe teachers are teaching kids to be gay and trans and that most child predators are LGBTQ+. When you disagree on fundamental facts that make up reality you won't find common ground and when the only version of socialism they know of based in deep propaganda from the 1950s they'll see you as evil and as if you want to bring the USSR to the states. The few logical people i know aren't on the right because there isn't really an overlap here, you're either deep in the QANON bs sphere or you believe in reality.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "I will never understand how teachers are supposed to teach how to be gay. They don't even succeed at making them read an article, let alone change their sexuality... Have they been taught to be straight?🤔\n\nPropaganda goes a long way, but I had thought McCarthyism was already buried and dead. We sometimes harmlessly joke it's all \"because of the socialists\", but further than that it doesn't go. Most logical people I know are on the centre of their side. Centre-right (conservative) and centre-left (social democrat) are the mainstream and the outliers are used as the fools of the villages. (But you rather be a communist than a radical rightwinger.) \n\nIt's strange how perception has changed in Europe and the US, but interesting to say the least.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "luckyassassin1",
                                                            "body": "Most of the people who are McCarthyist are older but some are within my generation (millennials). The people i consider reasonable are center right/left or moderates with a few if my friends being as far left as me.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "FeJ_12_12_12_12_12",
                                                                    "body": "Since when are socialists far left? Or have I missed that rightwing propaganda? Wasn't that a joke we made to appeal to the dumber mass? \n\nMarxists, Maoists, anarchists,... are far left, but socialism? I thought that was leftwing? Revolutionary socialism might be far left, but reformist socialism is firmly leftwing...\n\nMcCarthyism, I'll be honest, is as dead as a doornail. The only people you'll see doing this, are people that firmly oppose communism or marxism. Socialism (reformist) is as much accepted as conservatism in real life, while at college reformist socialism is even the mainstream ideology.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "luckyassassin1",
                                                                            "body": "Do you live in the United States and if you do, do you live in a blue or red area? In the United States our left wing is pretty far right compared to Europe. European conservatives are even left of where the center is here. Wanting basic Healthcare provided by the government is considered radical, socialism is considered far left here because when fascism is one of the main parties then even being slightly left wing is a big shift.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "FeJ_12_12_12_12_12",
                                                                                    "body": "I live in Europe, and the Democratic Party would be close to our centrists. Most Republicans are either rightwing or far right. In my country, the split is: \n\nsocial democracy (call themselves \"socialists\") <=> National conservatism \n\nthe Democratic Party falls inbetween if you forget about healthcare. But even then, they won't be considered rightwing. The Republicans have people so far to the right (e.g. Steve Bannon) that they don't even exist within the reasonable political spectrum...\n\nThere once was a time in which voting for the liberals and socialists was taboo, but that ended after World War I. Then the Catholic power declined more and more (they became christians in the 50s) and that communism/rightwing extremism was thrown out. Aside from one exception, it was always Christian democrats together with either socialists or liberals depending on the election results. \n\nIt's only in recent years (since the 90s) that the Far Right (without any trace of religion and their front is a Trumpist, Republican party pleading for more healthcare for \"true\" citizens, but only pleading as they vote economically rightwing or abstain) has returned and since 2019 also the Far Left (who love North-Korea btw). \n\nIt might sound weird to you, but we have both a right and a left, which seems absent from the American spectrum. The Democrats are similar to our liberals/Christian Democrats and the Republicans either don't exist (e.g. religious right) or are part of the rightwing/populist right.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jauznevimcosimamdat",
                    "body": "To add to this, I think political beliefs are mostly rooted in life experience and thus, challenging one's political beliefs might easily be seen as an attack on one's life experience.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "luckyassassin1",
                            "body": "Exactly. Growing up here most peoples politics are based on the life experiences they had growing up and challenging those opinions is challenging their core beliefs and values. Even if you're kind and not being rude or mean about it, they still feel like their perception on the world is being challenged sometimes and they turtle up and get defensive.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "WallabyBubbly",
            "body": "Healthcare reform was a great example of partisan psychology. In the 1990's, Republicans proposed the individual mandate as a way to prevent free riders from mooching off our healthcare system. The idea was generally well-received among Republicans and even became a feature of Republican healthcare reform in Massachusetts. Fast forward to the 2000's, and Obama proposed the same individual mandate, but he pitched it as a way to help vulnerable people gain access to healthcare, and the individual mandate suddenly became a communist takeover of healthcare. \n\nMy takeaway from this was that the best way to get conservatives to support a policy is to focus on how the policy punishes bad people or gets government out of the way of good people, while the best way to get liberal support is to focus on how the policy helps vulnerable people.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">...the current war in Ukraine, which might lead to food prices rising...\n\nIt already did.\n\nThe highest [global price of wheat](https://fred.stlouisfed.org/series/PWHEAMTUSDM) was in May 2022, with Russian troops in Ukraine.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "That should be a wake up call, as it shows that the leverage of the Russians is only increasing...",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mein_Kaiser_II",
                            "body": "Leverage of what? The simple fact is that Russia isn't a boogie man like they:\nClaimed to be\nClaimed they were going to be\nClaimed they always were\nClaimed they were\nEtc etc\n\nThey aren't genuinely to be taken serious as a world power, much like Chelsea in ⚽. Although yes, there absolutely should be much more action taken to arm the Ukrainian Army",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "They're not the boogie man they claim to be, because they don't have that power. Allowing Russia to take control of the Southern Ukraine would heavily increase the leverage it has on us. There's a reason we had an inflation of almost 10-12% thanks to them. \n\n[https://tradingeconomics.com/belgium/inflation-cpi](https://tradingeconomics.com/belgium/inflation-cpi)  \n\n[https://tradingeconomics.com/belgium/food-inflation](https://tradingeconomics.com/belgium/food-inflation)\n\nOctober 2022, we had an inflation of 12,27% and an inflation of 17% for our food (which went only back to pre-war conditions two months ago...). Put that into the context and you'll understand me why I want to increase our strategic independence. If you ask which (federal) government is in charge, it's a coalition of liberals, Christian Democrats, socialists and green parties, which ensures it's a leftleaning to centre-left.  (which doesn't have a Flemish majority btw....)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Mein_Kaiser_II",
                                            "body": ">Allowing Russia to take control of the Southern Ukraine would heavily increase the leverage it has on us.\n\nGood heavens, I see this argument all the time. Southern Ukraine is not some magic lynch point of the Western World, we can both agree that yes, Russian aggression and the entire war is bad, but the war existing is not some magic collapse of the food supply. I can tell this is based on Belgium, which I am not well versed on (German). I believe that this could be the fault of other issues within Belgium due to the HPAI outbreak, COVID-19, and general inflation within the Belgian economy as you state. I am more concerned about the European Energy crisis which solely happened due to Russian reliance and Fossil Fuel reliance.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kakamile",
            "body": "The better healthcare, longer lives, better education, better literacy, more pension, lower poverty, lower incarceration, lower single parentage, lower teen pregnancy, lower STDs, lower homicide, higher social mobility, more press freedom, fewer bankruptcies, lower infant and maternal mortality, all for lower working hours are in progressive and regulated states and nations.\n\nWe should not assume America's cure is in the opposite direction.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "My country had all of them during the 70s-80s and had to cut because the national debt was rising to 130-140% of the GDP. This led to Verhofstadt (you'll guess which country I am from...) cutting down and the trends we're in right now. We basically can't afford our welfare programs due to 1) greying population, 2) the many governements and 3) high taxes on everyone and everything. \n\nThese days, we try to comprimize both keynesianism and neoliberalism, but it's not really bearing its fruits and we'll have to cut down once more in the next legislation.... \n\nOr we have another governmental reform (7th time since 1970 btw) and kick the economical can down the road.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "Just addressing the prompt\n\nMeh, securing supply chain independence and securing strategic resources isn’t really a right left thing. If it leans one way, it’s probably left because of the rights insistence that green technology is useless and bad. Or if we’re only looking in the current context, it’s Biden doing things like the CHIPS act.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "ZeusThunder369",
            "body": "\"If you're saying that gender affirming care for minors should be banned; Then you're saying you trust the government more than parents, patients, and doctors to make the best individual medical decisions.\n\nAre you actually okay with letting Biden decide which medical procedures and medicines you have to take, or cannot take?\"",
            "score": 4
        },
        {
            "depth": 0,
            "author": "BlueCollarBeagle",
            "body": "When conservatives praise the private markets and criticize the government as inefficient unelected bureaucrats who are a leech on society, I point out that the leach in question was responsible for all the technology that makes your phone \"smart\".  Steve Jobs did not invent any of it.  \n\n\n\nWhen conservatives argue against welfare for able bodied individuals on the grounds that it creates a culture of dependency and robs the individual of the dignity of working for ones own wealth, I point to the never ending crusade of the right to abolish the Estate Tax, which is essentially the same as welfare, but to the rich.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DayShiftDave",
            "body": "What is with the sub's obsession with the \"silver bullet\" argument? It doesn't exist. It doesn't matter what your political beliefs are, they're deep rooted and you will not change them with one single argument or talking point, especially from a person you know you disagree with. \n\nAt least OP is asking the flip side of the usual question, but of course few are addressing it: it is highly unlikely that anyone here identifying as anything from center left to liberal to leftist would be convinced to vote for Trump based on one argument. u/TheOneFreeEngineer is on the best tack as far as I can see, opening a discussion and conceding some points in order to work toward a compromise.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheOneFreeEngineer",
                    "body": ">u/TheOneFreeEngineer is on the best tack as far as I can see, opening a discussion and conceding some points in order to work toward a compromise.\n\nI wouldn't even say I did that. I just talked about a perspective shift in order to advance leftist goals (and to a lesser extent liberal ones too), not compromise. Hell I basically said that point I want conservatives to get is the core of fucking Marxism (and all leftist thought). Thats about as demanding an issue i can ask them to flip on. And for the leftists I just basically said hey, rural people have issues too. \n\nI think people care too much about the aestehics of an argument or statement rather than it's content. I said similar things to what others said. I just didn't use buzzwords or trigger words.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DayShiftDave",
                            "body": "It's your post, of course, but my interpretation is perhaps different than your intent. Finding common ground, which I see you as doing, is the opposite of many of these posts, which are looking for gotchas that will only put people on the defensive.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BOSS_OF_THE_INTERNET",
            "body": "One thing I’ve learned over the years, especially since 2016, is that conservatives are not persuaded by facts.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "patdashuri",
            "body": "Ukraine is winning that war. Their grain and seed oil exports are growing every quarter. Just thought I’d share that",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DoomSnail31",
            "body": ">If you wanted to convince a conservative/leftist of one leftist/rightwing opinion using one argument, which one would it be?\n\nLeftists can be conservative, so this is quite easy. Just mention a leftist conservative standpoint, and they will agree automatically. \n\nA good example is how lowering immigration is in favour of the working class, as the influx of lower skilled populace leads to an increase on the burden in the social welfare system, leading to a lower effectiveness for the exact group of people that socialists seek to support. It also leads to less social housing availablity, again an important social system that is meant to support the working class. Immigrants also often get situated in local neighborhood community centers, which are quite important for lower income youth and lower income elderly to find a form of healthy socialising.\n\nIt's no suprise that conservative leftists parties, liek the durch socialist party, are often in favour of making immigration more difficult.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "tbtc-7777",
            "body": "That if you look at the Cold War, Democrats are still on the right side in supporting Ukraine and NATO, while Republicans have become a bunch of Putin-loving sellout scumbags who are spineless and weak on national security",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Maximum_joy",
            "body": "I would argue the economy always does better under democrats and if you care about that you should vote Democrat. Data to back this up is available.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tommy__want__wingy",
            "body": "\nMe: You see that woman over there?\n\nConservative: Sure.\n\nMe: Do you think she’s pregnant? \n\nConservative: I don’t know. \n\nMe: Can we keep it that way?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Firesword52",
            "body": "Current Republican politics are not normal and should not be treated as such. There's a difference between normal political corruption and effectively using mob tactics to get your way. \n\nThe vinear of respectability (if you look at it in that light)  matters when it comes to matters of state.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "vincethered",
            "body": "Why do you use the term “leftist” but not “rightist”?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "FeJ_12_12_12_12_12",
                    "body": "Habit and not being sure \"rightist\" is correct.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vincethered",
                            "body": "Correct? Is there a difference between “left wing” and “leftist”?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FeJ_12_12_12_12_12",
                                    "body": "Theoretically speaking, yes. \"Leftist\" is anyone on the left, while \"left wing\" covers everyone positioned between the centre and far left. \n\nBut in debates, it doesn't really matter and it depends whom you ask. I haven't heard anyone use \"rightist\" yet, while \"leftist\" is more common.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "vincethered",
                                            "body": ">\"Leftist\" is anyone on the left, while \"left wing\" covers everyone positioned between the centre and far left.\n\nI’m not trying to be difficult, I truly don’t understand the distinction.\n\n“Leftist” is not a term liberals use a lot much like conservatives don’t use the term “rightist” so you really need to define the term if you want good responses.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "FeJ_12_12_12_12_12",
                                                    "body": "It's quite subjective, but I'll explain how I see it, even though I catch myself using it as synonyms. \n\nI'll use a schematic to explain the mental \"tree of words\" I built up (it's very subjective, but it explains my vision.):\n\n* Rightist:\n   * far right: fascism, nazism (e.g. Mussolini)\n   * radical right: rightwing populism (e.g. Trump, Pat Buchanan)\n   * rightwing: neoconservatism \n   * centre-right: pragmatic conservatism \n   * rightleaning: Christian Democrats and liberals\n* Centrist:\n   * Christian Democrats and liberals\n* Leftist:\n   * leftleaning: Christian democrats and liberals\n   * centre-left: Social democracy and social liberals\n   * leftwing: (reformist) socialism \n   * radical left: left populism (The PTB in Belgium, I couldn't find any examples in the US. They're populist, but do tend to cross often into the far left with Marxism. It didn't sell so they calmed down.)\n   * far left: revolutionairy socialism, Marxism, stalinism and anarchism (e.g. Marx, Bachunin and Engels)\n\nIt's not rocket science and based upon my own opinion.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "vincethered",
                                                            "body": "That is a very well thought out reply, I’m not sure about broad agreement on the meaning of the term but I appreciate a well thought out and straightforward response which helps me to better understand the OP, thanks",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "wizardnamehere",
                            "body": "You’re correct.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "pillbinge",
            "body": "I would argue that cultural cringe has led many Americans, particularly on the left, to elevate their own culture in an ironic and therefore invisible twist. The presumption many leftwingers have, particular the metropolitan types, is that if they see a food item on the menu, they should pronounce it like a native might. However, they never expect the same from anyone else, or have a lower opinion of them. If they see a name that's new to them but cultural, they want to pronounce it right. They would never correct anyone on the pronunciation of their name. Americans cringe at being American and the culture we have when we step away from our keyboards but it's just as valid as any other, but they pridefully expect Americans to be these superior people while expecting nothing of anyone else, because they secretly don't think they're capable.\n\nI even see it with politics. Many on the left don't see borders. In our country, we should already accept every path of sexuality that exists. But outside our borders? Things are bad to varying degrees, but intolerance is just accepted as part of culture still - which implies they see others as more savage-like. They just aren't honest about it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "cybercuzco",
            "body": "Donald Trump is conning you.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sink_Key",
            "body": "I understand why guns aren’t liked by leftists, and I also understand that even most leftists don’t want to ban guns, they just want it to not be so easy to get them. \n\nThis opinion is only directed towards lefties that want to outright ban all guns\n\nLet’s go with the estimate that roughly 80 million people own at least one gun, in 2021, 48,000 people died from gun related injuries, whether it be suicide or murder. Now about 54% of those deaths were suicides, which is about 25,000, so 23,000 murders. And if we assume that each murder was committed by one person that was counted in that 80 million you get 0.0002875 percent of gun owners committing a murder. And that number is assuming each murder was committed by one person who legally owns a gun. A good chunk were likely committed with illegal firearms from the black market. \n\nSo statistically banning guns totally doesn’t make sense with the math, because the vast majority of gun owners don’t and won’t shoot or kill anyone.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SleepyZachman",
            "body": "I’d say it kinda depends on the conservative. If I’m talking to say a local business owner or stock broker or something similar I don’t think I’ll be able to convince them. They’re following their material interest by voting for trump since he supports deglobalization which would help small to mid sized national firms and her gets them lower taxes. \nBlue collar conservatives I think can be convinced if the conversation is put in simple populist terms of elites vs the people. Just use Trumps strategy but the enemy is the rich more broadly rather than the rich who they just personally dislike. Frame the struggle of urban Black people, Latino farm laborers, and poor rural whites as the same problem of deindustrialization and mass corporate power.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fugicara",
            "body": "We should not force people to become parents against their will.  That's why abortion should be legal, and it's why paper abortion should be legal.  I consider these both to be leftist positions in principle but paper abortion is mostly opposed by people on the left using literally identical arguments that right-wingers use in opposition to abortion.  So I use arguments against them in support of paper abortion rights that I usually use against right-wingers in support of abortion rights.  The arguments I have with left-wingers on paper abortion are literally indistinguishable from the arguments I have with right-wingers on abortion, with each of them being in favor of the state forcing parenthood on one group because \"they shouldn't have had sex if they weren't willing to become a parent\" and me opposing the state forcing parenthood on anyone.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dannydevitosfluffer",
            "body": "To my fellow leftists: You need to chill out on the 2A. It’s off putting to the rest of the population and to our politicians, it’s losing us elections. I’m looking at you Beto O’Rourke. \n\nLook I get it, I get upset anytime I hear about a mass shooting, especially at schools. I think a lot of this fear from my fellow leftists comes from lack of education and experience with weapons. There’s a lot of focus on the AR-15 but none on the other guns such as a Ruger Mini-14 mainly because it looks scary. They literally do the same exact thing and shoot the same caliber.\n\nShooting and hunting can be fun hobbies. If you’re not into that, cool. But making those specific weapons, certain types of weapons, or all weapons illegal will do nothing. It’ll just bring the prices up on a black market. People will still get them. For the record, I support background checks. But this will turn into nothing but something akin to the war on drugs. Otherwise law abiding gun owners will become criminals and fill our prison system even more. You think the prison industrial complex is bad now? It can get worse. \n\nHere’s the other thing y’all really need to hear. The right, especially of the MAGA variety, fucking hates us. They hate our values, they want a Christi-fascist nation, they daydream about murdering us. Now I don’t necessarily think there will be a civil war (though it’s certainly a possibility and would happen slowly), but I do see something similar to The Troubles on the horizon. Do you want the right to have all the weapons? If you don’t want to get a gun, don’t. But do you really want to depend on the police to protect you? Have you learned nothing from Uvalde? And more than likely they’re not on your side. That being said, as a first responder, I do work closely with the police, there are some of us among them. Learn first aid, learn how and where to store them, learn how to use them. \n\nLike it or not, guns are a part of American culture. There are more guns than people in this nation. They’re not going anywhere except underground if the worst happens. We’re collectively stepping on our dicks by not embracing them or refusing to live with their existence.",
            "score": 0
        }
    ]
}