{
    "title": "What's your political Hot Take?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nDo you have any spicy or controversial opinions or ideas you'd like to discuss?\n\nMy personal hot take is we need to repeal the 2A.  We have both unique gun rights and gun problems, coincidence?  I don't believe in a gunless society I just don't think it should be a right. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Square-Dragonfruit76",
            "body": "Any kind of disposable plastic should be taxed, and research into plastic alternatives and biodegradable plastics should get government investment. Anyone who disagrees should watch the latest episode of Stephen Colbert.",
            "score": 77,
            "replies": [
                {
                    "depth": 1,
                    "author": "Shaggy_Doo87",
                    "body": "Did you just find out about the plastic in the testicles lol",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Nose_Grindstoned",
                            "body": "Don't tell me we have to recycle that too?!",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "capsaicinintheeyes",
                                    "body": "Thankfully, your body can excrete it through regular frakking sessions",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Berenstain_Bro",
                    "body": "# [Plastics: Last Week Tonight with John Oliver](https://www.youtube.com/watch?v=Fiu9GSOmt8E&pp=ygUlam9obiBvbGl2ZXIgbGFzdCB3ZWVrIHRvbmlnaHQgcGxhc3RpYw%3D%3D)",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "bardwick",
                    "body": "I'm old enough to remember the hate and dirty looks I got from using paper bags instead of plastic...",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "stinkywrinkly",
                            "body": "This sounds far fetched. What are you talking about exactly?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bardwick",
                                    "body": "Deforestation.. Using paper bags was killing the environment. Campaign started in the late 70's. Got big in the 80's, standard in the 90's.   [You were killing the planet](https://www.independent.co.uk/climate-change/news/plastic-bags-pollution-paper-cotton-tote-bags-environment-a9159731.html), specifically the rainforests.   \n\nWhen there was a choice between paper or plastic, those that chose paper were just deemed horrible people.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "stinkywrinkly",
                                            "body": "Ah, yeah, those days. Luckily we’ve learned a lot since then, and now we know that single use plastics are horrible for the environment. \n\nAre you implying that they aren’t? Do you think deforestation is not an issue? I guess I’m just not sure what your point is beyond that people gave you dirty looks back in the 70s.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "bardwick",
                                                    "body": "No.. Just marveling about the tides of thought.       \nI switched to cable to get rid of commercials :).    \n\nOur family lived in huge level of fear due to overpopulation causing famine, disease and war.  The earth couldn't stand 3 billion people.    \n\nPeak oil, etc.. The list is pretty long.    \n\n>Luckily we’ve learned a lot since then\n\nI suspect the next generation will be marveling at us..",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "stinkywrinkly",
                                                            "body": "Yep, These are all things that are literally happening in the world, and are definite things to be concerned about. Are you saying they aren’t?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "bardwick",
                                                                    "body": "There wasn't \"concern\", there was full blown panic for the end of the world.  3 billion people, we were ALL going to starve to death due to over population.  Global war over resources.    \n\nThe global economy was going to literally shut down, military become useless. no more gas or oil by the late 70's (then the 80's, then the 90's).    \n\nThere's a lot out there to be \"concerned\" about.. but after the first dozen or so \"we're all gonna die in 5 years\" issues, you get over it.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "stinkywrinkly",
                                                                            "body": "Sounds like your panicky family really did a number on you, but I still can’t tell—are you saying environmental issues, overpopulation, peak oil, etc were issues that your family made up, and now that you’re all grown up, you think they aren’t issues? Or just that they aren’t issues to get panicky about?",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MuaddibMcFly",
                    "body": "Counterpoint: In locations where they did that, the plastic use *increased*",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "your_not_stubborn",
                            "body": "Source?\n\nNot trying to be snarky - I would like to read about this.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Ok-One-3240",
                            "body": "That sounds extremely improbable. Do you have a source for that argument/data?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SleepyZachman",
                    "body": "I agree with everything you just said but I’d rather have sex with a wood chipper than watch Colbert in 2024.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Square-Dragonfruit76",
                            "body": "why?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kateinoly",
                                    "body": "He's a liberal apologist instead of a revolutionary",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Square-Dragonfruit76",
                                            "body": "can you give an example?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "kateinoly",
                                                    "body": "No, because I don't think that about Colbert.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "stinkywrinkly",
                                                            "body": "So you're just making it up based on your feelings?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "kateinoly",
                                                                    "body": "No, just method acting the role of a disaffected progressive.  Why do you think they don't like Colbert?\n\nMy biggest pet peeve is the way he mocks peoples' phyducal appearance.",
                                                                    "score": 0
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "Canada should ditch the beaver and make the rosy maple moth their national animal. It's more visually interesting.",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "I like water rats",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Poorly-Drawn-Beagle",
                            "body": "I fear your love may be impure.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "Only pure love for rodents",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "L4ckzi3",
                    "body": "In fact, make that the flag, not some maple leaf.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BattlefieldNiblet",
            "body": "Maybe more economic or historic but it still applies, this idea that the 50s, 60s, 70s etc in America were just so great and any random schmuck could walk into any random factory or office and get a job and a month or two later but a huge house and support a big family on one income is just horseshit. Completely. \n\nLBJ didn’t start his war on poverty and great society programs because life was on easy mode for everyone.",
            "score": 48,
            "replies": [
                {
                    "depth": 1,
                    "author": "Corvid187",
                    "body": "Tbf, I think when this is said most of the time, it's out of a frustration that things haven't felt like they've got better for the average person's work life since then in the way it had improved up to that point.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "hitman2218",
                    "body": "Median income increased by $13,000 in the 1950s. You don’t see that anymore.",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Shaggy_Doo87",
                            "body": "Off the postwar boom which you also don't see anymore",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MuaddibMcFly",
                                    "body": "But the postwar boom *was a thing,* that a lot of boomers don't acknowledge that they benefitted from. \n\nThe 30-50 years after WWII were the most prosperous in US (world?) history, and assuming that economic life, or effects of a college education, in the 2010s and 2020s has any significant similarity to that of the 1960s and 1970s is quite simply naive.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Throwaway2154387",
                                            "body": "> and assuming that economic life, or effects of a college education, in the 2010s and 2020s has any significant similarity to that of the 1960s and 1970s is quite simply naive.\n\nYeah, the 2010 and 2020 is significantly better for most of the population.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SuchRuin",
                    "body": "According to my conservative friends the war on poverty was started because black peoples just got their rights and the evil democrats had to keep black people down somehow.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MuaddibMcFly",
                            "body": "Well, if you look at the effects...",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "stinkywrinkly",
                                    "body": "What effects are you referring to?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lemongrenade",
            "body": "Zoning must be heavily state lead not municipality lead.",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "Herb4372",
                    "body": "Living in Houston TX. Where we have no zoning and it’s a problem…. I dont think that Texas State house would have a better plan. \n\nThey’ve already made it illegegal for you to sample your air and test it to skein sure refineries are meeting their emissions protocol (because the emissions belong to the refinery and its theft). \n\nThe entirety of Houston would be split  into three types of zones. \n\nPrivate schools, industrial dumping grounds, and Lakewood Church.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "moonflower311",
                            "body": "I’m in Austin and I had an immediate negative reaction to this, especially because even if we implemented good zoning reforms the state (where billionaires are in the governors pocket) would find some way to shoot it down due to not benefiting the rich and/or to own the Austin libs.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "lemongrenade",
                            "body": "Yeah I don’t think Wild West no zoning is the solution but residential/commercial needs to be vastly simplified, in many ways deregulated (lot size mins/ parking mins/ etc) and commercial/res should overlap a lot more than they do (please better legalize 5 over 1s america I am begging you)",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Trumpsafascist",
                            "body": "This is so true and made me laugh hard. Thank you",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Danjour",
                    "body": "This is a goooood one.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lemongrenade",
                            "body": "You’re starting to see newsom claw some of that power to the state in the housing mandates for municipalities. Municipalities are obligated to build a certain amount to solve the housing crisis. They can own their own destiny if they embrace it but if they don’t the state will green light projects in those cities.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MuaddibMcFly",
                    "body": "Or, better yet, heavily *limited.*  Not heavy handed zoning, but heavily restricting *the ability to zone.*\n\nFarming vs Industrial vs Residential/Business zoning?  Sure.  \n*Forcing* a distinction between Business & Residential? No.  \nSingle-Family Residential vs Multi-Family Residential?  No.  \n\n\nBasically anything that isn't *directly* and *unequivocally* based on literal Health & Safety?  They do little more than to increase the cost of housing.\n\n\n---\nAs much as I hate a lot of the policies that California implements, the \"We control zoning now!\" move they made a few years ago was *brilliant*",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lemongrenade",
                            "body": "Yes. I went from being ready to support a primary challenge to newsom in 2020 to being a ride or die supporter in 2021 when he crushed the recall and let his true wings spread.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "insalted42",
                    "body": "I came here to make a joke but this is spot on",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lemongrenade",
                            "body": "Check out what newsom has been doing in Cali. It’s a model for states with the worst housing crisises. I was ready to vote for a primary challenge to him in 2020 but he’s been impressing the hell out of me since 2021.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "uniqueusername316",
                    "body": "Could you elaborate on why you think this?\nHere in Florida, the state has been preempting local municipality's ability to regulate growth and it's a serious problem. \nMore local control makes sense to me.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lemongrenade",
                            "body": "I used to live in Florida a couple years ago can you go more into detail? (Moved out 2020)\n\nIf you are saying the state is limiting development a municipality’s desire to do so I would agree that’s a problem. I’m my experience the nimbyism is far more likely to raise in the municipality than the state.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "uniqueusername316",
                                    "body": "To clarify, as I understand it, the state is restricting the local zoning departments from limiting growth in some ways. That means, if a local zoning department wants to reduce the amount of density in an area, the developers or property owners can sue the city for doing so. \nAlso, if an area is zoned as commercial/industrial, a developer can apply for a state program that allows them to build residential.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lemongrenade",
                                            "body": "Oh yeah that’s rad as hell I love that.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ManBearScientist",
                    "body": "Japan's nationally administered minimal-nuisance zones make so much more sense than America's single-use local zoning.\n\nIts simpler. There are just 12 zones. They don't waste endless time fighting over minutea. The end result creates walkable neighborhoods. \n\nOur system requires hyper competent planning and micromanagement, a sure-fire recipe for delays, high-costs, and sprawl. Almost every city just resorts to throwing new needed developments at the edge of town after endless delay, rather than within walking distance of where it is actually needed.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lemongrenade",
                            "body": "Preaching to the choir baby.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "KeepTangoAndFoxtrot",
                    "body": "FYI and only because it bugs me: led* not lead",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "FizzyBeverage",
                    "body": "You're better off with a few liberals here at the city council level than depending on the republican supermajority in the Ohio state legislature.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lemongrenade",
                            "body": "I think municipalities almost ALWAYS descend into\nNimbyism and state houses only occasionally do.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FizzyBeverage",
                                    "body": "You can count on Columbus to do the **wrong thing** when given any opportunity. Most currently, they've decided Joe Biden won't be on our ballots in November.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Admirable_Ad1947",
                            "body": "Disagree, history has shown that local governments (even in super Progressive areas like SF) nearly ALWAYS descend into NIMBYism; state government only usually do.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "atravisty",
            "body": "Islamic extremism needs to be eradicated and fully dismissed as an ideology in the same way Naziism has been. Arab countries have a responsibility to lead that charge.",
            "score": 40,
            "replies": [
                {
                    "depth": 1,
                    "author": "u2sunnyday",
                    "body": "All religious extremism. Not just Islam.",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sarin10",
                            "body": "\"Hey guys, Nazism is bad, and we should get rid of Nazism.\"\n\"Erm, actually all totalitarianism is bad and we should get rid of it all.\"\n\nthis is what you sound like. Yes, *we know* all religious extremism is bad, but we're specifically talking about one form of it.",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NPDogs21",
                                    "body": "Thank you for summing it up nicely. Literally every time valid criticism of Islam is brought up, there’s always someone who has to criticize all religions or say this other one is actually worse. ",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "highspeed_steel",
                                            "body": "Thats what I heard so many western liberals vigorously say after someone accuse them of being light on Islam. Fact is I understand that specifically in some western countries, Muslims occupy a funny place in power dynamics whereas in some places of the world, they aren't. Its ok to admit a little favoritism due to that.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NPDogs21",
                                                    "body": "I’d say most who do that have a view of oppressed/oppressor and punching up vs punching down. That’s why they will immediately attack Christians when critiques of Islam are brought up as they see it as attacking the oppressor/in power group rather than the opposite ",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "highspeed_steel",
                                                            "body": "Yes, that, but I also think that the  islamophobia that resulted from 9/11 really defined a generation of American liberals to coddle that religion significantly.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ok_Panic4105",
                            "body": "Yeah, no exceptions. Religious extremism is just a cancer in every civilization.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "IamElGringo",
                            "body": "Bhutan?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Warm_Gur8832",
            "body": "Traditional gender roles are often just as painful on men and need to be abolished.\n\nUnfortunately, so many men are going in the other direction, which will only make them feel worse.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "rogun64",
                    "body": ">Unfortunately, so many men are going in the other direction, which will only make them feel worse.\n\nYes, we're our own worst enemy. Despite the progress with equality, I recently heard a feminist say that the US is more paternal today than in the past and she is right, although it's not about how we treat women.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "dachuggs",
                    "body": "And men are the one that's maintaining that gender role.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "7figureipo",
                            "body": "No, we aren't the only ones. I'm a bisexual male. I've never been feminine. There are definitely expectations regarding men with respect to their appearance and behavior by people of all genders even in so-called progressive areas, such as the SF Bay Area. I've been a target of them, personally, by both men and women, and I've seen men targeted by them the same way. Everything from holding doors open to being the first ones asked to help move stuff around (e.g. in the office or in volunteer/recreational activities such as parties) to expectations around hair styles, clothing, etc. ETA: there are still some hardcore gender-based expectations in dating, and this is true in both the straight and even gay communities (in a sense).\n\nWe (collectively) reinforce and propagate gender stereotypes, period.",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "UltraSapien",
                            "body": "I think that's a harmful stereotype. Women are just as guilty, if not more so, than men.",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BrandosWorld4Life",
                    "body": "This take isn't remotely warm, let alone hot",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MiketheTzar",
            "body": "Any universal health care/socialized medicine proposal that doesn't address rural healthcare deserts is just pandering for urban votes and isn't an act of altruism in the slightest.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "ManufacturerThis7741",
                    "body": "Sadly, I don't think it is a problem that can be addressed. During the peak of the pandemic, you had doctors getting disparaged and even death threats for advocating getting the vaccine.\n\nNow you have doctors, particularly OB/GYNs leaving rural states because of strict abortion bans pushed by people from rural areas.\n\nWe can't force doctors to stay in areas run by worm-brained freak jobs who might try to jail or kill them for doing their jobs. So let's get the socialized medicine where we can.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MiketheTzar",
                            "body": ">We can't force doctors to stay in areas run by worm-brained freak jobs\n\nI bet you like to talk about how everyone deserves respect whenever people bring up the homeless.\n\nLet's not pretend the same unhinged death threats, pro-life, regressive thoughts don't also come from urban spaces and voices, but hey at least you're being honest about not giving a shit about rural people.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ManufacturerThis7741",
                                    "body": "\"Let's not pretend the same unhinged death threats, pro-life, regressive thoughts don't also come from urban spaces and voices\"\n\nAnd those people are also worm-brained freak jobs. The difference is, those people typically get marginalized in urban spaces rather than getting power to make laws the way they do in rural areas.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MiketheTzar",
                                            "body": "You mean like the marginalized rural communities that tend to only get any attention or power when they vote in mass about specific issues?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ManufacturerThis7741",
                                                    "body": "They get *plenty* of attention and power. Heck, our whole system is explicitly *designed* to give them more attention and power at the expense of urban areas.\n\nThey just use that attention and power for stupid social issue crap. They vote for the guys who are against regulations that would prevent things like chemical train crashes because they're against abortion or gay marriage and then try to blame the urban people when a chemical train crash turns their town into a cancer cluster.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MiketheTzar",
                                                            "body": "Because the saying is definitely \"as goes Wyoming so goes the nation\" and not \"As goes California so goes the nation\"",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ManufacturerThis7741",
                                                                    "body": "We have a Senate for the benefit of rural areas\n\nBecause Supreme Court Justices are appointed by the Senate, SCOTUS favors them too\n\nWe have an Electoral College for the benefit of rural areas\n\nThe House, the chamber that is supposed to benefit the populous areas, is capped for the benefit of rural areas.\n\nWhat else do you want exactly? I am genuinely asking. Because short of saying \"people in cities can't vote\" there are no other methods to pretzel up the system.\n\nAt some point, rural people voting for economically terrible people based strictly on their social issue stances or getting back at urban people for shit urban people had nothing to do with becomes a skill issue. Not a marginalization issue.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "MiketheTzar",
                                                                            "body": "You can talk of theory when I can point at practice.\n\nIn last 50 years 2 presidents have previously represented a state that had a doesn't double digit electoral count. Technically Trump never represented anyone, but it's hard to separate him from New York.\n\nThe VP has the same split 2 vice presidents in the last 50 years\n\nIn the same time span the speak of the house has represented a state with an under double digit twice.\n\nDuring the same time the Supreme Court has had 5 Justices from states with single digit electoral college votes and 18 from states with double digits. With Ketanji Brow Jackson being from DC, which while only having a single vote would be hard to argue as a rural space.\n\nYou're right the Senate seems to be dominated by smaller states at 9 to 3. So out of the 5 highest bodies and offices in our government 1 of them has been dominated by small states.\n\nAs to what I want that's quite simple. Stop pretending that small states and rural spaces have all of this power when they clearly don't. Y'all are just mad that the 1 in 5 moments when big states and their social policies aren't being catered too is the end of the world. Despite the fact that you don't give a shit about \"fairness\" the other 4 out of 5 times that your views are the ones at the forefront.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ManufacturerThis7741",
                                                                                    "body": "Which social policies?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "MiketheTzar",
                                                                                            "body": "Centralization of safety net services.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "ManufacturerThis7741",
                                                                                                    "body": "Before the Feds took control of the social safety net, whether or not poor people could get help was at the whim of some local lunatic whose criteria was extremely biased and basically dependent on their mood. In a lot of places you were anything other than a white Christian, you needn't have applied because the answer was no.\n\nThe Warren Court said that wasn't allowed and I, being a disabled atheist, am very grateful. Especially when I have been unfortunate enough to meet preachers who are hopping mad that the social safety net denies them a way to use people's poverty or disability as a way to induce religious conversions.\n\nBut the locals weren't going to abide the Warren ruling so the Feds had to step in and do a lot of restructuring and centralizing. While I do not doubt that this has been a negative for rural areas, doing nothing wasn't an option.\n\nSo how do we de-centralize social safety net services to help rural America without screwing over all the other people?\n\nMore importantly, is a social safety net that doesn't screw over all the other people a thing rural people will accept?\n\nA lot of the objections to the social safety net coming from rural America are explicitly about the fact that social programs apply to everyone rather than just the people they like.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "MiketheTzar",
                                                                                                            "body": ">A lot of the objections to the social safety net coming from rural America are explicitly about the fact that social programs apply to everyone rather than just the people they like.\n\nThey seem to be your objections too since you called them \"worm brained freak jobs\"\n\n>More importantly, is a social safety net that doesn't screw over all the other people a thing rural people will accept?\n\nYeah because despite mainstream views to the contrary rural folks are pretty diverse with a sizable number counties in Southern single digit electoral college states having a higher percentage black population than New York City. On top of that they disproportionately volunteer for military services and are subject to the same degrees of disability from that. On top of the general disability and hardship that come from physically demanding jobs. Which dominate rural spaces. The idea every rural person is a evangelical Christian is as laughable as the idea that every Californian is a socialist.\n\n>So how do we de-centralize social safety net services to help rural America without screwing over all the other people\n\nSimple. Allocated equal funding to rural hospitals. You could even do a hybrid model of hospitals getting a baseline regardless of location and then an additional amount on a per patient in their service area (rounded to the nearest 5,000) basis. Which could reopen all of the rural hospitals that are getting closed. Or at the very least reopen wings and units that have either been shuttered or criminally understaffed. That way we don't have people traveling 5 hours to deliver a baby in a maternity ward, or see about their heart attack, or have a broken bone reset, or even in some cases get basic physicals and care.\n\nIn that same vain utilize already existing public structures that can be supplemented with mobile treatment options. Run clinics out of high schools on the weekends. Hell even if you had a rotation that a bus with nurses, doctors, an X ray machine and maybe even an MRI machine set up in a high school gym one Saturday in a two month cycle you could cover the entire population without any real additional infrastructure. You could even have school bus drivers pick up people and bring them to that location since those routes and areas are already pretty well planned out.\n\nYou could even raise additional money for it by combining Medicaid and Medicare (as well as potentially aspects of the VA, but that's a much more complicated process) and eliminate all of their administrative bloat and hire more doctors, nurses, and technicians. Or even just sell any of the number of minor tax increases to rural folks because for once we have a very clear example of what their money is going towards not just a clinic 5 hours away that is by all practical means inaccessible.\n\nIt's not that difficult to actually address rural folks' issues.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "ManufacturerThis7741",
                                                                                                                    "body": "\"They seem to be your objections too since you called them \"worm brained freak jobs\"\n\nNo, I called the people who send death threats to doctors freak jobs. And the people who would no doubt jail an OB-GYN for telling a woman not to carry a non-viable fetus to term freak jobs. I called the people who supported this nonsense by choosing to elevate freak jobs to power freak jobs.\n\nWhat other term would you use?\n\nBut I don't object to them getting medical care via social services if they can find people who will voluntarily be doctors in these places.\n\nI do object however to the notion that this mess isn't partially of their own making. You can't dox and threaten pro-vaccine doctors and expect them to stay. You can't write abortion laws that are so strict and the life of the mother exception be so narrow that it may as well not exist and expect the OB-GYNs not to run for the hills in fear. And you can't vote for people who are publicly against social services and proceed to be mad that you don't get social services.\n\nI've been in the disability community for years and it still mystifies me when these rural special needs family members vote for people who are loudly and proudly against the services their family members use and then get mad when their family members get put on the chopping block. I really have trouble understanding how they were expecting something else other than that they seriously thought *their* family would be spared somehow.\n\nBig states and urban areas didn't make the small states and rural areas do this. They made that choice themselves.\n\nAnd these solutions you propose are smart. And rural America does have a choice now and they always have, contrary to what some may believe. They can vote for people who want to implement solutions. Or they can vote for culture warriors who will take the budget ax to whatever is left of rural healthcare and call it \"small government.\"\n\nWhatever choice they make is on them. I hope they make the right one but I'm not going to let them blame people in the cities if they make the wrong one.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "MiketheTzar",
                                                                                                                            "body": ">No, I called the people who send death threats to doctors freak jobs. And the people who would no doubt jail an OB-GYN for telling a woman not to carry a non-viable fetus to term freak jobs. I called the people who supported this nonsense by choosing to elevate freak jobs to power freak jobs\n\nBecause that was definitely every single rural person and not the basic level of nut jobs that just exist. You know like the people that have threatened to dox and kill the Trump jurors if they don't find him guilty. Or maybe we could not lump large groups in with their crazy elements.\n\nAs for what term we could use? I don't know maybe idiots or you could keep dehumanizing and othering them because fuck those people right?\n\nYou're right they didn't make people in those spaces so those things, nor did small states make big states hord and centralize social services because once again fuck those people right?\n\n>And these solutions you propose are smart. And rural America does have a choice now and they always have, contrary to what some may believe\n\nNo they really don't. Show me any medical reform plan that talks at all about actually combating rural healthcare deserts and I'll Venmo that candidate 10$. They are stuck between Republicans that are honest about not caring about them except for meaningless culture wars positions or Democrats that continually ignore and overlooked them because it's just not worth appealing to them.\n\nYou're more than welcome to continue to blame rural folks for their lot in life. That's your right and your prerogative. Just like I'm going to continue to state what I said in the original comment. \"Any universal healthcare/socialized medicine that doesn't address rural healthcare deserts is just pandering for urban votes and isn't an act of altruism in the slightest.\"",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ChildofObama",
            "body": "We shouldn’t be restricting what food stamps can be used for to fight obesity.\n\nNutrition is no doubt important, but poor people, and lower middle class people should not be on a government mandated diet, while everyone else gets to eat what they want. \n\nYour tax dollars are not being wasted because people on government food assistance are buying frozen pizza over peanut butter. \n\nObesity is not a problem we’ll solve via punitive action.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "secretid89",
                    "body": "Agreed.  Also, some people have food allergies.  So if the government limits what they can eat, this is a problem!   \n\n\nAnd food allergies don’t care if you’re poor!",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "NPDogs21",
                    "body": "Can you explain why foods/sodas with little or no nutritional value should be paid for by taxpayers when we know they are more likely to lead to obesity, causing additional health problems? That then leads to more and cost of our healthcare services. \n\nIt seems like one of the most no brainer policies that is preventative and proactive to helping address our obesity epidemic ",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Buffaloman2001",
            "body": "We still need to vote Biden in November, there's no way around it, he is the harm reduction candidate that can actually contend against Trump, you can be mad all you want and hell you should be criticizing Biden for funding Isreal the way he is, but it at least he's not for abolishing many of the democratic institutions in this country, and taking away more rights/autonomy from marginalized groups.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "dachuggs",
                    "body": "I still won't vote for him.",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NocturnalLightKey",
                            "body": "Can I ask how you rationalize basically cementing the Supreme Court as a permanent right wing brand of government?",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dachuggs",
                                    "body": "It's already at that point.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ACoderGirl",
                                            "body": "It still can get worse.\n\nThe right leaning SCOTUS judges are the oldest and most likely to die in the next presidential term. So there's a decent chance that the winner of the election gets to decide if the court stays conservative or if it becomes more balanced.\n\nPlus, things can get more conservative. Repealing same sex marriage is definitely already within reach, but interracial marriage seems less likely considering one of the supreme court judges is a black man with a white wife.\n\nOn the topic of abortion, things can get so much worse. Overturning Roe v Wade simply made it possible for states to ban abortion. They can't yet prevent interstate travel for abortion nor force progressive states to ban abortion. You can bet that a GOP trifecta is gonna push for those things.",
                                            "score": 6
                                        },
                                        {
                                            "depth": 4,
                                            "author": "NocturnalLightKey",
                                            "body": "We have almost 5 justices that are coming up to either retiring or leaving the seat one way or another. The majority of them are either left leaning or at the very least fairy moderate. You actually think that Trump having 5 more picks would not change the dynamic of the court?",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "SleepyZachman",
                                    "body": "Tbf the Supreme Court always existed as a conservative force in American politics. The only exception was during the Civil Rights era cuz FDR and Eisenhower got lucky and Eisenhower accidentally picked a mega liberal.",
                                    "score": -2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BrandosWorld4Life",
                            "body": "\"I don't care about racial minorities, LGBTQ+ people, immigrants, people in poverty, or anybody else who will be hurt under a Trump presidency.\" - You \n\nPassively helping the far right come to power, so brave /s",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dachuggs",
                                    "body": "There is a lot of strawman and incorrect information you got there.",
                                    "score": -2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Weirdyxxy",
            "body": "The tax function shouldn't be linear, and the marginal tax rate should approach, but never reach, 1",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "rm-minus-r",
                    "body": "Can you elaborate on that more? What problem would it solve?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Weirdyxxy",
                            "body": "I think it's the correct approach to taxation, anything less will lead to taxes that are a bit high first and a bit low later. The marginal tax rate mustn't reach 1 because that would remove the reward of increasing income, but this way, motivation is still there every time\n\nEdit: I didn't explicitly answer your question. What problem would it solve? The same problems any taxation scheme tries to solve - the need to finance a government without devaluing the currency, destroying the incentive structure, or imposing too much of a burden",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rm-minus-r",
                                    "body": "Let's say I'm a senior accounting director at Amazon, and I've just started working there after spending ten years working for the IRS. \n\nAmazon has hired me for my intimate knowledge of every single tax code loophole there is to allow Amazon to pay as little taxes as humanly possible.\n\nAside from this theoretical scenario actually being a near identical duplicate of real life, how would you arrange this so corporations couldn't avoid taxes?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Weirdyxxy",
                                            "body": "I don't know. Just because I have an opinion on one aspect of (income) taxation, doesn't mean I believe to have the answers to everything regarding (any) taxation.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "rm-minus-r",
                                                    "body": "No worries! It's just that I've seen a lot of tax improvement ideas floated on Reddit, but usually they're short on detail when it comes to the \"assume an evil corporation will attempt to turn this to their advantage\" front.\n\nI used to work for Amazon and the money they spent to avoid taxes was truly disturbing. Imagine the effort NASA put into going to the moon, but if it was to dodge taxes instead.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RealDealLewpo",
            "body": "Boeing needs to be nationalized.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Can we do oil too?",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "invadrfashcag",
                            "body": "You stole my idea lol",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "tidaltown",
                    "body": "Put the engineers back in charge and kick the MBAs to the curb.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rm-minus-r",
                            "body": "For-profit is great until the safety of people's lives becomes a line item on an accountant's spreadsheet.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GoldenInfrared",
                    "body": "Not even a hot take at this point, if almost all of your products are sold to the state and you have no real competitor you should just cut out the middleman",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "TlalokThurisaz",
            "body": "Dueling to death or first blood should be legalized as an option to solve disputes between consenting individuals, but there shouldn't be a stigma for refusing to partake in duels. They should only be allowed to take place in designated arenas with legal observers. Minors shouldn't be allowed to duel.\n\nGladiator fights and human blood sports should be legalized as long as they take place only in designated arenas, all participants are consenting adults, and minors aren't allowed to watch them.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "StabbingUltra",
                    "body": "You’ve really thought this out.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "LakersFan15",
            "body": "I’m sick of liberals acting like the US is a third world country. It isn’t. Working hard and smart can still get you to a place of comfort. The recipe for success hasn’t changed in decades.",
            "score": 51,
            "replies": [
                {
                    "depth": 1,
                    "author": "highspeed_steel",
                    "body": "I agree. I think a lot of it comes down to expectations. Many earlier Americans and immigrants intended to come here and work their asses off, and many of them did found success. More and more younger folks today are seeing the European model and going like hey, maybe not everyone likes the rat race and furthermore, that system treats folks who aren't able to work or work as much with more dignity, so that leads to a preference for more social democratic ideals in younger people. In turn, that leads to a lot of misgivings about the US. For the record, I think its possible to keep America to its more traditional boot straps ideals, but still treat its marginalize better. You don't need to tax like the Scandinavian to have decent basic healthcare. The bureaucratic bloat just has to be streamlined a ton.",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LakersFan15",
                            "body": "It’s probably my age talking, but I see the left (U.S) complaining way too much while not being grateful for the opportunities they have. Reddit thinks hard work doesn’t pay off - it absolutely does! Obviously you have to work smart as well, but Jesus Christ maybe you just lack discipline. Accountability is dying.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dachuggs",
                                    "body": "There are a lot of people that are working hard and still living in poverty.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LakersFan15",
                                            "body": "Yes I'm not saying it's black and white. That would be stupid. \n\nBut if you played your cards right and you aren't from a shit family. If you think you did all that and are still in poverty - likelihood is you missed something.",
                                            "score": -4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dachuggs",
                                                    "body": "You're putting so some many caveats on what it takes to be \"successful\" when in reality it's the luck of the draw. Claiming people lack discipline and accountability is purely disingenuous.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LakersFan15",
                                                            "body": "It's more disingenuous to say that it's the country's fault only or that it's impossible.\n\nWe won the lottery by simply being born in the US. How many people do you think don't take that innate advantage seriously enough?\n\nIf you create enough opportunities for yourself, you create your own luck. Working hard and working smart for a long time fruits rewards.\n\nBtw living modestly or being broke does not mean poverty. Things take time.",
                                                            "score": -1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "highspeed_steel",
                                    "body": "Oh yea for sure. Everything is relative, most people in the world would kill to get to work in the US, while terminally online Americans and Europeans shit on the US on the internet. We can acknowledge various systemic stuff that may make working for various minority groups harder, but that also shouldn't blind sight you to the fact that at the end of the day, hard work still rewards.",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "jaddeo",
                            "body": "I mean, we are experiencing a lack of medical professionals to deal with the people that are already insured and seeking healthcare. It's becoming harder to see a doctor themselves now that PAs and NPs are taking on much more responsibility. \n\nYoung people want all these amazing healthcare changes without the infrastructure and the amount healthcare providers to support it. This requires people to work their ass off to graduate as doctors, PAs, and NPs. Every nice thing in the world requires someone to work their ass off to get it for us. But young people want to take all the nice things without having to work their ass off themselves.",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Admirable_Ad1947",
                                    "body": ">I mean, we are experiencing a lack of medical professionals to deal with the people that are already insured and seeking healthcare. It's becoming harder to see a doctor themselves now that PAs and NPs are taking on much more responsibility.\n\nA large part of the shortage is the artificially capped number of residency spots (which all doctors need to go through to independently practice), not young people being too lazy to become MD's.",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "highspeed_steel",
                                    "body": "There are pros and cons to every system, but when someone tells me that Americans definitively want a Nordic style welfare setup, I said I wanna see a pole of let alone all Americans, but how many Democrats would be willing to have all income tax brackets increase by 10% with a 24% sales tax.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "But we could have it so much better \n\nFrance has 6 weeks of vacation at a minimum...",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LakersFan15",
                            "body": "Yes, but france also fares very poorly among western nations in employment rates.",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "Ok, doesn't mean we can't do better then what we currently are",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LakersFan15",
                                            "body": "I don’t disagree lol. Hence why I said I hate how we act like a third world country. If you do the following: you will live “comfortably” almost guaranteed:\n\n1. Go to college and actually study.\n\n2. Intern while going to college.\n\n3. Apply/look for jobs starting your senior year.\n\nIf you are from a relatively not complete shit family - this is doable for almost everyone. Problem is that it’s hard ass work. Some people don’t want to work that hard, but absolutely hate being told that they are lazy.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Shaggy_Doo87",
                                                    "body": "I think it's disingenuous to say if you do A B and C you'll get comfortable. (Probably). *If* you're also smart. (Good luck with that one how many smart people are actually milling around trying to figure out how to get a job out of college?) and *also if* your family isn't flawed and terrible. \n\nThat's too many caveats for you to make it sound like such a simple obvious thing. If there are that many qualifiers then maybe it's more complicated than you're willing to admit it is",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LakersFan15",
                                                            "body": "I think the family portion is a huge caveat which is why I added that part. But we aren't a shit country - that narrative needs to stop. It's rampant across reddit.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Shaggy_Doo87",
                                                                    "body": "U Kno I mean I get both, I know the US is generally better than a lot of other countries. But you have to understand when we see the blatant corruption. The inflation no one seems to want to do anything about.  The choices we have when deciding our leaders or even the sense that more and more of our choices are being taken from us. Seeing your country condemn you rather than work to ease your burdens you can't be surprised a lot of people feel the way they feel",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "LakersFan15",
                                                                            "body": "I absolutely agree. But when we say things can be better or even A LOT better - it does not mean we are a poor nation. Being born in the US is still a blessing 90% of the world would take in a heartbeat. We won that lottery. Take advantage of it.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Shaggy_Doo87",
                                                                                    "body": "Unless you can't because you're trans, or gay or black or a woman or poor, not because you don't want to and aren't the best choice but because they see one of those things and tell you you're not allowed in\n\nI'm not saying it's every case but it happens",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "LakersFan15",
                                                                                            "body": "I would also say the country is more accepting than ever before. In major cities, they are absolutely okay in major companies. It's not perfect, but it's worse in most other places.\n\nThe victim complex is strong - Republicans aren't wrong about that. I even see it at work - no one wants to be accountable.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Shaggy_Doo87",
                                                                                                    "body": "The thing is those parts of the country are, and have long been under attack by various types of conservatives for various reasons but ultimately because of the same acceptance you describe. And victim complexes cut both ways, War on Christmas neo-Christians I'm looking in your direction",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "LakersFan15",
                                                                                                            "body": "Negativity and self loathing is rampant on reddit lol. I'm seriously curious if anyone actually feels thankful to win the lottery for being born in the states. It's like if they suffer any condition in life - they use it as an excuse to not succeed. Many Liberals are so smart but can't use it to their advantage because they are too busy trying to find ways to be unhappy/lazy.\n\nI'm being harsh, but I see it so often. No one is thankful.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Shaggy_Doo87",
                                                                                                                    "body": "While I find that any attempt to talk about real world issues that affect millions of people daily, with someone who just doesn't want to hear it, to be pointless because I'll just get the response of \"oh such negativity everyone is ungrateful\"\n\nLike winning the lottery would be being born in an America which was one of the actual happiest countries on earth with real programs for their people like Sweden, Switzerland, Canada where most people have free access to the same benefits and 3/4 of the population wasn't treated like whiny loser babies by the most comfortable 1/4 of the population (or whatever the ratio is)",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "LakersFan15",
                                                                                                                            "body": "My parents were born in a war ravaged country. People were starving and dying including my parents family. They escaped with all of their savings for a ticket to the states and stayed here illegally. \n\nMore people in this world can relate to that than people born in the US. Just let that sink for a second. We are lucky.",
                                                                                                                            "score": 2,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Shaggy_Doo87",
                                                                                                                                    "body": "I'm not debating your luck and you have to understand that, just because many people are going through hardships in this country doesn't mean you're any less lucky. Just because it's been a great country to and for you doesn't mean it's great to and for everyone. People's hardships and experiences differ. Just because someone may not have had to go through literal hell doesn't mean their life hasn't been difficult in its own way. You can't generalize that everyone's life in America is or could be great and amazing and rainbows, because it's not true. Some people have terrible existences here.\n\nLet's look at child abuse. It's terrible there are CPS and cops abusing kids. Parents. Child Services is woefully underprepared and the adoption/foster system in this country is a literal joke, it's actually a cliche on TV and movies how it's almost as bad as just being abused by your own parents. Not always true but true enough and this stuff happens. You can't look at a young girl who's been molested (not necessarily by a parent, let's say a teacher or a family friend) and say \"well you didn't have to crawl through a warzone to get here so you won the lottery\"",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "LakersFan15",
                                                                                                                                            "body": "I also said it's mot black and white. And why I originally mentioned that as long as you're from a relatively normal family.\n\nI am also a victim of child abuse because of my parents' trauma and culture. It's what inspired me to work nonprofit in my earlier years. I basically moved out at 18 and have been estranged from my family for almost 10 years.\n\nHowever, these are not the majority. The majority of people are in perfectly fine families. It's going to sound harsh, but they have no excuses. It's so weak to have zero accountability for your actions.",
                                                                                                                                            "score": 2,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "Shaggy_Doo87",
                                                                                                                                                    "body": "It's tough tho because no one signed up to be told they're weak and lazy by someone who isn't even originally from here\n\nIf you love it and think it's so great then cool. Enjoy it and love every day for yourself. Why are you so fixated on whether the people who are from here meet your standards of how they're supposed to think and act toward their own country?",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "LakersFan15",
                                                                                                                                                            "body": "That's a silly question. Why care at all about politics and social issues then? You can ask that to anybody. \n\nThis world is hard and unforgiving. Some deserving better don't get it while others with opportunities squander it. It upsets me.\n\nMy experience in nonprofit and as an inner city teacher showed me life isn't fair at all. Some people aren't given a fair share. I will always support equality and children's rights - but people who have it easier than most of the world that just bitch and moan piss me off. \n\nI usually don't get into all this, but it was the question asked in this post. I just answered truthfully.",
                                                                                                                                                            "score": 2,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "Shaggy_Doo87",
                                                                                                                                                                    "body": "Actually the question was about your political opinions and you decided to stand up and start talking about how Americans are ungrateful idiots for not seeing that their lives are amazing and great. Your experiences are your own and they affect you and how you see the world, you have to understand that's the same for other people too.\n\nOne thing I think is noteworthy with most Americans is that they find it super annoying and not at all useful when someone they didn't ask starts telling them \"I've been through way more than you, life is way harder for me, so all your problems are dumb and stupid and don't matter. You didn't go through what I went through so you have no right to complain.\"\n\nNo one fuckin asked you, and your only argument is \"I've had it worse. I've had it worse.\" Well fuck me then I guess all my problems aren't really problems. You want me to bow down and thank you on my knees for helping me see that all my issues are really just because I'm a dumb weak whiny complainer?? You want me to nod solemnly with tears streaming down my face and vow to be a better man who appreciates his life from here on out?? What the hell do you even think you're accomplishing by telling people their life isn't that bad?\n\nI get it you volunteer and work with underpriveledged kids convincing them their lives could be better. That's amazing and great, it makes you a good person, but being a good person doesn't give you the right to tell everyone you see that they should shut the fuck up and love it. It's obvious from the tone of your posts that you're exasperated with people around you not \"appreciating America enough.\" Not everyone needs you to tell them how much they should appreciate their own world. Not everyone's issues can just be swept under the rug with a wave of the \"I've had it worse\" wand. Not everyone needs to be told by you that they're fuckin doing it wrong. Help those in need--your students and those you volunteer for--and leave the rest of us to figure out our own shit.\n\nHell try being sympathetic and see what you learn about peoples' hardships. Rather than constantly comparing them to your own. I get it you had a shit life. Well people can have a not-as-shit life as you had and it still be pretty shit. Yeah you're saying \"oh I said not in every case\" you also said you're sick and tired of seeing people not take responsibility so to me it sounds like you have a complex. Maybe you think the people here don't deserve to be here because they don't appreciate it like you think they should.\n\nPeople don't need your approval of their problems for them to be \"real problems\". And we don't need you telling us how we should feel about where we live. I respect your opinion but we had a reasonable discourse on it already and all I get is the same refrain of \"but people aren't....\" I'm done hearing the same thing over and over. Look up \"high horse\" and get the fuck down off yours boss",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "LakersFan15",
                                                                                                                                                                            "body": "This is fair tbh. I've absolutely become more cynical as I got older.\n\nI don't have access to a computer atm so I have been typing on mobile so I have been abbrievating as much as I can.\n\nI just believe people should try harder to improve. I'm not downplaying people's problems as much as you think. I just think people give up too damn easily and aren't thankful for what they have. Way too much emphasis on what they don't have.\n\nI talked to a North Korean refugee who told me how he had difficulty understanding (paraphrasing) how people in today's modern world complain about so many things when they were born with so much.\n\nI didn't have an answer for him.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "author": "Shaggy_Doo87",
                                                                                                                                                                                    "body": "I mean I'm not gonna lie and say there aren't lazy selfish people in the world. And I've heard many people who grew up in really bad neighborhoods, say they went into the Marines or Peace Corps or something and didn't realize how bad it was in other countries.\n\nBut you do have to understand the nuances of where we are as a country in American history. There's a growing sense that while people are struggling the systems that are supposed to be put in place to support them are being intentionally sabotaged in order to basically get out of having to provide those services. It's gotten way harder to keep food stamps for example. Or applying for and continuing on Section 8 is such a big hassle. \n\nBasically the idea is that we live in such a prosperous and powerful country that no one here should have to struggle. This preoccupation with trying to force everyone to \"earn their right to live\" comes across more and more as a disingenuous mode of thought designed to prevent a growing section of Americans from reaching true prosperity. There's a sore spot with people in being told that you'll make it if you just try harder.\n\nSome people have medical bills they can't afford and so they can't work. Basic medical shouldn't be so incredibly expensive. Basic childcare is so expensive it's not worth it to work because you almost have to pay a whole wage just to afford someone watching your kid.\n\nThe thing is not everyone can have the high paying job. It's more and more competitive and you have to be extra special and more extra special. Where is security for those who work hard, work two jobs and raise kids, but aren't super talented or social or especially intelligent? The \"earn your keep\" thought process is designed to discount those disadvantages. The \"I had it worse\" card is also designed to preclude empathy in favor of practicality. Because you did something doesn't mean someone else can do it and that in turn doesn't mean someone else shouldn't get the same access to happiness that you have. \n\nFor that mode of thought has allowed greedy politicians and the like to justify gutting or neglecting necessary services like disability, social security, Medicare, etc. the idea being that if we make necessities too accessible, people won't just force themselves to work harder to earn the same quality of life",
                                                                                                                                                                                    "score": 1
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "IamElGringo",
                                                    "body": "Ah well I'm fucked.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LakersFan15",
                                                            "body": "This recipe hasn’t changed in decades, but People act like it’s impossible. Say that to people in the actual poor countries. It’s a slap in the face - they would die for your opportunity. When I constantly read this shit on Reddit - it’s absolutely infuriating.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "dachuggs",
                                                                    "body": "I am sure people of color and queer would challenge your assessment.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "LakersFan15",
                                                                            "body": "And they are still in position to succeed compared to the rest of the world. I never said we dont need to improve.\n\nAlso I am 2nd generation and I believe I am colorful. Shit my boss is gay. \n\n\nThe woe is me attitude doesn't help.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "dachuggs",
                                                                                    "body": "Do you think the rest of the world is a third world country? \n\nJust being realistic here instead of dismissing and downplaying challenges some of us face.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "LakersFan15",
                                                                                            "body": "No of course not. Again, it's not black and white and would be impossible to discern all the variances. I don't want to reply in detail as I have already and it's hard on mobile lol.\n\nIn general, I get pissed when people from normal situations falter at the hint of difficulty or hardship. There are so many people deserving better that don't get it while people who have the opportunities squander it.\n\nIs it unfair for me to downplay people's struggles? Maybe. But I think it's a bigger slap in the face to all the people who never had a chance to begin with.",
                                                                                            "score": 2
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "IamElGringo",
                                                                    "body": "Well I missed the window to easily jump into college.  I can't for the foreseeable future.",
                                                                    "score": 5,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Acceptable-Ability-6",
                                                                            "body": "Well if you’re young enough you can join the military and get the GI Bill. That’s what I did. What he said about interning is kinda b/s though. A lot of people in college literally cannot afford to work a job for free.",
                                                                            "score": -7,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "IamElGringo",
                                                                                    "body": "I'm 27\n\nI don't believe in getting exploited",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Acceptable-Ability-6",
                                                                                            "body": "Fine man, that’s your choice. Getting exploited got me through college debt free and a cushy civilian job afterwards. It’s all what you make of it.",
                                                                                            "score": 2
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "GlassBoxes",
                                                    "body": ">2. Intern while going to college.\n\n\"Have money so that you can intern instead of working to pay for college.\"",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "LakersFan15",
                                                            "body": "Most internships pay actually. Talk to your career counselor - you will also likely get accepted to a work study program which allows you to work for a wage that is above minimum wage. It caps how much you can earn, but it's doable.\n\nRest are loans, grants, and scholarships. Again. It's fucking hard, but you can do it.",
                                                            "score": 2
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Badoreo1",
                                                    "body": "Don’t even need college nowadays. I’m in trades and have much more upward mobility than most that have a degree.\n\nEducation is increasingly becoming useless. Nothing wrong with that, it just is what it is.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "MiketheTzar",
                                                    "body": "You don't even need that to make it out ok.\n\nTo maintain a manageable standard of living you only need to do 3 things.\n\n1. Graduate high school.\n2. Not have children out marriage/a two parent household.\n3. Be employed full-time.\n\nYou might be living tight, but you can manage.",
                                                    "score": -2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Mathgeek007",
                                    "body": "Employment rate isn't the be-all-end-all of country comfort. Support structures for the unemployed, for one.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LakersFan15",
                                            "body": "Of course. I lived in Europe for a time - the situation for most of Europe is not better than the US.",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "A-passing-thot",
                                    "body": "According to Wikipedia - which could be a bad source - the US ranks 26th for employment, placing us above France (33) but below Germany (7th 4week minimum vacation), Iceland (#1, 24days), Switzerland (3rd, 20 days), Denmark (8, 25 days), Ireland (21, 20days), & UK (10, 5.6weeks).\n\nI'm fairly certain all of those countries have pretty comparably developed economies, better healthcare (especially per $ and in terms of longevity), and more worker rights in general.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LakersFan15",
                                            "body": "France is actually faring okay right now, but historically ranked high in unemployment rates. I'm just trying to imply that too many people think the US is shit and it's sad. Obviously things here can improve A LOT.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Admirable_Ad1947",
                                    "body": "I'd take the tradeoff.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nakfoor",
                    "body": "The US is a huge country and many areas when measured with a human development index are like third world countries.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "trufseekinorbz",
                    "body": "Can and will are two completely different words. Furthermore parts of the US are so bad that the living conditions are similar to third world countries",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "Admirable_Ad1947",
                    "body": ">I’m sick of liberals acting like the US is a third world country\n\nI don't think many liberals/Progressives seriously act like the US is on the same level economically as the Central African Republic or the Congo; this is mostly a strawman to dismiss the reality that the US is inferior in numerous ways compared to our peer.\n\n>Working hard and smart can still get you to a place of comfort\n\n*Can*, as in, only if you're also lucky as well. There are many people who bust their ass day and night to get to the middle class, only for an unfortunate illness or ambulance ride to bring them back to square one (which is actually a risk anytime until you get well into the 6 figures). If you are poor, you're going to be living worse then poor people in virtually any of our peer countries. Personally, I'm sick to death of \"centrist\" liberals dismissing our severe issues because our incredibly geographically endowed country isn't among the literal worst nations on earth.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LakersFan15",
                            "body": "You are describing a situation that is not as common as you think. I'm obviously not saying this is a black and white situation.\n\nI also do think our country is heading in the wrong direction and is completely flawed. However, this does not mean that most people in our country are in a completely shithole situation.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "7figureipo",
                    "body": "I'm sick of how much we fetishize success in business, as if it weren't essentially the result of some random lucky event. Hard work is a required component, but the luck element is absolutely essential, and without it hard work means little. We give too much credit to the wealthy for \"making it\" and not enough *to ourselves* for establishing the society and conditions that make \"making it\" possible.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LakersFan15",
                            "body": "I absolutely agree but it's definitely not what I'm talking about.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jauznevimcosimamdat",
                    "body": "The left is acting like that, though....",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "justanotherguyhere16",
            "body": "That the current system of government is broken and we need to go to a system like Britain has with multiple parties and they (the multiple parties, not Britain) form coalitions to choose the president (which we have, I know Britain has a prime minister) \n\nThat both ranked voting and pool voting would make our politics actually workable.\n\nEdits: the stuff in (), also I’m not saying how Britain does it is the best way, but that is a common enough reference most can get and we can use as a basis to rework it all.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "BoopingBurrito",
                    "body": "I wouldn't call out Britain as the example for that, many European countries do it much better than we do.\n\nIn the UK we have 2 major parties which are big umbrellas covering large portions of the spectrum from the centre out, one left and one right.\n\nWe do occasionally have coalitions, but it's very rare to have a major coalition. There was 2010-2015, but the last coalition before that was in the early 1900s.\n\nMore common, though still quite rare, is a single party government which almost has a majority being propped up by a small party which has just enough seats to push them over the line. They don't get an official say in government but they'll usually get some favourable funding considerations.\n\nA recent example of that was 2017-2019, when the Conservative party was 9 seats short of a majority and they made an agreement with the Democratic Unionist Party (a hard right, religious oriented Northern Irish party) who had won 10 seats. The last time that sort of arrangement happened was in 1977, and that was the first time since WW2.\n\nYou're much better off looking at countries like Germany or Belgium if you want an electoral system that leads to coalitions. Both of those countries have had coalitions continuously for 50+ years.\n\nAlso the UK doesn't have a president 😉",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "justanotherguyhere16",
                            "body": "I know they don’t have a president, but we do. \n\nAnd I used Britain as an example because us Americans are routinely ill informed of the particulars of other countries governments so I used what I hoped was a familiar enough reference as a basic framework for how we could change things. \n\nIt’s not like I suggested a House of Lords and a House of Commons either.  lol.",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "chadtr5",
                    "body": ">That the current system of government is broken and we need to go to a system like Britain has with multiple parties and they (the multiple parties, not Britain) form coalitions to choose the president (which we have, I know Britain has a prime minister)\n\nOver the last decade or so, Britain has had some of the most dysfunctional politics in the developed world.\n\nIf you're into multiparty democracy, they're also a crappy example because they use a FPTP rather than proportional electoral system.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Guilty-Hope1336",
                    "body": "Britain actually doesn't have coalitions.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "justanotherguyhere16",
                            "body": "What Britain doesn’t have is a president.  \n\n“The position of prime minister is usually chosen from the political party that commands - whether by itself or as the largest member of a coalition - the majority of seats in the lower house of parliament”\n\nIf you’re going to argue… at least take the time to be right.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Guilty-Hope1336",
                                    "body": "Coalition governments are pretty rare in Britain. Most of the time the ruling party has an outright majority.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "justanotherguyhere16",
                                            "body": "This is true. But rare still means it happens and as I said it’s an example of the basic framework not a “use this system exactly”",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Corvid187",
                    "body": "Britain has had 1.5 coalition governments in the last century, and other than that power has exclusively alternated between labour or the Tories since the war. \n\nI'm not sure we're a fantastic example of what you're looking for.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "justanotherguyhere16",
                            "body": "A perfect example? No. \n\nA good example: yes\n\nIt doesn’t matter if there are more accurate examples of what I’m comparing it to if it isn’t something others know about.   They need to be aware of the thing you are comparing it to and as stated it’s a general framework we could use to start with. \n\nIt’s like explaining a submarine to someone who has never seen a boat. Is “ a boat that you can seal up to trap air in so you can go underwater” a better analogy than “a sealed container that you can go underwater in and drive around in without dying”?  Yes, but if the person has no concept of a boat it’s useless.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Biden is going to win again.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "capsaicinintheeyes",
            "body": "Abortion is right back with the states, where it belongs.  The personhood of the fetus question isn't a resolveable one in our current moment and it has good-faith actors on both sides.  Combining that with the muddy place between \"health issue\", \"women's issue,\" \"civil liberties issue\" and \"poverty issue\" that it occupies, there is more than one defensible place to end up on it, and hence we should allow for a diverse set of community standards to coexist.\n\n. . . within reason, ofc.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "jkh107",
            "body": "Our federal government is gridlocked and has been for the past few decades. Some people like it that way. Maybe freeing it up would be like releasing a demon from hell. But it would be interesting to live with the consequences of voting for the kind of legislators we have, and see if we really like it, and actually not re-elect the stupid or evil ones, or the ones with really bad ideas. Also the electoral college is stupid and non-democratic. The president should represent the people, not the (actuarially-adjusted) states. Abolish the filibuster and the electoral college!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "insalted42",
            "body": "Any company the willfully reduces staff (read: layoffs) should be required to pay all affected employees at least 6 months of their salary with full benefits. \n\nThis would force companies to reconsider downsizing for \"profits\" and also save the US taxpayer millions in unemployment payments.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "u2sunnyday",
                    "body": "Believe it or not, Republicans are actually working on this.\n\n[Trump-allied Republicans are changing the GOP’s approach to labor, free markets and regulation\n@CNBC](https://www.cnbc.com/2024/05/21/trump-republicans-shift-gop-approach-to-labor-free-markets-and-regulation.html)",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "insalted42",
                            "body": "Impressive! I don't like their reasoning for this (read: the corporate elites are too woke). But I'm glad both parties are heading away from Reaganomics.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "rm-minus-r",
                            "body": "😯",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Throwaway2154387",
                    "body": "As someone who lives in a country with that policy, that's a good way to shoot your economy in the foot. Companies will respond by hiring less people, and trying to have as many employees as they can with contract or non salaried positions.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "secretid89",
                    "body": "Some European countries already do this!  Our turn!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NPDogs21",
            "body": "If you don’t vote or vote for a clearly non-viable candidate, you don’t have a right to complain. Seriously, Trump may win because some privileged, uneducated dipshits in a handful of swing states won’t vote for Biden because they think Trump and Biden are the same. Or they’re going to vote RFK/3rd party to “send a message” which will only help Trump win. \n\nBut we know they’ll be the first to complain if Trump wins. ",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Maz2742",
                    "body": "I've always voted third-party because I live in a Democratic stronghold state. The Electoral College won't let my vote change anything about the election results so it's safe for me to do so, which is the EXACT reason why my voting strategy is dangerous in a swing state",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "> which is the EXACT reason why my voting strategy is dangerous in a swing state\n\nDangerous to who? ",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Maz2742",
                                    "body": "Dangerous to whichever of the Big Two parties you disagree with less.\n\nI worded my comment so it'd equally apply to left-wingers who vote Green and right-wingers who vote Libertarian. I've voted Green every presidential election, which, if I lived in a swing state, would weaken the Democratic candidate's chance of winning the EC votes. Same applies for Libertarian voters weakening the Republican candidate's chance at EC votes.\n\nOf course, that only happens to a severity where it impacts EC votes in a swing state, which my home state is not.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "NPDogs21",
                                            "body": "> Dangerous to whichever of the Big Two parties you disagree with less.\n\nAnd the result would be the worse or Trump/Republicans winning. Is that preferable to teach your side a lesson? ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Throwaway2154387",
                                                    "body": "He said his strategy is dangerous, that's generally not a preferable strategy.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheBROinBROHIO",
                    "body": "I voted for Biden. He was one of my last choices, but I rationalized it as less about the specific people, and more keeping my state just a *little bit* less red and more competitive while I can help it. \n\nBut that said, your argument presumes an entitlement to a vote that is supposed to be earned, and the fact that this is the primary argument for 'why we should vote for x candidate' for the last several election cycles points to a fundamentally broken system that it seems no candidate is interested in fixing. We did the thing we were supposed to do in 2020, and yet Trump remains at the forefront of political discussion, having faced no accountability for anything. \n\nI already know the next step is moving the goalposts to 'well Biden can't single-handedly do everything, that's just the first step' but it's unclear what the next step is or how we feasibly get there, and by that logic Trump should also not be able to do all the terrible things he is seemingly able to get away with.\n\nIf what 'really matters' is down-ballot elections/appointments/everything outside the presidency, it seems the best person to energize and motivate democratic voters toward that goal is... Trump, actually.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "Who do you believe is more likely to move towards goals you support, Trump or Biden? Republicans or Democrats? \n\nTrump is able to get away with a lot because he still has support and people would rather be energized by him than vote for a stable, democratic President. ",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dachuggs",
                    "body": "Disagree. Your hot take is just reinforcing mediocre candidates and false dichotomy.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NPDogs21",
                            "body": "It is a dichotomy, whether you accept it or not, as it’s a 2 party system with first past the post. ",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Malachi108",
            "body": "There can be such a thing as too much immigration.\n\nAlternatively, there can be such a thing as too fast immigration. ΔV/Δt matters as much as ΔV itself.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "TheLastEmoKid",
            "body": "Most social problems we see in today's youth including dropping literacy rates and rising issues in schools are a result of having both parents have to work to support kids.\n\nFor a household to function and students to be successful one person really needs to be able to stay home until kids are at least Jr High aged (12-14)\n\nBoth parents working leads to a lot more parental burnout which is severely affecting the next generations ability to self regulate, know basic facts, have literacy and interest in learning because those traits that used to be taught at home aren't happening.\n\nI don't necessarily know what the solution is - especially when you consider the lasting impacts of patriarchy.   Wages should be nearly doubled, equity should be maintained so that would mean more stay at home fathers, and huge caps on housing food utilities etc.\n\nBasically we would need to reboot society, but as a highschool teacher we are about to run into serious issues in the next five years from a group of kids who are severely stunted emotionally and mentally",
            "score": 2
        },
        {
            "depth": 0,
            "author": "CJMakesVideos",
            "body": "Prison systems in both the US and Canada (i live in Canada so don’t know much about other countries) alow for far too much abuse against prisoners from both guards and each other. I don’t care how bad the thing they did was. We are all supposed to be against cruel and unusual punishment. I would prefer a rehabilitation system like in Finland. Though with the recognition that seriously violent criminals who cannot be rehabilitated shouldn’t be let out. That still doesn’t mean we should allow them to be abused though.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Sarin10",
            "body": "* ACAB is an idiotic slogan\n* We should lay off with the anti-gun messaging",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "rm-minus-r",
                    "body": ">* We should lay off with the anti-gun messaging\n\nNothing like grabbing onto that third rail!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "yasinburak15",
            "body": "That every person should have a national ID. \n\nI got dual citizenship, I got a Turkish identification card to vote, show for whatever reason needed. Similar to REAL-ID \n\nI truly believe this type of system should be adopted and should be FREE.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "jauznevimcosimamdat",
            "body": "Recently, I've learned two hot takes for Reddit:\n\n* Birth rates below the replacement rate (2.1 children per woman) combined with an aging populace are a serious issue\n   * Though, it seems to be really hard to find strong long-term solutions because short-term boost in birth rates might easily lead to economic disaster in 40-60 years\n   * Young people are especially screwed by demographic dynamics because more and more pressure will be put on them regarding social safety nets and senior pensions (at least in many European countries) and thus taxation\n      * These current dynamics seems to be one of the reasons why current democracies favor older generations. Old people tend to rely on state subsidies more (they don't and anymore cannot work) than young people who usually just want to have equal opportunities and be left to live their lives their own way.\n      * So old people (who are getting bigger in numbers recently) are incentivized to push for policies favoring them and hurting young people because their living standards depend on it\n      * And young people get increasingly fed up with the democratic system of decision-making because it f's them and doesn't help solving their own issues\n* Immigrants need to learn the language and be willing to work\n   * To preface it: I am all for open borders.\n   * If an immigrant isn't willing to work, they don't contribute anything to the society they migrated into.\n   * If an immigrant isn't willing to learn the majority language, they will have much harder time living in the society they migrated into.\n      * An American coming to my country, Czechia, and not willing to learn Czech will likely be retreating to a English-speaking expat community and essentially become an outsider in the country they live in.\n      * In Czechia, we can easily see this issue with old Vietnamese generations themselves living in rather secluded Vietnamese community while their children and grand-children are encouraged to learn Czech (kinda had to due to education system) so they can live better lives here\n\nMy old personal, and dusty, hot take:\n\n* Modern liberal monarchies would work better than modern democracies\n   * Admittedly, I have a romanticized view on medieval ages\n   * The issue with democracy is misinformed voters hold the most decision-making influence, therefore, making it easier for some threats to exist (eg. populism, the threat of a democracy turned authoritarian by \"the will of the people\"). \n   * But in the contrast, good-quality democracy supposes well-informed voters are in the majority and thus, would ultimately prevail over misinformed voters. \n   * In a monarchy, the monarch is incentivized to put themselves at the front but also, they need to \"bribe\" the common populace with good policies (that might have long-term nature) while democratic leaders usually \"bribe\" the common populace with short-term gifts and unfulfilled unrealistic promises\n      * Also, a monarch (and their families) is supposed to be educated in statecraft while democratic leaders could easily be some random sh\\*theads like Trump.\n   * To be frank, I've never tried to figure out a strong checks-and-balances system but I dare to say it could be invented.\n   * In the end, I've abandoned having this position seriously years ago but the criticism of democracy stays with me. Also reading and understanding this last bullet point will prove me you've actually read my whole piece about modern liberal monarchies versus modern democracies",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jauznevimcosimamdat",
                            "body": "Interesting perspective, thanks for that!\n\nTo add to this:\n\nI agree we Czechs seem to be tribalistic a lot more than elsewhere and have issues accepting foreign influences. \n\nThough, and I don't know how much experience you have outside Prague, if we Praguers feel you are a foreigner you're gonna get \"be pleasant to foreigners\" behavior while we are more critical of each other as Czechs. It's kinda hard to know what you are talking about specifically.\n\nIt's more complicated than that of course but I think this is the jist of it.\n\nAlso, I dare to say Prague is (maybe with Brno) the only cosmopolitan place in the country. Trying to live in smaller town like Pilsen or Budweis whilst just being a foreigner will be 100 times harder than in Prague.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Weirdyxxy",
                    "body": "... And there goes my response vehemently disagreeing with every single part of your take. I think I can still point out two things, though:\n\n\n>In a monarchy, the monarch is incentivized to put themselves at the front but also, they need to \"bribe\" the common populace with good policies (that might have long-term nature) while democratic leaders usually \"bribe\" the common populace with short-term gifts and unfulfilled unrealistic promises  \n\n\nMight have long-term nature, sure, but don't usually - for almost the same reason it's that way in a democracy (you want to throw the people a bone so they don't raze your castle, but that's basically it). But the difference is that in a democracy, the leaders have to get the support of their people, while a monarch only needs its obedience. Obedience can also be ensured with repression \n\n\n>Also, a monarch (and their families) is supposed to be educated in statecraft while democratic leaders could easily be some random sh*theads like Trump.  \n\n\nA democratic leader goes through an approval process, a monarch usually doesn't. And Trump didn't occur \"easily\", but was the result of quite a few things happening together. He was the only US President without any prior political or military experience, out of 45.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jauznevimcosimamdat",
                            "body": ">And there goes my response vehemently disagreeing with every single part of your take\n\nDon't worry, I've got plenty of disagreement here in the past regarding the first 2 hot takes.\n\n>Obedience can also be ensured with repression \n\nI think this is an outdated anti-monarchist opinion. Liberal monarchies wouldn't need to rely on repression to the degree democratic-minded people seem to suggest. They would mostly rely on good long-term policies. The incentive is clear. Good long-term policies ensure a good economy and thus happy people who won't feel the need to rebel against the crown.\n\nAlso, in democracies, political leaders rarely get the support of the people. It's usually the biggest minority ruling over others. Actually, more often than not, non-voters are the biggest chunk of the population.\n\nAnd it's not like people nowadays don't feel repressed in democracies. For example, the sentiment against mainstream media is mostly the feeling of being repressed by liberally-minded democrats (not meaning the US party).\n\n>A democratic leader goes through an approval process\n\nThe approval doesn't equal quality statecraft.\n\nTrump is an example. There are plenty of incompetent political leaders in democracies, at rates that one might easily lose faith in humanity (and democracy).\n\nAnd that a politician is in power for 8-10 years doesn't mean they became good at statecraft. Monarch being educated in that makes it much more probable.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Oberst_Kawaii",
                    "body": "Adding to your first point, which is very true indeed: We have to significantly cut retirement benefits for people without children. There is simply no longer an incentive to have any kids at all. The costs of raising kids are individual, the benefits of having them are nationalized. The costs of not having kids are also widely nationalized. If you don't have kids, you also don't have to worry about your inheritance. You can just blow out all of your earnings towards the end of your life and then have the government step in to pay for your assisted living, if the need arises. My parents had to bear those costs for their parents AND have to worry about what they're leaving for me and my sister.\n\n  \nThe fact that nobody questions this system is wild to me. It borders insanity and destroys my faith in democracy.\n\n \n\nAverage life expectancy has also risen drastically. Over here in Germany we spend an annual 1.1 trillion Euros in social spending, two thirds of which are just retirees, strongly disproportional health care costs, retirement and state pensions. That's about 700-800 billion annually. This is the same amount the US spends for its entire armed forces, discretionary spending and otherwise. Germany's boomers cost as much as the entire US military. (Our economy is a sixth of yours) \n\nLet that sink in. \n\n  \nAnd I do think the boomers really feel they are entitled to endless wealth and growth, without bearing any of the burdens, be that in raising children or paying taxes.\n\nMy cousin's neighbor is a boomer engineer who constantly complains about how lazy Gen Z is and asks who's gonna pay for his retirement. Guess how many kids this fucker has. Exactly: Zero. Doesn't like immigration either and he has a very high standard of living. If you bring any of this up with a boomer, even those who did have two kids, they usually get extremely defensive and start deflecting.\n\nPeople like that engineer must get fucked hard and get a reality check, asap.\n\nUnfortunately, it is a vicious cycle, like you mentioned. If we can't break out of this downward spiral I really fear that we are fucked. As costs increase further and further, the boomers are also going to dig in their heels more and more and the can will get kicked down the road into perpetuity.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jauznevimcosimamdat",
                            "body": ">We have to significantly cut retirement benefits for people without children\n\nAs someone who'll mostly likely end up without children, I must say this is the true hot take, lol.\n\nBut yeah, pension systems (at least in Europe) are a vicious cycle where it's actually hard to blame people on \"both sides\".\n\nYoung people see the prospect of increasing pressure on higher taxation (eg. retirement contributions) with aging population as something not to look forward to (a hindrance of their own economic wellbeing). Heck, I remember 20 years ago how older people were telling us children that we won't enjoy the retirement and we stupidly laughed it off.\n\nAnd old people feel entitled because they paid tons of money to their older generations, while it was and still is constantly framed they themselves are saving for the retirement. Obviously, they expect the same from younger generations. That they will happily hop in to participate in a hugely disadvantegeous system.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SovietRobot",
            "body": "We also have the unique right to utilize guns for self defense. \n\n\nThe issue with the gun control argument is always that it focuses on gun crime and gun deaths and throughly discounts gun utility in like the form of self defense. \n\n\nBut why does it need to be a right? Because otherwise local and State governments will (despite your personal assurances that you don’t want an gunless society) make it such that it’s impossible for people to own guns for self defense. It’s like asking the question - why does / did abortion or LGBTQ, etc need to be protected as part of the Bill of Rights? Because otherwise States can effectively ban it. \n\n\nTake for example New York. Just 10 years ago it was impossible for the average person to have a gun (any gun) for self defense even at home or within their place of business. You had cases where people had been robbed and attacked and injured multiple times at their business or in their home and New York still denied them gun permits. It was effectively a ban. Meanwhile the governor could have a gun for self defense. His body guards could have guns for self defense. So could the mayor. So did Trump have a gun also. Without it being a right - you get classism. \n\n\nIt was only after Heller and Bruen cases that the Federal Courts determined that New York was actually trampling on the rights of the common person in being able to own a gun for self defense - that New York was forced to allow such. \n\n\nBut don’t take my word for it. Read it from the largest association of New York black / minority public defenders:\n\n\nhttps://www.bronxdefenders.org/supreme-court-strikes-down-the-carry-provision-of-new-york-states-gun-licensing-scheme/\n\n\nThings that are not rights lead to classism and discrimination. \n\n\nBut also that doesn’t mean that rights are unlimited. The first amendment isn’t unlimited. You can’t just threaten someone with no consequence. Same for guns. We already have gun laws in place today from background checks, to age limits, to licensing requirements, to business trade stipulations, to carry stipulations and to use stipulations.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "7figureipo",
            "body": "I abhor religion, in all forms, and wish it would be eradicated. It has no place in a modern, civilized, rational society, and has historically been and is currently a direct cause of a substantial portion of suffering world wide. I'd never advocate banning it outright (a futile effort). I would prefer we go much harder at curtailing its reach (limiting or banning K-12 religious schools, banning the use of religious teaching in homeschooling, not permitting qualification as a tax exempt organization simply because it is a religious organization, etc.) and enacting/enforcing laws and regulations banning political campaigning in religious venues. Religious people are entitled to their beliefs and to speak freely about them, as wrong and backwards as they are. They are not entitled to thrust that religion into the body politic, and we should clamp down harshly when they do.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "thinjester",
            "body": "real estate investing should be illegal. no need to purchase a home unless it is going to be your primary residence.\n\n“passive income” by purchasing homes and renting them out is predatory and unfair.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "AquaSnow24",
            "body": "Not sure if this is unpopular but i think it’s depraved when someone wishes for Biden and Trump to die just to get a new set of nominees for President. That to me is depraved . I get not being happy with one or the other but to wish death upon them just to get a new set of nominees , to me is sickening. Maybe I’m overly sensitive but I find such comments incredibly inappropriate.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "sadetheruiner",
                    "body": "I want Trump to lose fair and square, but I do want him to die in prison. Not wishing death on him, just hoping he spends the rest of his life there.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "chadtr5",
            "body": "Spiciest:\n\n* We should abolish the US Army.  The Marine Corps should become our primary land warfare force.  Most Army capabilities would be eliminated; a select few would be transferred into the Marines.  We should keep and expand the National Guard, though.\n* We should ban health insurers from negotiating rates with providers.  All healthcare pricing should be exactly the same regardless of who pays.\n* We should attempt to convince the Bahamas and the Canadian provinces other than Quebec to join us as states.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "\"The United States of Earth\"",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "TonyWrocks",
            "body": "My platform:\n\n*  Free healthcare for all citizens - Medicare for All, with employers offering supplemental plans if they so choose.  This limits exposure for employers and allows them to continue to differentiate themselves,  but removes their literal life-and-death authority over wage earners.\n\n*  100% responsibility for how your firearm is used and 100% federal registration required or it's confiscated and destroyed.\n\n*  Independently verified health and civics tests and full financial disclosure for all political candidates for every office, with the results made public as a condition of appearing on the ballot.\n\n*  Rotating 5-year Supreme Court duty among the chiefs of the various circuit courts, after which they return to the circuit courts to finish out their lifetime appointments (or retire)\n\n*  Return of the Equal Time/Fairness doctrine for all media organizations (even those on cable) who report on the events of the day.\n\n*  Massive investments in civics education at all levels of the American educational system.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Kalipygia",
            "body": "\"America\" as most people know it, is already dead, or at the very least it is beyond saving at this point. No progress will be made until the next iteration is established. I'm terrified of what that might look like.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Kineth",
            "body": "I know this will seem like it's against the political affiliation I have, but there definitely needs to be some price fixing on some goods and labor.  The latter isn't controversial since that's what minimum wage is, but I'd have it go beyond that in that the wages of the workers/labor has to be the higher of two: the federally listed wage or a percentage in relation to the pay the board of directors or to profits.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "MuaddibMcFly",
            "body": "That \"voting for the lesser evil\" is probably a *good* thing, given the mathematical effects of the most common voting methods, a good thing that RCV eliminates.\n\nDo I *like* the fact that FPTP and RCV effectively forces us into a two party system?  Of course not, which is why I push for Score voting.\n\n...but people voting for the Lesser Evil does, in fact, ensure that we aren't stuck with the Greater Evil.  ...but RCV short circuits that, making things better for *individual* voters while making things worse for the electorate *as a whole*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ApexTitanKong",
            "body": "This shouldn't be one, but Youtube comment sections make me wonder otherwise, so here it goes:\n\nFuck Nazism.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "_TheJerkstoreCalle",
            "body": "it’Ll never happen, but I tend to agree",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NoExcuses1984",
            "body": "Forget rightist fascism or leftist authoritarianism, for centrist tyranny flies under the radar.\n\nThink Pinochet's tyrannous neoliberalism, which we see much of today in a myriad of ways.\n\nAnd not all tyrannical governments, moreover, have an autocratic leader, nope; bureaucratic totalitarianism is its own monster.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "invadrfashcag",
            "body": "The US government should buy out all of its investor-owned oil and gas companies - Exxon, Chevron, Sunoco, Valero, etc, and remake standard oil as a government owned business the same way that Amtrak and the USPS are. (Not including BP and Shell because they’re British) \n\nThe government would be able to self regulate oil, balancing the environment with demand, and have more leverage over the rest of the world, and we would be directly voting for their board in elections. The new Standard Oil would, in theory, be more inclined to implement climate change solutions since we the people are directly voting for their board. The US would also be able to have more leverage over other private companies, forgoing typical FTC lawsuits and rules and just cut their oil supply. It could further price BP and Shell out of the market if it wanted all oil and gas to be American, and with all the money going back to the government, national fuel taxes wouldn’t be a thing (though state fuel taxes could still exist), lowering gas prices for Americans, and raising them when necessary to encourage hybrids and EVs",
            "score": 1
        },
        {
            "depth": 0,
            "author": "invadrfashcag",
            "body": "The American people should be able to vote to nationalize specific hated private companies (like Ticketmaster and Comcast) at will in 4 year election cycle, but to discourage gaming the system, require a 2/3rds majority",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kbeks",
            "body": "We need to reform the senate by splitting California and Texas into three states each and New York and Florida into two each. We should also start combining the smaller ones. States shouldn’t be less than 0.5% or more than 4% of the national population to ensure adequate representation in the senate.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PlopsMcgoo",
            "body": "There should be an option of \"no valid options\" people can vote for in elections. If it wins, both candidates are publicly executed.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rogun64",
            "body": "I believe Dan Rather was setup by Sumner Redstone at CBS. Redstone was the chairman of Viacom. Viacom had acquired more assets and was being forced by regulation to spin off CBS. Although Redstone was allegedly liberal, he made news before the 2004 election, when telling his peers that he would endorse President Bush. \n\nAfter the election, the FCC attempted to change regulations without giving the required public notice. Redstone had lobbied for this change in the hope that it wouldn't be necessary to spin off CBS. But news of the regulation changes spread online and both sides of the aisle were angry about it. This was effective because the FCC backed down and Viacom was forced to spin off CBS. \n\nUnfortunately, the FCC later did change the rules (I think while Trump was President) and they did it without a whimper, this time. Viacom immediately rolled CBS back under it's wing afterwards.\n\nRegardless of whether the story that got Rather fired was true or false, I think Redstone made a deal for it to happen, in a failed attempt to save Viacom from splitting. And it would have worked had news of the changes not leaked, causing an uproar from both sides. I watched C-SPAN the morning after the news broke and people were extremely angry about it. Now ask yourself who would benefit from Rather's story being labeled as untrue, which would cost him his job at CBS?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AntiWokeCommie",
            "body": "China and Russia have better foreign policy than the USA.\n\nThe USA is just as much of a surveillance state, if not more, than China.\n\nThe US/NATO shares some blame for the Ukraine war and shouldn't spend anymore on this war.\n\nThere isn't sufficient evidence that there is a genocide in Xinjiang, and China treats Uighurs better than Israel treats Palestinians (though I don't condone China's treatment either).\n\nPeople should fear the propaganda of their own state more than the propaganda of foreign adversaries.\n\nBush was worse than Trump.\n\nThere is no significant difference between Ds and Rs on economic and foreign policy.\n\nThe USA is more of an oligarchy than a democracy.\n\nI also have a bunch of takes that are controversial on reddit, but aren't that controversial irl. I don't know if that counts.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Ukraine and the south China sea....",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AntiWokeCommie",
                            "body": "Yes, and do you know how many countries the US has couped, bombed, and invaded, post WWII?\n\n[https://williamblum.org/intervention-map](https://williamblum.org/intervention-map)\n\n[https://en.wikipedia.org/wiki/United\\_States\\_involvement\\_in\\_regime\\_change](https://en.wikipedia.org/wiki/United_States_involvement_in_regime_change)\n\nAnd which country has 800+ military bases all over the globe?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "Irrelevant though \n\nAt best its whataboutism",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AntiWokeCommie",
                                            "body": "What are you trying to say? I didn't say anyone was particularly great.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Morning_Dove_1914",
            "body": "Maybe not a hot take but every political leaning is understandable. As in, even if someone's logic is flawed, there is almost always a line that you can trace from them that eventually winds back to \"I think this will make the world better for more people\". Huge asterisk there, because obviously there are unconscious biases and perspectives that change what someone thinks a better world would look like. But I try to recognize that, on a very fundamental level, most of the people I disagree with politically in my life are decent people who are willing to stick their necks out for others. The main takeaway being that you can still take valuable lessons and ideas from ideologies you vehemently disagree with. \n\nFor example, I am not and never will be a Nazi sympathizer, but I try to recognize that the Nazis took root and were successful because there were factors at play that made many Germans feel supporting Hitler was the way to a better and happier world at the time, or at least a better and happier Germany. Flawed af logic, morals and means, but on some level you have to remind yourself that people believe things because of other things they had no control over influencing their psychology, just like you! So you shouldn't necessarily agree with them, but you shouldn't mindlessly hate and disregard them either. \n\nTL;DR be civil with people you disagree with politically, because even if they're very misguided or angry that likely originated from a place of wanting to improve something they felt was unfair/still do feel is unfair. And you might learn something you didn't know before.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ManufacturerThis7741",
            "body": "As a man, I'm tired of hearing about male loneliness and how men can't get dates yadda yadda yadda.\n\nBecause it's entirely their fault. Just look at the Twitter feeds of some of these \"lonely men.\"\n\nThey talk like wife beaters and rapists from a Lifetime TV Movie.\n\nSeriously, I want a \"male loneliness epidemic\" news story where the reporter just reads the Tweets where they fantasize about getting a passport to a country where the women have lower standards and getting a young naive woman to marry them. Or the Tweets where they complain that being expected to do a marginal amount of housework is misandry. Or the Tweets about repealing the 19th Amendment. Or the Tweets where they're just openly rape-y.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "I think they could be victims of their upbringing",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ManufacturerThis7741",
                            "body": "Possibly but most of these people are adults now. They can choose not to talk about women they were brought up to or they can be lonely.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "It's not really that simple",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ManufacturerThis7741",
                                            "body": "Yes it is.\n\nThere's always a choice.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Character-Tomato-654",
            "body": "My personal take is that the ongoing criminal organization known as the G.O.P. ought to be brought up on RICO charges within the states first and then on the federal level. \n\nI think they ought to be prosecuted and disbanded *in total*.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "moonflower311",
            "body": "I am not against vouchers for private schools.  I do think in order to receive state money the school needs to be secular and take every category of kid (lottery is fine but sped low ses needs to be included at the same rates they occur in the general population) or be a specialized school that fits a particular need (speech, autism etc).  Sometimes things happen where a kid needs to leave their local school due to bullying violence extreme low performance etc. and there should be options other than moving.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hitman2218",
            "body": "Prohibition should’ve never been repealed.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Why",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hitman2218",
                            "body": "Because the negatives of alcohol outweigh the positives.",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "Dont people have a right to fuck up their lifes?",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "Sure, but unfortunately they wreck a lot of other lives too.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "IamElGringo",
                                                    "body": "Yeah but abuse is already illegal",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hitman2218",
                                                            "body": "Abuse?",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "IamElGringo",
                                                                    "body": "Battery",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "hitman2218",
                                                                            "body": "Yes, battery is illegal. But that doesn’t mean it’s going to be reported or prosecuted. \n\nThere’s also other issues like drunk driving and loss of productivity in the workplace.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "IamElGringo",
                                                                                    "body": "Drunk driving is also illegal, I'm indifferent to that",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "hitman2218",
                                                                                            "body": "Yes, it is illegal. But it happens and it destroys a lot of lives.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "IamElGringo",
                                                                                                    "body": "I don't think you can ever stop that \n\nPeople are going to drink and drive",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "hitman2218",
                                                                                                            "body": "Drunk driving has declined pretty drastically since the 70s with tougher laws and social change. But we could do better.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "IamElGringo",
                                                                                                                    "body": "Perfection is a endless pursuit",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "hitman2218",
                                                                                                                            "body": "Not necessarily. Car companies are currently working on technology that could put an end to drunk driving.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "IamElGringo",
                                                                                                                                    "body": "They'd put a end of driving,soon you'll be able to drink and get droved",
                                                                                                                                    "score": 1
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "justsomeking",
                                    "body": "But do the positives of prohibition outweigh the negatives? Prohibition lead to increased crime, and people didn't stop drinking.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "It actually did result in fewer people drinking overall. And while it led to the rise of organized crime, other types of crime decreased. It was a tough scenario. Governments were looking at all sorts of ways to pull us out of the Depression and repeal was one of them. Had they been able to stick with it I think they’d have realized the benefits.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "justsomeking",
                                                    "body": "Interesting. I'm not super familiar with it, but I feel prohibition never had a real shot in America.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Mrciv6",
                                    "body": "But prohibition was a complete failure and never worked, and made things worse.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "It wasn’t.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Mrciv6",
                                                    "body": "You're being disingenuous, it was a total failure.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hitman2218",
                                                            "body": "No it wasn’t. Prohibition reduced alcohol consumption by a third, led to a decrease in various crimes and also improved the overall mortality rate.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "IamElGringo",
                                                                    "body": "And a increase of deaths and organized crimes",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "hitman2218",
                                                                            "body": "As I just said, the mortality rate declined during Prohibition.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "IamElGringo",
                                                                                    "body": "How bout deaths from alcohol poisoning?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "hitman2218",
                                                                                            "body": "Those obviously rose lol",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "IamElGringo",
                                                                                                    "body": "Because everyone drank unregulated bottled lightning",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "hitman2218",
                                                                                                            "body": "Not everyone, no.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "IamElGringo",
                                                                                                                    "body": "Mostly \n\nBeer and wine went down, hard alcohol went up",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lyman_j",
                    "body": "Oooh. Counterpoint: all drugs—every single one—should be legal, regulated, and taxed for people over the age of majority.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheBROinBROHIO",
                            "body": "I propose a third option: decriminalization without legalization. \n\nDrugs are not all the same. We've worked out frameworks on how to do some of them responsibly- i.e in specific amounts, at certain places, without doing anything that could create a danger to other people, but some of them are just too unpredictable to ever do that. Consider fentanyl- how would we regulate that? How can we even experiment with it to find out more without risking subjects getting addicted or dying outright? And for whose benefit would it all be for? \n\nAnd for drugs that are not quite as extreme, legalization would ultimately lead to commercialization and wider usage. If the intent is to keep cartels and other nefarious actors from being the profiteers, this *needs* to happen, and I would counter that having legal corporations being the dealers isn't that much better. I look at the tobacco industry for an idea of what legalization would look like.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lyman_j",
                                    "body": "Decriminalizing doesn’t do anything to address the overdose crisis. People need to know what they’re ingesting, including purity and potency.\n\nDecrim doesn’t accomplish that because there would be no legal market; transactions would still occur in gray or illicit markets.\n\nLet someone go into a Walgreens or CVS or their local pharmacy and ask the pharmacist for pure, medical grade drugs. Just like we have liquor stores where people know the purity and potency of what they’re getting.\n\nA huge issue is tainted supply, and decrim just doesn’t address it.\n\nEducate people about the harms (and benefits) of drug use then let them make an informed decision on what to do with their own body.\n\nThere’s no reason we cannot treat all drugs like alcohol, which is arguably worse for both personal and societal impacts.\n\nAlso, is big tobacco out there fighting turf wars and murdering innocent lives, by the way? I must’ve missed that.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheBROinBROHIO",
                                            "body": "You say this like the choice to do things like meth and heroin are based in reason and that people who do those drugs just aren't educated on them well enough. I can attest that multiple people from my high school have ODed despite going through the DARE lectures and nobody thinking of such drugs as 'safe.' In fact, I had a friend whom I personally begged to not get into smoking tobacco, who was 'smart' by all accounts, but insisted she knew herself well enough that she could manage any addiction. She couldn't and is now addicted to meth and who knows what else. \n\nSuppose all that stuff becomes legal tomorrow- would you go to your pharmacy and buy some ice? Would you be fine with your friends or family doing it? \n\nWhat if I, a responsible consumer of legal heroin, decide that the pharmacy-grade stuff just doesn't cut it anymore and I need a dose that would kill most people to get my fix? Who will give me that, and how?\n\n>Also, is big tobacco out there fighting turf wars and murdering innocent lives, by the way? I must’ve missed that.\n\nNo, but I guess you did miss the massive disinformation campaigns and political clout they used to wield because people dying quietly of something completely preventable isn't a problem to you.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lyman_j",
                                                    "body": "DARE from the 80s, 90s, and early 00s was entirely fear driven, not factually driven. Fear tactics are not conducive to making an informed decision. It’s slightly better now, but it’s still primarily geared at scaring people out of trying drugs instead of allowing them to make an informed decision. \n\nAnd for a lot of people, it **is** based in reason because they’re trying to escape the reality that they live in and the bit of reprieve they get while high makes an otherwise painful existence tolerable!\n\nTake, for example, smoking. Those are fact driven campaigns to inform people about potential side effects of smoking and tobacco use, and smoking rates are the lowest they’ve been in history!\n\nAlong with legalization, taxes would (and should) be used for mental health and addiction services as well as Safe Consumption Sites.\n\nLastly, most people move on to “higher grade stuff” because of tainted supply, not because they want to. Yes, tolerance is a thing, but it can be mitigated by making sure folks using heroin are using heroin rather than heroin cut with fentanyl, ultimately leading them to fentanyl altogether.\n\nOh, also, Big Tobacco deceiving consumers was a regulatory issue, but they fixed the regulations and you no longer see that as prevalently, and certain types of advertising is banned altogether.\n\nAll of this comes from both my time working in drug policy *and* my personal struggles with addiction and recovery.\n\nI personally don’t believe using drugs should be a death sentence. The only way to remedy that—because people are going to use drugs—is to make it as safe as possible.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CarrieDurst",
                            "body": "At least the ones less dangerous that alcohol, which is most of them...",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Helicase21",
            "body": "You want controversial, how's this: we should conduct a national-scale culling of outdoor cats. Kill them all. Do it as humanely as possible but make sure they end up actually dead. Trap-neuter-release isn't enough to protect bird, insect, and small mammal populations from the single biggest threat they face. War on drugs? No. War on cats.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ptcruz",
                    "body": "I don’t know about culling, but something clearly needs to be done regarding cats.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Megalomaniac697",
            "body": "Socialism bad",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Laissez-faire capitalism is bad",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "echofinder",
            "body": "I'm with OP on the 2A thing.\n\nAlso, I would support very strict limitations on residential lot size and residential land use. I have never thought this out in detail, bc it is not realistic so there's no point, but the idea is to prevent houses on large plots of mowed lawn.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "sadetheruiner",
                    "body": "I’m going to have to disagree on this. I do dislike denaturalized plots of land with no purpose but I like having my little forest yard. Does the town yell at me for not mowing? Yes but I like my yard to look natural.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "echofinder",
                            "body": "Oh, that would be cool. Specifically cleared, mowed, monoculture grass would be limited; woods, ag, garden, proper meadow would all be ok. If it's beneficial native-focused ecosystem, there's no limits",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sadetheruiner",
                                    "body": "Yeah my grass is all native as are the trees. My garden is behind my house, mostly tomatoes and strawberries. I have a few plants around that aren’t from the area but no lawn at all, lawns are stupid.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Admirable_Ad1947",
            "body": "Nations as they current exist are an outdated concept, and we should be striving to form a united front consisting of all of humanity.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "u2sunnyday",
                    "body": "This\n\nIntelligent life (Aliens) must see us as extremely stupid. We have all our guns pointed at each other.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ChildofObama",
            "body": "The DNC will pay Kamala Harris go away money to not run for President in 2028, on the basis that she’s unelectable. \n\nThey’ll pay off Gavin Newsom to not try either.\n\nIn this Post-1/6 climate, party leadership more than likely wants one candidate running unopposed for the sake of party unity. I could see Gretchen Whitmer getting it tbh. The DNC is gonna be offering ‘unelectable’ candidates incentives to stay out of the race.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Nobhudy",
            "body": "Human equality and natural liberty",
            "score": 1
        },
        {
            "depth": 0,
            "author": "darthreuental",
            "body": "By September, nobody will care about Gaza anymore. \n\nOnce the IDF finish clearing out Rafah and exit Gaza over the course of the summer, the Gaza invasion will cease to be a political story in the USA as national focus turns towards the election.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NocturnalLightKey",
            "body": "We need a mandated service for all people 18 or over, UNLESS they are already employed or are in some form of schooling. This can also obviously be military service. This can be working for the ASPCA if need be. Anything to make young people learn the value of their impact.\n\nAlso not voting democrat because you think both sides are the same is just as bad as voting for Trump.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AuthenticHuggyBear",
            "body": "Since everyone hates a \"both sides\" take: Capitalists are right about economics, socialists are right about the mentality it creates. \n\nThe left-right political axis is stupid, especially when people start splitting hairs over what counts as center-left vs. center-right.\n\nPutin would never have invaded Ukraine if Hillary Clinton had won in 2016.\n\nCareer politicians are a good thing.\n\nEven many of the most informed voters fail to consider when the government is being proactive or reactive when examining the sociopolitical climate.\n\nIn comparison to all the presidents in US history, Ronald Reagan was just kind of below average. But that says more about how bad the worse presidents than him were than it does about himself.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TigerUSF",
            "body": "Tax returns should be public record.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "thoughtsnquestions",
            "body": "In 2008, under Bush, NATO met to discuss the idea of Ukraine and Georgia going on a Membership Action Plan, Germany, France, The Netherlands, Italy, Belgium, etc.... all strongly opposed this idea.\n\nThey believed that we if put them on this plan, it would result in military conflict or war with Russia. As they wouldn't be a NATO Member, it would also mean we wouldn't come to save them... \n\nDespite their strong opposition and concerns raised, the US, under Bush, spearheading the move and consequently Georgia and Ukraine went in the Membership Action Plan.\n\nAs predicted, military conflict and war followed.\n\nThere was always a small possibility that war wouldn't happen but Bush knew war was the likely outcome. He was willing to let Georgia and Ukraine fall into war with Russia, it benefits NATO as it weakens Russia, we don't risk anything... Ukraine and Georgia risk it all. My controversial take is that these two nations were likely a sacrificial pawn in neocon geopolitics.\n\nAnd yes, Russia is in the wrong, and yes, Ukraine and Georgia are sovereign nations who can do as they please.... **Obviously Russia is the villain, they attacked innocent countries killing innocent civilians**..... but we can also condemn others, looking at the wider picture of geopolitics, why did Bush ignore the concerns and the strong opposition from allied European NATO members?",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "jauznevimcosimamdat",
                    "body": "Without Putin, all of this would have never happened. \n\nIf Russia welcomed the Western democratic system with open arms, today, we might have talked about Russia joining NATO and EU. It's solely Russian fault they clung to their old imperialism and have geopolitical insecurities, leading to becoming the European villain of the 21st century.\n\nThat's my hot take.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Billych",
                            "body": "Revisionist history. The Russians wanted to vote in Gennady Zyuganov and a social democratic system similar to Austria or Sweden (which was literally his campaign promise), while the Neoliberals decided to support Boris Yeltsin and even did a whole Times Magazine spread about interfering in the election and helping him win even though was hated more than Stalin by Russians, which is a literal quote in the article.  His American advisors were even asked to tell him to call off the election if he was going to lose, which is another quote in the article. \n\nThe belief among Russians is that Yeltsin didn't even win the election and the results were faked. It's a bit misleading to not mention the whole blatant interference in the 1996 elections and why they gave up on democracy. For example, when Pompeo says 'We lied, we cheated, we stole' he means in Bolivia where they sponsored a coup against Evo Morales... in Bolivia.\n\nThis is hardly democracy. Advertising it as Russians have to live in Yeltsin's oligarchic hell of a Russia forever is not a serious attempt. Does the Times Magazine article instill faith in democracy among Russians, do we think they can't read it because its in English?\n\n[TIME Exclusive Yanks To The Rescue](https://archive.org/details/TimeUSMeddlingOnRussia)\n\n[How Russia starves: the famine of 1992 | Green Left](https://www.greenleft.org.au/content/how-russia-starves-famine-1992)\n\n[Causes of declining life expectancy in Russia](https://pubmed.ncbi.nlm.nih.gov/9508159/)\n\n[Pompeo Calls It 'Democracy' in Bolivia as Post-Coup Violence Grows and Fear of Civil War Intensifies | Common Dreams](https://www.commondreams.org/news/2019/11/22/pompeo-calls-it-democracy-bolivia-post-coup-violence-grows-and-fear-civil-war)",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jauznevimcosimamdat",
                                    "body": "Name more iconic duo - Socialism and revisionist bullshit history.\n\nSure, no true ~~Scotsmen~~ Russians wanted to vote for evil \"neoliberal\" Yeltsin, yet he gained 10M more votes than your commie savior Zyuganov.\n\nI am not even defending Yeltsin. I don't give a damn about him. I am just stating it's Russians own fault they decided to go the path of nostalgic Soviet imperialism",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "thoughtsnquestions",
                            "body": "I agree. Is that really a hot take? Pretty sure 99.99% of people agree on that.\n\nBut Bush still ignored Germany, France, Italy, Belgium, the Netherlands,etc... in their strong opposition, noting concerns that military conflict and war might follow. Did it actually help Ukraine and Georgia to go on this plan, or was Bush willing to let Ukraine and Georgia be sacrificed as a pawn in geopolitics?",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jauznevimcosimamdat",
                                    "body": "Hot takes are relative. Pretty sure the majority of people sharing your sentiment about NATO-Russia relationship would see my comment as a hot take.\n\nFrom my rather uninformed view of Bush's thinking, I'd say it might seem like a geopolitical win-win situation.\n\nIf Russia let it happen, Ukraine and Georgia become closer to the West and the US.\n\nIf Russia goes to war because of this, it will f own relations with Europe and the US.\n\nObviously, I am working on a hypothetical of what you said is correct to some degree.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "That's not putins call",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thoughtsnquestions",
                            "body": "We're in agreement that it's not Putin's call.\n\nThe question is, when many European countries strongly opposed Bush is pushing for Ukraine and Georgia being put on a Nato Membership Plan, noting concerns that it might result in military conflict and war for them.\n\nWhy did Bush push on anyway? If that outcome was known to be likely.... theh why?\n\nDid the US note care if thag was the outcome? Many here note the benefits of the war, hurts the Russian army, etc... was that the goal?",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "If the people of Ukraine want in we should let them\n\nI wish we did make them a nato member back then",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thoughtsnquestions",
                                            "body": "I'm not sure why you keep ignoring the 1 question I've asked multiple times?\n\nMy question was about Bush.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "IamElGringo",
                                                    "body": "Buch can occasionally be based",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "thoughtsnquestions",
                                                            "body": "To clarify,\n\nDo you agree that Bush recognised the risk that this decision would likely lead to a war in which Ukraine and Georgia would be sacrificed in order to achieve a geopolitical win for the US?",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Weirdyxxy",
                    "body": "Do you seriously believe the Russo-Georgian war, or the invasion of Crimea, weakened Russia? The motivations you're ascribing don't seem to fit very well",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thoughtsnquestions",
                            "body": "Of course, it is these events, coupled with Ukraine that has pushed more nations to join NATO and pushed Europe away from Russia. That is a massive strategic weakness for Russia.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Weirdyxxy",
                                    "body": "I'm pretty sure that was mostly just the invasion of Ukraine. None of the countries joining NATO between 2008 and 2023 (Albania, Croatia, Montenegro, North Macedonia) border Russia, as far as I can see\n\n\nYou seem to be reasoning backwards, which is risky - and in this case, I think it means your reasoning's backwards.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thoughtsnquestions",
                                            "body": "What is your view then?\n\n In 2008, when Germany, France, Italy, Belgium, Netherlands, etc... strongly opposed Ukraine and Georgia going on a Membership Action Plan, noting it would likely result in a military conflict or war with Russia.\n\nWhy did Bush push for it?\n\nMy take is that it's a win win for the US. If no war, great. If war, their sacrifice weakens Russia, the war would push Europe away from Russia, it would weaken the Russian military, etc...\n\nThe possibility to war was known as that's why so many in Europe strongly opposed this idea. So why did Bush push for it despite the opposition and concerns?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Weirdyxxy",
                                                    "body": "You've asked this very question here before, and I've answered there: basically, I think the US was less wary of Russia, and also wanted the path to long-term security at a short-term risk they wouldn't bear the brunt of instead of long-term insecurity without a bump in the beginning. But that's only my guess, of course",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "thoughtsnquestions",
                                                            "body": "> The US was less wary\n\nWhy? If you have all these European countries strongly opposing Bush's plan noting the serious risks of war it could cause... surely the US would be wary too?\n\n> short-term risk\n\nSo you agree they recognised the risk? If the US recognised the risk, who beared the burden of the risk? Ukraine and Georgia right? If they bear the risk of being attacked, and the US gets the geopolitical win, how isn't that them being sacrificed as a geopolitical pawn?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Weirdyxxy",
                                                                    "body": ">Why? \n\n\nHubris, maybe? This is the Bush administration were talking about, they also thought they could just waltz through Iraq and Afghanistan and everything would be solved. Also without listening to allies\n\n\n\n>So you agree they recognised the risk? \n\n\nI agree they probably recognized a risk, probably also underestimated it\n\n\n>If the US recognised the risk, who beared the burden of the risk? Ukraine and Georgia right? \n\n\nI'd guess Ukraine and Georgia also were the ones deciding to apply to join NATO. Why did they decide to do so? Probably for a similar reason (long-term security) \n\n\n>If they bear the risk of being attacked, and the US gets the geopolitical win, how isn't that them being sacrificed as a geopolitical pawn?  \n\n\nThey were still actors on the international stage, not set pieces, and the geopolitical win mostly was their being secure. You seem to be denying their agencies even though the US was (I guess) only responding",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "thoughtsnquestions",
                                                                            "body": "I'm not denying their agency, they are independent sovereign nations but I don't think this scenario being played out was not discussed in 2008.\n\nI suspect when this was discussed in 2008, the US realised, if they go on the plan and there's no issues, then that's a win. If they go on the plan and a war occurs as a result, then that's also a win for the US. The second was more likely and as it was still a win for the US, the lives of these men and their sacrifice wasn't a priority.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GiveMeAnEdge",
            "body": "Biden is intentionally tanking his reelection on the orders of the DNC. The DNC is hoping that Trump will win the Presidency but the Democrats will gain the House and Senate, which will increase DNC fundraising without meaningfully impacting their corporate donors. How else do explain this latest move to work with the GQP to sanction the ICC?",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Guilty-Hope1336",
            "body": "Organ selling and buying should be legal.",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "I feel like that would exploit the poor.\n\nLike people will feel forced to go threw surgery and recovery to survive.\n\nThis remind me of a animation called pig pen\n\nI can understand the logic of selling but why buying?  Anyone or just hospitals?",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Guilty-Hope1336",
                            "body": ">I feel like that would exploit the poor.\n\nThis is an issue of informed consent. If after proper informed consent, someone still wants to sell their organs, then that's their decision to make, their risk to take. \n\n>I can understand the logic of selling but why buying?  Anyone or just hospitals?\n\nLong term, anyone. Short term, only hospitals and the government.",
                            "score": -5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "IamElGringo",
                                    "body": "Eh, it's not really willing if you're pressured into it knowing or not.\n\nWhy anyone?  Do you wanna make human liver and onions?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Guilty-Hope1336",
                                            "body": "Pressured how? \n\nIf I need a liver, then it should be legal for someone to sell me one.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "NeolibShill",
                            "body": ">feel like that would exploit the poor.\n\nIsn't forcing poor people on expensive, time consuming, and ineffective dialysis which will kill them when we could give them a kidney exploitation?\n\n\n>Like people will feel forced to go threw surgery and recovery to survive\n\nSo we force them to do dangerous work instead? The death rate for kidney donation is 3 out of 10,000. The average death rate for a US worker is 3.7 across professions. Logging is 100 deaths, construction 38,  and farmers 20. \n\nLetting people skip a year or two of work by selling a kidney would save lives and dramatically decrease their risk of death. Forcing poor people into dangerous logging camps instead because they can't sell their kidney is exploitation and murder\n\nhttps://www.bls.gov/charts/census-of-fatal-occupational-injuries/civilian-occupations-with-high-fatal-work-injury-rates.htm\n\nhttps://www.lahey.org/lhmc/department/transplantation/live-donor-kidney-transplant/pros-cons/#:~:text=The%20National%20Kidney%20Registry%20reports,(0.03%20percent%20mortality%20rate).",
                            "score": -1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "justanotherguyhere16",
                    "body": "You realize that some places like China are accused of killing people to supply organs already?\n\nThat making it legal would entice certain governments to exploit their people and kill them to make money through organ sales?  \n\n“Oh you need a heart for so and so?  Give us a week”",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Guilty-Hope1336",
                            "body": "There will be regulations",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "justanotherguyhere16",
                                    "body": "There already are and it hasn’t stopped China\n\nhttps://brighterworld.mcmaster.ca/articles/analysis-killing-prisoners-for-transplants-forced-organ-harvesting-in-china/#:~:text=China%20is%20the%20only%20country,known%20as%20forced%20organ%20harvesting.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Guilty-Hope1336",
                                            "body": "I wonder if there's a difference between China and the United States",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "justanotherguyhere16",
                                                    "body": "You have heard of importing goods right?\n\nAnd smuggling?\n\nAnd if you suddenly make something legal in one part of the world and demand skyrockets that others will find a way to fulfill that need?  \n\nI mean it’s like illegal drugs. We haven’t stopped them from coming in the country have we?  \n\nYou really think if some millionaire needs a heart they wouldn’t travel to China so they can get it and not die if they knew they couldn’t be prosecuted for it here?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Guilty-Hope1336",
                                                            "body": "You can regulate for that.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "justanotherguyhere16",
                                                                    "body": "Like we already have for illegal drugs?\nYeah that seems to work well. \n\nAnd people with the money have the influence so I’m sure the politicians will gladly write laws that condemn their billionaire benefactors to die because they aren’t allowed to get organs harvested in China. \n\nI mean yes they COULD regulate it but they likely won’t. And even if they did they likely couldn’t really stop it except for the poor / average person while the rich continue to exploit the system.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fox-mcleod",
                    "body": "Definitely not. How you alter incentives changes behaviors. \n\nThere are locations and kinds of body tissue where this is true and what happens is donation rates go down. Almost no one becomes an organ donor. \n\nWhy give something away for free when it’s valuable. Now you’re not a hero, you’re a sucker. \n\nMeanwhile, we have a much better solution to organ shortages. Simply reverse the opt in system to an opt out system and participation goes from 20% to 70%.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Guilty-Hope1336",
                            "body": "We sell sperm and eggs",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fox-mcleod",
                                    "body": "People have more than one or two of those. \n\nLet’s start from the top, if you found out that this has been studied and it reduces overall organ donations, would you change your mind about it?\n\nIf you found out that simply switching from opt in to opt out more than tripled the rate of participation and resulted in an organ surplus, would it satisfy your goal?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Guilty-Hope1336",
                                            "body": "If it reduced the organ supply, then it would an argument worth considering.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "fox-mcleod",
                                                    "body": "What is your goal *other* than to increase the organ supply?",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Guilty-Hope1336",
                                                            "body": "Bodily autonomy",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MiketheTzar",
                    "body": "I didn't realize Milei was in this subreddit. Neat!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "blanking0nausername",
            "body": "A lot of these aren’t hot takes, IMO\n\nMy hot take: we should start euthanizing people who are 92+ years old, bed bound, and no longer coherent/aware of their surroundings",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Virtual_South_5617",
            "body": "limp wristed immigration enforcement is making this race much closer than it should be.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Artfuldodger96",
            "body": "We should stop spending so much time money and resources investing in foreign affairs and put that money towards combatting poverty and investing in public education and  improving healthcare. Biden recently gave 94 billion dollars to Israel. Investing half of that in those 3 issues would make a big change",
            "score": 0
        },
        {
            "depth": 0,
            "author": "MrsDanversbottom",
            "body": "We should give at least half of the states back to the indigenous people of North America. Let them decide if anyone without native DNA can stay or not.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "GeeWilakers420",
            "body": "There is absolutely no reason to prohibit someone from voting once in our elections. This idea that a foreign power is going to spend millions of dollars to felonious immigrate enough people to our country to sway an election is ridiculous. These increased voter registration restrictions are racist, and those who push them are %100 aware that is exactly the point",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Grampappy_Gaurus",
            "body": "DeSantis was right, in regards to the immigration bill.\n\nHow long has the blue team been saying, \"if you really want to stop illegal immigration, go after the businesses hiring them.\" So he did, and of course, he had to deal with the consequences.",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "hitman2218",
                    "body": "Except he’s not really going after them. The law they passed has exemptions for small businesses and others.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Grampappy_Gaurus",
                            "body": "Yeah, trying to mitigate the backlash. I agree it was poorly thought out and totally a political stunt. However, this is the kind of action that's needed. Setting booby traps in the rio grande and torturing immigrants on the border isn't going to work. If you (not you specifically, but the general you, you know what I mean) really want to reduce immigration, you're going to have to  go after the businesses that exploit them.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "u2sunnyday",
                    "body": "But he isn't though\n\nCompanies in the agriculture industry, when the INS is coming, THEY ARE TOLD. They fire all the illegals for the day or two the INS is there and hire them right back the next day after the INS leaves. \n\nThose companies are huge donors for state and local politicians. \n\nIt is known.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Grampappy_Gaurus",
                            "body": "Exactly. The corruption is rife, and the border games are for show. If the goal is a really to stop illegal immigration, it's going to have to be more impactful than a piddly little 3k per person fine. \n\nIf we build a Trump style medieval stone wall with boiling oil and machine gun mounts, people will just go around it, or take a raft to Louisiana. Then we're right back where we started only with higher taxes because someone has to pay for it. \n\nAlso, you're right. The laws are already on the books. It's time to give them some teeth.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "u2sunnyday",
            "body": "We should have never left Afghanistan. Fight them there so we don't have to fight them here.\n\nAfter graduation, all Americans should be required to spend some time in the military or do some sort of public service.\n\nGender transition surgey should not be allowed until 21. Trans women should not be allowed in woman's sports\n\nBiden is too old. Trump carries his age better than Biden. The fact that Biden is running for reelection makes me think Dems are trying to lose.\n\nPostal workers make too much money",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "sadetheruiner",
                    "body": "Definitely some hot takes here, but what really has my head spinning is “Trump carries his age better than Biden”.\n\nHow could you possibly stand by that statement? Both are old, and I certainly want the entirety of our politics to shift below the retirement age. Like sure Biden fell off a bike, Trump can’t be in the same room as a bike. Biden has gaffs and a stutter Trump has: \n\n\"Look, having nuclear — my uncle was a great professor and scientist and engineer, Dr. John Trump at MIT; good genes, very good genes, OK, very smart, the Wharton School of Finance, very good, very smart — you know, if you’re a conservative Republican, if I were a liberal, if, like, OK, if I ran as a liberal Democrat, they would say I'm one of the smartest people anywhere in the world — it’s true! — but when you're a conservative Republican they try — oh, do they do a number — that’s why I always start off: Went to Wharton, was a good student, went there, went there, did this, built a fortune — you know I have to give my like credentials all the time, because we’re a little disadvantaged — but you look at the nuclear deal, the thing that really bothers me — it would have been so easy, and it’s not as important as these lives are — nuclear is so powerful; my uncle explained that to me many, many years ago, the power and that was 35 years ago; he would explain the power of what's going to happen and he was right, who would have thought? — but when you look at what's going on with the four prisoners — now it used to be three, now it’s four — but when it was three and even now, I would have said it's all in the messenger; fellas, and it is fellas because, you know, they don't, they haven’t figured that the women are smarter right now than the men, so, you know, it’s gonna take them about another 150 years — but the Persians are great negotiators, the Iranians are great negotiators, so, and they, they just killed, they just killed us, this is horrible.\"",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ReineDeLaSeine14",
                    "body": "Banning remote work entirely harms disabled workers and workers who can’t get reliable childcare",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Source?",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "OttosBoatYard",
            "body": "In about a hundred years, most countries on earth will be prosperous English-speaking democracies.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "ferrocarrilusa",
            "body": "Non-abusing pedophiles do not deserve hate",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "IamElGringo",
                    "body": "Wdym?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ferrocarrilusa",
                            "body": "\"Pedophile\" is not synonymous with \"child sexual abuser.\"  It's a venn diagram.  The pedophiles who are attracted to children but control their urges and understand their fantasies cannot come true should not be on the receiving end of death threats.  They should be able to seek therapy without shame, just like addicts.\n\nNow i don't see anything wrong with not allowing them to have jobs involving children, in the same way bus companies do not need to hire blind drivers, it's a reasonable carveout to disability law.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BalticBro2021",
            "body": "I want to abolish the second Amendment, but in the meantime I support Canceled carry permits.  \n\nrepeat DUI should result in mandatory prison time and decades long license suspensions.  \n\nSchools should be allowed to vaccinate children without parental consent\n\nDomestic violence should be treated like sex offenses.  Create a registry of abusers, ban them from marriage or dating or cohabiting with someone of the gender they offended against.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "your_not_stubborn",
            "body": "There's no real difference between \"leftist\" and \"liberal\" in America. All you need to do in America to be \"leftist\" is complain about capitalism and whine about voting.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "EchoicSpoonman9411",
            "body": "I have a lot of them.\n\nOur strictest legal penalties should be reserved for the crime of gender policing.\n\nStolen land should be reverted to the Native American tribes. Given that it's been a while and people are living on it, the way I think it should be done is to reestablish tribal jurisdictions and allow people living within them to choose whether they wish to be governed by their existing state government or the tribal government. We should not take any individual's private property. Each tribe should also have two Senate seats, just like states.\n\nTaking this idea further, it should be possible for individuals to declare residency of a state without the necessity of actually residing within the borders of that state.\n\nIt should be illegal to transmit advertising to devices with a general-purpose CPU, as the the incentive structure for that industry is toward enabling mass scale cyberattacks.\n\nIt should be required that anyone running for or occupying political office should be required to make all statements in a defamiliarized way. \"Speaking intelligibly while politicking\" should be a very serious crime resulting in permanent removal from office, at the very least.",
            "score": -6
        },
        {
            "depth": 0,
            "author": "RossSpecter",
            "body": "People who jaywalk should be arrested on sight and imprisoned for life.",
            "score": -3
        }
    ]
}