{
    "title": "What should the US government do about Americans being held in Turks and Caicos for gun violations?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nFive Americans are currently being held in Turks and Caicos for violating updated laws that changed having guns or ammunition from a fine to a mandatory 12 year sentence.\n\nhttps://www.cbsnews.com/news/americans-detained-turks-and-caicos-ammunition-found-in-luggage/\n\nhttps://amp.cnn.com/cnn/2024/05/21/americas/us-lawmakers-turks-caicos-detained-americans\n\nTurks and Caicos is a British overseas territory, and so the US government could potentially avail itself of diplomats in the UK as well as those in Turks and Caicos. \n\nWhat if anything do you think the US government should do?\n \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LyptusConnoisseur",
            "body": "Ask for leniency through State Department.\n\nThat said, why do people not read State Department notices... they specifically mention ammunition possession for Turks and Caicos. \n\nIt drives me nuts that Americans travel to dumbest locations like Iran, Russia, North Korea, etc. or do illegal things and expect to be bailed out by the government.",
            "score": 45,
            "replies": [
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "I’ve done some work in the travel industry in the past and my understanding from talking to people in the field it is that the assumption is that nobody outside of meeting planners, wedding planners, event coordinators, etc read the advisories. And apparently that’s not an American thing, it’s the entire world.\n\nHowever, your comment reminds me of the time that my father was really upset while in India that everybody in the city he grew up in was able to figure out that he was an American, most of the time before he even opened his mouth and revealed that he spoke his mother tongue with New York accent. \n\nMy uncle told him that he shouldn’t be surprised because he walks around as if the US Army is standing behind him.",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "03zx3",
                            "body": "That last bit about your dad and I know exactly what you're talking about. I noticed it when I was in the Navy, we're just more confident and in your face than everyone else, especially in Asia and the Middle East.\n\nI had a conversation with q Japanese bartender just outside of a Navy base about it and he pretty much said the same thing.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "Call State and appeal for leniency I guess \n\nI thought part of responsible gun ownership was knowing the laws surrounding gun ownership when you go somewhere. I mean geez. ",
            "score": 26
        },
        {
            "depth": 0,
            "author": "FreeCashFlow",
            "body": "The US should only intervene where citizens are being held unfairly, as in being prosecuted for political reasons or on charges that are gross violations of human rights. Travelers are responsible for knowing and obeying the local laws. \n\nIt astounds me that 5 different Americans apparently thought it was fine to bring firearms or ammunition somewhere where these items are illegal and possession is subject to significant prison time. Not everywhere is as yeehaw shoot’em up as we have the misfortune of being. ",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "evil_rabbit",
                    "body": ">The US should only intervene where citizens are being held unfairly,\n\nfrom the first article OP has linked, it seems that these were accidents. for one of them, it was apparently a single bullet stuck in the bag somewhere. the TSA missed it too.\n\ngetting 12 years in prison for accidentally bringing a single bullet into the country does seem quite unfair to me, even though i'm very anti-gun.",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "TheCrudMan",
                    "body": "Mandatory minimum sentencing is inherently a gross violation of human rights.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kooljaay",
                            "body": "Doesn't the US and its State governments also practice this?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheCrudMan",
                                    "body": "Yes.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Yea but it usually applies specifically to extremely violent crimes. What we have here is victimless crimes, people who accidentally left a single round of ammo in their bag without having a weapon to fire it",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pablos4pandas",
                                            "body": "I thought its been used quite extensively in the war on drugs for possession and distribution",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheCrudMan",
                                                    "body": "Yes, and also a human rights violation.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Guilty-Hope1336",
                            "body": "No, it's not",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheCrudMan",
                                    "body": "Inherent in the right to a fair trial by a jury of your peers should be that the people or a judge should be able to try your specific case and set sentencing accordingly. Guidelines including maximums are fine, and even some reasonable minimums are also fine. But there should be discretion. That is an inherent part of a fair trial. \n\nImposing the same, harsh, mandatory minimum sentence on any particular crime without considering the specific circumstances is cruel and unusual.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Guilty-Hope1336",
                                            "body": "Jury trials are not recognised as fundamental for a fair trial in civil law countries. Mandatory minimums are very common, not unusual in the least.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheCrudMan",
                                                    "body": "Commonality doesn't make them not a human rights violation.\n\nThe death penalty is also common, and also a human rights violation.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Guilty-Hope1336",
                                                            "body": "The death penalty is necessary for justice",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "TheCrudMan",
                                                                    "body": "The state killing its citizens as a solution for failing to keep them safe is an injustice.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Guilty-Hope1336",
                                                                            "body": "It was just to execute Ted Bundy",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "TheCrudMan",
                                                                                    "body": "We won't convince each other on this. I am in favor of reducing or eliminating state-sponsored violence wherever possible. Not killing people who are already in state custody is pretty low hanging fruit.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GoldenInfrared",
                            "body": "Correct. Bailing her out was dumb",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GoldenInfrared",
                                            "body": "One who has been waiting for *years* to be let out",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cleverdawny1",
                    "body": "You didn't read the article.  All five people state that they didn't know that ammunition was in their bag.  This wasn't them bringing a gun into the country because they're yeehaw morons.  It was them not finding a round in a fold in a duffel bag or similar.\n\nSeriously.  Use a bag as a range bag and then take it on vacation and this could easily happen to anyone.  No reasonable person would ever think that this kind of prosecution was okay.",
                    "score": -11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "carlse20",
                            "body": "I don’t disagree with you generally, but I’ll also point out that you are responsible for the things you take with you, and boarding a plane (international or otherwise) is one of those scenarios where you should be really sure that you’re not carrying anything you shouldn’t be. I understand that bullets can be small and not always easy to find in folds/pockets in bags, but it’s not like they’re impossible to clear out either. Do I think that these 5 people’s carelessness should land them in jail for 12 years? No. That’s excessive, and if it looks like any of them would actually be punished to that extent the government should intervene for leniency. Do I think that they should be exempt from prosecution entirely because it was due to carelessness rather than intent? Also no. \n\nI’m a semi-regular shooter (now pretty much only go when I’m visiting my parents for a variety of reasons) but I’ve used my backpack as a range bag  and then subsequently used that backpack as a carry on multiple times and I’ve never accidentally taken a gun or ammunition with me to the airport. If there’s one thing everyone should always exercise proper care with, it’s firearms and ammunition. That’s what I was taught by my gun-loving father, grandfather, and uncles - owning and using firearms is a right, but one which comes with an obligation to use, store, and transport them safely and responsibly.\n\nTl;dr: 12 years punishment based on what I know of these cases is excessive, and to the extent that it looks like any of these people will actually be subjected to that punishment the government should attempt to intervene for leniency, but these people all broke the law and their only excuse is carelessness, which doesn’t cut it for me to exonerate them completely.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cleverdawny1",
                                    "body": ">12 years punishment based on what I know of these cases is excessive, and to the extent that it looks like any of these people will actually be subjected to that punishment the government should attempt to intervene for leniency, but these people all broke the law and their only excuse is carelessness, which doesn’t cut it for me to exonerate them completely.\n\nThe reasonable thing to do when someone unintentionally brings something illegal into a country and is obviously attempting to follow the law is confiscate the illegal item and perhaps issue a fine.\n\n12 years in prison for someone with zero criminal intent who at best we could say didn't do a good enough job looking through her bag to clean it out is absolutely monstrous.  No reasonable human being could support that prosecution.  It is ridiculous that the state department has to even get involved.  If the prosecutor was a decent human being and not a monster devoid of morality they would have just refused to file charges.  That's a miscarriage of justice on the level of what happens in countries like Iran, not what you'd expect from a country like the UK.\n\nShit, we don't even know for sure that the ammo was theirs.  For all we know, they bought a used duffel bag someone previously used to go to the firearm range and they just didn't see a round or two of ammunition in it.\n\nThis story is completely ridiculous.  And that they're choosing to victimize FIVE people for clear accidents?  Something stinks in that customs office.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "carlse20",
                                            "body": "I think it’s unreasonable that marijuana is illegal in many places and people will be punished for possessing it. I think it’s unreasonable for Singapore to make chewing gum illegal. I think it’s unreasonable that any country anywhere executes people. I don’t get to dictate to other countries what their laws should be, and I don’t get to just pull out my “American” card and act as though that gives me a get out of jail free card for violating the law in a country I voluntarily chose to visit.\n\nI already said that 12 years is excessive and the government should try to intervene if that’s the penalty that actually gets imposed. Beyond that…I don’t know what you want. I have no control over the government of Turks and Caicos and if they want to be zero tolerance when it comes to firearms and ammunition, that’s the way it’s going to be there. It’s part of living in a society, disagreeing with a law is not an excuse to break it.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cleverdawny1",
                                                    "body": "I don't get to dictate to other countries what their laws should be.  But it is obviously monstrous and unjustifiable for such a ridiculous miscarriage of justice to take place.  The original question was whether the US government should try to work for the freedom of these people who are being abused by a foreign legal system.  The obvious answer is yes, and I think you know that, much as you also know that I'm right that this entire thing is completely unjustifiable.",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "carlse20",
                                                            "body": "I said that the government should intervene to avoid a harsh punishment like the one is on the table, so I think you and I are actually agreeing on the core point and I’m not sure why you’re acting like I’m hostile to you when I’m not.",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Cleverdawny1",
                                                                    "body": "Yeah, sorry, I have a bunch of hostile fucks who are hypocritical assholes and go on and on about how we need to reform policing to be more reasonable and not just lock people up in prison dogpiling on me to justify this obviously idiotic prosecution.\n\nMy point, really, is that the US government shouldn't be forced to intervene here.  It should have never come to this.  And if the UK intends to allow persecution of travelers like this, then it's probably not a good idea for people to go there, lest they be singled out for political prosecution",
                                                                    "score": -3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "carlse20",
                                                                            "body": "I think calling this political persecution is a stretch unless there’s evidence that this law is being only applied to some travelers but not others.\n\nMy core point is that while unfair punishments should be prevented, travelers also have an obligation to ensure that they are complying with the law to avoid ending up in a position where they could be punished like this. Every US passport reminds travelers that they will be bound by the laws of the country they are in, and that punishments can be significantly more severe. You and I can go round and round on whether or not it’s fair to need to be that careful, but whether it’s fair or not is kinda beside the point, because it’s what is, and there’s not a ton that can be done about that. If a country wants to make something illegal on a strict liability basis and has harsh punishments for it, that’s a signal that you need to be on your toes when you go there, and if that’s going to be a problem, maybe travel elsewhere. It’s not fair, but that’s life. Brittney griner should have been more careful to not bring marijuana derived products to Russia. These 5 people should have been more careful to not bring ammunition to Turks and Caicos. Griner’s punishment, and these 5 people’s potential punishments, are/would be unjust, and the government was correct to work to free griner and would be correct to try to intervene on these people’s behalf, but they all undertook actions that made it possible for the punishment to apply at all. This all could have been avoided if a little more care had been taken, and that’s a fact.",
                                                                            "score": 7,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Cleverdawny1",
                                                                                    "body": "No, the risk could have been reduced if they had taken action to mitigate it, but this is absolutely something which could happen to anyone who is either a gun owner or who purchased and used a used luggage bag.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "carlse20",
                                                                                            "body": "I agree, this could happen to anyone who wasn’t careful enough to make sure their bag was empty before they start to pack. To me, who as I’ve mentioned I am a gun owner, that’s just a signal to be really careful about air travel with a bag I’ve used to transport a firearm or ammunition.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Cleverdawny1",
                                                                                                    "body": "Tbh it's a signal for me to never, ever go or suggest anyone goes to that country",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "carlse20",
                                                                                                            "body": "Fair enough, it’s the same decision I’ve come to for places like Jamaica and the Middle East since my status as a gay man puts me in danger in those places (even though that’s obviously unfair too). It sucks but sometimes things just kinda suck.",
                                                                                                            "score": 3,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Cleverdawny1",
                                                                                                                    "body": "Oh yeah.\n\nI'm going to visit Egypt sometime, but I wouldn't if I didn't have a very good friend there who couldn't get a tourist visa to the US.  No way would I go for just touristy reasons.",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "ecothropocee",
                                                            "body": "Respect the laws of other countries?!",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FreeCashFlow",
                            "body": "Counterpoint: Leaving the country with ammunition in your bag does make you a “yeehaw moron.” It is shocking how casually Americans treat deadly weapons and their accessories. This is not like forgetting to toss a half-empty water bottle before security. I bet every one of these morons would call himself a “responsible gun owner” as well. ",
                            "score": 27,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cleverdawny1",
                                    "body": "Counterpoint: a 9mm round is tiny as fuck and can easily sneak into a fold in a luggage bag.\n\nAlso, counterpoint: no sane human being would seek to prosecute or apologize for the prosecution of a person without there being criminal intent or a victim or potential victim.  Especially a potential prison sentence of over ten years.  It is so ridiculous that no one who is a thinking individual could possibly argue in favor of such a miscarriage of justice.\n\nAlso, counterpoint: since you aren't a gun owner and don't know what you're talking about, you should probably listen to people who do.  This would be a different conversation if they'd smuggled a pistol into the country, but missing a round in a bag after a range day is absolutely something that happens and happens regularly.  Yeah, people should be more assiduous when sweeping their bags, but shit happens to everyone and if you're going to treat someone like a felon, there needs to be intent, not a good faith effort to follow the law.",
                                    "score": -17,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "After all the similar incidents with guns and ammo at airports over the years you’d think by now gun owners would have separate bags. One for their day to day gun stuff, one for travel.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cleverdawny1",
                                                    "body": "There was no gun involved.  But even if you could prove that the ammo was theirs, an obviously harmless oopsie by someone clearly intending to follow the law does not justify twelve years in prison, and if you are an honest human being you will agree with me.",
                                                    "score": -11,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hitman2218",
                                                            "body": "There are many laws in many countries that I disagree with, including this one. But you know, FAFO. I do hope there is some leniency.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Cleverdawny1",
                                                                    "body": "\"make a small mistake with no potential victim and fuck you, I guess, the law is the law\"\n\n- some joker who pretends to be a progressive",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "justsomeking",
                                                                            "body": "I'm with them, I don't feel the need to invade a country for people that don't check their bags. Maybe ask for leniency, but this isn't worth starting a war over. If you're a gun owner, you're certainly not displaying any personal responsibility that makes me feel like you're a good gun owner.",
                                                                            "score": 3
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "StillLikesTurtles",
                                                            "body": "There are plenty of people in the US serving time for small and trace amounts of drugs found in bags and automobiles, many of them faced mandatory minimums. Is is safe to assume you would be in favor of vacating those convictions? \n\nAt this point they haven’t been convicted, but the arrests will certainly send the message not to travel into T&C with ammunition or firearms.\n\nPersonally I think mandatory minimums are atrocious. On the flipside, traveling out of the country usually means checking your luggage to make sure you’re not traveling with anything that could be considered contraband in the place you’re headed. \n\nWhile I might agree that 12 years for what may be accidental ‘cargo’ is extreme, it is generally accepted that it’s on travelers to ensure their luggage is properly packed. \n\nA friend of mine served jail time in Dubai when the host of a dinner they attended sent them home with a bottle of scotch. They had the legal limit in their trunk in preparation for a dinner party so the scotch put them over. Yeah, it’s extreme, but the laws of another country are what they are.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "-Random_Lurker-",
                                            "body": "This is why safety classes teach to keep your range bag for range things, and don't re-purpose it.\n\nIf they can't follow the most common, most basic, and easy-to-follow range safety rules, I really don't have much sympathy for them.",
                                            "score": 11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cleverdawny1",
                                                    "body": "\"if you make a mistake with no victim, you deserve to go to prison for 12 years\"\n\n- some sociopath",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "pablos4pandas",
                                                            "body": "Do you think it's reasonable to punish DUIs even if they did not cause an accident or other harm?",
                                                            "score": 14
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ecothropocee",
                            "body": "I knew someone who did hard time because someone snuck stuff in their suitcase. Laws are laws.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cleverdawny1",
                                    "body": "I'm sure George Floyd should have just followed the law, too",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ecothropocee",
                                            "body": "??",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cleverdawny1",
                                                    "body": "LaWs ArE lAwS\n\nSounds like you're gonna say that blue lives matter next.  Odd how people turn into total bootlickers the moment they decide they don't sympathize with a victim",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DoomSnail31",
                            "body": ">Use a bag as a range bag and then take it on vacation and this could easily happen to anyone\n\nThen don't do that? No reasonable person would demand the US government to intervene in fair criminal prosecution of people in another sovereign nation.\n\nIgnorance, both of the law and of your actions, is not a sufficient defense in this case. These aren't intent based laws.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CuriousNoob1",
            "body": "Nothing.  You step outside the borders of the U.S. that's your personal responsibility to take care of yourself.  Part of that is complying with local laws regardless of your view of them.\n\nForeigners have to comply with are laws here and we have to comply with their laws when we travel.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Oceanbreeze871",
            "body": "State department can negotiate a hand over. \n\nStill the burden is in the gun owner to “be responsible” with their weapons as difficult as that is.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cleverdawny1",
                    "body": "They're not accused of bringing a weapon into the country.  They accidentally carried a bag into the country which had one or more rounds of ammunition in it.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Oceanbreeze871",
                            "body": "It’s still their fault. You’re literally responsible for the contents of your luggage. \n\nYou’re literally responsible for treating your guns and ammo as serious deadly weapons and for their safe storage. Bullets aren’t as forgettable as a usb cable or sharpie. Shouldnt be misplacing them carelessly.",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cleverdawny1",
                                    "body": "Tell me you've never handled a gun without telling me you've never handled a gun\n\nLook I get what you're saying but if you're going to lock someone in prison for twelve fuckin years there needs to be serious criminal intent.  Think about it for a second.",
                                    "score": -10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Oceanbreeze871",
                                            "body": "I grew up in an NRA/military family, our Ammo was organized and stored properly, not in a junk drawer. \n\nBut yes I agree, most gun owners are highly irresponsible people who treat their deadly  weapons like a toy,\n\nLaws of a foreign country. The state department should negotiate something",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cleverdawny1",
                                                    "body": "Sure you did.  Suuuuuure.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Oceanbreeze871",
                                                            "body": "I fired more different kinds of stuff before 18 than you prob fired in your life. lol",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Cleverdawny1",
                                                                    "body": "I'm sure you did, in plenty of video games.",
                                                                    "score": -5
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "pablos4pandas",
            "body": "Depends on the results of the court cases IMO. If they sentence the guy who had 4 loose rounds to 12 years the state department should maybe try to help after sentencing. \n\nIf the lady who accidentally brought a locked safe of Ammo around the world gets a few months in jail she should thank her lucky stars and the state department should stay out of it",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Coomb",
            "body": "I think what they already did, which was petition the Turks and Caicos government on behalf of the citizens, he is the right thing to do.\n\nE: To be clear, I understand that the petition was made by federal lawmakers rather than the US government as a whole. I think that's fine. At most, maybe the government should officially ask.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "st0nedeye",
            "body": "Fuckin gun happy Americans.  Only group of people in the world dumb enough to misplace their ammo in their international travel luggage.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "johnhtman",
            "body": "I love my guns, and strongly support gun rights. That being said Americans are subject to the laws of the countries they visit. There have been Americans sentenced to death for drug trafficking in foreign countries.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "PepinoPicante",
            "body": "I mean, I think we negotiate with the good people of Turks and Caicos and get them to release them in exchange for [a Booting](https://www.youtube.com/watch?v=Pt4mwy9OBNA).\n\nBut seriously, 100% respect for T&C's laws. These folks broke the law and so they have to be prepared to deal with the due process of it. That's how laws work.\n\nI also think that it was probably a dumbass, honest mistake these people made. They were being careless, but didn't intend any harm. The law was probably not crafted with the intent of catching and punishing tourists for being dumbasses.\n\nI feel like the T&C government will probably also be reasonable here. After all, their economy heavily relies on tourism. They probably don't want to get a reputation for sentencing tourists to a decade of hard labor over careless mistakes. There are plenty of other islands around there to visit.\n\nPerhaps we can work something out where these folks can pay a fine, make some form of restitution, issue an apology, or something. That is, assuming that they have genuine remorse and want to make up for their actions. \n\nIf not, they can stay locked up for all I care.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cleverdawny1",
                    "body": "How can they be reasonable with this when locking them up in the first place was unreasonable?",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PepinoPicante",
                            "body": "I don't think it was unreasonable. They broke a local law. They are gonna get arrested. \n\nIt's also not unreasonable for us to try and help them out, as long as they are respectful.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DBDude",
                                    "body": "Yep, it’s just like a Western woman showing too much skin while visiting Saudi Arabia. She should have known, so throw her in jail.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PepinoPicante",
                                            "body": "Yep. And use diplomatic channels to make sure she is treated as well as possible and get her out as quickly as makes sense.",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Cleverdawny1",
                                    "body": "And I'm sure you think it's perfectly reasonable for someone to lock a black man in prison for twenty years for having half an ounce of pot on his person because he \"broke a local law\"",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PepinoPicante",
                                            "body": "I think that's a far different scenario than what happened in T&C. \n\nThese people are not being discriminated against. And this law was not designed to target them specifically because of their race, nationality, etc.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cleverdawny1",
                                                    "body": "You're right.  The aforementioned black man had criminal intent and the prosecution would be far less unreasonable.  It's quite different and my analogy sucks.  My bad.",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "PepinoPicante",
                                                            "body": "So... what even was your point of bringing up this hypothetical man whose situation is completely unrelated to the one I was talking about?",
                                                            "score": 10,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Cleverdawny1",
                                                                    "body": "The point was to expose your hypocrisy and immorality, which I did.  You're perfectly happy to cheer for unreasonable and ridiculous prosecutions for a group of people you dislike (gun owners) while condemning less unreasonable prosecutions for a group of people you like (black pot users)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "PepinoPicante",
                                                                            "body": "Oh? That's what your point was? I couldn't tell, since you just made up a completely incompatible scenario and pretended it was a similar situation. \n\nI was just confused.\n\nBut now I know I'm an immoral hypocrite. Good to know! Thanks for the incredibly effective lesson!",
                                                                            "score": 11
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HoldenMcNeil420",
            "body": "Nothing.  You’re in a foreign country.  Check your damn bags for what’s inside them period.  This is personal responsibility in full frontal here.  \n\nIt’s not America our laws and your feelings don’t matter to border line authoritarian governments. \n\nI don’t agree but that’s moot cause it’s not my country. \n\nInsert “stop breaking the law asshole” liar liar gif.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "BirthdaySalt5791",
                    "body": "I assume you felt the same about Brittney Griner?",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HoldenMcNeil420",
                            "body": "Yea she’s a dumb dumb for leaving that shit in her luggage. Period. Your traveling to a FOREIGN COUNTRY make sure your person is in compliance before you leave your fucking home.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "Arthur2ShedsJackson",
                            "body": "Completely different scenario. The punishment for Griner's crime would normally be 15 days in jail. But the Russian court sentenced her to nine years for the explicit reason to keep her as leverage for a diplomatic prisoner swap.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BirthdaySalt5791",
                                    "body": "That’s not correct. The maximum sentencing for the law she broke was 10 years. [This PBS article](https://www.pbs.org/newshour/amp/world/russian-judge-rules-brittney-griner-illegally-carried-drugs) says that most Russians who are convicted get at least 5 years",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "The article says others get 5 years *at most*.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BirthdaySalt5791",
                                                    "body": "Okay, you’re right, but honestly same difference. It’s a lot more than the 15 days the other user claimed.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hitman2218",
                                                            "body": "The other user is right. The typical sentence for what Griner did is either a fine or no more than 15 days in jail.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "BirthdaySalt5791",
                                                                    "body": "No, they are not correct",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "hitman2218",
                                                                            "body": "Why, because of the smuggling charge? Brittney Griner, smuggler of less than one gram of cannabis oil!",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "BirthdaySalt5791",
                                                                                    "body": "I didn’t say it was justified. I said there is no difference between what happened to her and what is happening to Americans in Turks and Caicos. She broke the law and got arrested in a foreign country. \n\nWhether you think the law is bad or not, she was charged with possession and smuggling.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "hitman2218",
                                                                                            "body": "The smuggling charge was bullshit. She wasn’t trying to sneak anything into the country.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "BirthdaySalt5791",
                                                                                                    "body": "It was her product and she carried it into the country illegally. That = smuggling. Whether her breaking the law was intentional or an accident is not is actually relevant to whether she broke the law.\n\nAgain, I’m not advocating for Russian style justice. I’m saying her case is the same as these Americans with the ammo arrests. The left, from what I’ve seen so far at least, seem to be in favor of an exception for Griner but seem relatively undisturbed by the Americans imprisoned in Turks and Caicos.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "hitman2218",
                                                                                                            "body": "To smuggle something is to transport it secretly. She didn’t do that. \n\nThe similarity is that Griner and these tourists broke the law unintentionally. If she had just been charged with possession like they were, her sentence would have been practically nothing. But Putin decided to fuck with her.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "HoldenMcNeil420",
                                                                                    "body": "No see the answer is don’t bring that shit into Russia.  Like do we need to tell people not to run down the freeway….ffs.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Arthur2ShedsJackson",
                                            "body": "The [criminal limit](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2474596/) for marijuana in Russia is 6 grams. There was less than that in those cartridges.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BirthdaySalt5791",
                                                    "body": "That’s for possession. She was charged with possession *and* smuggling it into the country.",
                                                    "score": 5
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "Maybe review TSA procedures. Idk how they managed to get on the plane with a carry-on that had a gun in it.\n\nThey will probably be deported after their trials.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "Ammunition, not guns. \n\nThe thing is is that I’m not entirely sure that given enough tries you couldn’t get an ICBM past the TSA.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CTR555",
                            "body": "I have such mixed feelings about the TSA.  They have a blog where they post pictures of some of the stuff they've confiscated and some of it is pretty outrageous (and there's a lot of it), but on the other hand we know from tests that they miss a lot too.  I'm sympathetic to how hard it is to create a monitoring program without false negatives, but it still seems like we need to do better there.",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PlayingTheWrongGame",
            "body": "Guarantee the regular sort of consular services available to criminals—making translators and such available (not really relevant in this specific case, but in general).\n\nThese folks broke the law overseas, and are punished according to those laws. The US government isn’t there to ride to their rescue when they fuck around and find out in other countries. \n\nThis isn’t them being held as political prisoners or something. This is them going to another country, breaking the law there, and being caught. ",
            "score": 5
        },
        {
            "depth": 0,
            "author": "MelonElbows",
            "body": "I think that if it looks like it was an accident where these people left a couple of ammunitions in their pack, or if its clearly political like Brittney Griner, then you use the power of the state department and ask for leniency and/or extradition back to the US.\n\nHowever, I don't have much sympathy for people who go to another country and break their laws on purpose.  In 1994, Michael Fay was arrested in Singapore for vandalism over a 10 day period.  The punishment was caning, but I rememember American pundits made a huge deal about how its not fair, he's just a kid, corporal punishment was cruel, yada yada yada.  I say let him get caned, he broke the law there by being a dickhead, his vandalism spree was no accident.  So let him face the punishment.  The state department should have said \"Sorry Mike, you'll just have to sleep on your stomach for a little while\".",
            "score": 2
        },
        {
            "depth": 0,
            "author": "octopod-reunion",
            "body": "A mandatory minimum for an accident with no intent of smuggling is a bad law. (Mandatory minimums generally are.)\n\nAt the same time, and equally true, they were irresponsible gun owners for having loose ammunition not kept in a bag/case specifically meant for it. ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "RioTheLeoo",
            "body": "Since it seems like it was an accident and only a single bullet, surely our government can just like, ask to have them returned right? \n\nEspecially considering the US and UK have a pretty solid relationship",
            "score": 4
        },
        {
            "depth": 0,
            "author": "hitman2218",
            "body": "What I wanna know is if these Americans are the only tourists who have been tripped up by the law.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ManufacturerThis7741",
            "body": "Absolutely nothing. They chose to break the law. They can rot.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "madmoneymcgee",
            "body": "Feels like we are all super quick to just assume everyone “accidentally” bringing ammo someplace is just making an honest mistake. Where if I was someone planning to smuggle weapons and ammo into a country I might account for a simple whoopsie fine as a cost of doing business. Then devote the rest of my mental energy to figuring out to get the guns in. \n\nBut even if it’s like that this is just an honest mistake it highlights the problem in pro gun rhetoric where we are always told any new gun law would just hurt “responsible” gun owners and not do anything to stop the problem. \n\nThen anytime someone is irresponsible with a gun they’re automatically moved to that category of irresponsible gun owners and there’s just nothing we can do again.  \n\nAnd that leads to the situation here where all of a sudden it’s just seen as unfair to even punish folks who  do something irresponsible.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DoomSnail31",
            "body": ">Five Americans are currently being held in Turks and Caicos for violating updated laws that changed having guns or ammunition from a fine to a mandatory 12 year sentence.\n\nSo five Americans broke the law and are now suffering from the consequences of breaking the law?\n\n>What if anything do you think the US government should do?\n\nAbsolutely nothing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "twistedh8",
            "body": "Nothing. They didn't care when others were detained elsewhere. They can get the britanny Granier treatment.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DavidLivedInBritain",
            "body": "Part of me thinks they knew they should have been careful but I guess we should do what we did to get Brittney Griner free",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jcmacon",
            "body": "Well, guess I'd ask, what should we allow Turks and Caicos to do if one of their citizens breaks our laws. Should we allow them to seek out diplomatic resolutions? Sure. Then we can do that too. Would we allow them to put pressure on us financially? No? Then we shouldn't be allowed to do that. \n\nAnd maybe Americans need to be more careful when visiting other nations and if you are a gun owner have a full understanding of the laws of the nation you are visiting. Taking your range bag as luggage? Then you might want to check that shit out. \n\nWe should stop excusing and accepting stupidity as an excuse to break laws in other countries \"because we are Americans\".",
            "score": 1
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "That seems like a law that's probably pretty well known in those places. Like, something you should easily be able to find out before you go there.\n\nLike, maybe ask for leniency, but honestly that sounds like the kind of dumb fuck up that maybe you ought to take the punishment on.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cleverdawny1",
            "body": "The US government should do what it can to secure the release of those people unless it was an intentional effort to smuggle firearms into the country.  If they were imprisoned because they accidentally took a 9mm round with them in a duffel bag, it is obviously an unreasonable prosecution and a 12 year sentence would be morally unjustifiable and a ridiculous miscarriage of justice.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "engadine_maccas1997",
            "body": "The State Department should do what they can to secure their release. If guilty, they should have to pay some penalty for breaking the law. 12 years is ridiculous. But I wouldn’t be opposed to a smaller sanction. \n\nResponsible gun ownership means knowing the laws of where you bring your weapons/ammunition, knowing where your weapons/ammo is at all times, and never be caught off guard in such a way.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mrmfrides",
            "body": "Support T&Ks, these people broke the law on purpose. . Take away their gun rights in the US.\n\n\n\nI think the black market,  why all these hunters are going to T&k, and \"accidentally\" leaving ammunition in their bag, needs to be identified.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "NeolibShill",
                    "body": "You are saying they accidentally left a single bullet in their bag to smuggle it into and then back out of the country? That's their criminal plot",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NPDogs21",
            "body": "Advocate on behalf of the Americans if it was a genuine accident. I find it astounding how left-wing people who are against mandatory minimums and over sentencing are suddenly in favor of them when it comes to anything gun related. ",
            "score": 0
        },
        {
            "depth": 0,
            "author": "washblvd",
            "body": "Put out a travel advisory and heavily encourage cruise ships to bypass Turks and Caicos as a destination. If cruise ships begin skipping T&C, their government will feel the financial pinch and may be drawn to the table.",
            "score": 0
        }
    ]
}