{
    "title": "Do you support a company hiring based apon skin color, gender, or sexual preferences OK?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nIs it ok if it is for minorities? does this leave more qualified applicants left out? Is it fair if let's say, a black lesbian with 2 years in college was to get a job over a cis white man with 4 years? Didn't he in the end put in more work, and therefore deserve the job more? Or is there some underlying factor that I am failing to grasp? \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DickieGreenleaf84",
            "body": "Why would there ever be a major discrepancy in qualifications? I've not heard of many companies that don't have dozens of applicants for even the most niche positions.",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "coolgy123",
                    "body": "American Airlines recently stated that they will hire pilots based on inclusiveness. A pilot does not need college. This therefore would lead to a person of color being chose over a white male with higher qualifications, as before that there was never an issue.",
                    "score": -27,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DickieGreenleaf84",
                            "body": "They all need their licenses and experience. Having a BA in philosophy or a Bachelor of Medicine doesn't help you be a better pilot. Is there any evidence that someone was hired for their minority status despite having much less experience?",
                            "score": 32
                        },
                        {
                            "depth": 2,
                            "author": "srv340mike",
                            "body": "**TL;DR: The airline hiring process is brutal and nobody is getting hired without the proper qualifications**\n\n> A pilot does not need college.\n\nYou're correct that pilots don't need a degree - just the flight training pipeline - but a college degree was a requirement for a long time to get hired at a top airline job (DL/AA/UA/FX/UPS). There were hiring frenzies in 2018-2019 and a huge one 2021-2023 in which that requirement was dropped by those airlines to account for a bit of a pilot shortage. \n\nThe way airline hiring works, at least at the big airlines, is a points system. Different things on the application are given points values. This includes college, but other things like volunteer work, driving history, general work history, but ESPECIALLY flight hours, flying qualifications, etc. There's a minimum threshold the application has to hit to get a call for an interview. Many places have an aptitude or reasoning test that has to be taken before that point, but after the app gets a response, and if it doesn't hit that, you don't get a call back. Personality tests are also common, though where exactly you take it differs - before the interview, during, etc. One place famously has candidates talk to a psychiatrist, although that occurs at the actual interview.\n\nOnce at the actual interview, the interview generally will include HR and one or two pilots. Sometimes there's an HR interview in advance.  The panel will take notes and make recommendations, and then the final decision will generally be made by a \"blind\" pilot hiring board.\n\nIt's an extremely grueling process. Just getting a call back on your application alone requires A LOT of effort and qualifications. Getting through the actual interview is even tougher, and generally requires spending hundreds of dollars on interview prep, because the airlines can tell who did and didn't do interview prep and if you didn't, they'll consider you as not having tried hard enough. It's a giant fucking gauntlet.\n\nA couple extra points on the application - for example, a DEI initiative thing - only gets you to the interview. It doesn't get you the job. I promise you that nobody is getting hired at AA solely due to their skin color or gender. Anyone who makes it as far as that interview has the qualifications to do the job. And that's *before* you consider how few pilots are minorities, and how few are women. AA, or anyone else, could NEVER staff the airline if they only hired according to a DEI initiative. It's one of the most lily white, and male, industries there is.\n\nTo be completely frank, whoever fed you that about AA has No. Fucking. Idea. what they are talking about.\n\nSource: 5000+TT, 1000+ B737, ATP, CFI/CFII/MEI. \n\nThanks for playing. Try again.",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ButGravityAlwaysWins",
                                    "body": "Tangent but a follow up. After multiple attempts at getting my son to meet the pilot when we were traveling to India, I finally got him in a cockpit when we flew Spirit, it weirdly was actually cheaper plus the only flight that worked with our schedule, to Las Vegas.\n\nThe captain was exceedingly nice and was selling my son on the concept of trying to get flight time as soon as possible. He was also very obviously exceedingly proud of the fact that his copilot was a woman, ex-military and very young. \n\nThe whole thing was very funny because my son confronted with an actual plane and not Microsoft flight simulator finally understood how complicated the controls really are when he saw them in person.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "srv340mike",
                                            "body": "The funny thing is he could actually probably control the aircraft just knowing what he knows from flight sim. Most of that stuff in the cockpit controls systems that aren't directly related to flying the airplane (i.e. air, electric, etc) and is mostly checklist driven. The screens provide information and you need to know the instruments of course, but he'd probably do a bit better then he realizes.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ButGravityAlwaysWins",
                                                    "body": "So the side benefit of him being so into flight simulator is that he understands the concept of checklists now and what their value is. So my wife has finally been able to get him to understand that he needs to write down in an ordered list everything he needs to do for school and prioritize things. That is something he was never able to fully grasp unlike his sister.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "srv340mike",
                                                            "body": "That actually is a really great a life skill. If you're doing it the \"right\" way, aviation imparts a very structured way of going about things and it's really good for developing routines. Pilot checklists get pointed to as an example of how to approach things in that sort of matter in other industries all the time.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ButGravityAlwaysWins",
                                                                    "body": "I might’ve mentioned this to you before, but I worked on a project for an auto manufacturer focused on their design process. The guy who led the effort had worked with Boeing for years.\n\nThe entire focus of the project was bringing checklist mentality to the company. \n\nI am fully bought in on the idea of having read The Checklist Manifesto from Atul Gawande. The way it benefits medicine is unreal.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Megalomaniac697",
                                    "body": "> I promise you that nobody is getting hired at AA solely due to their skin color or gender.\n\nNo one claims that, but they can pick a low scoring candidate with the \"correct\" identity over a high scoring candidate who has the \"wrong\" identity. The end result is an airline with inferior pilots doing the job. \n\nI hope you don't try to contend that among pilots there is a hierarchy of ability.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "srv340mike",
                                            "body": "The thing is if the candidate is low scoring they're not getting called for an interview in the first place. You get points for DEI initiatives when apps are scored, but its not a lot of points. \n\nAmerican, generally, seems to have its' floor at 2500 hours and 1000 hours of airline experience. Nobody's getting an app pulled lower then that unless you're coming out of the military. They're not picking \"low scoring\" applicants over high scoring ones because of DEI. I've both been through, and been involved in, this process. Its' cold and deliberate.\n\nNobody whose getting hired is underqualified.\n\nThere was a time where underqualified people were getting into the regionals, but that was a bit of a \"fog the mirror\" phase. It was literally meet the ATP minimums -> get regional job. So even then, DEI initiatives didn't really affect anything - there were way more jobs than there were pilots to fill them. But even that's stopped. The bottom of the industry is over-saturated with First Officers who haven't yet reached captain minimums, so for the most part right now the regionals aren't hiring at all, and those are the entry level jobs.\n\n > I hope you don't try to contend that among pilots there is a hierarchy of ability.\n\nSome people are better than others. Most of the skills improve with time and experience and can be cultivated, but there is some natural aptitude at work, too.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Megalomaniac697",
                                                    "body": ">The thing is if the candidate is low scoring they're not getting called for an interview in the first place.\n\nBecause it wouldn't happen if the world made sense? I am not buying that for a second. Corporations set these ridiculous identity quotas and then set about chasing them. Since they won't be able to find a suitable pool of candidates with the \"correct\" identity, they will keep lowering the bar until they get them.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "srv340mike",
                                                            "body": "I've been through the process several times, been involved in the process at both companies I've worked at, and it's a small industry so it's not hard to find out other people's experiences. You don't have to buy it but I can show you the back of my ATP if that's what it takes to prove I'm speaking from a position of familiarity. \n\nThere's a huge number of factors that go into the process. Hell, Delta won't even call you back if you don't match abbreviation formats in your app because they consider it bad attention to detail (i.e. use Rd. in an address in one place and spell out drive in another)\n\nThe hard limit on flight time is a bit harder to pin down. Every company has a different \"magic number\", both the quantity and what number it is - total, or turbine, or PIC, or airline time. But the number is almost always higher than the \"minimum\" published online. The point, though, is that you're not getting a call back without meeting what they're looking for. Period. No demographic information changes that.\n\n\n>Since they won't be able to find a suitable pool of candidates with the \"correct\" identity, they will keep lowering the bar until they get them\n\nThere literally aren't enough certified pilots who are women or minorities in the country to staff even a fraction of legacy airline new hire positions. They could lower the standards to the FAA ATP mins - i.e. the legal minimum threshold to hold the airline pilot license - and they won't be able to preferentially higher women and minorities in a way that disadvantages white men.\n\nI can't speak for the rest of the corporate world but the actual pilot side of the aviation industry is so esoteric that it doesn't make tons of sense compared to a lot of stuff elsewhere.",
                                                            "score": 8
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Sleep_On_It43",
                                                            "body": "Of course you’re not buying it…let’s face it…you are brainwashed by bigotry.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "willpower069",
                                                                    "body": "Yeah it’s strange how people like them complain about it, but have zero evidence to back up their points.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Gertrude_D",
                                            "body": "Anyone who excels is going to get hired, period. Am I getting upset at the C+ fit is getting hired over the B-? Not really. When the applicants are close, there are so many little things that can sway a decision that skin color is just another one on the pile. I used to do a lot of hiring for a medium sized company. The good applicants get sniffed out and hired pretty easily. If I didn't hire them because I had a better one, you bet I'm passing that resume on to another department with a recommendation.\n\nMost of the time you weed out the ones that are a no then look at the rest who may sit around the same level of acceptability. Some of those are going to rise above because they can sell themselves well. Then you think about the person - well, she got my obscure reference, or he went to school with my brother, or I liked the way they smelled. Something stupid like that tips the scale so often. How often do I just feel a kinship with this white woman over here because she has a similar life experience to me rather than the black woman who just moved here? She feels like she would be a better fit because I'm a good fit and this woman is like me, cool.  It's not like people are really even aware of this most of the time, but those things do play a part and taking time to think about it makes you aware of how superficial and paper thin some of the hiring decisions can be.\n\nThe biggest lie is that there is *one objectively better* candidate for most jobs. Nah, there's sooooo much subjectivity in hiring. I once had a manager tell me the tipping point for hiring me over another was that she liked my signature. No, she didn't do handwriting analysis or anything, she just thought it looked cool.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "So how do you imagine that works? American Airlines used to hire people with qualifications and certifications to show that they knew how to fly a plane but now they’re going send a van down to the ghetto and pick up a couple of people off the street corner, put them in uniform and tell them to fly?",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "srv340mike",
                                    "body": "I know you're giving him snark, which is deserved, but you're even selling short the qualifications by a lot when you just say \"certifications to show that they knew how to fly a plane\"",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "Oh, I know. Sorry about that.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "coolgy123",
                                    "body": "no. I belive that other people are being given unfair advantages against other aplicants.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Megalomaniac697",
                                    "body": "They are going to pick applicants who do worse in testing and evaluation, but who have the \"correct\" racial/sexual identity.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sleep_On_It43",
                                            "body": "Goddamn…you really have your mind made up on this, don’t you? You just KNOW(with no real evidence) that this is going on. You need to get a fucking grip dude.",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "willpower069",
                                            "body": "Any evidence of that? Last person I asked disappeared.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "mr_miggs",
                            "body": ">American Airlines recently stated that they will hire pilots based on inclusiveness. A pilot does not need college. This therefore would lead to a person of color being chose over a white male with higher qualifications, as before that there was never an issue.\n\nAre you aware of what the actual qualifications to become a pilot are?  The base standard requires more training than most jobs. \n\nNo airline is going to hire unqualified people to fly their planes.  If they crashed, there would potentially be hundreds of millions of dollars of cost. And lost public faith in their airline that could bankrupt them.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "> Is it fair if let's say, a black lesbian with 2 years in college was to get a job over a cis white man with 4 years?\n\nOK, I understand that this is how it is described in right wing media. But just step back a little bit and ask:\n\nDo you think it’s conceivably possible that companies, anywhere from small businesses to startups to multi national companies with revenues in the billions are deciding that they should hire somebody completely unqualified for jobs because they happen to be a black lesbian?\n\nJust step back and ask if that is even conceivably possible. Because if you get outside your media bubble - I’m sorry I’m loathe to use the term media bubble in a conversation like this, but it is extremely appropriate here  - the idea is absolutely fucking preposterous. \n\nLike you’ve had a job I assume. What seems more plausible. That companies are hiring completely unqualified people because of DEI or that media that makes money by making you angry so you watch it is lying to you?",
            "score": 49,
            "replies": [
                {
                    "depth": 1,
                    "author": "GabuEx",
                    "body": "Ironically, anti-DEI people are effectively saying that corporations aren't actually *that* greedy, because apparently they're happy to hire unqualified minorities and lose money for no reason, just because they believe that strongly in... something, I haven't quite figured out what yet.",
                    "score": 27,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PepinoPicante",
                            "body": "> because they believe that strongly in... something, I haven't quite figured out what yet.\n\nI think the typical rationale is \"they have to, in order to placate the woke masses, be politically correct, etc.\" \n\nThey wouldn't do it if they didn't have to. So the costs of \"affirmative action\" are built in. They consider it a wasted employee... but it's a marketing expense.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GabuEx",
                                    "body": "I find it bizarre how the anti-DEI people are so unwilling to consider the thought that maybe these companies just... think it's a good idea.\n\nLike, just in this comment section, we have one person who thinks that giant megacorps like ExxonMobil and Bayer have been bullied into submission by supervillain activists who would be able to literally *run them out of business* if they didn't implement DEI, and another who thinks that entire corporate HR departments have gone completely rogue without executives' knowledge and are hiring unqualified minorities because they're just that woke and no one knows enough to stop them.\n\nYou would think that someone would realize that if they have to get that crazily conspiratorial to defend their position that this has been imposed from without that eventually they would have the thought occur to them that maybe the companies just, like, want to do DEI.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Megalomaniac697",
                            "body": ">Ironically, anti-DEI people are effectively saying that corporations aren't actually   \n>  \n>that  \n>  \n> greedy,\n\nCorporations ARE greedy, but their HR departments are very woke. So both things happen at the same time.",
                            "score": -26,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GabuEx",
                                    "body": ">their HR departments are very woke\n\nHow did they get very woke?  Did they spawn into existence fully formed without any executive action?  Are the C-suite people powerless to fire these people who are killing their company's profitability?",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Megalomaniac697",
                                            "body": ">Are the C-suite people powerless to fire these people who are killing their company's profitability?\n\nThey are not powerless, but they are slow to react. The type of people who go into HR tend to be female and tend to be woke, so it just naturally works out that way.\n\nElon has notably fired 80% of Twitter staff, including I presume most of HR, without it noticeably affecting company operations. Large corporations are carrying TONS of dead weight. They become similar to the government once they get past a certain size.",
                                            "score": -19,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Ok-One-3240",
                                                    "body": "I stopped using Twitter because of that staff cut… that staff cut killed Twitter my guy. Well, to be fair, it was a lot of Elons bullshittery.\n\nIt’s literally just spam, scams, porn and nazis now. \n\nAnd since you’re a capitalist, I’m willing to bet you know Elon’s decreased the value of that company by what, 90~%?",
                                                    "score": 18,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Megalomaniac697",
                                                            "body": ">And since you’re a capitalist, I’m willing to bet you know Elon’s decreased the value of that company by what, 90\\~%?\n\nNot nearly by that much and the advertisers will come back and then some. They can't keep their hand out of the cookie jar.\n\nThe point of X right now is not to make money, but to be an outlet for free speech, and it's doing a fantastic job of that. \n\nWatching media shills get \"Community-Noted\" is an entertainment in itself.",
                                                            "score": -13,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Ok-One-3240",
                                                                    "body": "You’re so right, it was a mere 80%. \n\nhttps://qz.com/elon-musk-x-twitter-value-drops-2023-1851136401\n\nAnd no, they’ll advertise somewhere else, and why would they pay for a site that’s hemorrhaging users?\n\nNo, Twitter is dead. It’s literally just right wing nuts now, and if you think that’s a good business model, I have an island to sell you.\n\nWatching the owner who high and mightily declared himself the champion of free speech remove community notes that make him look bad is fairly entertaining, I’ll give ya that. It’s nice to know that the world’s richest man has a small pp.\n\n^ see this for the free speech bullshittery you claimed.",
                                                                    "score": 16,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "WeenisPeiner",
                                                                            "body": "Right wing nuts and bots.",
                                                                            "score": 6
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ok-One-3240",
                                                                            "body": "Just a quick add, that 80% represents ~32.5 billion dollars.",
                                                                            "score": 4
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Megalomaniac697",
                                                                            "body": "You are free to live with your delusions, but yes, there is more lively discussion and free speech on X than anywhere else on the internet.",
                                                                            "score": -8,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Ok-One-3240",
                                                                                    "body": "Lol I’m not the one ignoring fact to defend a billionaire megalomaniac who bought a company and immediately devalued it by 80%.\n\n“X” is an insult to the platform Twitter used to be.\n\nIt’s porn, pay to win(get views) crack pots, right wing nut jobs, scammers, and a concerning number of Nazi sympathizers. \n\nhttps://mashable.com/article/x-twitter-daily-active-users-mobile-app-decline-report-x-disputes\n\nhttps://www.benzinga.com/amp/content/37926167\n\nhttps://www.abc.net.au/news/2024-05-23/twitter-misinformation-x-report/103878248\n\nEdit: this is not very capitalist of you",
                                                                                    "score": 13,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Megalomaniac697",
                                                                                            "body": "I've never seen porn on X. Tells us something about your search history.\n\nFunny that you are clutching for straws linking to mainstream media articles purporting misinformation on X, thr very same media that can't get a foothold there because it's getting eviscerated by fact checks and it no longer has censors to protect its nonsense.",
                                                                                            "score": -2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Ok-One-3240",
                                                                                                    "body": "So I guess you also don’t use the platform, don’t blame you, I’ve seen porn posted under Elon’s tweets.\n\nAnd okay lmfao. \n\nScreaming fake news when you’re losing an argument is just unbelievably stereotypical.",
                                                                                                    "score": 9,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Megalomaniac697",
                                                                                                            "body": "If you see porn, it's because you search for it and the algorithm is feeding it. There is no other explanation.",
                                                                                                            "score": -2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Ok-One-3240",
                                                                                                                    "body": "… are you like trolling? Or have you genuinely never used the platform?\n\nThey were literally planning to launch a competitor for OnlyFans… before they had their little child porn snafu.\n\nhttps://www.brusselstimes.com/910938/elon-musks-x-is-turning-into-a-porn-website-says-belgian-regulator\n\nhttps://www.livemint.com/companies/news/x-is-literally-loaded-with-porn-users-slam-elon-musk-after-he-claims-x-outperforms-instagram-in-child-safety/amp-11716258985633.html\n\nhttps://www.rollingstone.com/culture/culture-features/twitter-porn-bot-sex-meme-1234973030/amp/\n\nhttps://nypost.com/2024/01/29/business/elon-musks-x-to-hire-100-content-moderators-in-wake-of-taylor-swift-ai-fiasco/\n\nhttps://sfist.com/2024/01/29/x-and-other-platforms-restrict-searches-for-taylor-swift-as-deepfake-porn-pictures-of-her-go-viral/\n\nhttps://www.icirnigeria.org/users-urge-musk-to-crack-down-on-pornography-spread-on-x/\n\nhttps://www.npr.org/2024/03/07/1235784919/twitter-x-bots-social-media-elon-musk\n\nhttps://www.forbes.com/sites/paultassi/2023/12/29/i-never-had-bot-problems-on-twitter-until-elon-musk-now-theyre-stalking-me/\n\nhttps://www.washingtonpost.com/technology/2023/07/27/twitter-csam-dom-lucre-elon-musk/\n\nhttps://www.theverge.com/23327809/twitter-onlyfans-child-sexual-content-problem-elon-musk",
                                                                                                                    "score": 6,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Megalomaniac697",
                                                                                                                            "body": "I am on the platform every day and I can assure you that the above are just hit pieces, which you could equally write about facebook, Instagram or reddit. They are going after X because free speech is something that lefties organically cannot handle. It gives them indigestion and a burning pain in the ass to know that people can actually express opinions online. They have a lot more hurt coming their way because people naturally gravitate to free speech. Even lefties cannot stay off X. They repeatedly proclaim how they are leaving and then, months later, they are still posting furiously.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Ok-One-3240",
                                                                                                                                    "body": "I’ll just quote ya-\n\n> You are free to live with your delusions\n\nYou can choose to ignore all the evidence you want. That doesn’t change the fact that the value of the company disagrees. It’ll die. \n\nI work in IT, he gutted that company’s technical staff too. I’m sure if you’re a user you’ve noticed the outages and service problems that have occurred more and more often… a well built platform can run on autopilot effectively for a long time, but not forever. The technical deficiencies will become more noticeable. I’m just glad he took it private so only he’ll lose that money.",
                                                                                                                                    "score": 7,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Megalomaniac697",
                                                                                                                                            "body": "I run a software company and I know that in a team of 200, there are maybe 10 key people. Elon has retained those who are needed",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "Ok-One-3240",
                                                                                                                                                    "body": "Lol ya can’t fix that level of… let’s go with ignorance.\n\nYou remind me of my former employer.",
                                                                                                                                                    "score": 8,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "Ok-One-3240",
                                                                                                                                                            "body": "Made a ton of money in crypto and blew it all trying to start an MSP. 7 years. Average turnover was like 2 months. Real piece a’ crap",
                                                                                                                                                            "score": 5
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "IgnoranceFlaunted",
                                                                    "body": ">to be an outlet for free speech, and it’s doing a fantastic job of that.\n\nThey’re literally silencing people for saying “cisgender” right now. He banned a journalist for working with his competitor. They have banned and censored many, many people at the request of governments.",
                                                                    "score": 9
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "hitman2218",
                                                                    "body": "An outlet for free speech lol",
                                                                    "score": 6
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ButGravityAlwaysWins",
                                                                    "body": "Why do the advertisers need to come back? Twitter was a shitty advertising platform even before Elon took over.\n\nYou’re missing the big problem that all of these companies have. Almost all Internet advertising has accrued to Facebook and its platforms and Google. Outside of specific cases like LinkedIn there’s basically no reason to spend your budget elsewhere.\n\nWhy spend the money configuring your full click funnel in another platform when you can handle all intent and brand marketing on just two platforms? Why have your team learn two platforms for managing advertising spends? \n\nEspecially when if you try, your conversion rate is terrible on Twitter because it is botted to hell and back. And especially since anybody who cares about their brand doesn’t want to deal with having their logo sitting next to a Nazi tweet.\n\nAnyone looking to put part of their spend outside of Google and Meta platforms is looking at programmatic podcast advertising, well targeted email lists or specific niche platforms.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "GabuEx",
                                                    "body": "Are you saying the executives at ExxonMobil are just, like, unaware of the fact that their company has a DEI program?  Did someone forge the [\"Message from the CEO\" section](https://corporate.exxonmobil.com/careers/global-diversity#GlobalDiversityFramework) of their website without his knowledge?",
                                                    "score": 9,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[removed]",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "GabuEx",
                                                                    "body": "[The page on ExxonMobil's website on DEI](https://corporate.exxonmobil.com/careers/global-diversity#GlobalDiversityFramework) contains a \"message from the CEO\".  Was this forged, and did he not actually know about this?\n\nI'm just trying to figure out what you're actually saying, as you seem to be asserting that this is all the actions of rogue HR departments without the knowledge of people who would otherwise fire them if they were aware of what they were doing, but the fact that executives are going on the record announcing these initiatives would suggest otherwise.",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Megalomaniac697",
                                                                            "body": "Where did I say that they don't know about DEI? They don't know that much about the impact, but they are learning. That's why there is now a trend towards slashing DEI programs rather than expanding them. A huge reversal from a few years ago.",
                                                                            "score": 3
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HotStinkyMeatballs",
                                                                    "body": "Dude you're literally rambling without any actual basis in fact. Every comment you make is just you projecting your feelings. You've made multiple false claims, dismissed people who provide supporting evidence, and then call people \"snarky\"?\n\n  \nTake a look in the fucking mirror.",
                                                                    "score": 2
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AskALiberal-ModTeam",
                                                                    "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Sleep_On_It43",
                                    "body": "I think that’s a ridiculous assertion. The HR departments are the most company loyal departments in the organization. They aren’t going to hurt the company by hiring unqualified people.\n\nIf you work for a living….trust me…HR is not your friend….they are the company’s friend.",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "C137-Morty",
                                    "body": "So you're saying these companies are hiring unqualified people via their woke HR departments... why aren't they going under?",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Meihuajiancai",
                                            "body": "It's not unqualified vs qualified. It's qualified vs more qualified.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Megalomaniac697",
                                            "body": "They are big companies. They can carry a lot of dead weight. Elon laid off 80% of Twitter and they are chugging along fine.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "C137-Morty",
                                                    "body": "So what you're saying is, very few are really qualified in the first place?",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "HotStinkyMeatballs",
                                    "body": "HR departments work for the company dude. What are you talking about?",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "03zx3",
                                    "body": "Lol. You don't know what HR does.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Meihuajiancai",
                                    "body": ">Corporations ARE greedy, but their HR departments are very woke. So both things happen at the same time.\n\nI don't think this is accurate. From a top down perspective, the management of a corporation know that hiring someone qualified, but not as qualified as someone, else will have a marginally negative impact on performance. However, they get the boost from claiming they have implemented DEI and avoid media spotlight for not implementing DEI. By their calculation, they see that as the better option.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Meihuajiancai",
                    "body": "I was under intese pressure from HR to hire a black woman, not sure about her sexual preferences, over the two finalists I wanted, a Japanese woman and a white man. Her qualifications were decent, but not nearly as good as the other two. I told them I won't do it and we just didn't hire anyone. \n\nThis stuff happens. Maybe it's your media bubble that keeps telling you it doesn't happen.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "Back about 20 years ago one of my guys came to me after work and told me that the rest of the men on the staff choose him to tell me that they would just reject any candidate I sent to them for an interview for a design position that wasn’t a woman. They wanted a woman.  A Black or Hispanic woman was preferable but not a requirement. \n\nI didn’t break the law or anything but sure enough we hired a Hispanic woman for the job. \n\nThey wanted different backgrounds on the team for valid reasons. It wasn’t because woke - it’s because they saw the business reasons why it would be good and realized that if the company was doing better that was better for them financially. \n\nThere are valid reasons to force some diversity into your staff.  I get that that can be annoying sometimes and that there’s opportunities for idiots to misuse or abuse it. But this idea that there are large numbers of unqualified people getting hired simply because they are black is idiotic.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Meihuajiancai",
                                    "body": "The tone of this post is vastly different than the tone of your other posts in this thread. Vastly different. \n\n>this idea that there are large numbers of unqualified people getting hired simply because they are black is idiotic.\n\nThe OP used the term 'more qualified'. When I see this discussion come up irl or online, it's almost always a 'more qualified' candidate. \n\nAnd yet your other responses, this response, and the consistent narrative in responses is 'unqualified vs very qualified'. \n\nYou commented on the 'what is bad faith' post yesterday. I don't see how latching onto the 'completely unqualified hire vs most qualified person in the world not hired' narrative isn't a textbook example of bad faith. \n\nNo one is claiming a completely unqualified candidate is getting hired over very qualified candidates. No one except maybe edge lord meme makers. And yet over and over again the responses completely disregard the legitimate question in favor of the illegitimate 'own the cons' narrative that you've embraced multiple times in this very thread. Why not lead with the last paragraph you wrote and then have the debate? Why lead with the narrative that it isn't happening?",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bucky001",
                            "body": "Did HR give you a reason, or is there a reason you would guess?\n\nIs this common?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Meihuajiancai",
                                    "body": ">Did HR give you a reason\n\nYes, the board of directors want more minority hires to meet DEI goals.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Gilbert__Bates",
                            "body": "Most liberals 100 percent know that this happens, they just try and gaslight people because they know it looks bad for their side if they tell the truth.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Meihuajiancai",
                                    "body": "Ya, the commenters here, and irl ime, latch onto this extreme 'completely unqualified vs the most qualified person in the world' narrative because it makes it easier to grandstand. In reality, it's 'qualified person vs more qualified person'. I've dealt with it at my company. I have friends who've dealt with it at their companies. It's definitely a thing. \n\nBut having a good faith discussion about it,  (ironic because their was a post here the other day asking what bad faith is, and it's *exactly what they're doing on this topic*) would mean they'd have to actually make a cogent argument in defense of it. It's like Schroedinger's DEI. It only exists when they want it to. DEI is necessary, but it also doesn't happen and when it does, it wasn't actual a policy and they were actually the best candidate anyway...\n\nAnd tbf, I'm not even necessarily opposed to it. I get the arguments in favor. At my company, one time I did give in to HR because the discrepancy between the two candidates was small enough that I was fine hiring the black guy. Other times, when the discrepancy was larger, I've stood firm. \n\nThe whole thing is indicative of how our society communicates. Good faith discussions are nigh on impossible.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Nah. \n\nThat doesnt look bad. Thats reducing segregation",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Gilbert__Bates",
                                            "body": "It looks bad to most voters, according to polling data and results from ballot initiatives. Crying about it wont change that.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sad_Lettuce_5186",
                                                    "body": "Ok. So Democrats are lying about this because we know it looks bad and are crybabies if we dont think it looks bad?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Gilbert__Bates",
                                                            "body": "If you don’t think it looks bad to most voters then you’re woefully uneducated. Even deep blue California rejected an affirmative action ballot measure by a fairly solid margin.",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sad_Lettuce_5186",
                                                                    "body": "I think it looks bad to most people here, because theyre White. \n\nI dont think it is bad. I should’ve clarified. \n\nMuch like the civil rights movement looked bad back then too",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Gilbert__Bates",
                    "body": "> Like you’ve had a job I assume. What seems more plausible. That companies are hiring completely unqualified people because of DEI or that media that makes money by making you angry so you watch it is lying to you?\n\n\nOr the third option, which is that there are usually several qualified applicants for each job, and companies will greatly favor the DEI hire as long as they meet the bare minimum qualifications. Which is what pretty much anyone with recent experience hiring at the entry level will tell you.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "Not going to come close to doxxing myself, but my wife’s best friend is executive for one of the largest publicly traded companies in the world and head of HR. Talking about how DEI means that certain people have this massive advantage in hiring is a fun way to get her to go off and tell hilarious stories. Usually about how the person least likely to actually get a promotion is 100% certain it’s because of DEI. Sometimes in cases when the person who actually got the promotion is white man.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gilbert__Bates",
                                    "body": "Sounds like she doesn’t hire at the entry level, so it’s completely irrelevant to what I said.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ButGravityAlwaysWins",
                                            "body": "Quick question. How do you think somebody rises to be the head of HR for a major company? You don’t think they ever started their career at a lower level where they were doing hiring?\n\nAdditional question: do you think that there are some roles at a publicly treated company where the head of HR still gets involved in the hiring decisions?\n\nThat said, one of my clients does outsourced HR and change management for small businesses. The staff there makes fun of this stuff too. And they also make fun of really shitty DEI programs that HR departments use to cover their ass while not actually doing anything to address diversity inclusion or equity in the company.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Gilbert__Bates",
                                                    "body": "Most of the rise in DEI hiring happened after 2020. If someone was hiring at the entry level a decade ago then they wouldn’t be experiencing it. Also not every company is the same and some are more DEI focused than others.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ButGravityAlwaysWins",
                                                            "body": "No, that’s not correct. Things get renamed but all of this is the same stuff that has been going on since the civil rights movement. DEI is just a new name for the same thing. Companies were spending over 10 billion in the US on diversity programs by the early 2000s. There was a big push lining up to when McKinsey published its report on how diversity increases corporate profits.\n\nAside from actual diversity programs there is corporate HR bullshit, where the purpose of the diversity program is a bunch of CYA and feel good crap. That goes back decades as well.\n\nThe reason people are talking about DEI is what is more recent. People like Christopher Rufo started promoting it because he needed to replace CRT as the focus point of pointless right wing rage. \n\nThe other reason it’s in focus right now is that talking about DEI was a marketing technique used by companies in the wake of the George Floyd protests.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Gilbert__Bates",
                                                                    "body": "Diversity hiring has been an issue for awhile, but it really started ramping up after 2020 to a much greater extent than it ever has before. Most recent grads either have direct experience with this or know someone who has. And in this awful economy for entry level jobs, younger white folks are growing less and less willing to be a whipping boy for liberal and leftist identity politics. It's a whole lot easier to be pro DEI until you're struggling to pay rent because most of the decent jobs are going to applicants with more diversity points. Like it or not, a backlash is coming, because people care more about putting food on the table than whether or not some Ivy League liberal thinks they're racist.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Megalomaniac697",
                    "body": ">Do you think it’s conceivably possible that companies, anywhere from small businesses to startups to multi national companies with revenues in the billions are deciding that they should hire somebody completely unqualified for jobs because they happen to be a black lesbian?\n\nAbsolutely they do. There are entire HR departments salivating over the prospect. It doesn't make any business sense, but it's happening anyway. Mostly at large companies as the small ones cannot afford too much nonsense.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fastolfe00",
                            "body": "Using race as a qualifying factor in hiring is explicitly illegal employment discrimination in the US. The only place this is happening is in conservative fever dreams. If you see it happening, report it to the EEOC.\n\nhttps://www.eeoc.gov/filing-charge-discrimination",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Megalomaniac697",
                                    "body": "Ummm, dude, Ketanji? Biden said upfront that he's nominating a black woman to SCOTUS without checking anyone else's qualifications.\n\nClearly unconstitutional and illegal, but there you have it.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "fastolfe00",
                                            "body": "SCOTUS appointments are political and are not subject to employment law and are not considered acts of \"hiring\" or employment.\n\n> without checking anyone else's qualifications.\n\nEveryone currently serving on the Supreme Court can be [said to be qualified](https://www.americanbar.org/groups/committees/federal_judiciary/resources/supreme-court-nominations/), but [the Constitution does not require any sort of qualification](https://constitution.congress.gov/browse/essay/artII-S2-C2-3-5/ALDE_00013096/).\n\n>Clearly unconstitutional and illegal\n\nNo.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "coolgy123",
                                                    "body": "so wouldn't that just be exploiting the system? correct me if I am wrong of course.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "fastolfe00",
                                                            "body": "\"Exploiting\" a system? The system isn't \"designed\" to work any other way. It's a political system. The intent here isn't to oppress white people, man, it's just making SCOTUS look like America. It's \"exploiting\" a system less than Americans choosing who to vote for partly based on race or racial bias are. Should we root those voters out and hold them accountable for employment discrimination?",
                                                            "score": 0
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Megalomaniac697",
                                                    "body": "Discrimination is always illegal. No ifs and buts.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "fastolfe00",
                                                            "body": "I don't think you understand the basics of Constitutional Law here. If you don't like the way that someone was Constitutionally appointed to a position, your remedies are prescribed by the Constitution: get your senators to vote against confirmation, vote them or the President out of office, or impeach them. Trying to enforce employment law against Constitutional appointments is nonsensical. Appointments aren't employments.\n\nIf you're just trying to say \"this feels unfair to me\" or \"there might have been someone my color that might have been chosen if they only tried harder\" or \"people my color should be in the majority everywhere\", just say that.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Megalomaniac697",
                                                                    "body": ">your remedies are prescribed by the Constitution: get your senators to vote against confirmation, vote them or the President out of office, or impeach them.\n\nOk, sure, I'll set about that later this afternoon.\n\n>If you're just trying to say \"this feels unfair to me\"\n\nIt is unfair because it's race/sex based discrimination. I am flabbergasted that people on the left aren't bothered by it. \"It's ok when we do it\" should really be the leftist motto.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "fastolfe00",
                                                                            "body": ">I am flabbergasted that people on the left aren't bothered by it.\n\nI personally don't think this goes far enough. I think for positions of power and representation, the makeup of the body should maximize representation of every identity group in the US that we possibly can. This means appointments should *intentionally* select people based on their identity group memberships.\n\nThis is one of the reasons I'm a fan of proportional representation used in other forms of government, rather than our system, which magnifies majorities, and incentivizes gerrymandering.\n\n>It's ok when we do it\" should really be the leftist motto.\n\nI just don't think you understand what people are saying. It is possible to believe both of these things at the same time: \n\n1. Employment should be based on qualifications and people shouldn't have the opportunity to be racist or sexist against candidates so as to perpetuate societal inequality and injustice.\n2. Appointments to positions of power should be made with consideration of representation of the American people. \n\nSince we probably agree on (1), we can enshrine that in law and criminalize violations of it when they happen. That's basically what this whole post is about. Discriminating on race in hiring is illegal even though many conservatives have been misled into thinking it's rampant.\n\nBut since (2) isn't that, we're not going to agree on the best principles to use in appointing people to positions and power within our government, and since the authority for how appointments work is in the Constitution, and the Constitution does not prescribe a certain way that we need to qualify or select people for the role, the best we can do is be mad when it doesn't look the way we want it to look and do the things the Constitution says we can do to fix it. Trump can make a point to say \"I am going to make it a point to nominate a *white* candidate\" and it would be exactly the same conversation. I'm sure liberals would be upset at that, and might question his motives for doing so, but ultimately the Constitution grants him that ability, right?\n\nSome voters vote on the basis of race. If these votes become deciding votes, did the American people engage in illegal employment discrimination? How do we remedy that?\n\nLike can you give me any plausible way you imagine we could enforce employment law against a Supreme Court Justice nomination? Would a candidate that wasn't chosen file an EEOC complaint? What would an EEOC response look like? If you imagine this is criminal discrimination, who would be charged with the crime? The President? The Senate? The voters for voting for someone that said they would appoint someone that way?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Megalomaniac697",
                                                                                    "body": ">I personally don't think this goes far enough. I think for positions of power and representation, the makeup of the body should maximize representation of every identity group in the US that we possibly can. This means appointments should *intentionally* select people based on their identity group memberships.\n\nTotal disagree. It should be based on merit and nothing but merit.\n\n>I just don't think you understand what people are saying. It is possible to believe both of these things at the same time:\n\n>Employment should be based on qualifications and people shouldn't have the opportunity to be racist or sexist against candidates so as to perpetuate societal inequality and injustice.\n\n>Appointments to positions of power should be made with consideration of representation of the American people.\n\nSince you are really going to pretend that employment decisions aren't identity based, then fine, here are some examples:\n\n[https://about.google/belonging/diversity-annual-report/2021/hiring/](https://about.google/belonging/diversity-annual-report/2021/hiring/)\n\n>Hiring changes drove our best year yet for women in tech globally and Black+ and Latinx+ people in the U.S.\n\n[https://about.fb.com/news/2021/07/facebook-diversity-report-2021/](https://about.fb.com/news/2021/07/facebook-diversity-report-2021/)\n\n>Increase the number of people from underrepresented groups. By 2024, our goal is to have at least 50% of our workforce comprised of women globally, and underrepresented minorities, people with two or more ethnicities, people with disabilities and veterans in the US. \n\n[https://www.boeing.com/content/dam/boeing/boeingdotcom/careers/footer/EEO\\_AA\\_HarassmentFreeWorkplace\\_old.pdf](https://www.boeing.com/content/dam/boeing/boeingdotcom/careers/footer/EEO_AA_HarassmentFreeWorkplace_old.pdf)\n\n>As such, Boeing is committed to taking affirmative steps to promote the employment and advancement of minorities, women, persons with disabilities, and protected veterans.\n\nBasically every large company is PREFERENTIALLY hiring based on race/sex identity and you're going to try to feed me drivel that it's not happening. Get the hell out of here and don't waste my time.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "fastolfe00",
                                                                                            "body": "Respectfully, you have no idea what you're talking about. \n\nTake a moment to actually read through the links you just provided, and try and identify a *single* instance of one of these employers making an employment decision on the basis of membership in a protected class.\n\nDiversity goals in employment are satisfied through recruiting, sourcing, diversifying professional networks, eliminating sources of racial bias in the hiring pipeline, your system of recognizing merit and promotions, and by making your place of employment attractive for people of all identity groups, so that they encourage their own friends to apply.\n\nSource: I have run large organizations and have built hiring pipelines from scratch with diversity goals, spending many hours in meetings with HR and employment lawyers navigating these lines.\n\nThe popular conservative understanding of diversity/DEI is a fantasy. What you think is happening is in fact illegal employment discrimination and if you actually see it happening, you should report it to the EEOC. Gesticulating angrily at companies with diversity goals is not evidence of employment discrimination no matter how much your amygdala is screaming about the ongoing attack on your people.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Megalomaniac697",
                                                                                                    "body": "How do you think they aim to achieve these quotas in practice? Of course they are going to give preference based on race/sex identity and it is illegal, just difficult to prove. I don't believe that you are so gullible as to not know that, so I just wonder how do you square this discrimination with your sense of morality. Do you just repress it? Do you repeatedly lie to yourself until you feel convinced? It's bizarre.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "fastolfe00",
                                                                                                            "body": ">How do you think they aim to achieve these quotas in practice?\n\nI directly answered this in the third paragraph of the comment you replied to.\n\n>course they are going to give preference based on race/sex identity and it is illegal, just difficult to prove\n\nThis is your amygdala preempting your imagination.\n\n>I don't believe that you are so gullible as to not know that\n\nAgain, respectfully, I have spent probably a hundred hours working with employment lawyers on exactly these questions in multiple organizations.\n\n>how do you square this discrimination with your sense of morality\n\nWhat employment discrimination have I said I supported? Who are you talking to here?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Megalomaniac697",
                                                                                                                    "body": "Clearly you do not live in the real world, so I'll explain it to you. A company has a mission statement: we will hire more women and minorities. This proclamation filters from the top down and it is repeated and reemphasized at every opportunity. Upper management is judged on how it does on diversity and it judges lower management on how those levels do on diversity.\n\nIn terms of recruitment, if an 'identity' candidate shows up who is at least close to the minimum qualifications, that candidate will win over even the most qualified one who does not check the identity box, because the incentives are clear. It looks great on your performance evaluation if you've hired a lot of \"identity\" candidates. \n\nOnce again, I am sure that you either know this perfectly well and are just blowing smoke, or you are \"honestly\" lying to yourself in order not to face the obvious reality.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "fastolfe00",
                                                                                                                            "body": "> Clearly you do not live in the real world, so I'll explain it to you.\n\nNot only do I live in the real world, but I have literally built hiring pipelines at multiple large organizations, with diversity goals, and in deep and thorough consultation with employment lawyers. And I am telling you how I have done it, how I have seen it done everywhere I've been (including one of the companies you linked to), and how it must not be done, and I'm telling you that your Fox News-inspired fever dreams of how diversity \"has\" to be done is wrong. It's a fabrication. This isn't reality. What you think is happening is actually *illegal*. If you genuinely see what you believe you're seeing, *report it to the EEOC*.\n\n>A company has a mission statement: we will hire more women and minorities. This proclamation filters from the top down and it is repeated and reemphasized at every opportunity. Upper management is judged on how it does on diversity and it judges lower management on how those levels do on diversity.\n\nYes. Companies meet diversity goals using the methods I discussed already. These methods do not involve discriminating on race in hiring decisions. Sending your recruiters to women-in-tech conferences is how it's done. Telling your hiring team to pick the less-qualified woman over a more-qualified man in order to meet gender quotas is a form of illegal employment discrimination.\n\nI'm not arguing with ignorant people on the internet anymore about this. You're obviously not going to believe me. Find an employment lawyer and have this conversation with someone that knows what they're talking about.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Megalomaniac697",
                                                                                                                                    "body": ">Not only do I live in the real world, but I have literally built hiring pipelines at multiple large organizations, with diversity goals\n\nAhh ok, so THAT's why... you don't want to know about the fact that your life's work has been subverted into something abominable. I trust that your intentions were good.\n\n>Yes. Companies meet diversity goals using the methods I discussed already. These methods do not involve discriminating on race in hiring decisions.\n\nThey do, not quite by definition, but certainly by practical application. To make a loose analogy, it's like a teacher telling students that the test is closed book, but there will be no penalties for peeking in the text - it's based on trust. It's important to do well. You can of course trust that students will not look into textbooks, but you'd be quite a fool to do so. If you open the door, it will happen.",
                                                                                                                                    "score": 1
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "coolgy123",
                                                                                                                    "body": "Big words don't make you smart. Big Joe B for example.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "fastolfe00",
                                                                                                                            "body": "Why are you here?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "coolgy123",
                                                                                                                                    "body": "To ask liberals. I thought the sub's name was self-explanatory enough.",
                                                                                                                                    "score": 0,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "coolgy123",
                                                                                                                                            "body": ";)",
                                                                                                                                            "score": 0
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                },
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "coolgy123",
                                                                                                    "body": "What about the higher percentage of White people in the country? It is pretty obvious once using a 10th of your brain that white people would be hired more than minorities due to the fact that they are the MAJORITY, not the minority.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "fastolfe00",
                                                                                                            "body": ">white people would be hired more than minorities due to the fact that they are the MAJORITY\n\n... Yes. This is expected, this is what we typically see, and this is normal. I have no idea how this is connected to the conversation, sorry.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "coolgy123",
                                                                                                                    "body": "Sorry, misinterpreted it at first. My bad XD",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "coolgy123",
                                                                                    "body": "So what I am getting is it is ok to hire based on race if it is AGAINST white people? racism is racism, no matter what name you give it. No matter who is being discriminated against. No matter what the person's ancestors have done.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "fastolfe00",
                                                                                            "body": ">So what I am getting is it is ok to hire based on race if it is AGAINST white people?\n\nNo. If you decide to hire a black (white) candidate over a white (black) candidate for reasons of race (racial quotas, diversity targets, whatever the reason), where race isn't a core requirement of the job itself, this is illegal employment discrimination.\n\nIf this is happening today, it needs to be reported to the EEOC so that remedy can occur and the illegal behavior will stop.\n\nIn reality, this isn't actually happening. Conservatives see things like \"diversity goals\" and go straight to \"the only way I imagine that could be done is racial discrimination\", so that becomes the conservative narrative despite no evidence that that's actually happening.\n\nSo yes, discriminating against someone in employment decisions on the basis of race is wrong and (already) illegal.\n\nBut that's not what diversity or DEI mean.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "pablos4pandas",
                                                            "body": "It really really isn't. Discriminating based on job performance is the point of interviewing candidates.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Megalomaniac697",
                                                                    "body": "That's called MERIT, and it is SUPPOSED to be the entire basis of employment and appointments.",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "fastolfe00",
                                                                            "body": ">MERIT, and it is SUPPOSED to be the entire basis of ... appointments.\n\nSource?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Megalomaniac697",
                                                                                    "body": "Liberalism 101",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "fastolfe00",
                                                                                            "body": "In this house we go by what's in the Constitution. If you think we need to enshrine a set of qualifications and an objective process for assessing merit for political appointments, the correct place for you to put that is in a Constitutional amendment.\n\nOtherwise this is just you being mad at the other party doing things differently. Your remedies here are voting or impeachment, not pointing to the EEOC and saying \"*do* something!\"",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Megalomaniac697",
                                                                                                    "body": "This is largely why I abandoned the left and want nothing to do with it. Leftists would rather put an unqualified hack who checks identity boxes on the SCOTUS bench than look for the best candidate.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "fastolfe00",
                                                                                                            "body": ">Leftists would rather put an unqualified hack\n\nWho have \"leftists\" put on the bench that is unqualified? How are you assessing qualification? Everyone on the bench now was deemed qualified by the ABA.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Megalomaniac697",
                                                                                                                    "body": "Ketanji, Sotomayor - thoroughly mediocre judges, would never even sniff the SCOTUS bench if it weren't for identity checkboxes.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "fastolfe00",
                                                                                                                            "body": "> Ketanji, Sotomayor - thoroughly mediocre judges, would never even sniff the SCOTUS bench if it weren't for identity checkboxes.\n\nThis is racist garbage.\n\nhttps://www.americanbar.org/groups/committees/federal_judiciary/resources/supreme-court-nominations/\n\n> Rating: \"Well Qualified\" by unanimous vote of the Standing Committee on the Federal Judiciary\n\nHow are *you* determining \"qualified\"? What does the Constitution say about necessary qualifications?",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Megalomaniac697",
                                                                                                                                    "body": "Their respective record on the judge's bench is remarkably sparse compared to so many others who have been overlooked for SCOTUS positions. I guess those others simply didn't have the right levels of melanin and the right type of genitals to do the work - these are the things that really count.",
                                                                                                                                    "score": 0
                                                                                                                                },
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "coolgy123",
                                                                                                                                    "body": "I dont want to hear a LIBERAL of all people call people racist. Just read before you comment and down vote (which will happen any way) [https://www.heritage.org/progressivism/commentary/bidens-history-getting-away-racist-remarks](https://www.heritage.org/progressivism/commentary/bidens-history-getting-away-racist-remarks)",
                                                                                                                                    "score": 0
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "pablos4pandas",
                                                                            "body": "Discriminating based on merit is still discrimination. You're discriminating against people who you think won't do the job well. That's a thing you're allowed to do.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Megalomaniac697",
                                                                                    "body": "Merit is the one criteria that we are supposed to consider and it is not discrimination in the pejorative sense. Are you really going to try to play semantics like this? It makes you look smarter by the minute so keep it up! 👍",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "pablos4pandas",
                                                                                            "body": "> Merit is the one criteria that we are supposed to consider and it is not discrimination in the pejorative sense.\n\nIt is today. A hundred years ago the right to not hire black people was enshrined into law\n\n> really going to try to play semantics like this?\n\nIt felt like an important point when you said all discrimination is illegal. It literally is not.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Megalomaniac697",
                                                                                                    "body": "Who cares what the law was 100 years ago? You can't discriminate today just because someone else discriminated in the past. There is no such legal thing as retaliatory discrimination.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "pablos4pandas",
                                                                                                            "body": "> You can't discriminate today\n\nYou definitely can depending on the place. Some localities like California make it illegal to fire someone for political views. In Alabama your boss can fire the shit out of you for being Republican but it's illegal to do so in California",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Megalomaniac697",
                                                                                                                    "body": "We are talking about race/sex discrimination, which is based on protected characteristic. Either stick to the subject or go talk to someone else.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "pablos4pandas",
                                                                                                                            "body": "So when you said \n\n> Discrimination is always illegal. No ifs and buts.\n\nYou meant if it's discrimination about race or sex it's always illegal? There are many different kinds of discrimination; you made a universal statement but you actually meant it with a very narrow context?",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Willing_Cartoonist16",
                    "body": "> Do you think it’s conceivably possible that companies, anywhere from small businesses to startups to multi national companies with revenues in the billions are deciding that they should hire somebody completely unqualified for jobs because they happen to be a black lesbian?\n\nAre you really asking if it's conceivable that it happens? Yes, yes it is not only possible, it's common practice. I work in a multi billion dollar tech company and have seen this practice first hand. So yes it happens, I have no idea what bubble you live in where you aren't seeing it.",
                    "score": -1
                },
                {
                    "depth": 1,
                    "author": "coolgy123",
                    "body": "It is still greed. It brings publicity. Publicity means attention. Attention means customers. As easy as addition.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "Sadistmon",
                    "body": "> Do you think it’s conceivably possible that companies, anywhere from small businesses to startups to multi national companies with revenues in the billions are deciding that they should hire somebody completely unqualified for jobs because they happen to be a black lesbian?\n\nYes. You're in denial if you think it has never happened.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BigCballer",
            "body": "> Is it fair if let's say, a black lesbian with 2 years in college was to get a job over a cis white man with 4 years?\n\nI feel like we really need to drop this idea that DEI hiring is somehow screwing over white people trying to get the job, when there is barely any corroborating evidence to support that assertion.\n\nLike even if you found a handful of examples like that, where some white person didn’t get the job over a black person, I’m willing to bet the opposite situation happens just as much at a similar rate.",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mugiwara5a31at",
                    "body": "This is just a local story but king county needed a new sheriff, instead of hiring a qualified candidate, our executive promoted a black woman into the job. The woman had to go through the process of becoming a cop to get that job. One could ask why not hire someone that's already been through that training? And yes she is still currently our sheriff",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chrisnlnz",
                            "body": "I mean promoting from within, with training, vs hiring external has always been a consideration businesses have made and depending on many different factors, either method may be preferable.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "And_Im_the_Devil",
                            "body": "If you’re talking about Patti Cole-Tindall, she had years of experience working in various government departments, including the sheriff’s office.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mugiwara5a31at",
                                    "body": "I understand that, but the point was that we elevated an under qualified candidate over many qualified candidates that have completed said trainings.working for the sheriff's office doing paperwork doest  necessarily mean you have the qualifications to take over as the sheriff.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "And_Im_the_Devil",
                                            "body": "That’s an absurd understatement of her work history. Also what does it mean to be qualified for that job? Another meathead jacked up on killology? Law enforcement agencies can use more civilian oversight.",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Mugiwara5a31at",
                                                    "body": "a lot of people work in he sherrifs department. Are they now all qualified to become sherrifs? \n\nWe can have Civillian boards, and stuff like that, but a sherrif should at least be able to do the job of a sheriff. Which she wasn't qualified to do at the time of hire.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "polkemans",
                                                            "body": "You are aware that sheriff is often an appointed or elected position? It's not necessarily the next step of being a police officer, and often exists in conjuction with other branches of law enforcement.   \n  \nAll thay to say, there are plenty of people who aren't qualified to be a sheriff who get the job for all kinds of reasons. There was a guy out here in WA state who was catching flak as sheriff because he was picking and choosing which laws he would enforce. Namely not enforcing COVID measures at the time. But he'd been a cop for ages. Is he qualified to be a sheriff?",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Mugiwara5a31at",
                                                                    "body": "I would say that person you mentioned was not qualified to be a sheriff. but can anyone give me a valid reason why she was picked for sheriff outside of her race/sex? she worked in government/the sheriff's office, great, but a lot of people work in government and the sheriff's office. what would you say makes her qualified to he a sheriff? \n\n  \nand BTW she (Patricia tindall cole) is currently sueing the city of Burien so she doesn't have to enforce their anti camping rule.",
                                                                    "score": -5,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "polkemans",
                                                                            "body": "Do we know that there were more qualified people in contention for the role? What exactly does qualify someone to be a sheriff more than working directly with and for one?   \n  \nMy point is, sheriff is kind of a bullshit political position anyways. It's not exactly novel for a political position to be filled for political reasons.",
                                                                            "score": 9
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ok-One-3240",
                                                                            "body": "What qualifications do you think a sheriff needs? What is listed under job requirements, and why do you think she isn’t qualified?\n\nBecause we’ve kinda been going with the same type of people for a century for this role, and we have the worst police in the developed world. Maybe some civilian oversight will help remind them who pays their bills.",
                                                                            "score": 6
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Ok-One-3240",
                                            "body": "She sounds qualified to me. \n\nAs a Floridian, she sounds far more qualified to protect and serve than a typical sheriff around here.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sleep_On_It43",
                            "body": "I thought sheriffs were elected officials…",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mugiwara5a31at",
                                    "body": "I'm not sure why but our most recent sheriff was put in place by dow",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sleep_On_It43",
                                            "body": "Dow? Not sure what that is…",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Mugiwara5a31at",
                                                    "body": "Lol he's the county executive. Dow Constantine ",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Sleep_On_It43",
                                                            "body": "Oh…ok…I was scratching my head on that…I was going “Department Of….”",
                                                            "score": 2
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "C137-Morty",
                                                            "body": "Just a random point I'd like to make to you; I had no idea which county is King county or wtf a dow was either without the additional context provided through these comments.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "pablos4pandas",
                                                                    "body": "> which county is King county\n\nOne remarkable coincidence is it's the county with the dude's face on the flag; the same pattern used for the state flag. Something about that state that causes terrible vexillology",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "California_King_77",
                    "body": "The entire concept of DEI is using race as a means of determining who gets hired.\n\nThe goal is to promote underrepresented people, and this will come at the expense of non-diverse candidates.\n\nIt's discrimination against whites.  This is exactly how it works.",
                    "score": -12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GabuEx",
                            "body": "Why do you think a multinational multibillion-dollar company would decide to hire unqualified people?  What are they getting out of it?",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "California_King_77",
                                    "body": "They'd be meeting thier diversity goals, and they'd be included in DEI oriented ETFs and indexes, which attracts more cash.  Government agencies have DEI goals mandated by law\n\nIt's not just hiring.  Firms have diverse procure requirements - if your company is not sufficiently diverse, many firms won't be able to contract with you to use your services. \n\nColleges have diverse citation requirements for scholars - if your papers don't cite enough minority scholars, you might not get hired.  \n\nAt the absolute peak of the Jim Crow hatred, there were no laws hectoring firms not to hire blacks, or contracting with black owned business.  \n\nBut that's what we have now.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GabuEx",
                                            "body": ">They'd be meeting thier diversity goals\n\nWhy do you think they set diversity goals?  We're talking about private companies here.  The government isn't mandating anything.  So who decided that they would have those goals, and why?\n\nAre you aware of the fact that [studies have shown that diversity increases productivity](https://nbs.net/how-diversity-increases-productivity/)?\n\n>they'd be included in DEI oriented ETFs and indexes, which attracts more cash.\n\nHow many people do you think are invested specifically in those, and why do you think that will get them more money than having qualified employees would have?",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "California_King_77",
                                                    "body": "The diversity goals come from their regulators, activists, do gooders, NGOs, etc.\n\nThere's zero empirical evidence that a diverse workforce is more productive or efficient.  The study you quoted, like the McKinsey studies, use correlation as a proxy.  Yes, very successful firms with lots of money can afford diversity offices.  \n\nThere's no causal effect to diveristy practices.  You can't buy a failing firm, sprinkle in diversity, and magically see your ROE and ROI increase.\n\nAnd there's no evidence to show that diverse indeces out perform standard ones.  People buy them to feel good about themselves.",
                                                    "score": -7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "GabuEx",
                                                            "body": ">The diversity goals come from their regulators, activists, do gooders, NGOs, etc.\n\nYou realize we're talking about companies like [ExxonMobil](https://corporate.exxonmobil.com/locations/brazil/inclusion-and-diversity), [Philip Morris](https://www.pmi.com/who-we-are/inclusion-diversity), and [Bayer](https://www.bayer.com/en/us/diversity), right?  You're telling me that activists got those companies to voluntarily agree to hire unqualified employees and thereby lower their revenue by a significant margin?  How?  Because I feel like other activists are going to want to emulate those truly groundbreaking techniques!\n\n>There's no causal effect to diveristy practices.\n\nEvery large company in the world believes otherwise. \n\nSeriously, what's more likely: that every single company has been bullied into submission into hurting their bottom line in a way that no activist has ever achieved before in human history, or that diversity is just genuinely good for the bottom line, and that that's why they're all doing it?\n\nPlease, for the love of Adam Smith, exercise a little Occam's Razor here.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "California_King_77",
                                                                    "body": "Yes, Exxon mobile is actually in the green index, and Tesla is not.  Yes, they're doing exactly that, because they want to stay in business.\n\nWhich large company has demonstrated a causal benefit for DEI, and if it's so great, why are companies shutting down their DEI offices now that the economy is souring?\n\nIf you have something showing ta causal relationship between DEI and success, you're free to share it.  I notice you haven't done so yet.",
                                                                    "score": -4,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "GabuEx",
                                                                            "body": ">Yes, they're doing exactly that, because they want to stay in business.\n\nI'm sorry, you think companies like ExxonMobil, Philip Morris, and Bayer will all *go out of business* if they refuse to hire unqualified minorites?\n\nWhat kind of supervillain activists do you think are behind DEI programs?\n\n>If you have something showing ta causal relationship between DEI and success, you're free to share it.  I notice you haven't done so yet.\n\nI don't have access to the internal financials of those companies.  The people who do, however, are all in favor of DEI programs. \n\nAgain, Occam's Razor.  You've somehow convinced yourself that a worldwide conspiracy by supervillain activists forcing multibillion-dollar global corporations to wreck their bottom lines is the more likely explanation for the existence of DEI programs than just that they... work.  Or at least that corporations believe they work.\n\n/u/RigusOctavian shared an anecdotal explanation [here](https://www.reddit.com/r/AskALiberal/s/BNH5BJGJ0z), if you want more.  Why is it so hard to believe that this is as simple as \"people believe hiring diverse candidates is good for business\"?",
                                                                            "score": 9
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ok-One-3240",
                                                                            "body": "Do you think companies waste money on corporate culture for no reason? Happy employees stick around.",
                                                                            "score": 4
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "willpower069",
                                                                            "body": "So any evidence for your claims?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "California_King_77",
                                                                                    "body": "Any evidence that DEI is real, and corporations are following through on their very public goals of implementing these policies?\n\nAre you cliaming that DEI doesn't exist?",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "willpower069",
                                                                                            "body": "So no evidence that unqualified people are being hired?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "California_King_77",
                                                                                                    "body": "The literal definition of DEI is to allocate resources based on race, ahead of talent.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "willpower069",
                                                                                                            "body": "If that was true then you would have proof or evidence yet you provide nothing. \n\nDo you regularly believe in things without evidence?",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Ok-One-3240",
                                                            "body": "So, a firm made up completely of white people would be just as productive as  a firm with diversity. Otherwise you’d be implying that race somehow impacts productivity.\n\nProductivity isn’t the goal behind DEI. The goal is basically segregation and inequality are bad, and we’re going to make an effort to overcome them. \n\nSo, I guess whip some balls out and argue that segregated races and inequality are fine, which from a bottom line perspective, sure, but ya won’t win any public relations battles.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "fastolfe00",
                                            "body": ">They'd be meeting thier diversity goals, and they'd be included in DEI oriented ETFs and indexes, which attracts more cash. Government agencies have DEI goals mandated by law\n\nI know we've already had this conversation and apparently you didn't internalize anything I said before, but I'll try one more time: \n\nYour understanding of what's happening here is incorrect. I have run large organizations and have built hiring pipelines inside the US government. Using race as a criteria in hiring is explicitly illegal, even inside the US government.\n\nDiversity goals are achieved through targeted sourcing, recruiting, and not making your office the kind of workplace people of color want to leave, such as by fairly promoting people, giving everyone professional development opportunities, and eliminating for mitigating any kind of bias you might discover.\n\nSince you brought up the US government in particular, I think you'd benefit from reading it from the horse's mouth: \n\nhttps://www.whitehouse.gov/briefing-room/presidential-actions/2021/06/25/executive-order-on-diversity-equity-inclusion-and-accessibility-in-the-federal-workforce/\n\nNowhere in that order is there any hint of preferential hiring based on protected characteristics, as you are claiming is happening. \n\nPlease stop spreading conservative misinformation on DEI.\n\nAlso the last time we had this conversation you came out and said your own employer was engaging in illegal employment discrimination. I never did hear about the status of your complaint to the EEOC. Can we get an update?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "California_King_77",
                                                    "body": "It's not called \"preferential hiring\" and we're not *technically* hiring someone because of their race.  We're hiring because they would add to our diversity, which is different.  We still have an EEOC statement that we issue every year.  Because hiring based on diversity is legal.  \n\nWe consider the racial makeup of our organization when making hiring decisions, which can lead us to hiring someone who helps us meet our diversity goals.  If we have two candidates, one diverse and less qualified, and one non-diverse but more qualified, we are to consider hiring the former, to increase the diversity of the firm.  Based on the myth that diverse organizations perform better.  It's never been proven.\n\nWe also have diverse procurement.  We filter our sources and suppliers by race and gender, and look to spend more with those owned by diverse owners, and less with firms owned by straight white people.  \n\nIn my state the schools have diversity statements about admissions, where diverse candidates are prioritized because they \"add diversity\".  If a white kid wants to get into Penn Law, they need to be in the top 1% of LSAT scores and GPAs; black kids can be at the 50% level.\n\nDEI is real, and institutions taking actions based on race is real.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "fastolfe00",
                                                            "body": ">We're hiring because they would add to our diversity, which is different. We still have an EEOC statement that we issue every year. Because hiring based on diversity is legal. \n\nIncorrect. Full stop. You should talk to your HR team or your company's employment lawyers before you continue to make false statements about your employer's hiring practices. \n\nRacial quotas of any kind are illegal. You cannot use race as a factor in hiring decisions for any reason whatsoever\\*. Not for racism, not for diversity, not for achieving representation in your workforce. The hiring process must evaluate all candidates that apply for a position without regard to their race, gender, or membership in any other protected class.\n\nAny EEOC-mandated affirmative action plans are about correcting past instances of illegal employment discrimination, but even these plans cannot simply result in the employer discriminating \"back\". Racial quotas are illegal, even in affirmative action plans, even if those are mandatory.\n\n>If we have two candidates, one diverse and less qualified, and one non-diverse but more qualified, we are to consider hiring the former, to increase the diversity of the firm.\n\nThis is illegal employment discrimination and you should report this to the EEOC. I look forward, again, to a progress report.\n\nI think it is more likely that you are misinterpreting what you are hearing or reading, or maybe you are just making this up, I don't know.\n\nProcurement or school admissions have nothing to do with employment law or employment discrimination.\n\n\\* it is possible for a job to necessarily require someone of a particular race or gender, but that needs to be a key requirement to the role and would be subject to a lot of scrutiny. Examples are actors, models, bathroom attendants, etc.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "California_King_77",
                                                                    "body": "I agree - racial quotas ARE illegal, but hiring to increase the diverse makeup of your workforce is legal, and this has been affirmed by SCOTUS multiple times.  \n\nIt's not a quota, it's an \"inclusion target\".  We are remedying the historical underrepresentation of specific racial and ethnic groups in the workforce.\n\nWe evaluate all candidates based on their merits, and then we make the decision that works best within our diversity goals and framework.  We will hire to meet our diversity goals.\n\nEverything that I've described is 100% legal, and 100% common in the workplace.\n\n[https://www.aclusocal.org/en/inclusion-targets-whats-legal](https://www.aclusocal.org/en/inclusion-targets-whats-legal)",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "fastolfe00",
                                                                            "body": ">but hiring to increase the diverse makeup of your workforce is legal, and this has been affirmed by SCOTUS multiple times. \n\nIncorrect. You don't know what you're talking about. Stop repeating conservative garbage and talk to an employment lawyer.\n\n>We evaluate all candidates based on their merits, and then we make the decision that works best within our diversity goals and framework. We will hire to meet our diversity goals.\n\nMaking a decision between two candidates for employment on the basis of skin color is illegal employment discrimination. If this statement came from your employer, it is prima facie evidence of illegal employment discrimination and you should forward that email to the EEOC. I suspect it's not and is just something you made up because you *think* that's what's happening.\n\n>Everything that I've described is 100% legal, and 100% common in the workplace.\n\n>https://www.aclusocal.org/en/inclusion-targets-whats-legal\n\n**READ YOUR OWN FUCKING SOURCE**. Top to bottom. It's short. Don't skim. Don't search for keywords. Just read it and internalize it. Don't miss the green box at the bottom.\n\nNothing in this document recommends or legitimizes *any* kind of post-evaluation racial discrimination. Two key bullets for you to read, re-read, figure out how to reconcile with your erroneous worldview, and then read again (emphasis mine):\n\n>* The program establishes numerical goals or targets (such as “aim to double the percentage of women we hire to direct television shows with our studio this season” or “we will hire crews that better reflect the demographics of California’s skilled labor pool”) but not rigid quotas or set-asides (such as **“the next 5 people we hire in X job must be women” or “we need 10 Black people in Y job”**).\n*The program does not unduly harm members of non-targeted groups, **such as by refusing to hire any people from those groups, or firing such individuals in order to reach the numerical target.**\n\nWhat *you're* describing is racial quotas. Racial quotas are illegal employment discrimination, whether done for diversity or correcting past racism. You cannot refuse to hire someone based on their race and you cannot set aside positions. Your source clearly says this.\n\nWhat you can do is have abstract goals, and you meet these goals through things that are **not** selecting black candidates over white candidates. You do targeted recruiting, you clean up your GlassDoor complaints, you de-bias your promotion and retention processes, you fire the racist hiring manager that got you into that mess to begin with. You achieve diversity in hiring by achieving a diverse pool of candidates.\n\nPlease stop repeating misinformation before you talk to an employment lawyer. Your company probably already has one on staff or retainer. Just get 5 minutes with them and ask this question. They'd probably *love it* if you did this because it's an opportunity for them to keep the company out of trouble and they're used to only talking to people for unpleasant reasons. It's a win-win-win: you'll be more informed, they'll be excited to inform you, and the Internet doesn't have to suffer from your ~~misinformation~~ disinformation anymore.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "California_King_77",
                                                                                    "body": "We are absolutely NOT prevented from hiring white people and I never hinted we did this.  And we have NO quotas.  Becuase quotas are illegal.\n\nWe have diversity targets, because we're attempting to undo centuries of discrimination in the workplace, which is legal.  We apply these in our hiring and promotion processes.  Our bonuses depend on how well we meet these targets.\n\nIf we have a pool of candidates who apply for a job, we're allowed to factor in any number of factors when making our hiring decision, including our Banks diversity goals.  We not choosing one candidate over another based on race, we're doing it to enhance the diverse workforce.  Which is legal.\n\nWe've been instructed by management to do just this.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "fastolfe00",
                                                                                            "body": ">We've been instructed by management to do just this.\n\nYou've misunderstood, you are misrepresenting what you heard, or your company is breaking the law.\n\nLet's be VERY VERY CLEAR here:\n\n>We have diversity targets, because we're attempting to undo centuries of discrimination in the workplace, which is legal. We apply these in our hiring and promotion processes. Our bonuses depend on how well we meet these targets.\n\nThis is legal but only because it's vague.\n\n>we're allowed to factor in any number of factors **when making our hiring decision,**  \n[my emphasis]\n\nIf you choose to extend a job offer to a black person and not a white person because hiring the black person helps you with your diversity goals, that is illegal. You cannot use race in hiring *decisions*.\n\nIf you spend extra effort in your \"hiring process\" to recruit black applicants, or race-blind your resume reviews to reduce bias, that is legal. That's how diverse hiring processes work.\n\nTalk to an employment lawyer.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FiveStarPapaya",
                            "body": "Is it discrimination against whites if both are equally qualified and the white person historically and pretty much universally would be picked over the minority if not for affirmative action? Even if the white person was less qualified?",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "California_King_77",
                                    "body": "Who said whites are automatically hired over blacks if the qualifications are equal?  Who told you that?  That's never been proven.\n\nAnd you're going one step further and saying the whire person wold be hired if they were LESS qualified?    Do you have a source for this?\n\nYou think business owners, with their own capital at stake, would put their racist views ahead of their greed?  They'd hire a white guy they didn't know, who was worse at a job, than make more money by hiring the black worker?\n\nWould you be surprised to learn there's academic research showing this isn't true?  In South Africa, the government limited the numbers  of black workers firms could hire, or pay a fine.  The firms ended up paying the fines, because it still left them with more money in the end.\n\nIt's wildly irrational to think someone would put racism ahead of their own financial well being.  And it doens't happen",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Carlyz37",
                                            "body": "For pity's sakes. Of course unqualified white people have gotten hired over qualified black people and it has happened for generations. That is behind why DEI programs were developed to begin with. \n\nThis ludicrous white grievance crap has gotten way out of hand. It's just another way to blame your failure on \"the other\"",
                                            "score": 6
                                        },
                                        {
                                            "depth": 4,
                                            "author": "FiveStarPapaya",
                                            "body": "It does happen because historically black people are less likely to be hired if their name on their resume sounds less white. Youre essentially saying it’s racist to hire an equally qualified black person so let’s just keep the racist status quo of hiring the same or less qualified white person.",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "California_King_77",
                                                    "body": "If you're attempting to quote the results of \"call back\" studies first done in the 1960s, you might be interested to know that these studies have been replicated with every sort of name you can imagine - Irish, Russian, Orthodox Jew, Asian, etc. and the result is the same.  The study shows \"differentness\" impacts your ability when only your name is out there.  It's why you see Asians adopting western sounding names.\n\nI NEVER said it was racist to hire an equally talented black person, or that firms should hire lesser qualified whites..  I said it's racist to use race as a hiring criteria, which is what DEI forces companies to do.  They're hiring lesser qualified candidates based on the idea that their diversity is a qualification.\n\nDEI causes firms to hire non-whites at the expense of whites.  That's how it works.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FiveStarPapaya",
                                                            "body": "At the expense of whites but can you prove they are less qualified than whites and thus less deserving?",
                                                            "score": 5
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "roylennigan",
                            "body": ">The entire concept of DEI is using race as a means of determining who gets hired.\n\nThis is like saying \"Black Lives Matters\" somehow implies that other lives don't matter. You're claim is implying that people of color are *only* getting hired because of their race, and not because of their qualifications. This is an implicit dismissal of their abilities compared to white candidates, and a dismissal of the historical trend of discriminating against non-white applicants (even if that discrimination is subconscious).\n\nDo you really think that DEI is forcing people to *only* hire based on race?\n\nUnless someone is teaching DEI wrong, there is a very clear emphasis on *diversity*, not *non-white*. I can guarantee that most businesses in most places are still hiring majority white employees in the US, because the population is majority white.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "California_King_77",
                                    "body": "I never said what you're claiming.  I'm saying DEI requires firms to consider race in hiring and procurement, which it does, and firms do.  White people are hurt by this.  Because it's racist.  No one EVER said blacks were only hired because of DEI.  I never said *only* - you did.  \n\nFirms, schools, and the government are making hiring decisions based on race, favoring non-white applicants over white ones.  This is how DEI works.  And it's real.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "roylennigan",
                                            "body": "Yes, you never said it. Yet the implication of the argument you're using is that it is causing *whites who are more qualified* to not be hired. Who is saying these white people are more qualified? By that metric? Where is the argument, other than what you feel is happening?\n\nMeanwhile there is decades of evidence for how minorities are not considered for applications despite their overachievement compared to white applicants.\n\nI'm asking you to make a better argument.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Fuckn_hipsters",
                            "body": "What this is is you assuming that black people are incapable of doing the jobs they are hired for. It's really not any more complicated than that. You're believing the lie that white conservatives have been told, and tell, since the Civil War. It's just a new flavor of making impressionable white people think black people are the enemy so those at the top can keep the status quo.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "California_King_77",
                                    "body": "Nobody ever said that black people are incapable of doing their jobs.  You said that.\n\nDEI specifically asks firms to consider race as a qualification that would put a lesser qualified person of color above a white person when choosing who get a job.  We're supposed to factor in the diversity that person would bring as a positive.\n\nAt my firm, we have DEI driven procurement policies - if you as a supplier want to sell to my company, and you're not diverse enough, we can't do business with you.  It's based on race and gender.\n\nI take it from your comments that you have no idea how DEI programs work in the real world.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Weirdyxxy",
                            "body": "The entire concept is making it slightly less likely to determine who gets hired, by partially counteracting effects through which race determines who gets hired",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Ok-One-3240",
                            "body": "I’m very for switching to basing it off of socioeconomic status. \n\nAlso, no it’s not. It’s an advantage for the disadvantaged. DEI programs tend to actually impact Asian people more than whites.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "coolgy123",
                    "body": "I feel that the issue is that there is the idea that you hire based upon external factors. to truly have the most efficient company, wouldn't you instead choose the most highly qualified? For example, let's say one race tends to be a bit stronger than another, wouldn't you hire them for a more strength-based job? It may sound racist, but it is not meant that way, some people would be more qualified for certain jobs. Of course, it would not only be race but also education. I someone fully understands the job, wouldn't you choose them over someone who only has a general idea? Of course experience as well. wouldn't you choose some on who has b been doing the same job for years over someone who is only recently involved?",
                    "score": -11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kakamile",
                            "body": "The idea.\n\nMeanwhile can you cite less qualified people who got hired?",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "DavidKetamine",
                            "body": "I think all of these hypothetical examples are situations where one of the applicants is very obviously more qualified than the other. Even if you don't buy into the different perspectives/diversity for its own sake stuff it's still the case that it's sometimes not entirely clear who is \"more qualified.\"\n\nI think a lot conservatives got pretty upset when Biden announced his next Supreme Court justice nomination would be a woman of color. The obvious complaint would be that he should chose instead the most qualified candidate. That's all well and good at surface level but then it begs the question- who exactly would be the most qualified guy? Would it be person who spent the most time at the best law school? Would it be the guy who's made the most rulings or presided over the most trials? Maybe whoever the oldest law clerk is? \n\nEducation and experience are obviously good metrics to evaluate judges. But it's not clear to me that they alone point to the very objective and clear \"best\" candidate. I'd imagine at any given time there's quite a few people who are more or less qualified to fill a given role- which is probably why a lot of liberals like me didn't particularly worry too much when Biden made this announcement. \n\nA lot of people have been asking for more concrete examples. If DEI type stuff is obviously keeping more qualified people out of jobs I'd find that pretty distressing, but instead if people are taking diversity into consideration when selecting from a pool of roughly equally qualified candidates I don't find that nearly as controversial. I guess I'd be curious to find out what's more likely.",
                            "score": 7
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "wifey_material7",
            "body": "How would they know if an applicant is a lesbian?\n\nThere are systems that hold minorities back from success. Therefore, I support efforts to equitize the workplace and higher education. The difference in experience would never be that significant, though. That doesn't happen.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "ButGravityAlwaysWins",
                    "body": "> How would they know if an applicant is a lesbian?\n\nDuh, either the blue hair or the blood of men they killed on the way to the interview splattered on their shirt will make it obvious.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sleep_On_It43",
                            "body": "lol…good one…",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GabuEx",
            "body": "It's important to remember that DEI is not a government edict.  The government is not forcing private companies to do anything.  Companies are choosing voluntarily to enact DEI policies.  So, unless you think that multinational companies worldwide have all collectively decided to hire unqualified people, thereby damaging their own profitability, for no good reason... yes, there is something you're missing.  Anytime you wonder why a publicly traded company is doing essentially *anything*, the answer is \"because they believe it will increase profitability\".  The idea that any big company, anywhere, is doing something that they know will hurt their bottom line, for no gain... that is a huge claim that requires commensurate evidence.\n\nDiversity in corporations is proven to reduce blind spots, increase innovation, and make the company better able to function.  It's not a woke conspiracy, it's just economics.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "coolgy123",
                    "body": "I never stated that the government mandated (or is the word MANdate offensive?) This. It is obviously pushed for by the libs in office, but it was primarily about the morals of a company deciding to do this",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "erieus_wolf",
            "body": "I'm an executive who has hired more people than I can count. The idea that \"less qualified\" people are hired is a lie.\n\nIn reality, there is a baseline qualification that most candidates meet. These are called the \"hard skills\", or the qualifications required to do a job. Because we post these required skills, almost every application has them.\n\nThis is where the \"soft skills\" come into play. The most important part of getting a job is the \"soft skills\". How well do you sell yourself? Do you come across as a team player? Do people want to work with you?\n\nI've noticed that people on the right are super obsessed with the \"hard skills\", believing they are special snowflakes that have a certain set of skills. I'm sorry, but you are not special. Other people have those skills. You should be focusing on the \"soft skills\", which is something that people on the right lack.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "FizzyBeverage",
            "body": "I’m a white cishet male. Married in the suburbs, two daughters, nice house. Ridiculously comfortable work from home gig with the best benefits you can get in this country.  \n\nI’ve gotten every job I’ve ever applied for. Paid at the top of the salary range. Accepted into every college I was reasonably qualified to attend (and then some I had no business getting into). Never let go from any job, I left at my own choice for a better one. \n\nNever been denied a loan or mortgage or housing. Never denied for a credit card. Never pulled over without legit cause by a cop. Never chased around a store by security. Never feared for my safety taking photos of the city at night in deep fog or rain. Never been raped or assaulted. Never been whistled at because of my ass. \n\nWhat republicans refuse to admit is that white males are privileged as fuck. And sure, maybe we’re not born with the **golden spoon** boomers got in the 1950s, **but it’s still silver**.\n\nFact is, other races and minorities and genders get absolutely fucking wrecked compared to us. They can start on step 4. Because whether you realize it or not, we’re mostly on step 10.\n\nGo look at the Fortune 500 CEOs. 90% are still males, and 90% of the males are just white dudes with monosyllabic first names like Tim or Scott or Mark or Steve or Bill or Will or John or Mike.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "wooshoofoo",
                    "body": "The Republicans think minorities hate that you have privilege; we don’t, we just want you to support us sharing the wealth.\n\nYou can be lucky and if you acknowledge that nobody is going to begrudge you; it’s the entitled white people who think privilege was somehow their earned right that riles people up.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "erieus_wolf",
                    "body": "Same, except the children. We may be brothers.\n\nBut yes, we are privileged as fuck.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "loufalnicek",
                    "body": "Good for you, but surely you're aware that not all white males have had the same story as you have.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FizzyBeverage",
                            "body": "Clearly not, but they looked at their natural born opportunities as a white man in America and did their best to squander them.\n\nIt's like a guy standing 6'8\" who never tried picking up a basketball. He should have at least tried.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "loufalnicek",
                                    "body": "Nice empathy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FizzyBeverage",
                                            "body": "I see a ton of these guys in Ohio. Every opportunity. Middle class family. Excellent schools. They decide to skip college. Knock up a girl. Broke as a joke at 21 with no prospects. Thinks Trump will fix all their problems.\n\nIt's fucking **absurd.**",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "loufalnicek",
                                                    "body": "Sure, they exist. But poor white men also exist, who didn't have every opportunity, went to crappy underfunded schools, and are legitimately struggling.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "willpower069",
            "body": "Why does hiring minorities mean that high qualified people are being left out?",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "coolgy123",
                    "body": "it is more of the hiring them OVER a more qualified individual to show equality.",
                    "score": -10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "willpower069",
                            "body": "Does that actually happen? I hear lots of fear mongering about it, but not an equal amount of evidence.\n\nu/coolgy123 did you find any evidence?",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "Sleep_On_It43",
                            "body": "I would need to see actual proof this is happening and not another right wing source of manufactured outrage that has become so common these days.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "FiveStarPapaya",
                            "body": "How do you know that is happening?",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "Fuckn_hipsters",
                            "body": "Why do you just assume this is happening? It doesn't make any reasonable sense. You have to turn your brain off to get to the conclusion you came to here",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RigusOctavian",
            "body": "As someone who actually hires people, this take is just bonkers.\n\nI might give a diversity candidate a little more leeway when reviewing resumes / backgrounds to decide on an extending an interview, but that does _not_ mean they will be hired if they interview poorly, or are empirically less capable than my minimum requirements, or clearly are underperforming compared to the rest of candidates.\n\nBut if there is one thing I’ve learned in 20 ish years of corporate work, having people with overlaps in experiences, but also differences, is how you come up with the best solutions to real problems. If everyone in the room went to an Ivy League, grew up upper-middle to low-upper class, got all A’s, all go to the same church / faith, and all have the same interests… I’ve got ten copies of the same damn thing. I want ten _different_ things in the room because I’m way more likely to get a new idea that hasn’t been done before. That is WAY more valuable to the business.\n\nAnd FWIW, I know people with an entire alphabet of certifications after their name that I wouldn’t trust to pick up my groceries… a degree does _not_ guarantee a good worker or candidate. It does tell me they know how to suffer through red tape, BS, and can work with others which is a lot of corporate life. The stamp on the forehead gets you in the door, it does not get you a job.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sleep_On_It43",
                    "body": "No no no… you don’t look at resumes or backgrounds first…you look at their race/gender/sexual identity first…then make that person fit into the company. Meanwhile, white, cisgender straight men have to flip burgers…\n\nDon’t you see? It’s the apocalypse and the sky is falling!!!!!\n\nIn other words…one more source of right wing manufactured outrage to poison the minds of the gullible.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GabuEx",
                            "body": "I am a bit gobsmacked at multiple conservatives, who normally crow about the efficiencies of private enterprise, and who chastise liberals for allegedly not knowing how they work, suddenly deciding that the only possible explanation for so many giant private companies worldwide adopting DEI initiatives is that they must be being *sabotaged from within* by *rogue woke HR departments* or *bullied into submission* by *supervillain activists*, as opposed to, like, them just believing that it's good business.",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Smart-Tradition8115",
                    "body": ">That is WAY more valuable to the business.\n\nCan you give an actual concrete example of this?",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RigusOctavian",
                            "body": "Go look up group think. A lack of a diversity of opinions will lead to this phenomenon occurring more frequently / more easily. \n\nThis isn’t limited to just race either. Having a healthy split of women and men in a workgroup can also generate more balanced outcomes and also tends to lower overall personnel conflicts. I have my personal views as to why but if you look at single sex dominated professions, you have more dysfunction than more blended ones.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Smart-Tradition8115",
                                    "body": "No, that's not a specific example. You said,\n\n>if there is one thing I’ve learned in 20 ish years of corporate work, having people with overlaps in experiences, but also differences, **is how you come up with the best solutions to real problems.**\n\nDo you have a **specific example** related to how \"diversity\" has to led to a better solution to a real problem?",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "RigusOctavian",
                                            "body": "Yes, I work with a healthy blend of people from across the US and the world and we are able to solve / fix problems quickly and creatively. When we don’t cross collaborate, it doesn’t work as well. I also see higher conduct reports from facilities that lack diversity from their local population of workers.\n\nYou’re asking for an anecdote to fight against; that’s not how this works. I’m also not going to go spouting off pages of background and detail about my employer on the internet. If you don’t think group think is tangible enough, there is no point discussing this with you.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "hitman2218",
            "body": "Why is it assumed by conservatives that whenever a minority or a person of color holds a prominent position, that they didn’t get there on merit? (Unless that person also happens to be a conservative. Then it was deserved I guess.)\n\nKetanji Brown Jackson being one example.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sleep_On_It43",
                    "body": "Oh….we know why…",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hitman2218",
                            "body": "Was hoping OP would respond. Oh well.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sleep_On_It43",
                                    "body": "Yeah…I wouldn’t hold your breath on that one.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "No, I don’t support a company hiring on innate characteristics, which is why I *do* support quotas and conscious recruitment programs. Without conscious effort, companies hire based on innate characteristics. It takes quotas to break those biases.\n\nAnd I disagree that simple resume points like years of college tell you how hard someone works. There are different types of work and different skills that can make someone the best fit for a job.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "FiveStarPapaya",
            "body": "I’m okay with affirmative action yes.\n\nI’m assuming in all these cases that it’s a choice between say a white male and a black female and both are equally qualified in every way. \n\nUnless I had reasonable suspicion that they weren’t taking merit into consideration I don’t care.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DarkBomberX",
            "body": "Tell me you don't understand DEI initiatives without saying you don't understand DEI initiatives.\n\nThere is no mass hiring of unqualified minorities over white dudes for jobs. Literally, all that's happening is companies are pushing to have more diverse groups of workers. There are various business benefits from this. Having a diverse set of workers can help the business better serve their customers. They have a large pool of unique viewpoints when strategizing. Overall, productivity is increased. Here's a pretty good explanation of some studies into it.\n\nhttps://www.mckinsey.com/capabilities/people-and-organizational-performance/our-insights/why-diversity-matters\n\nPoint is that companies see material benefits from having a diverse talent pool. Literally, businesses do better if they aren't 99% white dudes. Given the history of people being turned down for jobs due to the reasons you listed, companies are now trying to achieve having a diverse talent pool by focusing on hiring diverse people.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sleep_On_It43",
                    "body": "There is no point of fighting a belief with facts. If it were a successful strategy? The world would be a better place. These folks have had their minds poisoned by manufactured outrage.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "_Two_Youts",
                    "body": "FYI the McKinsey report has been almost completely discredited. They got the causality wrong. Successful companies tend to embrace diversity initiatives. It is *not* the case that diversity makes companies more succesful, necessarily.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DarkBomberX",
                            "body": "Interesting. I'll try and remember this. Do you know of any better articles to show people about the benefits of DEI?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "_Two_Youts",
                                    "body": "I don't, and I don't necessarily agree DEI, as currently practiced, is beneficial.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PM_ME_ZED_BARA",
            "body": "Generally no, with a few exceptions like when skin color/gender/sexuality is a legitimate part of one’s merits in a job. \n\nFor example of the exceptions, if I run shelters for those who are sexually abused, it would make sense that I hire men and women. Say, if I aim to have 30 employees and so far I have 20 qualified male employees, then I think it is reasonable that I would hire qualified women for 10 remaining spots, rather than men. \n\nIdeally these innate characteristics would not matter but we do not live in an ideal world yet. As long as our society treats people differently based on these characteristics, then there will remain cases where hiring based on these attributes is reasonable or even necessary.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "s_ox",
            "body": "I support companies hiring on truly non discriminatory basis. The problem is that even the humans with the best intentions have subconscious biases, based on many experiments we have that have studied this. The true problem is in finding methods that truly eliminate such biases. Which is why race and other bias conscious hiring practices are essential. It is not the only method.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "wooshoofoo",
            "body": "I work in big tech which is acknowledged to have some of the worst diversity numbers around and NO DEI effort would ever result in that. The most that it has accomplished is ensuring every job interviews at least one non-white/Indian/Asian female candidate, because white/Indian/Asian dudes is basically all we used to even entertain interviewing.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TheyCallMeChevy",
            "body": "Have you ever considered that the current system is not a meritocracy?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "HuegsOSU",
            "body": "IMO, increasing the diversity of the applicant pool is a good thing, but it’s a detriment to the company to hire someone less qualified just because they’re a minority. \n\nThe truth is it requires EFFORT for companies to implement DEI policies in a meaningful way, especially larger ones, and most senior leaders would just rather just check that box. \n\nAnecdotal, but I’ve personally had multiple experiences at large companies where HR literally would not allow us to submit negative feedback on a new minority’s review for not being capable of the role despite them receiving extra help and teaching others normally wouldn’t get. This placed extra burden on the entire team to pick up their slack which creates animosity. Any other white employee would be let go and not get such treatment. And this is in a creative/progressive industry, so I can imagine it’s way worse in regular corporate America.\n\nDiversity is the great and brings new points of view often needed in majority white institutions. But when it’s ham fisted and people see less qualified individuals getting roles they aren’t qualified for, it’s easy to understand the pushback.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Impressive_Heron_897",
            "body": "You were sold a lie. What you're describing isn't happening. There are some places that hire to maintain some level of diversity, but that's them choosing the strengths of a more diverse workforce over pure resume. After working at a bunch of different places, I can say diversity is indeed a strength.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "fastolfe00",
            "body": ">Do you support a company hiring based apon skin color, gender, or sexual preferences OK?\n\nNo. And in the US at least, this is illegal employment discrimination. If you believe this is happening at your company, you can report it to.the EEOC, or have another employee report it on your behalf.\n\nWhen companies seek diversity (or even just proportional representation), what they actually do is:\n\n1. Target their recruiting to underrepresented groups. \n2. Show up at conferences and events that specifically highlight underrepresented groups \n3. Intentionally have people expand their LinkedIn networks (most people's professional networks look like them).\n4. Scrutinize their hiring process to eliminate any form of bias that might have unintentionally crept in. This might involve things like blinding resumes so that resume reviewers don't have anything to exhibit unconscious bias against. \n5. Make the workplace the kind of place their employees of color recommend to their professional networks.\n\nDoing these kinds of things results in a higher fraction of applicants being people of color, women, etc. If the rest of your hiring process is unbiased, this means you will end up with a diverse (or representative) workforce.\n\n>does this leave more qualified applicants left out?\n\nIt shouldn't, no. Nothing about the process I'm describing above includes any kind of racial quotas for preference given in the actual hiring process itself. Diversity is achieved in hiring by achieving it in applications. The evaluation itself should be unbiased. \n\nSource: I have run large organizations and have built hiring pipelines from scratch with diversity as a goal. I have spent more hours in rooms with HR and employment lawyers figuring these things out than I think anyone here has spent in threads answering variations of this question.\n\n>Is it fair if let's say, a black lesbian with 2 years in college was to get a job over a cis white man with 4 years? Didn't he in the end put in more work, and therefore deserve the job more?\n\nIf you're hiring for a line cook position and want to pay $20/hr, and a highly qualified professional chef asking $100/hr applies, it's rational to choose the less qualified candidate. Same if the more qualified candidate is likely to be there only briefly while you want someone more long term, etc.\n\nIn some positions, qualifications are inherently political, such as Supreme Court Justice. The ABA seems to do a decent job of objectively pointing out who is likely qualified for such a position, and I support intentionally choosing for a diverse slate of Justices, so long as they are at least qualified.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "evil_rabbit",
            "body": "yes, if they're doing it to increase equality, then i support it OK.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Square-Dragonfruit76",
            "body": "> Do you support a company hiring based apon skin color, gender, or sexual preferences OK?\n\nSometimes, if they both already meet the initial qualifications for the job.\n\n> Is it fair if let's say, a black lesbian with 2 years in college was to get a job over a cis white man with 4 years\n\nIf someone wants to do that, I wouldn't necessarily have a problem with it as long as the job doesn't require a college degree to begin with. If the job needs someone with a college degree, then the first person shouldn't be hired.\n\n> Didn't he in the end put in more work\n\nA college degree is about education level, not how much work someone has put in. Someone could be only doing 5 hours of actual stuff a day while in college, whereas another person could be working two jobs, 10 to 12 hours a day. Or it could be the other way around, but either way, a college degree does not necessarily signify the amount of work you put in.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dr_Scientist_",
            "body": "Are people *entitled* to private employment wherever they wish?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "IamElGringo",
            "body": "Yes, diversity is important",
            "score": 1
        },
        {
            "depth": 0,
            "author": "docfarnsworth",
            "body": "no, but i think places should examine why their employees differ from the population and candidate pole. I dont think companies should prefer a race, but maybe they could try to target great candidates from minority schools for instance.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "I think that having a diverse set of view points is likely a benefit to organizations and thus a valid metric to grade potential applicants on.  No one is seriously suggesting it should be the only metric, and in theory it would work for hiring white people in areas where they are under represented as well.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ElboDelbo",
            "body": "White people have pretty much been on top in America since the pilgrims landed at Plymouth Rock.\n\nIf a few of us lose a few job opportunities, I'm not losing sleep over it.  It still ain't exactly difficult to be a white man in America.  There's jobs everywhere and white people, specifically men, still occupy the higher up positions in most companies.  Hell, even small business owners tend to be largely white.\n\nYou'll be alright.  There's plenty of work out there for you.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PhylisInTheHood",
            "body": "I'll just say that in my personal offline experience, but i have never Heard a talented person blame dei for them not getting a job. Funny how that works out",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mr_miggs",
            "body": "\n>Is it fair if let's say, a black lesbian with 2 years in college was to get a job over a cis white man with 4 years? Didn't he in the end put in more work, and therefore deserve the job more? Or is there some underlying factor that I am failing to grasp?\n\nIn the example that you provided, the only disparity between the two people was a couple years of college. Whether those two years matters to an employer depends on the job.   \n\nDEI policies at companies simply are not about hiring people based on race/gender/sexual preference regardless of their experience. They are about promoting an inclusive and diverse workplace. \n\nMy company does this well. For hiring practices, managers are not encouraged to hire certain people over others. Rather they are encouraged to reach out to those communities and broaden the pool of applicants. We also have groups that meet to discuss issues related to race/gender/sexuality/disability. Anyone is free to join any of those groups, and they are a great way to network and to learn about the needs and experiences of that group. \n\nIt helps to improve the work environment and make all people feel more included. My industry was historically white cis male dominated, so that is actually an important thing. If people who are not part of the main group at your company, they may not even apply there for fear of being isolated. Having a DEI policy encourages people from more communities to want to work there, and increases your potential pool of candidates. \n\nIn the end, it is literally a good business decision to have these policies.  It is hard to find good people to staff a company, and working with a larger pool of applicants really helps. And managers will absolutely not use those policies to hire a black lesbian over a white cis male if the black lesbian is significantly less qualified. Managers do not want to hire people unless they know they will be able to do the job and improve their team.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LeeF1179",
            "body": "If I owned a business, I would hire the person that could most facilitate the organization's mission statement.  I wouldn't care what color they were, who they slept with, or what they had between their legs.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DoomSnail31",
            "body": "I support the current legal framework around diverse hiring practices as per the Dutch constitution. \n\nIn short, discrimination based on any protected class us illegal when you're hiring someone. Protected classes in this context are, amongst others, sexuality, political affiliation, religion, gender identity, skin colour, age. \n\nExceptions to this rule occur when the discrimination fits the description of the job. For example, age based discrimination would be okay when you're hiring someone to be the face of a brand focused on teenagers. Religious discrimination would be okay if you're hiring a teacher for a religious private school. \n\nThe company hiring, and thus engaging in discrimination, is liable to prove that said discrimination was befitting the requirements of this legal exception. If they fail, we have a case of unlawful hiring discrimination. \n\nWhilst this can lead to some negative experiences for individuals, this generally seems to work well on a societal level.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Please show an example of an under qualified individual getting hired over a qualified one due to diversity.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dream_flakes",
            "body": "I'm not exactly sure whether these criteria makes an applicant more qualified or less qualified. to do the work the company wants. HR departments can look at the credentials or licenses for technical jobs.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lemonbottles_89",
            "body": "Your question sounds like you're assuming there is a major difference in qualifications between most minority candidates and most white candidates.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gilbert__Bates",
                    "body": "Whether this is true or not is irrelevant. The are plenty of qualified candidates for most job openings, but race should not be determining which on of them gets hired.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lemonbottles_89",
                            "body": "My previous comment is the cruz of the whole question. But anyways, the reason why race is often taken into consideration for hiring is to correct the pre-existing racial biases that this country has started with, and still continues with. The fact is that more people get hired for stable well-paying jobs through networking and connections more than they do by cold resume submissions on places like LinkedIn. And when, for most of history, the people in a position to hire through those connections are white people, that means white people have an unfair advantage in being hired for well-paying jobs, and something needs to be done to correct for the racial biases. A white person in upper management is more likely to network and connect with other people who have lived in his/her circles, grown up in the same neighborhood as them, went to the same school as them, and for most white people in America, those are other white people. That's how its been for most of history (and some research shows that neighbors and schools today are even more segregated than they were in the 60s)\n\nIf you don't want the solution to this problem to be \"DEI hiring\" then what other solutions are there?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gilbert__Bates",
                                    "body": "Most white people don’t have these great connections you think they do. The end result of DEI is that poor and less connected whites get doubly screwed just cause a bunch of rich people share their skin tone. I don’t support that and nor do the majority of voters across the country. Sorry not sorry.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lemonbottles_89",
                                            "body": "I didn't say anything about \"great connections.\" It's as simple as hiring your brother-in-law to fill a position at your company over hiring someone on LinkedIn (as one of my ex-bosses did). And your brother-in-law is more than likely to be the same race that you are, because most people marry within their race. If you don't want \"DEI hiring\" to correct for the problem of racial biases within networking and connection, toss out another solution. \n\n>The end result of DEI is that poor and less connected whites get doubly screwed just cause a bunch of rich people share their skin tone. \n\nProve this.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Gilbert__Bates",
                                                    "body": "Most white people don’t have brothers in law with hiring power. You’re talking about a small minority of white people. Every white person I know who’s gotten hired recently has had to build up their network from scratch just like anyone. If you genuinely believe that’s how life is like for most white people then you’re incredibly sheltered.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lemonbottles_89",
                                                            "body": "If it's not someone with hiring power, then its already working at a company and referring someone you to know those with hiring power. It's not as \"elite\" as you're imagining it is. You're underestimating how much companies rely on referrals from people's networks. Of all the white people you know who've gotten hired recently, ask yourself what kinds of jobs they were for and how they got it. You can also do this research yourself on [racial bias in job networkings and referrals](https://www.usatoday.com/story/money/2024/05/02/employee-referral-programs-hurt-diversity/73532573007/), its not new information...",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Gilbert__Bates",
                                                                    "body": "You need to stop assuming every white person is an upper middle class college grad with an old boys network. You’re shockingly sheltered and ignorant. A lot of white people struggle to get jobs too because they don’t have strong networks either.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lemonbottles_89",
                                                                            "body": "So now you're just ignoring what I'm saying. Alright. Again, you are free to do the research yourself, and itll all tell you the same things I just did.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Gilbert__Bates",
                                                                                    "body": "Til there are no working class white people and we all have connections at companies ready to hire us at a moments notice. I should tell some of my still unemployed white friends that; it might cheer them up.",
                                                                                    "score": 0
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "_Two_Youts",
                                                    "body": ">It's as simple as hiring your brother-in-law to fill a position at your company over hiring someone on LinkedIn (as one of my ex-bosses did). \n\nYou are greatly overestimating how many white people have connections even this minimally beneficial.\n\nAnd discriminatory connections fucks over people without those connections far more than those with them. Hence why the person you responded to said they are \"doubly fucked.\"",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lemonbottles_89",
                                                            "body": "We aren't talking about how many white people that have them. Of the people that DO have them, the majority are white, which is the problem that DEI hiring is attempting to correct.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Gilbert__Bates",
                                                                    "body": "So because a few white people have those connections, every other white person must now be discriminated against in the hiring process to compensate. Totally sound logic lmao.",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "_Two_Youts",
                                                                    "body": "So instead of trying to fix the issue of nepotism, you instead want to make sure nepotism is racially neutral? Can you understand why a poor white would get anhered by that?",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "jweezy2045",
            "body": "Your hypothetical is nonsense. No, no one is hiring unqualified people. That’s not how this works. That’s not how hiring works. \n\nIn hiring, you gets many more applicants than you can accept. The idea that there is a single best applicant is nonsense. Think about it. Let’s say 100 people apply, but if those, only 20 are in serious consideration. Of those 20 people, 5 are the top candidates who would all succeed in the role. Choosing one of these 5 above the other 4 for something like diversity reasons is not at all sacrificing hiring quality. It’s just not. You’re hiring equally qualified people, who happen to be black lesbians, not unqualified people who are black lesbians.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gilbert__Bates",
                    "body": "> Choosing one of these 5 above the other 4 for something like diversity reasons is not at all sacrificing hiring quality. \n\nGlad you can admit that you support illegal hiring discrimination. I really appreciate it!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jweezy2045",
                            "body": "In what way is that illegal hiring discrimination?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Gilbert__Bates",
                                    "body": "What else would you call selecting between applicants based on their race or other protected characteristics?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jweezy2045",
                                            "body": "Freedom. A company can hire who they believe is best for their company. If they believe a black lesbian with equal qualifications provides move value to their company than a white man with equal qualification, they can hire the black lesbian to maximize the value of their company. \n\nThat’s not discrimination in any way, nor is it illegal.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Gilbert__Bates",
                                                    "body": "That may be your perspective but that's not what the law says. As much as you desperately wish otherwise, our current laws are mostly race neutral.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "jweezy2045",
                                                            "body": "No, that’s exactly what the law says. The law says you cannot discriminate based on race. This is not discrimination, so it is not against the law.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Gilbert__Bates",
                                                                    "body": "Selecting applicants based on their race is textbook discrimination. If a company selected a white man over an equally qualified black candidate based on race, we both know you'd be singing a different tune.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "jweezy2045",
                                                                            "body": "Who said we were selecting applicants based on  their race? I said they were selecting the equally qualified person out of the best interests of the company. Having diversity in your company is, itself, an advantage. Hiring to increase diversity is hiring the best person based on merit to improve the economic performance of the company the most.\n\nAlso, you’re wrong. If a company lacked the perspective of white men, then hiring a white man over a black lesbian would be in the companies best interest. Why would you think I have an issue with that?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Gilbert__Bates",
                                                                                    "body": "That was the legal loophole used to justify affirmative action, but it's since been shot down by the supreme court. With any luck Corporate DEI will soon follow. Goodbye and good riddance.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "jweezy2045",
                                                                                            "body": "Companies will not be forced to hire equally qualified white people over equally qualified black lesbians. I mean honestly, how does your position even make logical sense? Is hiring a white man somehow not a DEI hire? Is white not a race? Is man not a gender?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Gilbert__Bates",
                                                                                                    "body": "They’re free to hire whoever they want as long as they aren’t deciding based on race or other protected characteristics. ",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "jweezy2045",
                                                                                                            "body": "Which isn’t what hiring a black lesbian is doing. It’s hiring based on what you think is best for the company, which is perfectly legal.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "Gilbert__Bates",
                                                                                                                    "body": "Not if that involves hiring based on protected characteristics. If someone genuinely thought their company would do better if it hired only white people that still wouldn’t be legal.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "jweezy2045",
                                                                                                                            "body": "https://journals.sagepub.com/doi/abs/10.1177/000312240907400203\n\nIt is legal to maximize your profits and make hires that achieve that aim.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "Gilbert__Bates",
                                                                                                                                    "body": "That article has literally nothing to do with legality. The idea that institutions can discrimination to achieve diversity was just struck down by the Supreme Court. Just because something might be in a companies interests doesn’t automatically make it legal.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "jweezy2045",
                                                                                                                                            "body": ">The idea that institutions can discrimination \n\nThey are not discriminating. That is the point here. Choosing someone because their race maximizes profit is not discriminating against other races. Since this is not discrimination, it does not fall under discrimination laws. The laws do not say that you cannot consider race, just that you cannot discriminate on the basis of race. Discrimination and consideration are not the same thing.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "Gilbert__Bates",
                                                                                                                                                    "body": "Where is this distinction legally defined? Just because you think there’s a distinction doesn’t make it legally recognized.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "jweezy2045",
                                                                                                                                                            "body": "In the civil rights act. That's what it means. That's how it works. It is not against the law to only hire white people as actors to play the role of George Washington. It outlaws discrimination. Consideration is not discrimination.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "Gilbert__Bates",
                                                                                                                                                                    "body": "Tell that to the Supreme Court, I guess. They specifically said diversity doesn’t count as a legitimate reason to prefer one applicant over another.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "jweezy2045",
                                                                                                                                                                            "body": "Sure. Me and the supreme court are in perfect agreement. No one thinks it is against the law to hire only white male actors to play George Washington. That is not discrimination, and me and the supreme court agree.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "author": "Gilbert__Bates",
                                                                                                                                                                                    "body": "But the Supreme Court said that promoting diversity doesn’t qualify as a legitimate reason to favor one applicant over another, even if that’s in the interests of an institution.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "depth": 22,
                                                                                                                                                                                            "author": "jweezy2045",
                                                                                                                                                                                            "body": "Wrong. The supreme court did not say that at all.",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "depth": 23,
                                                                                                                                                                                                    "author": "Gilbert__Bates",
                                                                                                                                                                                                    "body": "They said that race can not be considered in college admissions. They explicitly used the word “considered” too which you seem to be obsessively hung up on. This precedent hasn’t been applied to corporate hiring yet, but people are already building cases around it.",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "depth": 24,
                                                                                                                                                                                                            "author": "jweezy2045",
                                                                                                                                                                                                            "body": "None of those cases will hold, and the supreme court ruling on affirmative action is hilariously weak as well. It is still true that metrics like GPA are biased, and it is still legal to acknowledge and account for that bias, including if that bias is race. \n\nYou just seem to not fully understand these court cases, and just think it means no one can consider race for any reason. That is clearly nonsense. I mean honestly, do you think it should be illegal to only hire white male actors to play George Washington in your historically accurate film? Yes or no?",
                                                                                                                                                                                                            "score": 1
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                },
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "_Two_Youts",
                                                                                                                    "body": ">It’s hiring based on what you think is best for the company, which is perfectly legal.\n\nThis is an embarrassing argument. You sre proposing these two concepts as if they oppositional. You can hire someone \"because\" they add value to the company; and they add value to the company \"because\" they are X race. Through basic transitive property you are hiring them *because* they are X race.\n\nIf this paper thin argument had any merit, the Civil Rights Act would be completely toothless.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "jweezy2045",
                                                                                                                            "body": "> Through basic transitive property you are hiring them because they are X race.\n\nOnly so long as doing so improves your company, yes. That is how this works. It is not illegal to only hire white male actors to play the role of George Washington in your historically accurate film. Saying that is against the civil rights act is a joke. That is not how it works.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "_Two_Youts",
                                                                                                                                    "body": ">It is not illegal to only hire white male actors to play the role of George Washington in your historically accurate film. Saying that is against the civil rights act is a joke.\n\nPoor example because something like this is an express exception to the Civil Rights Act.\n\n>Title VII of the Act . . . prohibits discrimination by covered employers on the basis of race . . . . In very narrowly defined situations, an employer is permitted to discriminate on the basis of a protected trait if the trait is a bona fide occupational qualification (BFOQ) reasonably necessary to the normal operation of that particular business or enterprise.\"\n\nYou are referring to a BFOQ - i.e., someone of a different race literally cannot perform the job. Jobs like that are very rare and there is reason why you had to go to entertainment to find it, rather than something like, I don't know, the entire financial or tech sectors?\n\nI'm sure your next move will be to claim being X race is BFOQ because the company needs diversity. Under that logic, McDonalds would be justified to refuse any employment of blacks in racist towns because it would likely increase their operating income there. Do you think that result was intended by the drafters of the Civil Rights Act?",
                                                                                                                                    "score": 1
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lobsterharmonica1667",
            "body": "I support practices that allow for a more diverse workforce. Usually that's just a matter of making sure the candidate pool is sufficiently diverse and making sure that you make an effort to combat any biases.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MrTickles22",
            "body": "No. Hard enough to get a job without being subject to discrimination based on an innate characteristic.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Personage1",
            "body": "I support finally acknowledging that those things are taken into consideration when hiring. I'm tired of society pretending that white straight men haven't been benefiting from those very considerations as the status quo in society.\n\nWhy are you so ok with white straight men benefiting from discriminatory hiring practices? Shouldn't other people have a fair shot too?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "coolgy123",
                    "body": "I never said I was. It is the fact that the discrimination is not there. If you look for it, you see all of these flashy articles. Have you seen it, in person, put in practice? I can only think of these isolated cases when I think of it.\n\nI have many friends of different races, and they have never had any issues getting a job based on race. Many of them are extremely well-off too. This issue is a made-up point for a liberal Democrat's voting campaign. liberals constantly call the Republicans racist because we don't see other races as above us.\n\nStating this does not automatically mean we look down on them. we look them in the eyes as fellow human beings, not gods. We don't sacrifice for them because they are capable human beings. They are equals. There ARE cases of racist Republicans, but that does not make all republicans racists. If you believe that, you believe a stereotype, something you are so adamant against. I call it hypocrisy.\n\nSame as politicians, both sides included, saying to do one thing and doing the complete opposite. This leads back to the discrimination. If it keeps being pushed, racism will loop around, as more and more advantages are given to minorities, and suddenly it is the whites who are being discriminated against.\n\nThis is my issue. I want my children to be equal to their fellow Americans, whether Black, Latino, Asian, Native, or Indian. This is not about myself, I can deal with my own crap. I don't want my children to grow up how a black child grew up in the 50s, I want them to grow up and not make friends based upon race, but instead upon the person themself. Not to have them spit on for existing.\n\nIt is like losing traction while driving. A slight turn will allow you to recover your car, but if you over-correct it you end up in a ditch. I believe this is where our society is going. You can say whatever you want about the white man's skin, and no one gives a damn. Then try saying it about a black man. You will get canceled. Ruined. You are suddenly known as a racist and hated. This is what concerns me.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "willpower069",
                            "body": "So any evidence unqualified people are being hired because of sexuality, race, gender?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "coolgy123",
                                    "body": "You asked for evidence. I'll give you a source, but it is not your CNN 10 [https://www.foxbusiness.com/politics/american-express-reverse-discrimination-white-people-former-employee](https://www.foxbusiness.com/politics/american-express-reverse-discrimination-white-people-former-employee)",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "willpower069",
                                            "body": "> The employees, none of whom were in human resources, did not present internal documents to demonstrate an official policy, but they said they witnessed a worrisome trend that raises questions about racial discrimination in promotion.\n\nlol Of course. So strange how many people claim this is happening without anything to back it up.\n\nI am surprised you finally managed to show something, but you should have critically thought about the content of the article first.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "coolgy123",
                                                    "body": "no, I read it. The whole damn thing as well. The people are feeling it. They sense it. If it was a black woman in that place, saying they felt discriminated in the workplace, not getting promoted, would you brush it off because they are not in human resources?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "willpower069",
                                                            "body": "I remember hearing many conservatives proclaim time and time that “facts don’t care about your feelings.” \n\nSeems odd to claim something is happening with no proof and only feelings.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "coolgy123",
                                                                    "body": "That doesn’t address my question at all. I will post it again in case you missed it.\n\n>If it was a black woman in that place, saying they felt discriminated in the workplace, not getting promoted, would you brush it off because they are not in human resources?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "willpower069",
                                                                            "body": "And you provided no evidence just feelings. People feel like crime is up and yet it’s not. Does that mean crime is actually up?",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "coolgy123",
                                    "body": "-12.1% of Americans are black\n\n-Approximately 13% of the workforce is black\n\nThis points toward the fact that there is no employment issue.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "willpower069",
                                            "body": "That doesn’t address my question at all. I will post it again in case you missed it. \n\n> So any evidence unqualified people are being hired because of sexuality, race, gender?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "coolgy123",
                                                    "body": "Hey bud, It is an argument against the fact that there is a diversity issue. No need to make the jobs easier to get if they are already getting them.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "willpower069",
                                                            "body": "And there is no proof of “making the jobs easier to get,” just conservative fantasies.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "EdwardPotatoHand",
            "body": "My current opinion, which has changed over time, is that if it’s a black person and maybe Native American they should be given preferential treatment over all other races including white, Indian, Asian, middle eastern, whatever .   I believe that black people built this country and then we threw them away.  They have not recovered from this and we owe it to them, to help bring them back.   I do not believe that other minorities should be given preferential treatment.   I do not believe this should be law.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "coolgy123",
                    "body": "But why in the end should we be punished for our ancestors' mistakes? couldn't the same be said about men vs women? the men created all of these things, yet the feminists say all men are stupid apes",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hitman2218",
                            "body": ">But why in the end should we be punished for our ancestors' mistakes?\n\nBecause white people as a whole are still benefitting from it.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "coolgy123",
                                    "body": "proof. I am an evidence guy.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hitman2218",
                                            "body": "I’ve had this discussion a thousand times with conservatives. You can lead a horse to water.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "coolgy123",
                                                    "body": "How is it beneficial for me to watch as former issues are over-corrected?",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hitman2218",
                                                            "body": "We’re a long way from over-correction.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "willpower069",
                                                                    "body": "Conservatives need to lie to justify their opposition.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EdwardPotatoHand",
                            "body": "It’s not punishment.  It’s to help a group that helped us.   You and i would not have the luxuries we have today with the black folks of this country.  It’s the Christian thing to do.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "coolgy123",
                                    "body": "For give if I am wrong, this is basically the same statement I just gave, just worded from another standpoint.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FiveStarPapaya",
                            "body": "Why should a white person be hired over a minority if they are equally as qualified or perhaps less qualified than the minority?",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "EdwardPotatoHand",
                                    "body": "He’s arguing for non-preferential hiring..   The “color blind” argument.  I understand that argument and can see where folks are coming from.   People don’t want to be racist so they decide they are “color blind”.    Missing that ignoring the struggles of minorities and saying everyone is equal is perpetuating systemic racism.  I would say most racist think they aren’t racist because they are unable to see beyond the outside layer and  empathize with struggles of people outside their tribe.  It’s really the core difference between the left and the right.  The ability to empathize or not outside of your tribe.   Many of us on the left get angry because we explain over and over the other layers, but it doesn’t help.  It’s not their fault, necessarily, If they  literally do not have the ability to empathize with people outside of your tribe, they will never understand their struggles, no matter how many different ways we try to describe it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "coolgy123",
                                            "body": "not exactly. ignoring an issue does not solve it. I believe that all men (and of course women) are created free and equal. This means NO human should be advantaged over others. Would you also tell me what a few of the struggles are and what exactly is meant by struggles?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "coolgy123",
                                                    "body": "Because I do genuinely want to know",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "EdwardPotatoHand",
                                                    "body": "100% ignoring an issue does not resolve it.  glad we agree.  All men are not free and equal.  Tell me, why do you think the black community struggles to get ahead?  If everything is free and equal, what do you think the problem is?  If what you say is true, why is the black community overwhelmingly poor and struggling?\n\n  \nIn 2022, **17.1 percent** of Black people living in the United States were living below the poverty line, compared to 8.6 percent of white people. That year, the total poverty rate in the U.S. across all races and ethnicities was 11.5 [percent.No](http://percent.No)\n\nhttps://www.statista.com/statistics/200476/us-poverty-rate-by-ethnic-group/#:\\~:text=In%202022%2C%2017.1%20percent%20of,and%20ethnicities%20was%2011.5%20percent.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "EdwardPotatoHand",
                                                            "body": "I genuinely want to know why you think the poverty rate is more than double for black folks.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Gilbert__Bates",
            "body": "No. And I think this a growing problem in many companies that needs to be investigated. Fuck DEI hiring and fuck anyone who supports it.",
            "score": 0
        }
    ]
}