{
    "title": "Do you or any liberals you know support open borders?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nI have a family friend who has become a QAnon conspiracy theorist. She recently posted a meme of an open door that something like, \"people who support an open border should celebrate on May 25 by leaving their front door open.\"\n\nI commented that nobody on the left supports open borders other than most extreme leftists. She stated that she knows several people on the left that do.\n\nSo my question is, do you or someone you know support open borders? I also asked her to name one politician in Congress that is lobbying for open borders. I'm sure she'll ignore that request. \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CraftOk9466",
            "body": "I support open borders, as in hire enough immigration officers to screen everyone who wants in, and give them papers if they’re not criminals.\n\nBut I get the sense that when people hear “open borders” they think of just getting rid of any immigration laws whatsoever, which is obviously dumb and supported by no one.",
            "score": 151,
            "replies": [
                {
                    "depth": 1,
                    "author": "Apprehensive_Fix6085",
                    "body": "You, I and Ronald Reagan and I all agree on immigration.",
                    "score": 42,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "godlyfrog",
                            "body": "I like trotting out the Republican primary debate from 1980 where Bush Sr. and Reagan are debating and [talk about the border](https://youtu.be/TpJmozEzd-I?t=2686).  The link directs right to the question, but it starts at 44:46 and runs through 47:30.  They both talk about recognizing the reason why people are illegals and being compassionate.  Reagan talks about working with Mexico and suggests that putting up a fence is stupid.  If I didn't know these two men were both Republican and this were done in 1980, I'd have assumed this were a debate between modern liberals.",
                            "score": 31,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "saturninus",
                                    "body": "\"These are good people, strong people. Part of my family is a Mexican.\" A little awkward from Bush, but 180 degrees from \"They're not sending their best.\"",
                                    "score": 18
                                },
                                {
                                    "depth": 3,
                                    "author": "BooBailey808",
                                    "body": "Overton window shift",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "BraveOmeter",
                                    "body": "I'd love to see Trump and Desantis both answer that question now",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "mtmag_dev52",
                            "body": "??? How so?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Apprehensive_Fix6085",
                                    "body": "https://www.reddit.com/r/AskALiberal/s/bPtox6GtaP",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CaptainAwesome06",
                    "body": "I get the sense that Republicans seem to think \"open borders\" means there is no policing and immigration has run amok. Plenty of people want less restrictive immigration. But somehow the narrative has turned into \"Democrats want turnstile border access.\"",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HayabusaJack",
                            "body": "It’s the same thing with ‘Defund the Police!1!!!11’ which is in reality, let’s reallocate some police funding to groups that can help folks that don’t really need the police and let the police do actual police stuff.",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Daegog",
                                    "body": "I always thought of defund the police means to demilitarize the police.  You got tiny towns with literal APCs.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BooBailey808",
                                            "body": "Its both.  Instead of spending all this money militarizing the police, lets spend it on things that would actually reduce crime rather than fighting it",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HaveCamera_WillShoot",
                                                    "body": "The police don't fight crime, either. They fight poor people, mostly.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "BooBailey808",
                                                            "body": "Touché",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Vuelhering",
                                    "body": "The difference is no democrat ever said \"open our borders\" afaik.\n\nPlenty of people said \"defund the police\" and meant it as that. They didn't mean it as \"redirect money to mental health first responders\" which was retconned in once everyone called them stupid. \n\nAnd if you don't believe me, plenty of the blm protests had signs with other less ambiguous things like abolish the police.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ActualTexan",
                                            "body": "Defunding always meant what you're saying was the retconned version. People just didn't know what defunding entailed so the meaning of the phrase was clarified. \n\nPolice and/or prison abolition is a separate issue. Defunding doesn't mean abolition and the people advocating for defunding weren't necessarily advocating for abolition because you can advocate for the former without advocating for the latter. \n\nBut even the abolition position was treated with no nuance just like defunding by people who were either ignorant, bad faith actors or both. Most abolitionists advocate for a gradual approach that in and of itself isn't absolute and a step along the way to some form of abolition is the kind of 'retconned' defunding you mentioned.\n\nBottom line: like usual, the people criticizing the positions of the protesters didn't know what they were or what they meant and they never tried to find out because they never cared (even four years later).",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Vuelhering",
                                                    "body": "> Bottom line: like usual, the people criticizing the positions of the protesters didn't know what they were or what they meant and they never tried to find out because they never cared (even four years later).\n\nI was there, and I reject your shifting the burden to the listener. If there was a messaging issue, it was internal to the protesters, because that is what multiple protestors stated outright.\n\nAt that same time, tons of viral twitter and fb posts said things like \"Police originated to chase slaves\" and whether many (like myself) believed in redirecting funding to train mental heath services, these same protesters attacked Biden's statements who wanted to add funding for mental health first responder services but not remove funding from police.\n\nNo, not every protester or ally believed \"defund\" meant take away all the funding, including me. But a **significantly large** percentage of advocates did which is why that expression caught on, and I reject you trying to gaslight by rewriting history. I watched it happen with my own eyes and questioned advocates. I had to explain to some that the rich would hire their own private police forces, a far worse outcome.\n\nA **large percentage** I spoke with wanted money *completely* removed, to wreck the police institution, just like GOP advocates removing government money to Planned Parenthood to try to wreck them. Exactly the same sentiment, and no, I didn't misunderstand what several were saying.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "libananahammock",
                                    "body": "In all fairness, the left sucks at branding and marketing. We open ourselves up to this shit by labeling the movement defund the police. I know what that means but what did we think was going to happen when we label allocate funding spent on police services to mental health and homeless serves DEFUND THE POLICE lol",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "johnnybiggles",
                                    "body": "It's also similar to J6 where they claim that Capitol police were just \"letting them walk in!!\" to the building unfettered.  \n\nThe ones who were doing it were on the \"same team\", and the others were doing it intentionally for crowd control, so to avoid unnecessary violent confrontation and to herd them to secluded, monitored or controlled areas.  \n\nTheir tiny little minds only function on tiny bite-size bits of black & white information, so either the border is \"open\" by their opposition, or totally closed by their guy.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "JustDorothy",
                                    "body": "The difference is \"Defund the Police\" is an actual slogan that actual leftists actually use. It's a terrible slogan that doesn't clearly communicate what BLM/police reformers actually want, but it's not something rightwing media just invented out of whole cloth, like we're going to take all their guns",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Haltopen",
                            "body": "It would definitely cut down on unauthorized immigration if you could just come here legally and stay without needing a specific reason. Despite what most people think, most unauthorized immigrants didn't sneak across the border, the vast majority of new unauthorized immigrants each year are people who came here legally, passed through the process and then overstayed on their visa because they had put down roots and were either afraid they'd be kicked out and denied re-entry or were denied visa renewal and told to leave. And it gets worse when border restrictions get stricter (ie when republicans enter office). Unauthorized immigration had been on a steady downward trend since it hit its peak in 2007 but then trump entered office and it started going right back up again.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "bumpkinblumpkin",
                            "body": "I’ve seen a lot of people say things like we have to double the number of legal immigrants each year, but that fails to consider the people immigrating illegally are already at the very back of the line when it comes to immigration for as long as there are waves of skilled laborers from Nigeria, India, Pakistan and Iran trying to move here. An unskilled immigrant with limited language proficiency simply doesn’t have the positive economic impact of skilled labor. \n\nWe’d have to eliminate preferences for individuals that provide the largest economic gain for the country or essentially take anyone that we can’t prove has a criminal record to curb illegal immigration. I’ve yet to see a single Dem or Rep propose such policies.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "csasker",
                            "body": "I think it's how different cities and state handle it and illegal immigrants. Like letting them go to school, not reporting to feds etc\n\n\nThen people, rightfully in my opinion, wonder why it wouldn't be the same nationwide when Democrats have more power ",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Call_Me_Clark",
                            "body": "Well, they really mean “open borders = the end of Americas white majority.” \n\nBut they don’t say that, much.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HaveCamera_WillShoot",
                                    "body": "They're starting to, more and more.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MateoCafe",
                            "body": "Why even have the turnstiles? I jest.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CaptainAwesome06",
                                    "body": "The turnstiles have a counter so we know how many illegal votes to cast in the next election.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MateoCafe",
                                            "body": "We don't need numbers, we will just tell Dominion to make the vote dumps the biggest most beautiful dumps you've ever seen, and if we need more we will just call them and tell them to \"find\" the votes.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CaptainAwesome06",
                                                    "body": "Hmmm. I do like a big dump. I'm in!",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "paxinfernum",
                    "body": "This is my stance. Unless you're a criminal or can't support yourself economically, why the hell should I care if you visit or even live in my country?",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "TheMothHour",
                    "body": ">and give them papers if they’re not criminals.\n\nI wouldnt consider this an open boarder policy... just saying. But way more open than what we have now.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CaptainAwesome06",
                            "body": "I agree.\n\nOpen borders would be no security. That's how I understand it, as Republicans seem to think it's completely open with no security.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Liesmyteachertoldme",
                                    "body": "I imagine it’s something similar in their minds to the zombies climbing the walls scene in world war Z.",
                                    "score": 10
                                },
                                {
                                    "depth": 3,
                                    "author": "TheMothHour",
                                    "body": "Honestly, the republicans I know (or really the ones who think this is a big issue), have no clue what immigration means, what it is like, and what it means for it to be illegal. \n\nIm not going to pretend what it is like for states near the boarder. I also believe there are issues with a loose boarder. BUT I have to roll my eyes when residents in my state think it is a huge issue for them. We have more illegal Canadians than non-white residents here. OH NO!!!",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "BooBailey808",
                                    "body": "technically speaking, yes thats what it means.  But I have only ever heard of the term used in the context of legally letting people in versus not( i.e. closed borders).  For example, many countries opened their borders again after having closed them during the pandemic",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TastyBrainMeats",
                            "body": "Okay, what would you call this, then? Because that's where I'm at. If you pass a basic background check, you come or leave at your leisure.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TheMothHour",
                                    "body": "You are probably going to hate this answer but ... a controlled boarder? \nJust because the barrier of entry is low, doesnt mean it is open. If the entry point requires documentation, thats a control. \n\nAn a boarder is not the only thing that can restrict movement too! Strict housing laws, strict work laws, and a hostile environment can hamstring an outsiders movement. And why Rep. want to destroy sanctuary cities.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TastyBrainMeats",
                                            "body": "Okay, but \"controlled border\" is an incredibly broad statement, to the point of meaninglessness, and is not very useful for getting across the idea of \"freedom of movement for anyone who passes a basic background check\".\n\n\"Open border\" is a *lot* closer.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheMothHour",
                                                    "body": "I mean ... we are definately talking about abstract ideas. And it really comes down to the definitions we use. But I define open boarders as no restrictions and no immigration at all. At the most, it would be like the Canadian boarder before 911. But now at the Canadian boarder, you need to privide an ID and purpose of the visit. (So it isnt 'open' by that standard). My friends were almost turned away onetime too!  \n\nHaving Immigration enforcement take ID and perform a background check is a form of control. And likely will require records of entry and departing. Or a VISA. So that is a form of control. Even if the term \"controlled boarder\" is vast. It indicates that it isnt opened or closed (like N. Korea). \n\nI agree that my answer isnt the clearist. But im sure there is a better term or subcategory that isnt \"open\". \n\nhttps://en.m.wikipedia.org/wiki/Open_border\n\nAlso! Boarders are more than just the port of entry. You can have those roads unrestrictive. But if the laws are hostile to incomers or a population that is xenophobic, that doesnt matter. Movement inside the country will be restrictive to outsiders. Again SKorea is a great example. Even if you make it in, you will be escourted, watched, and manipulated with every step you take.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bumpkinblumpkin",
                    "body": "How does that align with goals for an improved welfare state? As someone born in Europe this is a pretty uniquely American take amongst the left. Can’t say I’ve ever met someone back home that supported unlimited unskilled labor immigration as it would destroy our strained healthcare system.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CraftOk9466",
                            "body": "You could for instance limit welfare for non-citizens and fast-track citizenship for immigrants that are net-tax-payers. \n\nBut looking bigger picture, even someone who comes in with only a HS education is someone that we didn’t have to pay to educate. Children, if applicable, are a cost for sure, but that’s no different from any other American child. \n\nA big distinction between Europe and the US here is that, for whatever reason, immigrants tend to integrate into to the US very well.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Hosj_Karp",
                                    "body": "Children are an asset to the country. Not a liability. Declining birth rates and such. \n\nImmigrants integrate into the US better than Europe for three reasons: 1. Americans are less racist and xenophobic 2. America is a younger and more flexible society 3. Catholic Latin Americans are much more integratable into a \"western\" country than Muslim north Africans and middle easterners\n\nI think the US should have an open border policy but I actually am at least somewhat sympathetic to immigration skepticism from Europe.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kerplonk",
                    "body": "I think at that point you are kind of splitting hairs.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CraftOk9466",
                            "body": "Given the number of replies saying my preference isn’t really open borders, I disagree",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kerplonk",
                                    "body": "So firstly, if you said that voter ID laws aren't racist on a right leaning subreddit you'd likely get a bunch of people agreeing with you as well.  People sympathetic to your position also splitting hairs is not a particularly compelling defense.  Secondly, you yourself label your position as open borders and by my count there's only really one response to this that suggests they woudln't consider you an advocate of open borders vs 4 (including me) who would label you as such.\n\nThe difference between what you support and what you don't is essentially the difference between figuratively letting anyone in and literally letting everyone in.  Something like 99% of people haven't committed a crime so that's basically everyone.  Maybe people opposed to open borders are assuming we're going to stop trying to prevent terrorists from entering the country, but they're also worried that absent any restrictions immigration levels will overwhelm our ability to assimilate new arrivals.  The difference between people who are open borders and those who are not is if you think such a limit exists/should exist or not.  It's not over the 1% of the population we'd have a reason to arrest if we found them.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "clce",
                    "body": "I don't know if everyone's going to assume that. I mean, what you describe sounds like a pretty reasonable open border. The reasonable because obviously it's reasonable to check people as they come in to make sure they aren't some terrorist or drug smuggler maybe .\n\nBut, you are clearly in favor of letting in pretty much anyone who wants to come here as long as they don't post some serious threat to the country. \n\nSo I would consider you to be in favor of open borders. I think most people on the right do not assume that everyone on the left wants to let in just anybody no matter who they are. Although they do think that in favor of not caring much about most people that that also opens the door for crime etc. \n\nI guess what I mean is, most people on the right understand someone like you and you are included in when they say open borders. They don't assume everyone on the left doesn't care at all about anything. If that makes sense.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "pillbinge",
                    "body": "I don't think I've seen a single person suggest that open borders means no security.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Famijos",
                    "body": "Me too!!!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "MuaddibMcFly",
                    "body": "I would point out that even a lot of the people who advocated for that stopped doing so after the Bussing programs started to have an effect.\n\n\"Let virtually any upstanding person of good faith interest in\" works great in theory, but in practice, it doesn't work out as well as we'd like (more's the pity), because the nation would become overwhelmed very quickly (as NYC, Chicago, etc, are finding out)",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CraftOk9466",
                            "body": "It works great in practice if you’re set up for it. Not if every part of the immigration pipeline is underfunded.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "dutch_connection_uk",
                            "body": "The reason why NYC is being overwhelmed is because of immigration restrictions, not in spite of them. If those refugees could work, supporting them wouldn't be such a big problem, but they're legally not allowed to due to immigration restrictions. It's basically \"stop hitting yourself!\" for this issue, and it's how it was always intended.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "TastyBrainMeats",
                            "body": "> Bussing programs\n\nI'm sorry, do you mean the Republicans kidnapping people, or were you talking about something else?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "its_a_gibibyte",
                    "body": "Sanctuary cities are places that will not participate or cooperate with the Federal government on enforcing immigration. They don't want to get rid of immigration law, but they also don't want the law enforced, which is a distinction without a difference.",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ImInOverMyHead95",
                            "body": "It’s so that undocumented people can report being the victim of a crime without having to worry about ICE showing up at their door. For decades criminals from as low-level as muggers to serial rapists and murderers have targeted the undocumented because in the not so distant past they were significantly less likely to report the crime due to their status.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "RandomGuy92x",
                            "body": "Sanctuary cities are mostly just a myth propagated by right-wing media. [https://www.americanimmigrationcouncil.org/research/debunking-myth-sanctuary-cities](https://www.americanimmigrationcouncil.org/research/debunking-myth-sanctuary-cities)\n\nThere is no real reason to be opposed to large-scale immigration from Latin America if the majority of immigrants do in fact end up contributing positively to society. Immigrants, on average, do have lower crime rates than US-born citizens. And Latinos may be culturally somewhat different but in no way do they pose a threat to America.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Hosj_Karp",
                                    "body": "Pretty sure (modern) catholicism doesn't hold that apostates should be executed, adulterous women stoned, or gay men thrown off buildings. \n\nEurope might have something to worry about but we don't.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MaggieMae68",
            "body": "The problem with answering this question is that \"open borders\", to a QAnon/MAGA person means basically anything that isn't the Berlin Wall, complete with guard towers, a death zone, vehicle trenches, and \"shoot to kill\" orders. \n\nIf a Dem wants to increase immigration they scream \"open borders\". \n\nIf a Dem wants to hire more judges and lawyers to process the backlog, they scream \"open borders\".\n\nIf a Dem talks about not separating families, they scream \"open borders\".\n\nIt's impossible to have a rational discussion about the topic. \n\nFor the record, I support more immigration and increased asylum numbers. I want us to hire more of everything: border guards, judges, lawyers, social workers, etc. I want us to build larger, better facilities to process and house immigrants and asylees. I want our immigration and our asylum processes to take months instead of years. I want us to figure out a path to citizenship for Dreamers and people who have been in this country since they were children. I want us to do a better job of vetting immigrants and when we do deny asylum or deport someone, I want it to be done humanely. \n\nTo a conservative, that makes me an advocate for \"open borders\", so there you have it.",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mr_Quackums",
                    "body": "And good luck getting them to define \"open borders\".\n\nIf you want me to oppose or support a potential policy it is on you to define what that policy *is*.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "No. Open borders is a very fringe opinion. It might be over represented online but it is fringe. For the small number of people that actually support it, it's mostly right libertarians and even among them, a good amount aren't the caricatures of morons that simply want to throw open the border right now.\n\nRepublicans have been pushing the idea that Democrats are for open borders since the Clinton administration. Clinton marks the point at which Democrats as a coalition switched to the majority position being aligned with the former Reagan / GHWB position. The result is that Republicans began a switch to the Pat Buchanan position. After the republican base humiliated GWB when he pushed for immigration reform the switch was complete and then you get Trump.\n\nHonestly if you are talking to a QAnon type or even just a person completely indoctrinated by  right wing media, you can't really talk to them. For them \"open borders\" means we haven't opened concentration camps and sent soldiers to the border to shoot first and ask questions never. Basically they want the stuff Trump is telling us he will do in a second term.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "MuaddibMcFly",
                    "body": "Ironically, you can point out the Dems' rhetorical hypocrisy on immigration to prove that the dude's beliefs are BS.\n\nA lot of the \"Republicans are evil on immigration!\" is pure (hypocritical) rhetoric; the tools Trump used to separate immigrant kids from immigrant parents were put in place by Obama.  The \"Walls are Racist!\" and \"Not one more foot!\" cries made for great soundbites... but Biden *knows* that uncontrolled borders is a bad idea, and has been building more wall.",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kakamile",
                            "body": "No. For the whatever time, Obama temp held unaccompanied minors and still got protests from the left. Trump separated existing families for longer which made him in violation of Flores and you shill for him.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MuaddibMcFly",
                                    "body": "So, Obama set it up, but Trump did it worse?  Got it.\n\n...but that doesn't change the fact that virtually *everything* that the Republicans misuse are things that *Democrats* set up and/or use themselves.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kakamile",
                                            "body": "No. Not what I said. Read it again.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Vuelhering",
                                                    "body": "Hello? McFly? Anyone in there?",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "MuaddibMcFly",
                                                    "body": "The fact that I summarize the facts differently from what you like doesn't change that it's an accurate summarization.\n\nThis is the problem with setting up systems of control: *you'll* use it responsibly, but eventually someone *else* will be in charge of them.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Kakamile",
                                                            "body": "You can't summarize shit. \n\nYou picked one word, longer, and \"somehow\" missed the fact that it was a different thing Trump did for longer to the point that he violated the law. A rule he tried to remove in 2019.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "That works for mindless \"both sides\" logic. Since that logic relies on not actually understanding context, degree, intent or anything really.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MuaddibMcFly",
                                    "body": "...I'm pointing out that the \"border control bad!\" rhetoric disappears when the Democrats are in power, and that you can use that to prove to that moron that it's not *actual* policy, because nobody with even half a brain thinks lack of it is a bad idea, and you think it's \"both sides\" logic?\n\nOr do you just not like that the rhetoric is hypocritical and are upset with me for pointing it out.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "-paperbrain-",
            "body": "I've seen some compelling arguments for at least radically low levels of control over the movements of labor, but In general I'm in favor of what most liberals I encounter seem to want.\n\nWe recognize that migrant labor has existed for a long long time, US industry depends on it and neither party actually wants to stop the flow of labor. On the left, most of us would like immigration reform that allows people to enter and work legally which would allow them protections of safety, wages and conditions. Ronald fucking Regan spoke in favor of guest worker programs.\n\nWe recognize that the current asylum system isn't working well. We want clear guidelines actually followed, fast and humane processing.\n\nWe generally believe that what we have is not a surplus of humans or a surplus of people willing to work hard and low paid jobs. The same republicans who try to argue as though high immigration rates are slicing a pie thinner are ALSO saying no one wants to work tough jobs and complaining about a lack of available labor and a declining birthrate.\n\nI think there is no good served by having someone who came here as a child, had no say in the matter and has been here decades living as a second class citizen looking over their shoulder. \n\nI believe the best course of action is to reform immigration policy around all these areas and spend our enforcement energy specifically on things like drugs and human trafficking enforcement at the border.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "limbodog",
            "body": "I'd be for relaxing the requirements to immigrate a bit if we could get off our asses about housing.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "dangleicious13",
            "body": "Define \"Open borders\"",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Far_Introduction3083",
                    "body": "Do you support deportation of foreign nationals only in cases of criminal conduct and are against border restrictions.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ButGravityAlwaysWins",
                            "body": "Meh that's the stretch where we ignore the reality of US immigration policy and normal human behavior and declare \"effectively open borders\".\n\nUS immigration policy is based on pretending that leadership of both parties and everyone with influence doesn't want a steady flow of immigrants but we can't have that done legally. Actual conversation on the subject became impossible to have after the bitch slapping the republican base gave GWB and Republican Senators when they tried. What just happened with the bill republicans killed because Trump ordered them to confirms it.\n\n>Do you support deportation of foreign nationals only in cases of criminal conduct \n\nFor the most part. Mostly because I don't like wasting tax payer dollars on pointless law enforcement, I don't like growing the police state and I acknowledge that since we can't get people here legally, this crappy solution is still better for the economy.  \n\n\n>and are against border restrictions.\n\nEffectively no one is against border restriction. Even to the degree someone like I am, it's because I'm more market force driven and just want to use e-verify as the major driver and not waste money on shit like \"the wall\" which wouldn't work anyway.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "dangleicious13",
                            "body": ">Do you support deportation of foreign nationals only in cases of criminal conduct\n\nNot necessarily.\n\n>against border restrictions.\n\nDepends on the restrictions. I will say that I have a hard time caring much about illegal immigration as long as it is so difficult to enter legally.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> > Define \"Open borders\"\n\n> Do you support deportation of foreign nationals only in cases of criminal conduct and are against border restrictions.\n\nThat is a complete non sequitor.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dutch_connection_uk",
                                    "body": "This is a pretty conventional definition.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "its_a_gibibyte",
                                    "body": "Not a non-sequitor at all.  The argument is that if immigration laws are not enforced, then immigration laws are not relevant. \n\nIf the borders are not \"open\", it means some reasonable restrictions and process for entry, which seems popular in this thread. What should happen to individuals who do not follow the process?",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "othelloinc",
                                            "body": "> >  ...deportation of foreign nationals only in cases of criminal conduct and are against border restrictions.\n\n> The argument is that if immigration laws are not enforced, then immigration laws are not relevant. \n\nYou leaped all the way to \"not enforced\" from \"deportation\"; those terms are not synonymous.\n\nI favor enforcing laws against speeding in school zones. I don't favor deporting Americans who speed in school zones. \n\nLaws can be enforced by means other than \"deportation\".",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "its_a_gibibyte",
                                                    "body": "\n> You leaped all the way to \"not enforced\" from \"deportation\"; those terms are not synonymous.\n\nNo, that was a prior comment from someone else. I asked:\n\n> What should happen to individuals who do not follow the process?\n\nIf we set restrictions, how do we enforce those restrictions? This isn't some \"gotcha\" question. I'm genuinely asking.\n\n> I favor enforcing laws against speeding in school zones. I don't favor deporting Americans who speed in school zones. \n\nI assume the first step is to stop them from actively speeding in the school zone.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "othelloinc",
                                                            "body": ">  >   What should happen to individuals who do not follow the process?\n> \n> If we set restrictions, how do we enforce those restrictions? This isn't some \"gotcha\" question. I'm genuinely asking.\n\nSince you are \"genuinely asking\":\n\nWe are estimated to have more than ten million people in this country illegally. At no point has congress ever allocated sufficient funding to deport all of them.\n\nPeople who suggest that they should all be deported tend to be unserious people who never acknowledge the costs.\n\nFun Fact: In the 2012 Republican presidential primary, *the hardline, anti-immigrant* position rejected deporting all of them.\n\n---------\n\nAlso, it was hard to assume that you were \"genuinely asking\" because you skipped right to punishment.\n\nFinding and identifying those here illegally is the much harder problem.\n\n...and when we find and identify them, we deport them! That is the status quo!",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "its_a_gibibyte",
                                                                    "body": "OK, first I was genuinely asking and now I'm genuinely confused.  \n\n> Also, it was hard to assume that you were \"genuinely asking\" because you skipped right to punishment.\n\nNo, that was a different person who started the conversation about deportation. That's what I mentioned in my last comment too. That other guy wants deportation, and I'm still trying to figure out what you want instead. \n\nYour entire comment is about how deportation is too expensive. Yes, we all understand you are against deportation. Cool, let's move on, OK? What are you suggesting as a means to enforce immigration law?",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "othelloinc",
                                                                            "body": "> ...we all understand you are against deportation.\n\nI'm not!\n\nI never said I was!\n\n---------\n\n>What are you suggesting as a means to enforce immigration law?\n\nI'm all for e-verify and prosecuting employers.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "its_a_gibibyte",
                                                                                    "body": "Ah. I assumed you were against deportation because you said:\n\n> People who suggest that they should all be deported tend to be unserious people who never acknowledge the costs.\n\nBut I do see there's a difference between deporting many and deporting all.\n\n> I'm all for e-verify and prosecuting employers.\n\nThanks! This makes sense. Cheaper to implement, and reduces the core draw of immigration to begin with.",
                                                                                    "score": 3
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Honest_Report_8515",
            "body": "Absolutely not, if by “open borders” you mean zero enforcement.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "CaptainAwesome06",
                    "body": "That's what it seems like Republicans are talking about the way they seem to fear everything.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Honest_Report_8515",
                            "body": "People forget that a lot of invasive pests not native to the U.S. are stopped at borders, it’s not just people who are stopped and validated.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "cossiander",
            "body": "\"Open borders\" as in what the phrase actually means? No.\n\nI've had conservatives tell me that what \"open borders\" actually means is just *having* an immigration system, of any kind. Like if people can physically cross the border, legally or illegally, then it's an open border. If you run *that* definition, then most people, even a good chunk of a Republicans, are for open borders.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "CaptainAwesome06",
                    "body": "This particular person claims she is in favor of legal immigration, though that claim is suspect because she seems to do a lot of complaining about non-americans in general.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cossiander",
                            "body": "Maybe she means only immigrants from \"nice\" countries, \"like Denmark or Switzerland or Norway\".\n\nEdit: this is a reference to a Trump quote, in case that's unclear",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CaptainAwesome06",
                                    "body": "Maybe. She used to be a nice person but now she just sounds angry all the time. I started noticing it while hearing her rhetoric after 9/11.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cossiander",
                                            "body": "That sucks. It's terrible how sometimes it just feels like people are slipping away, lost in some semi-ideological media cave with no exit. I wish I knew what to do about it.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "00Oo0o0OooO0",
            "body": "I'm pretty moderate and support open borders, but I agree that's a pretty uncommon, even among \"extreme leftists\" (depending on you definition of extreme). Bernie Sanders famously dismissed open borders, calling it a \"Koch Brothers proposal.\"",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "fttzyv",
                    "body": "Can you define \"open borders\" as you are using it?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "00Oo0o0OooO0",
                            "body": "Unfettered movement of people and goods (though I could be convinced that's too tricky to pull off without international cooperation) in and out of the country.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fttzyv",
                                    "body": "And what counts as unfettered? Does that mean no checks of any kind at the border? Or are health/safety checks okay?\n\nLet's say you can import/export whatever otherwise legal goods you want without any kind of restriction/needing any kind of permit/paying any fees/etc. but there are still checks at the border to make sure you're not transporting contraband.  Would that be open borders?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "00Oo0o0OooO0",
                                            "body": "Yes, checks are ok, but subject to all the rights in the US Constitution. That is, you need probable cause to search a vehicle for contraband.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "fttzyv",
                                                    "body": "Meaning that you can't actually do border inspections or anything like that, right? \n\nThe 'border' would cease to be a meaningful zone, and the standard for stopping and searching someone there would be the same as if they were driving down a street in Oklahoma City?",
                                                    "score": 5
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "PRman",
                                    "body": "Do you not think it may be problematic if people were able to pass over our borders with no checks of any kind? People from anywhere in the world would be able to show up on our shores and live here. We don't have the resources to handle that kind of population increase nor the public resources to provide housing and basic needs to those people.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "akcheat",
                                            "body": "I mean that's the way it used to be. There are different considerations now, but the idea that we \"couldn't handle\" people coming in is just baseless; we've done it for our entire history.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PRman",
                                                    "body": "You don't seem to know your history. The United States has had immigration laws and quotas since the 1890s and the entirety of the 20th century. That time period is also matched with a population explosion that comes hand in hand with large increases of resources required. We most certainly have not had unregulated immigration our entire history, so your assertion is baseless.",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "akcheat",
                                                            "body": "Actually, I don't think **you** know your history. The southern border has been open for most of our history, and the quotas you were referring to were mostly just racist attempts to prevent specific people from coming in, not broad immigration restrictions. \n\nI'm also just really interested in this idea that we don't have the resources to take more people. We are not a densely populated country and are incredibly resource rich. You really think we can't handle more people?",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "PRman",
                                                                    "body": "There is a major difference between when we had open borders prior to the population explosion of the Industrial Revolution and after. Resources are not the same in those two scenarios. Yes, have the resources to handle more people, but we do not have the resources to handle an unlimited amount of people. That is the entire point of limiting how many people come into the country that you are just ignoring.",
                                                                    "score": -1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "akcheat",
                                                                            "body": ">Resources are not the same in those two scenarios.\n\nYou're right, we actually have **way more** resources now.\n\n> That is the entire point of limiting how many people come into the country that you are just ignoring.\n\nIt's not, the \"entire point\" is social engineering to keep people from \"undesirable\" countries coming in. If it were simply about limiting people, we wouldn't do it by country, we'd just give a number. \n\nAnd **again**, we do not have some resource issue that immigrants are exacerbating. I also don't see why open borders would lead to \"unlimited\" people coming here. That didn't happen before, I don't see why it would happen now.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "PRman",
                                                                                    "body": "And despite having more resources we still have power, water, and housing shortages. These things will be directly exacerbated by an increase in population no matter where that population comes from. A reason for some of this is because of misappropriation of resources or hoarding by the wealthy, but having open borders does not resolve those reasons as that would be a separate conversation. \n\nSocial engineering to keep people from undesirable countries is a part of it, yes, but sustainable numbers are the overall goal. Once having a goal number in mind, we then distribute that between countries around the world based upon multiple factors including productivity, current standing with the United States, active conflicts, and more. There are times when we will surpass our stated immigration numbers with the intent of receiving more refugees and that is something I am happy that we do. However, we are able to do so because we know we can take care of SOME extra people. \n\nYou cannot seriously be telling me that you do not understand that resources are not finite and having more people, regardless of the source, would lead to additional demand on already strained resources. Not only that, but you seem to insinuate that there has been no change in the demand to come to the United States pre and post 20th century. We were not viewed as the leaders of the free world and richest nation until after WWII so of course people want to move here more than they did when we had open borders, it was a completely different world.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "akcheat",
                                                                                            "body": "> You cannot seriously be telling me that you do not understand that resources are not finite and having more people, regardless of the source, would lead to additional demand on already strained resources. \n\nThe resources aren't \"strained,\" I don't agree with your premise. We may misallocate resources, but we have more than enough to take in more people. You also seem to have this condescending view of immigrants as **only** burdens on our resources; this ignores that immigrants work, build things, pay taxes, etc. They aren't exclusively a negative on our resources. \n\n> Not only that, but you seem to insinuate that there has been no change in the demand to come to the United States pre and post 20th century.\n\nI don't think there has been a significant change, no. Immigration to the US is fundamentally based on material conditions in the country of origin, not the US. I think your belief that everyone will try to move here immediately if the borders are opened is pretty egotistical and baseless. Most people don't view us as the \"leaders of the free world\" at this point in time.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "PRman",
                                                                                                    "body": ">The resources aren't \"strained,\" I don't agree with your premise.\n\nAnd I do not agree with yours, so where do we go from here?\n\n>We may misallocate resources, but we have more than enough to take in more people.\n\nI have already acknowledged this point, I guess you ignored that. \n\n>You also seem to have this condescending view of immigrants as only burdens on our resources; this ignores that immigrants work, build things, pay taxes, etc. They aren't exclusively a negative on our resources.\n\nI also said that an increase in population regardless of source would lead to a strain on resources, but you seem to have ignored that as well. \n\n>I don't think there has been a significant change, no.\n\nYou are simply delusional. To think that desire to immigrate to the United States has not changed from over a hundred years ago is absolutely absurd. You are disregarding social influences, economic influences, and technological influences that all would factor into increased demand to immigrate. \n\n>Immigration to the US is fundamentally based on material conditions in the country of origin, not the US.\n\nYeah, no shit that someone wanting to emigrate from their home country would be dependent upon the material conditions they had. Did you stop to consider the next step in this equation may be to decide where to go? Would they not be comparing nations to determine which nation may grant them the best outcomes which would be independent of the material conditions of their home country? Surely there is a difference between coming to the US compared to going to Canada or Mexico which is right next door including potential accesses to social services, wealth generation for your family, access to modern amenities, and more. \n\n> Most people don't view us as the \"leaders of the free world\" at this point in time.\n\nYOU may not, but plenty of people do. It is recognized that the United States has more wealth and geopolitical influence then any other country in the western hemisphere. This makes people from other countries very knowledgeable about the United States compared to other nations such as Denmark, Portugal, Singapore, Panama, or Canada despite those countries also being great places to live. We don't currently have open borders and we already receive more immigrants than any other country. If we open our borders, this number would obviously increase, I really don't understand how you don't acknowledge this will happen. Currently, 50 million people in the US were born in another country and immigrated here. The next closest is Germany at 16 million. We actually outnumber the next four countries combined in the number of immigrants we currently bring in and we are having housing crisis in places such as Texas and New York where they are being brought to. To insinuate that this would NOT get worse if we have open borders is simply absurd.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "akcheat",
                                                                                                            "body": "> And I do not agree with yours, so where do we go from here?\n\nWell my premise is based on the US having low population density and being one of the most resource rich countries in the world. I don't know what yours is based on. \n\n>I have already acknowledged this point, I guess you ignored that.\n\nYour mild acknowledgement is contradicted by your continued use of the silly \"resources\" argument. \n\n>I also said that an increase in population regardless of source would lead to a strain on resources, but you seem to have ignored that as well.\n\nThis doesn't actually address what I said there, maybe try again.\n\n>You are simply delusional. To think that desire to immigrate to the United States has not changed from over a hundred years ago is absolutely absurd. \n\nWell, you've given no support for this statement, so why would I just take your word for it? \n\n>Yeah, no shit that someone wanting to emigrate from their home country would be dependent upon the material conditions they had. Did you stop to consider the next step in this equation may be to decide where to go?\n\nThe point, that you are ignoring, is that people aren't just waiting in the wings to come to the U.S. if we opened the borders. They come either way, regardless of immigration law. Your angry little questions don't actually address that. \n\n>YOU may not, but plenty of people do.\n\nWell those people are wrong, but that's not really the point here. \n\n>To insinuate that this would NOT get worse if we have open borders is simply absurd.\n\nYou haven't provided any support for the idea this would happen. Shouting \"you're absurd\" at your screen isn't actually an argument.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "PRman",
                                                                                                                    "body": ">Well my premise is based on the US having low population density and being one of the most resource rich countries in the world. I don't know what yours is based on.\n\nHaving low population density for our size doesn't actually mean much since our population tends to revolve around metropolitan areas. We cannot just build communities in the middle of nowhere. Those resources are also not able to be distributed equally in our current system. Things such as social services are already bankrupting our nation despite our current excess in wealth. Medicare, Medicaid, and Social Security make up around 60% or more of our overall spending and is close to our gross income alone. My premise is based on the fact that resources such as these entitlement programs, electricity, gas, water, and housing are limited and costly. We are able to manage right now because we are keeping our population stable through limited immigration. These resources will be further strained by an increase in population in general and thus my assertion is that open borders will lead to greater numbers of immigrants which will increase our resource burden. This should have been obvious, but you are not actually responding in good faith, so whatever. \n\n>Your mild acknowledgement is contradicted by your continued use of the silly \"resources\" argument.\n\nI am sorry that you don't find utilities and housing as important to consider, but most people do. You are glossing over a very important aspect of how many people we would be able to take care of given our current systems. You can advocate for a completely different way of allocating resources in our country, that is fine, but that is not the conversation we have been having. We were discussing what would happen if we had open borders.\n\n>This doesn't actually address what I said there, maybe try again.\n\nGod I hate this kind of condescending response. If you don't think I addressed the point that point out why. Such low effort. \n\n>Well, you've given no support for this statement, so why would I just take your word for it?\n\nI would expect the support for the statement to be obvious for anyone who may have studied history, but I guess you didn't. \n\nThe first huge upticks in immigration that we saw was during the 1880s and 90s due to the Industrial Revolution and our need for greater numbers of laborers both to work in the newly developed factories as well as to help build the railroads that crossed the country. As we got into the 20th century, immigration was heavily curtailed in part because of racist ideologies specifically targeting Asia, South America, Africa, and parts of southern Europe along with economic and political ideals of isolationism that we held prior to the world wars. After WWII, the United States became the dominant power of the western hemisphere and slowly began to grow its amount of immigrants over time. This was in part due to our ability to house them thanks to our increased economic standing after the war as well as our change in foreign policy to be more accepting for both moral reasons as well as political in order to combat the spread of communism with the Soviet Union. Many of these immigrants were coming from western Europe as they were our main allies at the time. \n\nAs we get closer to the 1980s and 1990s, we grew our relations with South America in part, again, to combat the spread of communism as well as an effort to increase domestic profits through foreign production thanks to NAFTA and other trade agreements in the 90s. Since then there has been continued increases to immigration as we have continued to source cheap labor from South America in order to keep domestic production high and costs low. People continue to come to the United States with work and education being the two biggest reasons for them to do so. We turn millions of people away every year because we already let in numbers that we are able to handle. In fact, the number one cause of illegal immigration is actually legal visa holders overstaying their work or education visas and remaining in the United States anyway. These numbers would be increased by the millions of people that we would otherwise turn away that already come and this does not include the increase of people who would come if they knew there were no barriers whatsoever. \n\nThat is the historical support for my statements. Feel free to do your own research on the topic as well. \n\n>The point, that you are ignoring, is that people aren't just waiting in the wings to come to the U.S. if we opened the borders. They come either way, regardless of immigration law. Your angry little questions don't actually address that.\n\nThere are, again, millions who are turned away at the border that would otherwise be let in under open borders. I also do not believe your assertion that there aren't people waiting in other countries to emigrate to the United States since there are millions currently waiting for permission to legally come to this country. I guess those people aren't actually waiting? Or do you view them as stupid for just not coming over like other people do to be turned away? Sorry, I shouldn't ask questions you aren't going to answer. \n\n>Shouting \"you're absurd\" at your screen isn't actually an argument.\n\nCorrect. That statement was not part of my argument. I simply found your ignorance absurd.",
                                                                                                                    "score": 0,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "akcheat",
                                                                                                                            "body": "> This should have been obvious, but you are not actually responding in good faith, so whatever.\n\nWell, I don't accept your premise that our social spending is unsustainable, and your analysis seems to completely disregard that more people is equal to more tax money, productivity, resources, etc. \n\nI also don't see any evidence for your belief that these are only currently sustainable through limiting immigration. If anything, we need immigration to make up for the lack of children we are having (another thing you don't acknowledge).\n\n>I am sorry that you don't find utilities and housing as important to consider, but most people do. \n\nOh, where did I say that? I just don't see immigrants as a drain on these resources, and you haven't supported the idea that they are.\n\n>God I hate this kind of condescending response. If you don't think I addressed the point that point out why.\n\nYou're right, you've been so reasonable. Anyways, I was pointing out that your response didn't reckon with or acknowledge the positive impact immigrants have on our system.\n\n>That is the historical support for my statements. Feel free to do your own research on the topic as well.\n\nAll you've done is demonstrated that my position is the correct one. Immigration ebbs and flows over time. You've never supported the argument that immigration would linearly increase if we opened the borders, and your poor, rudimentary reading of history doesn't do that either. \n\n>There are, again, millions who are turned away at the border that would otherwise be let in under open borders.\n\nOh no! How will a country of our size ever handle a few million people? \n\n>Sorry, I shouldn't ask questions you aren't going to answer.\n\nYou should try asking good questions, that would be a start. That there are some people who are waiting to come to the US is not evidence that there is an unsustainable number who want to come, or that this number would linearly increase forever. You have taken a simple statement \"some people are waiting to immigrate to the US,\" and extrapolated that to mean what you want it to mean. Hopefully you can put together how foolish that is. \n\n>Correct. That statement was not part of my argument. I simply found your ignorance absurd.\n\nRight back at ya bud.",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "00Oo0o0OooO0",
                                            "body": "If that's true, people would be free to move somewhere else where there are more resources, including back to their home country if that's where they can beat thrive.\n\nAn irony of making it so difficult to get here is that it incentives people to *stay* here, who would otherwise only want to visit for a few weeks for a temporary job.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PRman",
                                                    "body": "This could work well if we had a globalized government, but we don't. The world does not function like the EU where resources can just be easily traded and swapped between borders. That would be awesome, but that is not reality. Even with limited resources the Unites States would still draw people, even if it is just for chasing the myth of the American Dream. Resources would be drained from us just for people to eventually move elsewhere and take resources with them. You may not care about the longevity of singular nations, but a lot of people depend on that.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CincyAnarchy",
                                                            "body": "I'm not even a pure open borders fan, but I am confused as to what you mean.  The world does trade resources pretty freely, at least more freely than people can move.  And the EU shares some institutions and reciprocal agreements, but they're not the be-all-end-all.\n\nIf you could clarify, what do you mean by this?\n\n> Even with limited resources the Unites States would still draw people, even if it is just for chasing the myth of the American Dream. Resources would be drained from us just for people to eventually move elsewhere and take resources with them.\n\nWhat resources are you speaking to and how would they be drained?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "PRman",
                                                                    "body": "Land and utilities mostly. Food we have in great supplies, but shipping it may become a factor depending on where people decide to settle down within the country. There are already states that have power grid, housing, and water issues. These would be exacerbated with increased populations that have no limits. All resources are finite and we have to adjust costs and access when we have more demand. The increased demand that would come with unregulated immigration would not be sustainable.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "00Oo0o0OooO0",
                                                                            "body": "Some people are net positives on resources,, right? In a functional, growing economy like ours, is not the average person is a net positive on resources? A farmer creates more food resources than they consume. A power plant worker creates more energy than they use. I don't see why we should assume the average immigrant is a resource sink when the average American is a resource source.",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "PRman",
                                                                                    "body": "Yes, we do grow our available resources over time. The difference I was trying to point out was that we are currently doing so through limited immigration. If we were to allow unfettered immigration through open borders, the demand would outpace the supply that we currently have as it would be beyond what we have planned for. I am perfectly fine with immigration, we just can't have completely open borders because there would be no way to account for limitless population increases. \n\nThis is not to say that the entire world would be able to move here, but we wouldn't be able to tell people \"no\" which is the same issue that we have run into with entitlement programs. Social Security is fantastic, but we cannot tell people \"no\" if they qualify which has lead to a bit of an issue where more people are taking out of SS then putting into it. This is the same thing that would happen with unfettered immigration.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "akcheat",
                                                                                            "body": "> I am perfectly fine with immigration, we just can't have completely open borders because there would be no way to account for limitless population increases.\n\nWhy do you think this would happen? You've never provided any support for it.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "PRman",
                                                                                                    "body": "I am curious as to why you believe it wouldn't? If we have open borders then anyone could come into our country, or at the very least that is the version of open borders that I am speaking out against. If people are able to come over with no limitation then the millions of people that we currently turn away at the border plus the millions that are left in their home countries waiting for permission to enter legally would all be able to come over. This is not including the untold number of people who currently want to come to the United States but chose not to come because they knew they would be turned away, were denied visas, or otherwise did not view it as a viable possibility. I see no reason why opening the borders would NOT lead to potentially limitless population increases.\n\nHowever, that is based on current and past immigration numbers, I don't claim to be able to read the future. I would use other countries as examples, but I am not aware of any other country in the world that has open borders as a general policy so I did not have anything to compare it to.",
                                                                                                    "score": 0,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "akcheat",
                                                                                                            "body": "> I see no reason why opening the borders would NOT lead to potentially limitless population increases.\n\nThat's because your fear is more important to you than rational or logical thinking.",
                                                                                                            "score": 0
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "00Oo0o0OooO0",
                                                                                            "body": "> If we were to allow unfettered immigration through open borders, the demand would outpace the supply that we currently have as it would be beyond what we have planned for. I am perfectly fine with immigration, we just can't have completely open borders because there would be no way to account for limitless population increases.\n\nSo, to be clear, you *do* think immigrants are resource sinks, on average, at least initially? And we have to control the amount of immigration we allow so that Americans can catch up in making up for the difference.\n\nI have to assume this opinion is at least somewhat colored by our current system where it's illegal for many immigrants to work. Of course *those* immigrants are less likely to bring economic growth.\n\nBut, I think people are rational. I don't see why we should worry about immigrants the US and drinking all the water any more than we worry about people from Mississippi flooding California in search for a better life. \n\nOrganic growth with organic movement tends to find equilibrium. It's kind of exactly how life has thrived for millennia. I think it'd be a much more efficient system than the arbitrary quotas set by bureaucrats we have today.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "csasker",
                    "body": "A very common slogan for leftists is no border no nation stop deportation so....",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Hosj_Karp",
                    "body": "I dont think Sanders has thought seriously about it, or else he has and is just hoping no one will press him on it.\n\nHis position seems to just be the inherited union-type immigration opposition on the basis that it depresses domestic wages",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "00Oo0o0OooO0",
                            "body": "He and Trump have pretty much identical populist \"America first\" ideas on world trade-type issues and [they're](https://thehill.com/blogs/floor-action/senate/315655-sanders-ill-work-with-trump-on-trade/) both happy to [admit](https://thehill.com/blogs/ballot-box/presidential-races/268545-trump-i-very-much-agree-with-sanders-on-trade/) it.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "othelloinc",
                    "body": "> I'm pretty moderate and support open borders...\n\nDo you actually support open borders? \n\nShould we allow into the country an Al Qaeda member, without any in-demand job skills, and with tuberculosis?",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "00Oo0o0OooO0",
                            "body": "I wouldn't be opposed to checkpoints at airports to apprehend criminals in transit when appropriate.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fastolfe00",
                                    "body": "So, you mean to say that we need to have controlled points of entry (checkpoints), and stop everyone and ask to see their ID? What happens if someone doesn't have an ID?\n\nWhat do you mean by apprehending criminals? Do you just mean people wanted for crimes, or somebody that once committed a crime?\n\nIf someone has a cell phone full of contacts of a bunch of known or even wanted terrorists, and when you ask them why they're coming in (should we even ask?), they mumble something like \"you'll see\", should we let them in?\n\nIf someone crosses outside of a controlled point of entry, should we be okay with them getting in?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "00Oo0o0OooO0",
                                            "body": "> So, you mean to say that we need to have controlled points of entry (checkpoints), and stop everyone and ask to see their ID? What happens if someone doesn't have an ID?\n\nI don't think we *need* to have these; I said I wouldn't *oppose* them. It would be a police checkpoint, not like a current bill-of-rights-doesn't-apply immigration checkpoint. If there's plausible cause to detain someone, they can do it, otherwise welcome to the United States. \n\n> What do you mean by apprehending criminals? Do you just mean people wanted for crimes, or somebody that once committed a crime?\n\nPeople wanted for crimes. We shouldn't exclude people who have served their time \n\n> If someone has a cell phone full of contacts of a bunch of known or even wanted terrorists, and when you ask them why they're coming in, they mumble something like \"you'll see\", should we let them in?\n\nThat sounds like plausible cause to me. But this situation does depend on the suspected terrorist volunteering their phone or a warrant for it having been issued. \n\n> If someone crosses outside of a controlled point of entry, should we be okay with them getting in?\n\nAssuming they have broken any other aviation or maritime laws, no. People should be and to walk back and forth to and from Canada as much as they want.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "EtherCJ",
                                                    "body": "It's \"probable cause\" btw.  And like you said, you can't search their phone so all you have is the \"you'll see\" mumble.  Then presumably they will get a public defender who will get them out of jail?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "00Oo0o0OooO0",
                                                            "body": "Thanks, I was ready to blame autocorrect, but notice I made the mistake twice. My head must just not be in the right place. But, yes, if there's no evidence someone is a terrorist they shouldn't be detained as one.",
                                                            "score": 2
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "fastolfe00",
                                                    "body": "So with this model unless we had a probable cause to stop someone, we should let them in? How long do you think that will last before the first terrorist attack? Is that an acceptable price to pay for openness?\n\nWhat about bringing *things* in? Will you want to stop and search bags or boxes? Or would that need probable cause for a search? If we should let people have their privacy, how long do you think before a weapon of mass destruction is brought in and used?",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "00Oo0o0OooO0",
                                                            "body": "> So with this model unless we had a probable cause to stop someone, we should let them in? How long do you think that will last before the first terrorist attack? Is that an acceptable price to pay for openness?\n\nI'm sure a border wall around DC might make the Capitol safer from domestic terrorists. But, yeah, we've decided openness outweighs the occasional Jan 6. I don't think it's productive assuming foreigners are terrorists without evidence.\n\n> If we should let people have their privacy, how long do you think before a weapon of mass destruction is brought in and used?\n\nHow many weapons of mass destruction *have* been caught at the border?",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "fastolfe00",
                                                                    "body": ">I'm sure a border wall around DC might make the Capitol safer from domestic terrorists.\n\nCool, but what about schools, or, you know, the occasional music festival?\n\n>How many weapons of mass destruction *have* been caught at the border?\n\nSo if this number is zero, we don't need to worry about anyone trying once we announce we're not looking anymore? You don't think North Korea or Iran would just find a spot in Mexico or Central America to bring a nuke ashore, truck it on into the US, and use it?\n\nSorry this strategy just seems obviously suicidal.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "00Oo0o0OooO0",
                                                                            "body": "> Cool, but what about schools, or, you know, the occasional music festival?\n\nI'm not sure what point you're making. Mass shootings are a good example that immigration controls are not some sort of failsafe against terrorist attacks (not that you claim them to be, of course). It's a problem that needs to be addressed with good policework regardless of where the terrorists are born.\n\n> You don't think North Korea or Iran would just find a spot in Mexico or Central America to bring a nuke ashore, truck it on into the US, and use it?\n\nIf they were set on doing that, I really don't think it's ICE that's currently keeping Iran at bay. If Mexican cartels can smuggle thousands of tons of contraband into the US, I'm pretty sure a much more resourced (though depressively not *too* much more) nation state can manage to sneak a dirty bomb in a backpack past.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "fastolfe00",
                                                                                    "body": ">Mass shootings are a good example that immigration controls are not some sort of failsafe against terrorist attacks\n\nMass shootings happen, therefore there's no point trying to keep out people who want to mass murder? That's your argument?\n\n>It's a problem that needs to be addressed with good policework regardless of where the terrorists are born.\n\nCan you give me an example of policework that you think will prevent or eliminate acts of terror once we open the borders to anyone that wants to enter bringing anything they want to bring? Like what do you think the police can do here that they aren't doing today?\n\n>I really don't think it's ICE that's currently keeping them at bay.\n\nOf course not.  But primarily because ICE is not responsible for border security today. I'm getting the impression you have no idea what you're talking about.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "00Oo0o0OooO0",
                                                                                            "body": "> Mass shootings happen, therefore there's no point trying to keep out people who want to mass murder? That's your argument?\n\nNo. If you have reason to believe someone is planning a terrorist attack, by all means arrest them. I just don't think the presumption of not being a terrorist and freedom of movement should only befall on people born in the US, for some reason.\n\n> Can you give me an example of policy work that you think will eliminate acts of terror once we open the borders to anyone that wants to enter bringing anything they want to bring?\n\nNo, I obviously don't have the solution to terrorism any more than you do. But terrorism is obviously something that [*can*](https://en.wikipedia.org/wiki/List_of_unsuccessful_terrorist_plots_in_the_United_States_post-9/11) be thwarted, even when the perpetrators are inside the country, with constitutional rights.\n\nTerrorism should be viewed as actual specific plans to be detected and prevented. Not a vague excuse to keep innocent people out of the country.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lcl1qp1",
                    "body": "So you'd get rid of the visa system, airport security, and border patrol?",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "00Oo0o0OooO0",
                            "body": "Get rid of visas and immigration control. Keep airport security. Customs might be a necessary evil with the current state of world trade.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lcl1qp1",
                                    "body": "I'm not sure I see any reason to relinquish control over immigration.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">Do you or any liberals you know support open borders? \n\nNo. \n\nWe believe in letting some people in, and not other people, just like everybody else.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "EngelSterben",
                    "body": "Who is we?",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> Who is we?\n\nThe vast majority of liberals.",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "Yes, of course I know people who support fully open borders with no screening or restriction whatsoever. I think it would be silly to pretend no one takes this position. I also know people who literally think we should build a 50-foot-tall barrier on every inch of the Southern border and position sharpshooters on top who take out anyone who comes within 100 yards.\n\nThis is the problem with talking about every person’s opinion as if it’s a serious policy proposal. You and your friend need to stop worrying about what dumbass ideas random people spout and instead look at what serious actions the government is considering taking.\n\nEdit: As a sidenote to your friend, I do actually keep my door open lots of times. Helps air to circulate so the house feels cool and comfortable. Never once in decades has anything bad happened as a result.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": "In theory? Yes, that's a lovely goal that we should work toward. \n\n\nIn practice? No.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PepinoPicante",
            "body": "Usually when bad-faith conservatives and conspiracy nutjobs talk about \"open borders,\" they have this idea that it is like a door. It can be open, so anyone could walk through it, or closed, where no one could walk through it. \n\nAnything short of building the Great Wall of China on our Southern Border is \"open borders\" to these people. Every time Fox News shows a video of some migrants in a desert, they say \"look at Biden's open border!\"\n\nSo, unless we support this sort of approach where we pretend the border is a Mad Max-style warzone and needs to be turned into a DMZ, we're apparently for open borders.\n\nAnd remember... when Republicans controlled Congress and the Presidency... *they chose not to do this.*\n\n---\n\nI guess I would just ask what [we are supposed to be celebrating](https://nationaltoday.com/may-25-holidays/) on May 25?\n\nInternational Skin Pigmentation Day?\n\nNational Bath Bomb Day?\n\nWorld Thyroid Day?\n\n*It's a Saturday, Karen.*",
            "score": 3
        },
        {
            "depth": 0,
            "author": "wedgebert",
            "body": "Unfortunately, I feel like this question is starting have to two different answers based on Republican actions.\n\nWhen comes to things our border with Mexico, then no. Immigration policy is important, but we should also properly fund it so that even if a \"migrant caravan\" shows up, we can properly handle it instead of being overwhelmed.\n\nBut the new second answer is, yes I do support open borders **between states**. The GOP keeps trying pass more and more laws restricting travel, primarily for pregnant women. And that's just not acceptable (or even constitutional)",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "loufalnicek",
                    "body": "We do have open borders between states.\n\nIt's a bit of a mischaracterization to say that GOP wants to prevent travel What they want is to have there be consequences for a state resident getting an abortion even if she doesn't get it in that state. It's the abortion part that's illegal, not the traveling.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "wedgebert",
                            "body": "Not allowing women to leave their state, or punishing them for doing legal things in other states is akin to closing the border for them and opens the door to adding more \"you did something legal elsewhere we don't approve of, so we're going to punish you\" laws.\n\nSure, it's not an exact 1-to-1 comparison to the southern border, but you had to know I was using it as a comparison",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "loufalnicek",
                                    "body": "> Not allowing women to leave their state\n\nIt's just that this is not happening, I think it's important not to blur the truth here.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "wedgebert",
                                            "body": "They're not physically restricting pregnant women from travelling, but   the various slate of laws they're proposing would put intense focus on any woman who left the state for any reason while pregnant.\n\nYou can restrict something without making it illegal by making it such a burden that most people are disinclined from doing it.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "loufalnicek",
                                                    "body": "You're performing gymnastics now.\n\nI'm not defending these laws, by any stretch. But let's be honest about what they are and are not doing. They're problematic enough as is without having to make up new reasons they're bad.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lemongrenade",
            "body": "I mean I believe in processing applications quickly and letting in most people that just want to come here and work and can document they don’t have significant criminal record in their home country. Right wing dummies call this open borders but that’s just because they hate brown people more than they love the economy.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "froggerslogger",
            "body": "I’d say that, conceptually, conceits like the Social Contract whereby you as a citizen agree to give up some freedoms for a certain kind of ordered society only make sense to me if you have some ability to choose between societies/systems. So, in theory, I believe that people should be able to immigrate to a country that reflects their values and ideals. \n\nHowever, I also think that one of the foremost responsibilities of a government is public safety. Because of that, I think governments should take reasonable precautions to exclude people from entry who would be a threat to public safety.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "chadtr5",
            "body": "Open borders is mostly a libertarian position, and usually doesn't mean something quite as extreme as leaving the door open.  Proponents of open borders still tend to support criminal background checks, health screening, etc. for potential immigrants.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Square-Dragonfruit76",
            "body": "First of all, my neighbor actually does leave her front door open a lot and we live in a normal suburb.\n\nThat aside, it depends what you mean by open borders. I wouldn't necessarily be opposed to giving green cards out to anyone who applies for them, as long as they pass a proper screening. However, we couldn't literally have the borders open because we need to be able to regulate commerce, and also try to prevent illegal activity.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Cleverdawny1",
            "body": "Nope.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "If we could establish a system to register, vet, and give an ID to everyone crossing the boarder. I support that.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DBDude",
            "body": "What do you mean by open borders? I believe it should be fairly quick and easy for anyone who wants to work here to do so, and continue to do so with work visa extensions (in work and no serious legal trouble,  you get an extension) while seeking citizenship within several years. However, having set up such an open system, we should have quick deportation for violators since they are then here in bad faith.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "fingerpaintx",
            "body": "Nope.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "WallabyBubbly",
            "body": "Nope. Metaphorically, I'd like to see a high wall with wide gates: robust border security to turn away undesirables, while good people are generally welcomed with open arms. We should also do a better job of screening prospective immigrants for their support of first amendment freedoms. For example, really grill someone on whether they fully support freedom of religion, and if they don't, then turn them away. We have enough aspiring theocrats at home that we don't need to be importing more.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "kavihasya",
            "body": "I would like to note that the free/trade capitalist position on immigration would have to be few to no restrictions on the free movement of labor to where wages are highest. \n\nIf you believe in protectionist immigration policy, then a part of you already knows that capitalism doesn’t solve every problem or always promote the best welfare for every actor within the system. \n\nAnd that thoughtful regulation has to be in place in order to reduce negative impacts.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "lcl1qp1",
            "body": "No.  Every liberal I've spoken with knows that America does not and will most likely never have something as bizarre as \"open borders.\"",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bubli87",
            "body": "I mean, I think land boarders and land ownership is a terrible concept philosophically, but I’m not going to argue that when it comes to policy. I just don’t see why we “deserve” to be on this land anymore than anyone else.\n\nIn reality, I think immigration should be loosened as more immigrants mean more people in the workforce and therefore higher GDP. I think it should be screened on workforce (bring in workers that we are short of in our economy) and not on family ties.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "zeratul98",
            "body": "Broadly speaking, yes, I support open borders. \n\nThere's probably some nuance to how we should implement them, but I've yet to hear any arguments that make me think it's a straight up bad idea, and I've seen some really compelling arguments in favor. I'd highly recommend Open Borders by Ben Caplan and Zach Weinersmith.\n\nThe two main arguments against are generally security, which seems like a silly and weak argument that falls apart immediately, or just a vague \"because\", which is much the same.\n\nThe analogy to leaving your front door open is a disingenuous one to say the least.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SlitScan",
            "body": "I do.\n\nask someone from England how theyre enjoying Brexit for the explanation from the opposite point of view.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "fttzyv",
            "body": "I think there's a terminology issue here.\n\nI've seen open borders used to mean everything from \"literally zero border checks of any kind\" (i.e., crossing an international border into the US is no different than crossing from one city to another within the US) to \"there's no limit on how many people can enter the country in a given year, but the process for doing so otherwise looks about like it does now.\"  And, as with anything, some people don't even mean that and just use \"open borders\" sort of metaphorically to mean \"looser immigration restrictions.\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "EngelSterben",
            "body": "Yes I support open borders.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mr_Quackums",
                    "body": "what do you mean by \"open borders\"?  Different people mean different things when they use that term.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EngelSterben",
                            "body": "So I would prefer people to move between countries with as little hassle or red tape as possible. No limits on visas, education level doesn't matter. I like the free flow of people between counties.\n\nNow, that doesn't mean there are check points, but these should be efficient and getting people between countries as quickly as possible as they wish.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BiryaniEater10",
            "body": "I think we can have both open and closed borders. In terms of temporary work, we should allow a large number of people to come and work here short and long term, but, that should be with the understanding that they return home after their work is over.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Serventdraco",
            "body": "\"Open borders\" is a liberal position, not a leftist one. For example, Bernie Sanders is against loosening border restrictions for protectionist reasons.\n\nI support a border policy akin to the one we had at Ellis Island. Anyone can come in so long as they pass a cursory medical and background check. Basically, there are no novel downsides to more immigration, so why even bother restricting it?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "madmoneymcgee",
            "body": "This is about the same as wall discourse where people think they're being clever by pointing out that the White House has a fence or something but people think a border wall is a bad idea.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "53rp3n7",
            "body": "I support open borders. It would be incredible for the economy and we are short on millions of laborers.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Oceanbreeze871",
            "body": "Why are should anyone entertain the insanity of Qanon conspiracy theorist dudes?\n\nYou’re validating their crazy by treating it as a question worth asking",
            "score": 1
        },
        {
            "depth": 0,
            "author": "link3945",
            "body": "I do, more or less.  \n\nCurrently, we have the presumption that you do not have the right to cross the US border into the US and work/rent a place/form contracts or whatever.  As someone who thinks that the freedom of movement is a basic human right, I think that's completely backwards.  We should presume that you have the right to cross into the US, and require some of due process and compelling reason to deny entry.  That due process can be a background check, border inspection, interview, whatever we need.  I'll even admit that there are compelling state reasons to restrict travel: cartels, smuggling, terrorism, cases of pandemics, etc;.  I just don't think \"we hit a random quota and can't let anyone else in\" is a compelling reason to deny someone a fundamental human right.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Complaintsdept123",
            "body": "They do when they say things like \"they just want to have a better life for themselves and their families\" and \"they do jobs we won't do\" and if they counter any border policy with the statement that it is racist. Anyone with these attitudes de facto supports open borders.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bluegargoyle",
            "body": "\"Open Borders\" is a meaningless and undefined term generally only used by extreme conservatives to attack anyone to the left of \"absolutely no brown people allowed in.\"  That being said, if your family friend is genuinely Q-anon, dump them.  I'm not kidding, remove this person from your life.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "deepseacryer99",
            "body": "I don't actually have much of an opinion given I would argue that the immigration problems that many complain about are the result of their own voting patterns. \n\n\nThey are often vehemently anti-union and constitently want cheaper and cheaper goods while keeping production in the country. This is the result of that.  Not like there are a bunch Okies to replace them like Cali tried to do during the Dust Bowl, either.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Smallios",
            "body": "No. That’s actually a thing outside a few randos",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HazelGhost",
            "body": ">Do you or any liberals you know support open borders?\n\nI do, but I also recognize that it's a minority position among liberals.\n\n>\"people who support an open border should celebrate on May 25 by leaving their front door open.\"\n\nThe metaphor comparing open borders to opening your house to everybody is the dumb comparison that won't die. I could write a short book on why this metaphor is a bad one, but to sum it up briefly, there's an obvious key difference between a public space and private property. Almost everybody agrees with the principle of open \\*state\\* borders for citizens... that doesn't mean they agree that every citizen should have access to their private property.\n\nAnd, as Bryan Caplan pointed out, if you believe that the entire nation is collectively owned, as property, by the citizenry... you are a communist.\n\n>I also asked her to name one politician in Congress that is lobbying for open borders.\n\nI support and advocate for open borders, but even I'm aware that not a single Democratic politician supports it. It may be the post policy position, but it's not a very useful one to politicians.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "washtucna",
            "body": "I have one friend who doesn't believe in borders, but he's also a tough on crime, shrink the welfare state centrist type.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "not_a_flying_toy_",
            "body": "I support what the right wing calls \"open borders\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "almightywhacko",
            "body": "I know a lot of people who support immigration reform, as in, making it actually possible for the average person to immigrate legally. I also know people who think that rounding up illegal residents who aren't actively engaged in criminal activity should be a fairly low government priority. I know people who support DACA and programs like DACA that provide a path to citizenship for people who arrived here illegally at a young age. \n\nHowever I don't know anyone at all who actually supports \"open borders.\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mr_miggs",
            "body": "Not me.  I think that we should:\n\n- increase the ability for people who want to work or seek asylum to come here legally\n\n- Increase funding so that we are better equipped to actually handle asylum seekers\n\n- beef up border security where it makes sense (yes this may include a wall in some places) \n\n- make dreamers citizens\n\n- deport people who commit crimes while here, whether or not they are documented",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Connect_Surprise3137",
            "body": "As in no vetting of any kind? No way, though I could point you toward a person or two who might agree to that. My position is just that we should check ourselves on what level of issue it might be. Misdemeanor that is addressed with a (significant) fine?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kerplonk",
            "body": "It's few enough people that this should be considered a straw man argument.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "Can’t think of anyone ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "qchisq",
            "body": "Yes. I think that all democracies should be a part of a Schengen-like setup",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rogun64",
            "body": "20 years ago, there were a lot of liberals online who supported open borders. I don't have any figures, and I don't know how it might have changed, but I notice less today. \n\nThere were also others like me, who disagreed with open borders. It was probably the issue that split us most back then.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Gordon_Goosegonorth",
            "body": "Open borders for animals, absolutely. I don't really care about the affairs of primates, they are silly and tribal and unwise. But the javelinas and the ocelots and the jackrabbits need to come and go.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "decatur8r",
            "body": "no",
            "score": 1
        },
        {
            "depth": 0,
            "author": "notonrexmanningday",
            "body": "I would love it if we could get to a place where north America operates like the Euro zone, and we sorta used to before 9/11. Seems like we're a long way from that now though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Thorainger",
            "body": "Nope.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TonyWrocks",
            "body": "\"Open Borders\" is just right-wing nutty talking points.\n\nTell these guys who wait three and four hours to get into San Diego from Tijuana that we have Open Borders and they'll laugh at you.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "IrrationalPanda55782",
            "body": "Theoretically I support open borders, but not in practice in today’s world.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WildFlemima",
            "body": "I support open borders actually. I also think that almost every country in the world is way too big. I think countries should be small enough that if you don't like yours, a couple days of walking will get you to the next country. This is completely unfeasible, and doesn't really bear on how I vote because it is too out there, but it's what I think.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RockinRobin-69",
            "body": "No",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Call_Me_Clark",
            "body": "Depends what we mean by open. \n\nShould, in general, people be free to come to America and seek a better life so long as they meet a low bar of reasonable and transparent requirements? \n\nYes. \n\nShould immigration in general be decoupled from antiquated racial theories, the products of corruption, etc? \n\nYes. \n\nWhat’s missing?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LucidLeviathan",
            "body": "I don't necessarily *oppose* it. I have yet to hear a really good argument *against* it. It's not a strong position that I hold.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "whozwat",
            "body": "As a person with a global outlook and a Buddhist perspective, I believe in the idea that we are all citizens of the world, and ideally, there should be no barriers preventing people from seeking a better life. The concept of open borders aligns with the fundamental belief in compassion and the interconnectedness of all human beings.\n\nHowever, I also recognize the practical need for security and the importance of managing immigration in a way that fosters harmony and integration. In today's world, it is crucial to balance our aspirations for a borderless world with the reality that communities need time to adapt and integrate new members without triggering resentment or hostility. Properly managed immigration can help ensure that both newcomers and existing communities can thrive together, building mutual respect and understanding over time.  I believe it is essential to approach this goal with careful consideration of security and social cohesion, allowing humanity to move towards a future where such barriers are no longer necessary.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "JRiceCurious",
            "body": "It's important to remember that some people (pauses to make air-quotes and mouth the words again: \"some people\") are ... facile.   \n  \nIn this case, for example, your QAnon-tainted friend isn't going to split hairs when it comes to defining \"supporting open borders.\" To her, it's likely that anyone who doesn't support building a physical wall on the border \"supports open borders.\"  So, yeah: by that definition, I'd go so far as to say \\*nearly all liberals\\* fit into that definition.\n\nCommunication is hard.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WesterosiAssassin",
            "body": "I'd be in favor of what might be considered an 'open border' policy (i.e. anyone is allowed in provided they pass a background check to make sure they're not a criminal) in theory, but only after we solve the housing crisis and do a much better job of protecting workers' rights so that employers can't keep using immigration as a means to keep wages low.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hosj_Karp",
            "body": "If it \"open borders\" you mean literally no security whatsoever and everyone in, including objectively bad actors, no.\n\nIf by \"open borders\" you mean \"fund the border and immigration adequately to screen and assess every person in a timely fashion who wants to enter with no arbitrary upper limit and with a clear path to citizenship and only refuse entry/deport people like criminals, suspected spies/terror sympathizers, political extremists, infectious disease carriers, etc, then yes\"",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MateoCafe",
            "body": "I doubt she actually knows \"several\" people on the left side of the US political spectrum.\n\nI haven't met a single person in favor of what is called open borders. I have however met several people who want to fix our broken fucking immigration system and make it easy for qualified \"i.e. no history of violence or criminality\" into the country.\n\nIts almost like she was fearmongered into her position and its almost like America is a country of immigrants but people with similar outlooks to her wont recognize either point.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Emergency-Ad2144",
            "body": "I have met people that do but they are extreme leftists and it's definitely not the norm at least not in the sense that fox news would define open borders",
            "score": 1
        },
        {
            "depth": 0,
            "author": "insalted42",
            "body": "I agree with most people here that most Liberals don't support an open turn style immigration.\n\nIt's sad that the debate has basically become \"Should we have a border or not?\" \n\nWhat I will say is that I know a lot of \"casual liberals\". Or people that have always been on the left bit don't think too much about actual policy. They're starting to fall for this Republican talking point so I have met some people that literally don't support border policies at all. But I stand by the fact that any well read leftists would not be on board with this.\n\nOur immigration system has needed a major rework for decades now. I just hope the Democrats can find a way to better articulate their goals.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "-Quothe-",
            "body": "I do. Why not?  We have the tech to protect ourselves from trouble. The real problem for closed-border folks is too many brown people. I don’t mind immigrants looking for a better life. Bring em.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CaptainAwesome06",
                    "body": "With no restrictions or checks on who is coming in?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "-Quothe-",
                            "body": "As i said, we have the tech to protect ourselves from trouble, which i thought obviously applies to troublemakers.  Who do you think needs restricting?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CaptainAwesome06",
                                    "body": "Drug cartels? It seems like we should restrict them. Why should we protect ourselves from drug cartels in the country when we can stop them at the border?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "-Quothe-",
                                            "body": "So… troublemakers, which i already addressed, yeah?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CaptainAwesome06",
                                                    "body": "Ok so if you aren't letting them in, it's not an open border.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Threash78",
            "body": "I support letting in tens of millions of young carefully vetted people, maybe more. First we need to do something about housing, prices are too insane to just throw a shit ton more people into the mix. We NEED more people. People need to understand boomers were the largest generation in the history of mankind, and every single generation below them has shrunk. We have too many old people and not enough young people. This is a real problem.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sepulchura",
            "body": "No, to me that's always seemed like some moron shit conservatives make up that doesn't exist.  Every liberal I know just wants the application process to be reformed and not take 10 years, that's ridiculous.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dutch_connection_uk",
            "body": "In the sense that there should be a legal path to citizenship that is open by default to everyone and for which you must specifically have done something wrong to deny it (like being a member of a hostile group, being a part of tyranny, or being a criminal), I am for open borders.\n\nI find the game with the far right is that usually they will claim something else by open borders, but they're against this kind of open borders, too, in fact their position might be so extreme that they want to expel naturalized citizens. If they say it outright though, they alienate too many people, so they need to pin their opposition to some extremely unreasonable interpretation of \"open borders\" so that they can position themselves as the sane one. So I think likely the QAnon will agree that what I support is open borders, but describe open borders as something much more anarchic than this.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PurpleSailor",
            "body": "No, pretty much everyone I know wants proper procedures followed. Keep in mind that showing up at the border and asking for asylum and getting let in as that asylum claim is processed **IS** currently following proper procedure. Apparently the border deal that fell through would have changed that somewhat but the repubs nixed that deal.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DarkBomberX",
            "body": "No. I don't support \"not having any form of checkpoint or \"close borders\" and letting anyone who passed country lines in.\"\n\nHowever, I do support letting anyone in who's been reasonable vetted. What I mean is that as long as people coming in don't have drugs or weapons on them and have whatever government docs their country uses to identify them, they can enter the country. I also don't think their should be limits on how many people can enter the country to try and become citizens. There's been zero evidence showing me that immigrants are bad for our country and plenty of evidence showing they're better citizens than native born Americans.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Remote-Quarter3710",
            "body": "Perhaps if it was implemented in the right way at the right time. And when I say that I mainly mean I would have liked to see a transition into a Schengen zone like system for North America but it would have made a lot of NAFTA meaningless from my understanding of it. \n\nOverall, I understand the theory behind it and agree that a large problem stems from capital and corporations being global but the prospect for employment is based on your citizenship, location, and favorability. Plenty of countries have labor shortages and plenty of people need work and economic opportunity. We wouldn’t need an open border system if we created a better immigration system and for many they really need more young people. \n\nTo a different point, there are many people with ancestral ties on both sides of the border and it feels like it should be easier for people to traverse it. The rigidity of our immigration laws are largely the problem imo not necessarily that we have a semi permeable border.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "One-Earth9294",
            "body": "I support a very welcoming immigration policy. Call that what you want. Should we just close down all border controls? No. Gotta remember our Southern neighbor also has a serious crime problem. Not keeping an eye towards being taken advantage of by organized crime which is fucking VAST in Mexico would be dumb. \n\nBut the reality is that Democratic politicians don't fuck around with that despite Republicans screeching that they do. And it's tiresome having the argument trotted out. Obama never took the fucking fences that exist down or shut down border patrols, in fact deportations under him went up. Nor does Joe Biden or anyone else just 'let everyone through' or even cater to illegal immigration. Just a more open policy about asylum seeking, clearly.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "candre23",
            "body": "Define the term and I'll give you an answer.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "stopped_watch",
            "body": "I live in Australia. We have no land borders with any other country. Therefore, any arrival, legal or not arrives via an airport or boat.\n\nAirports are completely controlled. You're not getting in without a visa. If you overstay your visa, you are deported and most likely you won't ever be coming back to Australia again.\n\nBoat arrivals are problematic. While I sympathise with the plight of asylum seekers, people smugglers are the scum of the earth. The illegal trade in the movement of desperate people must end. \n\nI support the policy of turning back boats. I also support policies that improve the processing of asylum seekers and refugees in their first place of safety. I believe that USA is doing more than their fair share of accepting immigrants (the stats don't lie). I believe other developed nations (I'm especially looking at countries like Japan) should be doing more.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Unban_Jitte",
            "body": "I support starting from an open border and finding reasons to exclude specific people rather than starting from a closed border and finding reasons to include specific people.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sirlost33",
            "body": "I hear that term a lot but I get a lot of different responses as to what an “open border” is. I want an open border that allows commerce, tourism and personal business just as it does now. I don’t see making it more difficult for things that help economically. \n\nWhat we need to reform are our asylum laws, which is what’s driving a lot of the current issues. And we were all real close to something getting done too.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nomiinomii",
            "body": "Yes. Fully open, no rules, no restrictions, worldwide. If someone wants to move somewhere for whatever reason, feel free",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kbeks",
            "body": "I support a less racist version of the immigration system than my great grandparents came through, though I understand that immediately snapping back to such a system would strain resources in this country significantly. That system, btw, was “are you an anarchist? Are you sick? Ok there’s the boat to take you to Manhattan.”\n\nOk maybe more of a background check than just that, but you get the idea. It won’t happen, so it doesn’t really matter, but I’d really love a less racist system all around. I think we’ve got a bit of work to do to get there.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "California_King_77",
            "body": "If the left doesn't support open borders, are you upset with Biden for his actions?\n\nThe border was sealed up much better under Trump, and Biden unwound all of his predecessors policies on his first day in office.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CaptainAwesome06",
                    "body": "I don't consider anything Biden has done as supporting an open border. The democrats did try to pass a border security bill. That doesn't sound open at all.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "California_King_77",
                            "body": "You do realize that Biden rolled back every one of Trump's border related policies on his first day of office, and instructed Mayorkas to make the changes that he did, which caused us to get 3-5 million new illegals?\n\nAre you aware of this?\n\n[https://www.texastribune.org/2021/01/20/joe-biden-trump-immigration/](https://www.texastribune.org/2021/01/20/joe-biden-trump-immigration/)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CaptainAwesome06",
                                    "body": "Lifting *some* restrictions doesn't make it an open border. There are still checkpoints and restrictions. Are you aware of this?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "California_King_77",
                                            "body": "There are checkpoinst, but if you break the law by avoiding them, we're not deporting people.  In Texas migrants rushed a checkpoint and assualted border agents - they were waved in. \n\nWe're letting them all stay.  Biden is even flying them directly from Venzuela to the US.  Criminal prosecutions?  We've stopped those too.\n\n5 million illegals waved in under Biden, from over 100 countries.  The border is open",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CaptainAwesome06",
                                                    "body": "The Biden administration had deported more people in 9 months (May '22 to Feb '23) than any other single year since 2015. So what you are saying doesn't quite add up to the reality of the situation.\n\nFurthermore, just because immigrants came in doesn't make it an open border. There are, in fact, still checkpoints, laws, deportations, etc. Not being as strict as you'd like does not make it not strict. Get out of here with that fear mongering rhetoric.\n\nAlso, crossing the border and declaring asylum is not illegal. I don't know why conservatives seem to think that it is. And unlawfully crossing the border is also a civil penalty. No need to get in an uproar over a civil penalty. The party of family values has really lost its humanity.  As a Christian, I don't know how you guys vote for people like that.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lesslucid",
            "body": "I think in an ideal world we would have open or near-open borders, but I accept that it's not possible as a practical reality for the near future. We could do more to make them more open than they are now, though.  \n\nI wouldn't worry too much about arguing the question with your friend, though; chances are she doesn't really care about the truth content of her statements at all.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "CaptainAwesome06",
                    "body": "She never responds when I ask for proof so I'm sure the conversation is already dead.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "WildBohemian",
            "body": "No and no.\n\nI do support a much more generous and humane asylum and immigration process than what we have, but the phrase \"open borders\" does not describe that.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MythologueUK",
            "body": "I support \"open borders\" in a sort of Schengen area sense. My personal view isn't just that borders, in their current form, should cease to exist but that they probably will, inevitably, as global society and international unity are both more or less guaranteed. \n\nNote that by this, I don't mean literally no checks or control measures.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yousernamefail",
            "body": "I frequently leave my front door open (with screen door closed) to allow a nice breeze into the house. Is that wrong?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lucille12121",
            "body": "No one. I have never met anyone of any political standing that want literal open borders. That includes several immigrants who understand how broken the system is firsthand.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Toolaa",
            "body": "Right this minute not many will say so.   During the Trump administration and towards the run up to the 2020 election, yes I knew quite a few that latched onto opposition to immigration, and were proud to admonish those opposed.  \n\nThe fact is, this is not a left vs right issue.  It’s not a racial issue.  It is mostly a wealthy vs working class issue, that cuts across party lines.  Unchecked, illegal immigration benefits human traffickers, businesses and very wealthy families at the expense of the taxpayers, legal lower/middle class workers, and those who are being exploited.  \n\nI worked along side many legal and illegal foreign born workers in construction and services industries in Washington DC.  I’ve been involved in many projects working within K Street law and lobbying firms.  Those firms have reception desks that cost more than the median income in the US.  They spend lavishly on architectural finishes that cost 10-100x more than your typical American home.  50% of the workers doing the interior construction and the building cleaning these buildings are here illegally.  They are in effect being underpaid by clients that could afford to pay living wages, and they are taking away jobs from potentially legal workers.  If you can train a person who does not speak English, who has never used a power tool, who was a farmer in a 3rd world country how to install steel channel studs, insulation, drywall, or paint, then you can train any unemployed inner city man or woman how to do that same job.  (Source ME, I was there)\n\nThere were democrats who thought that making opposition to immigration, a racist MAGA talking point would help them come election time.  Well that’s totally backfired in a huge way.  It’s certainly not going to be easy to change course before November.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ElboDelbo",
            "body": "I wouldn't say I support an open border as much as I don't really care if there's an open border.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "dachuggs",
            "body": "I think we should allow more people to immigrate to the United States.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "hitman2218",
            "body": "In an ideal world it would be like the old days. Migrant workers could come and go as they pleased. But we need regulation. \n\nSide note, I’m so sick of people comparing the border to their own home. It’s so stupid.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "panic_bread",
            "body": "I'm not into the idea of nations at all. It's just hyper-inflated tribalism. We'd be better off working as an integrated global community for the benefit of all, with decentralized smaller communities dealing with more local issues.\n\nI know your friend thinks they did some sort of \"gotcha\" with the \"go ahead and leave your door open comment,\" but it really just shows that they're not aware of/are ignoring how the global capitalist hellscape functions, where people/countries with more privilege chronically and systematically extract resources and value from people/countries with less privilege. The root cause of crime and violence is always poverty and inequality.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "pinner52",
            "body": "The left is losing control of the narrative and really needs to stop beating around the bush now:\n\nhttps://www.axios.com/2024/04/25/trump-biden-americans-illegal-immigration-poll\n\nhttps://www.dailymail.co.uk/news/article-13438653/survey-poll-voters-lockups-deportation-migrant-immigration.html\n\nhttps://www.washingtonpost.com/politics/2024/04/29/harsh-deportation-tools-are-just-fine-with-many-americans/\n\nIf you think anyone at anytime should be able to freely enter this country to do whatever the heck they want as long as they ain’t a known criminal when they entered as some here have suggested, you are for open borders; you are for depressed wages for the poorest people while lining the pockets of the rich; and you are for globalism over state sovereignty. You are for destroying the middle and lower classes and making it impossible for them afford children, and now your just admitting in Congress your plan is to just import them from someone where else to replace them to keep your numbers up as the population ages and people have less children: https://nypost.com/2022/11/20/chuck-schumer-admits-democrats-dont-want-any-real-immigration-law/\n\nOh and let’s not forget the brain drain you will create and you want to place on all these third world and developing countries that need their greatest minds in order to lift them out of poverty and prevent the need to leave. Very kosher, very progressive. \n\nYes. Some of you are even more radical and actually believe there should be no limits on the border at all, not even a “can I check your id please” but these less radical ideas are still radical when compared to literally every country that exists.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "alaska1415",
                    "body": "You really kicked the shit out of that person who doesn’t exist.",
                    "score": 1
                }
            ]
        }
    ]
}