{
    "title": "Federal reserve study concludes “Greedflation” is not a thing. What do you believe is causing the current persistent inflation?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nBiden has blamed “corporate greed” for stubborn inflation rates. I’ve heard similar sentiments repeated on here. Of course most economists will tell you inflation has nothing to do with that and recent Fed study also demonstrates the obvious. \n\nhttps://www.reuters.com/markets/us/corporate-greed-not-blame-price-pressures-fed-study-shows-2024-05-13/\n\n> Data for the current recovery show that the increase in corporate profits is not particularly pronounced compared with previous recoveries,\" the San Francisco Fed researchers wrote. \"Markups also have not played much of a role in the slowing of inflation since the summer of 2022\n\nIs there a larger issue with a big portion of American public not understanding basic macro and micro economics? \n\nDo you think our politicians take advantage of this fact and spew talking points that make no scientific sense (in this case from the standpoint of economics)  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "The same federal reserve study says that there is no “current persistent inflation.”",
            "score": 74,
            "replies": [
                {
                    "depth": 1,
                    "author": "hitman2218",
                    "body": "Is there though? It’s been a while since we saw any significant change in the inflation rate.",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": ">It’s been a while since we saw any significant change in the inflation rate.\n\nThat's true.\n\nThe \"[12-month percentage change](https://www.bls.gov/charts/consumer-price-index/consumer-price-index-by-category-line-chart.htm)\" has been hovering between 3.0% and 3.7% for about a year.",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "octopod-reunion",
                                    "body": "If you see that the history of the 2% target is completely arbitrary, it really seems like a mistake. \n\nThe economy is doing very well, and if 3% had been the arbitrary number we had picked for full employment imagine what the media and public opinion would be. ",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "idowatercolours",
                                            "body": "It’s not completely arbitrary. For example, there’s been several Fed chairmen who argued for different target rates. However most argued for lower than 2%.  Richmond Fed president in 2004, favored a 1 percent inflation target. Yellen (who’s the Fed chair now) decades ago favored a 1.5 percent target as the San Francisco Fed president.\n\nTarget rate signals stability and sound policy to he market but also provides that the increase of money supply doesn’t surpass the aggregate output/productivity",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "octopod-reunion",
                                                    "body": "This was interesting because we had the opposite problem that we do now. \n\nInflation was very low, but employment and more importantly workforce participation was not that high. \n\nEconomists were concerned that we could not get to a strong growth as we had already become a rich country and were aging and perhaps productivity could not improve significantly again (even with the new technology).\n\nGoing to 1 or 1.5 was because we wanted _more_ inflation, or in actuality more growth and labor participation that goes with inflation. \n\nWe had zero interest rates and huge deficits and _still_ couldn’t get the inflation number to budge. \n\n—-\n\nAll that is to say is, it’s further proof to me that the 2% is arbitrary. \n\nIn that economic circumstance getting to 1.5 would be an achievement and a worthy goal, but getting 2 the price would’ve been too high for not that much of an improvement. \n\nSimilarly in our current circumstances getting to 3% has lead to good economic conditions (wages growing above inflation for about a year now). But getting down to 2 would likely cause a recession and wage decrease. \n\nThe goal should be based on the circumstances and what would be the best outcome. Not just an arbitrary number for all circumstances. ",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "PM_ME_YOUR_DARKNESS",
                                                            "body": "I find it tough to discuss the 2% target because it both is *and* isn't arbitrary. It isn't arbitrary because we want it above zero, and we know once it gets above 4%-5% it can cause price instability. It *is* arbitrary because there's nothing magical about 2% inflation. Is 1.8% \"better?\"",
                                                            "score": 1
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "idowatercolours",
                                                            "body": "It’s not arbitrary. It’s not that we wanted to raise the inflation when the economic activity was slow.  We wanted to raise the economic activity and the inflation is typically the indicator. So we were willing to accept the higher inflation. \n\nExcept for the cases where there’s stagflation where sharp rise of money supply occurs due to spending, deficit and a crisis but the economy doesn’t grow as fast or the unemployment remains high. (1970s).\n\nIn many ways, the current situation resembles the 1970s except the unemployment is not as high. The economy put up pathetic numbers last years and inflation remained relatively high. Which is probably a mild version of stagflation. \n\nSo you can say the number is arbitrary but it’s not, it’s circumstance dependent. In circumstances when you’re experiencing high unemployment and low growth, you’re fine lowering your FFR and you’re okay with relatively higher inflation, but when your employment and inflation is already high and you’re expecting it to come down, you’re never going to set your target to 3 or something higher",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "octopod-reunion",
                                                                    "body": "> It’s not that we wanted to raise the inflation when the economic activity was slow. We wanted to raise the economic activity and the inflation is typically the indicator \n\nThat’s exactly what I said: \n\n> Going to 1 or 1.5 was because we wanted more inflation, or **in actuality more growth and labor participation that goes with inflation** \n\n> the current situation resembles the 1970s except the unemployment is not as high  \n\nThe situation in _2021 and 2022_ matched this, as both stagflation in the 1970s and this were initiated by supply shocks. When the aggregate supply shifts leftwards, the entire economic output decreases (recessionary) _and_ prices go up. \n\nThe situation _now_ is just the typical unemployment-inflation trade off that we get when the economy is running hot.  \n\n—- \n\n> So you can say the number is arbitrary but it’s not, it’s circumstance dependent \n\nThat is once again my point. One central banker in New Zealand in an offhand comment said that there’s some ideal inflation target “like 2%” that got publicized and central banks made it an unofficial, then official policy to always target 2% inflation. \n\nThat specific target, 2% is arbitrary. \n\nIt would be better policy to have targets based on circumstance. If getting to 3 means getting to a situation where wages can grow faster than inflation, but getting down to 2 means a recession, unemployment and a poorer populace, then dont make 2 your goal. \n\nIn the opposite situation if getting to 1.5 means you can raise incomes and increase workforce participation, but getting to 2 means you have to bankrupt the country with huge stimulus even though unemployment is already low, then there’s no point in that extra cost to get to 2. \n\nEdit: tl;dr: 2% is ideal in some circumstances. But not all circumstances. The fact that we decided on 2% as the overall target in all cases was an arbitrary event in history. ",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "letusnottalkfalsely",
                            "body": "According to the federal reserve there is not.\n\nEither the report is accurate and there is no greedflation because there is no *inflation*, period, or the report is not reliable and the question is still open.\n\nOP is using the report to suggest that there is no greedflation but there is still current, persistent inflation. The report does not support such a claim.\n\nEdit: To all the people not reading my whole post, I am not making a claim about current inflation rates. I’m making a claim about critical reasoning. Please stop trying to counter the argument I’m not making.",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DistinctTrashPanda",
                                    "body": "\"Persistent inflation\" doesn't just mean that there is ongoing inflation--it means that there is high inflation, and it should be expected that inflation will remain for a long time.  While there was high inflation post-COVID, it peaked at 9.1 percent; less than two years later, we are at 3.5 percent or so.  The high 9.1 percent inflation did not last a long time, and while 3.5 percent is higher than the 2 to 2.5 percent the Fed targets, it's not \"high,\" nor is it expected to last a long time.\n\nThe economic letter does not say that \"greedflation\" doesn't exist; it merely points out the well-established rationale of why prices rise during inflationary periods (namely, the cost of inputs of businesses are increasing (also the costs of supply chain issues, etc.--which was most of the beginning of inflation; used cars being a main driver of inflation at the start was due to supply-chain issues and the market for used cars), so the businesses raise their rates to compensate, plus an additional buffer for future, expected inflation).  \n\nWhile the letter did not touch on it much, there is the side of things after inflation levels off:  wages rise faster than inflation to close the gap, which is what we've seen over the last year.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sweens90",
                                            "body": "Careful part which people need to realize. 3.5% is not high compared to 2 or 2.5 in the short term. If it were to stay there its effects quite literally compound.",
                                            "score": 4
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "sweens90",
                                    "body": "Inflation is designed into the system like the frog in a slowly boiling pot. Except in some cases like the past years the heat gets ramped up too quickly. \n\nIf inflation were to go to zero prices would stat where they were. Which I think people get because inflation duh but still we see it and hope it goes down. Plus we tie gas to inflation so mich that when we see gas down then obviously inflation is going down. \n\nThat said if federal reserve does not believe in constant inflation which I am almost sure they said they design it to then the whole report is just as Joe would say malarkey. \n\nNow does this mean Greed flation did or did not exist. It absolutely existed but the real question is to what extent. Some ceos basically admitted it, but did it have a noticeable effect is the question",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Fed’s target inflation is 2%. The current rate is 3.5 %",
                                    "score": 6
                                },
                                {
                                    "depth": 3,
                                    "author": "akcrono",
                                    "body": ">  but there is still current, persistent inflation. \n\n[citation missing]",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": "> What do you believe is causing the current persistent inflation?\n\n[[An Oil Price-Fixing Conspiracy Caused 27% of All Inflation Increases in 2021]](https://www.thebignewsletter.com/p/an-oil-price-fixing-conspiracy-caused)",
            "score": 39,
            "replies": [
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "Hmm. Crude oil prices are still much lower than there were around 2010-2014. And the inflation was never that high and persistent back then. Natural gas prices have actually been declining. So you can’t really blame the energy cost.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheManWhoWasNotShort",
                            "body": "You’re looking in a vacuum though.  It’s also in the context of the post-COVID changes to the economy and the war in Ukraine.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "There were wars back then too. Remember Arab spring and war in Libya? OPEC countries were actually involved. Russia actually invaded Ukraine in 2014 as well.",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": ">  Crude oil prices are still much lower than there were around 2010-2014. And the inflation was never that high and persistent back then.\n\nInflation tends not to happen in weak economies.\n\nThe unemployment rate was significantly higher 2010-2014.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Inflation can absolutely happen in a weak economy. Ever heard of stagflation in 1970s under Carter ?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "EchoicSpoonman9411",
                                            "body": "> tends not to\n\nand\n\n> can\n\nare compatible states. It's entirely possible for inflation to occur in the 1970's, and then not happen in the early 2010's.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "Do you understand why it tends not to happen in weak economies and with high unemployment? The answer to that question pretty much proves the point as to what are the primary drivers for inflation (hunt: not the oii prices)",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "EchoicSpoonman9411",
                                                            "body": "Because weak economies generally have lower demand, which puts downward pressure on prices. Downward price pressure works against inflation.\n\n> The answer to that question pretty much proves the point as to what are the primary drivers for inflation (hunt: not the oii prices)\n\nPrice fixing, by definition, exists outside of the demand/supply push pull. You really don't have a good grasp on the concept of cause and effect, dude.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "idowatercolours",
                                                                    "body": "You just answered the question and then went back to “price fixing”? Lol \n\nDo you understand why lower demand and lower prices lead to lower inflation? Because companies lower their output, the overall economic activity usually slows down. Less money circulating in the economy. Less inflation.\n\nPrice fixing is not and has never been a significant factor that’s affected inflation. Price fixing is also not a common practice in market economies. In markets dominated oligopolies  or a monopoly itc can happed. \n\nBut look at crude oil price vs weekly retail gasoline price charts. They nearly mirror each other. Oil market is an example of oligopoly market if there’s any and even in this environment price fixing is not a significant factor",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "EchoicSpoonman9411",
                                                                            "body": "This:\n\n> Do you understand why lower demand and lower prices lead to lower inflation? Because companies lower their output, the overall economic activity usually slows down. Less money circulating in the economy. Less inflation.\n\n...does not imply this:\n\n> Price fixing is not and has never been a significant factor that’s affected inflation.\n\nIt is entirely possible for two different things to affect inflation.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "idowatercolours",
                                                                                    "body": "Right. there are several things at play. And if we make a list of top 5 things I wouldn’t put price fixing on that list.",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "EchoicSpoonman9411",
                                                                                            "body": "[It was found to be the cause of 27% of inflation in 2021](https://www.thebignewsletter.com/p/an-oil-price-fixing-conspiracy-caused). Facts matter. Your opinion-driven 'list' doesn't.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "idowatercolours",
                                                                                                    "body": "Don’t have any reputable sources for this conspiracy theory? Has this been proven?",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "othelloinc",
                                            "body": "> Inflation can absolutely happen in a weak economy. Ever heard of stagflation in 1970s under Carter ?\n\nYes, and the solution was raising interest rates above the rate of inflation, and holding them there until inflation was defeated.\n\n...which is what The Fed has done ever since, and is doing right now.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> If an oil price fixing conspiracy caused 27% of all inflation that’s still 73% unaccounted for… \n\nWe also had a major oil exporter that invaded a major grain exporter, pushing up the price of both.\n\nWe also had the supply-chain snarls resulting from COVID.\n\n---------\n\nThere are also [other explanations,](https://old.reddit.com/r/AskALiberal/comments/1cywrpe/federal_reserve_study_concludes_greedflation_is/l5ch43v/?context=3) but they take time to type out.\n\n---------\n\n>...just saying for the math geeks reading this\n\nYou think that \"the math geeks\" need you to show them what 100% minus 27% is?",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sad_Lettuce_5186",
                                    "body": "Seemingly they’re insinuating that the math geeks automatically saw that and that you didnt. That theyre speaking on behalf of math geeks to you.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Roombaloanow",
                                    "body": "Russia is also a major grain exporter. More major once the Ogallalla aquifer is exhausted in 25 years or so.  ",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "CoatAlternative1771",
                                    "body": "The 73% comment was clearly tongue in cheek sarcasm… I hope.",
                                    "score": -1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dottsterisk",
            "body": "Looking at the full Reuters article, I’m a bit confused on what’s being rebutted. But, full disclosure, I’ve not taken any economics since grad school.\n\n> Corporate price gouging has not been a primary driver of U.S. inflation, according to research published on Monday by economists at the Federal Reserve Bank of San Francisco.\n\nArticle thesis statement. Doesn’t seem to be saying that greedflation isn’t a thing, but that it’s not the *primary* driver of inflation for the country.\n\n> While markups for motor vehicles and petroleum products did rise sharply during the 2021-2022 inflation surge, markups across the entire spectrum of U.S. goods and services have been relatively flat during the post-pandemic recovery, the bank's latest Economic Letter showed.\n\nWas the argument that corporations were *continually* raising prices at an exorbitant rate, or that they raised prices a lot to deal with sudden COVID expenses *and then did not lower the prices once those expenses were no longer on the balance sheet.*\n\nThat’s a very different accusation. Prices are going to keep going up with inflation, but if there’s still that COVID bump in the base price, but no longer the COVID expense in production, people call foul.\n\n> “As such, rising markups have not been a main driver of the recent surge and subsequent decline in inflation during the current recovery,\" wrote the bank's research chief Sylvain Leduc and colleagues Huiyu Li and Zheng Liu.\n\nThis also seems to be addressing the idea that corporations are continually and over time adding price bumps out of pure greed, versus the idea that they’re just keeping the COVID bump in the price, even though they no longer have the same COVID expenses.\n\n> U.S. President Joe Biden has blamed corporate greed for still-elevated prices, accusing companies of boosting profits by shrinking portion sizes but leaving the selling price unchanged, and by failing to pass on falling costs to consumers.\n\n*That.* That’s what I’ve understood “greedflation” to be—the still-elevated prices that take into account COVID expenses like constant sanitation and installing sanitizer machines and paying for more sick leave and for emergency hires. Those aren’t on the balance sheet anymore, but the cost is still passed to the consumer.\n\n> Fed policymakers, and many economists, say the inflation surge can be better explained by the combined effect of supply chain disruptions and a drop in labor supply during the post-pandemic recovery that occurred just as consumer demand rose.\n\nExactly. And that disruption has passed, as has the worst of the pandemic. But prices are still set as though corporations were hemorrhaging cash to deal with COVID. \n\n> Leduc and his colleagues did not refer to Biden or use the colloquial term 'greedflation,' but their work was a clear rebuttal of the theory that corporate profiteering has been a main cause of higher prices. \n\nNot a main cause is still not the same thing as “not a thing.”\n\n> “Data for the current recovery show that the increase in corporate profits is not particularly pronounced compared with previous recoveries,\" the San Francisco Fed researchers wrote. \"Markups also have not played much of a role in the slowing of inflation since the summer of 2022.\"\n\nAnd just because we *usually* see a greedflation factor during recoveries (the rich always get richer in emergencies) doesn’t mean it’s not a thing to be concerned about.\n\nAll told, the study seems to be concluding that greedflation is not the *primary* cause of inflation, not that it’s just flatly not a thing.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "erinberrypie",
                    "body": "> not that it’s just flatly not a thing\n\nIf anything, it feels a lot like they're confirming exactly what it is. They're defining the word. Like you said, not primary, but clearly admitting it's part of the problem. Language like, \"not much\", \"not particularly\" pretty much confirms that it does exist imo.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "almightywhacko",
                    "body": "> markups across the entire spectrum of U.S. goods and services have been relatively flat during the post-pandemic recovery\n\nSo prices haven't gone up much *post-pandemic*, however prices for all sorts of product skyrocketed *during* the pandemic and have remained high. Could that be a driver of inflation?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ausgoals",
            "body": "All I know is [my bag of Doritos has (at least) five fewer chips in it](https://www.newsweek.com/not-your-imagination-doritos-bag-has-5-fewer-chips-due-shrinkflation-1689450) and now costs $6 a bag, while the cost of corn is [drastically lower](https://www.macrotrends.net/2532/corn-prices-historical-chart-data) than it was in 2020. They’ve increased in price by around $2 a bag while putting less of the product into the bag. \n\nIs that not exactly the issue Biden is talking about?\n\nInflation is a complex thing, but the part that we see every day and that hits our pockets the hardest is the cost of everyday goods, and I will readily accept and propose that the majority of inflation in everyday goods is because of corporate profiteering.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "Obvious_Chapter2082",
                    "body": "That would make sense if you were buying corn directly from the producers. But you’d need to factor in all of the input costs that actually go into producing a bag of Doritos. Transportation, other ingredients, labor, plus any other costs that the retailers have that are unrelated to Doritos that they recover from general price increases \n\nJust using PPI as a gauge, the sellers of these goods aren’t marking up the price in excess of what their costs are increasing by. It’s just that when you look at profit margins, those are going to increase in nominal terms when inflation goes up",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ausgoals",
                            "body": "If the cost of the raw ingredient has gone down, while the price of the end product has both shrunk and gone up - something along the line is price gouging.\n\nIt might not be the retailer directly, it might not be Frito Lay themselves, but someone somewhere is doing it.\n\nTo put it another way - if I, say, manufacture and provide filters for vacuum cleaners that Dyson buys from me for use in their V-series, and the cost of my parts goes up 20% in 2020, I then put up my costs 20% and push the increase down the line to Dyson who inevitably push the cost of their vacuum by an equivalent amount to make up for it.\n\nIf the cost of my parts drop back to where they were in, say, 2019 - I can either drop my price back to where it was, or I can keep it at the high rate. My orders from Dyson didn’t change due to the increase in price, so why *wouldn’t* I keep the price as it was? It’s all extra profit for me.\n\nIf no-one else does this, the vacuum cleaner will still be 20% more expensive than it was because of my profit gouging. Best Buy might not make an extra 20% on the sale, but I am. If every provider in the chain does this, you end up with a product that is 30% more expensive despite being smaller, despite the retailer themselves not changing their markup percentage (though ultimately making more money because the markup is a percentage not a flat fee). \n\nIt’s also self-fulfilling. Thinks inflate in cost, so I put my prices up. But when my parts come down in cost, the fact that all the things I buy for my everyday needs have inflated in cost means I’m even less incentivised to drop my prices. \n\nThen people stop buying Dyson vacuums because their price has inflated so much. So my filter orders slow. I’m left with the choice of dropping my prices to try and get more orders, expanding my business to other vacuum companies, or increasing my prices further to make up for the shortfall in revenue and profit.\n\nLet’s say I have shareholders in my vacuum filter business… I have a fiduciary duty to make them more money. So I either drop prices a little and hope to sell more, or I increase the price further and hope the increased price makes up for a smaller sales volume.\n\nThis is where we’re at now, with Target reporting a drop in sales and therefore dropping prices on many items to try and get people back in the store and buying again.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Obvious_Chapter2082",
                                    "body": "A couple of things:\n\n1. Your original point was talking about the price of corn, but ignoring all other costs. We know that average input costs have risen across the board, labor costs have increased, transportation costs have increased, and non-COGS costs have increased as well. All of this factors into the price of the final product, not just the cost of one of the inputs \n\n2. Just because a company’s reported profits are increasing doesn’t mean they’re increasing prices more than their costs. Most companies record their inventory, and therefore their costs of sales, on a FIFO system, so their reported costs are much lower than their actual costs when inflation is rising. It’s why profit margins increase in times of high inflation, because there’s a significant time lag between the reported costs of the goods sold and the actual cost the company is buying them at",
                                    "score": -3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Skabonious",
                    "body": "I propose that the majority of inflation is due to higher demand. With such a low unemployment rate, you are competing with more of your neighbors for the same goods.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ausgoals",
                            "body": "The current unemployment rate is about on par with the unemployment rate for all of 2019, yet 2019’s inflation rate was 1.81%.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Skabonious",
                                    "body": "Fair point, though also avg wages in the US as of March 2024 are **$34/hr** whereas in 2019 it was between $27-28/hr. Wage growth has been outpacing inflation",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ausgoals",
                                            "body": "[Wage growth also outpaced inflation in 2019](I shot TV shows and all sorts of stuff back in Aus.), though this specific visualisation of the data makes it tricky to compare more directly.\n\nI’m not sure that it’s necessarily a compelling case as to why inflation stays persistent, however I do think that the high rates of both inflation and wage growth combined to create this issue we have where the perception of the economy is detached from the reality of the economy. \n\nBasically I do think that people overall feel squeezed - not because inflation is higher than their wage, but because on average they’ve received a 20% increase in wages over the past four years, but in real terms (I.e. after inflation) it amounts to a 2% raise in the same time period. \n\nEssentially if you earned $55k in 2020, your pay has on average increased $11,000 but in real terms it’s as if it’s only increased $1100.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Poorly-Drawn-Beagle",
            "body": "The Fed has also argued that there is no persistent current inflation, a notion I imagine you would not agree with yourself ",
            "score": 5
        },
        {
            "depth": 0,
            "author": "C137-Morty",
            "body": "Current inflation is within normal levels\n\nBut shouldn't this study also define what caused the previous high levels?",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "3.4% is not normal. Fed’s target is 2%.\n\nI dont think it’s a secret what’s causing it. Most college sophomores who took macroecon 101 could tell you it’s overspending  - i.e stimulus money and low federal funds rate (it’s been raised  now but was low during Biden’s first 2 years.) \n\nThose factors compound and lead to increase in borrowing and mass money influx into the economy",
                    "score": -13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> Most college sophomores who took macroecon 101 could tell you it’s ~~overspending - i.e stimulus money~~ *budget deficits* and low federal funds rate (it’s been raised now but was low during Biden’s first 2 years.) \n\nConservatives like to pretend that it is government spending, but it is actually the size of the deficit.\n\nReducing the deficit should be a priority right now, but doing so by increasing taxes (on people making over $400,000 per year, as Biden favors) would fix the problem just as much as decreasing spending would.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Deficit is a huge issue. However it’s government spending that contributes to inflation. We saturate money in certain sectors arbitrarily, the amount of that money doesn’t always correspond to productivity of that sector. EVs is a great example. Earlier this year there has been a reported crash in demand on EVs yet were dumping money into the industry  \n\nAlso taxing people isn’t going to solve an issue it’s going to further exacerbate the problems by slowing down our economic growth",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheManWhoWasNotShort",
                                            "body": "That’s myopic to the point of being misleading in its presentation.  Government spending contributes to inflation but is held in check by interest rates and taxation.  So it’s far more deficit driven than spending driven, because deficits create a lack of a substantial check on inflation, which is naturally going to occur for any government that spends money.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "The deficit is the indicator of either too much spending or not enough taxation.\n\nIf you elect to go with higher taxation, you end up spending the money you take from one group of people to another. Taxation does result in slowing economic growth - go to CBO estimates even they show that. but there is also no evidence that it will also lower inflation. The same money is being spent except it’s being redistributed by the government",
                                                    "score": 0
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "othelloinc",
                                            "body": "> Also taxing people isn’t going to solve an issue it’s going to further exacerbate the problems by slowing down our economic growth\n\nWe are *supposed to be* \"slowing down our economic growth\". The economy is running 'above capacity'.\n\nRaising interest rates and/or reducing the deficit is intended to take fuel out of an overheating economy.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "Is it running above capacity? Lol we posted miserable 1.6 the 1st quarter of 2024. That’s one of the historic lows",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "othelloinc",
                                                            "body": "> Is it running above capacity?\n\nYes, in the most literal sense.\n\nI work for a manufacturer and our orders are still at about 130-140% of our capacity. The same with all of our suppliers.\n\n--------\n\n>Lol we posted miserable 1.6 the 1st quarter of 2024. That’s one of the historic lows\n\nThat is *growth*. If we are above capacity and the economy *grows*, we can stay above capacity. (This is part of why so many people were certain we would need a recession to defeat inflation.)\n\nWe *might* be able to defeat inflation while growing, but requires increases in capacity, which don't comes easily.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "idowatercolours",
                                                                    "body": "Do you understand that economic growth is not just growth of demand. \n\nYou have an anecdote of a sector where supply is yet to catch up with the growing demand, I have an anecdote for you of a case where demand needs to be caught up. \n\nWhere I work we’ve built, qualified a good number of aseptic pharmaceutical filling facilities/equipment over the past couple of years, and we had a couple of clients back out of the contacts. Now we have lots of supply and few clients. Demand needs to catch up. \n\nNo, we’re not at capacity.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "othelloinc",
                                                                            "body": "> Do you understand that economic growth is not just growth of demand. \n\nYes.",
                                                                            "score": 2
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "banjomin",
                                                                            "body": ">You have an anecdote\n\n-\n\n>Where I work we’ve built, qualified a good number of aseptic pharmaceutical filling facilities/equipment over the past couple of years, and we had a couple of clients back out of the contacts. Now we have lots of supply and few clients. Demand needs to catch up.\n\n>No, we’re not at capacity.\n\nYou can criticize someone putting forth an anecdote, or you can put forth a competing anecdote.  Doing both is gross.  \n\nIf you don't like that he did it, why is it ok for you to do it?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "idowatercolours",
                                                                                    "body": "I wasn’t using my anecdote to make larger conclusions. I simply pointed out that experiences can vary based on anecdotes. \n\nThis is why we have numbers and measurable values that show the state of the economy",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "C137-Morty",
                            "body": "The target is 2%, 3.4% is still within normal levels.\n\nThose sophomores, like most of the time, would be wrong and should definitely stay in school. That theory gets demolished when you zoom out and see every other country was also experiencing unusually high inflation these past 3 years as well.\n\nIf only I could remember what global event happened during this time frame that may have something to do with all of this.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Uhm what are you talking about ?  most G20 counties have lower inflation than us",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "JamesDK",
                            "body": "... And supply chain disruptions, surely? \n\nIf, per macro101, inflation is \"too much money chasing too few goods\", then the \"too few goods\" part must have been a contributing factor: especially as we all saw goods shortages in our daily lives.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "There aren’t many known global supply chain issues, outside of wars and stuff which there are always wars. \n\nThe “too few goods” isn’t necessarily referred to trade, it’s domestic production. If the domestic production and economic activity is slow who’s to blame for that?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Kakamile",
                            "body": "Reminder once again that debt rate is lower than Trump era and US inflation is lower than most of G20 even though we spent more.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "That’s a lie. The inflation is actually not lower than most G20 countries. Theres actually only 8 G20 countries that have higher inflation than us and none of them except for Australia are developed nations lol try again \n\nhttps://tradingeconomics.com/country-list/inflation-rate?continent=g20",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kakamile",
                                            "body": "Damn that's awesome, claims UK 1% drop just in a month.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Blecki",
            "body": "\"Not particularly pronounced compared to other recoveries\" != \"not caused by greed\"\n\nFirst off, their use of language exposes their bias: if it was the same they would say so; instead they made a judgment call that its 'not particularly pronounced'.\n\nSecond, just because a bad thing was happening before does not mean we should be okay with it happening now.\n\nThe real answer is Biden is right: it's caused by corporate greed. Just like it always has been.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "ZeusThunder369",
                    "body": "What do you think caused corporations to be greedy starting around 2020? What can we do to get back to a time when corporations were unconcerned with maximizing revenue?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Blecki",
                            "body": "Read again.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ZeusThunder369",
                                    "body": "Okay, I read your last sentence again. I see no reason to edit my comment.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Blecki",
                                            "body": "I read the last letter in your comment again and no, I prefer coffee.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "So your real answer is the science of economics is wrong. Are you a science denier?",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "srv340mike",
                            "body": "Economics is NOT a hard science.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "srv340mike",
                                            "body": "It's not though. It's a bit like social sciences. There's too much human factor, and we don't have a high enough understanding of human psychology to account for that. It's still an interpretation of human behavior, like anthropology, political science, psychology, etc. It becomes an exercise of \"We have a big enough sample size of dating to extrapolate patterns/trends from\" which isn't the same as a hard science like physics/chemistry/biology are. It's a completely different type of field and it's disingenuous to call someone a science denier for not 100% buying into it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "It’s a numbers game. Relationship between prices and quantities of goods/sevrices are not absolute but they’re pretty damn accurate. \n\n Do 9 people out of 10 prefer a cheaper product of the same quality if presented with those options? \n\nWould you switch to a different company if they paid you $10 per hour more? \n\nIt’s as simple as that. We don’t make wild assumptions about people in economics. The only assumption we make is that people are relatively rational actors when it comes to their immediate financial benefits. Are there outliers? Sure. But it’s like that with every science.\n\nWhen you research wolves or lions you also make certain generalizations about their behavior. When you study physics, you assume that a lot of actions occur in a vacuum (newtons laws) even though real vacuum isn’t possible/",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "srv340mike",
                                                            "body": "> It’s a numbers game. Relationship between prices and quantities of goods/sevrices are not absolute but they’re pretty damn accurate. \n\nYes that's what I meant by 'It becomes an exercise of \"We have a big enough sample size of dating to extrapolate patterns/trends from\"'\n\nIt's still not a hard science because of the human factor, even if you can make reasonably accurate predictions over a large sample size. Human behavior is unpredictable on the micro level, but is somewhat predictable on the macro level. \n\nThat's what makes economics \"soft\". There's \"laws\" in economics but they're not *really laws* because of the it still just being an interpretation of human behavior. If you hit a ball with a hammer, it's going to act the same way given the conditions every single time. The same input will basically always give the same output. That's not true of the soft sciences.\n\nEven with your examples...\n\n> Would you switch to a different company if they paid you $10 per hour more? \n\nI absolutely wouldn't because my QoL and seniority are very good and I like my corporate culture.\n\nBut raising pay in general is an effective way to increase staffing, because the calculus for other people is different. \n\nThat unpredictability is what makes it soft.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "idowatercolours",
                                                                    "body": "Soft and hard are just labels. I don’t think you can fit scientific studies in two arbitrarily chosen labels.\n\nHumans are very predictable when it comes to their economic behaviors on macro level. In micro level we’re just not interested in that information, it’s not useful.\n\nMy example was hypothetical. But your answer doesn’t disprove anything, conversely you’re building a more complex economic model here. \n\nfor instance stuff like your QoL and other benefits or costs can be taken into account when constructing an economic model. Like opportunity costs are being taken into account when calculating financial decisions. The cost of you leaving the current job is obviously more than $10 in monetary terms. But say if someone doubled your pay, maybe you’ll be willing to switch over. In that case the economic model will simply adjust  your salary in terms by adding your QoL in monetary terms. \n\nThis isn’t different from how any\nScientific models are built, you keep adding variable until you reach your desired accuracy",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "srv340mike",
                                                                            "body": ">  But your answer doesn’t disprove anything, conversely you’re building a more complex economic model here.\n\nThat's exactly what I'm saying, though. It's a very complex model and the more complicated a system gets, the more likely it becomes that something will fall apart or not work as expected.\n\nThat can be accounted for, but then that'll create added complexity which will again increase the odds of \"failure\", and so on. \n\n> Humans are very predictable when it comes to their economic behaviors on macro level. In micro level we’re just not interested in that information, it’s not useful.\n\nExactly. Micro level is useless because of how unpredictable it all is.\n\n> Soft and hard are just labels. I don’t think you can fit scientific studies in two arbitrarily chosen labels.\n\nYou and I are more or less agreeing on how everything works, we just have different interpretations of how firm economics is.",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "AskALiberal-ModTeam",
                                            "body": "Subreddit participation must be in good faith. Be civil, do not talk down to users for their viewpoints, do not attempt to instigate arguments, do not call people names or insult them.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Blecki",
                            "body": "Most of the modern economic framework is wrong, yes. It's *correct* for the goal of maximizing corporate profit. It's *wrong* for everyone else.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Your statement comes from a deeply uneducated perspective. It’s similar to claims of those who say the earth is flat and the dinosaurs aren’t real",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Blecki",
                                            "body": "I've never seen a more text book perfect example of that logical fallacy.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "Fallacy or not you could benefit from reading a textbook in economics. I recommend Gregory Mankiw intro to economics",
                                                    "score": -1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Blecki",
                                                            "body": "Is that the book where he claims environmental laws drive down wages because companies have to hire more people, but then never explains why supply and demand only applies to what he wants it to apply to and not everything? \n\nOr the one where he tries to claim Mexico benefited from NAFTA?\n\nDon't see why I'd read his stuff twice. He'd just be wrong again.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "idowatercolours",
                                                                    "body": ">Is that the book where he claims environmental laws drive down wages because companies have to hire more people, but then never explains why supply and demand only applies to what he wants it to apply to and not everything?\n\nElaborate here. The laws of supply and demand apply to all labor markets. Not sure where he says it doesn’t apply \n\n>Or the one where he tries to claim Mexico benefited from NAFTA?\n\nThey did. [Mexican ag suffered but their manufacturing boomed. Total capital investment in Mexico went up .](https://www.cfr.org/backgrounder/naftas-economic-impact#:~:text=NAFTA%20boosted%20Mexican%20farm%20exports,lowered%20consumer%20prices%20in%20Mexico.)\nAgain, mankiws textbook is not prescriptive. It doesn’t tell you to pursue free trade policies. It’s up to nations to decide that. Mexico at the time elected to transition away from ag based society toward manufacturing \n\n>Don't see why I'd read his stuff twice. He'd just be wrong again.\n\nBecause this is one of the most reputable economics textbooks in the world. It’s used in Harvard and university of Chicago, London etc",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Blecki",
                                                                            "body": "And Einstein thought quantum mechanics was wrong. What's your point? That you're capable of making additional logical fallacies?\n\nMexico is a pretty damned good example of economics working great for the corporations while fucking the workers over.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "idowatercolours",
                                                                                    "body": ">And Einstein thought quantum mechanics was wrong. What's your point? That you're capable of making additional logical fallacies?\n\nWhat? Seems like ur having a discussion with someone else here. You never elaborated on your earlier point on supply and demand in labor markets\n\n>Mexico is a pretty damned good example of economics working great for the corporations while fucking the workers over.\n\nHmmm that’s all wrong. There’s multiple factors at play in Mexico including lack of safety and robust political institutions.",
                                                                                    "score": -1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Blecki",
                                                                                            "body": "I expect people to think. Just a little. But I'll spell it out for you.\n\nHe said that environmental regulations decrease wages because companies have to hire more people.\n\nOkay, that should be enough for anyone to figure this out, but let me lay out the steps he's proposing here.\n\nHire more (increase demand) -> pay less (lower price)\n\nSo why does supply and demand apply everywhere but here? He offers no explanation (its because he's a stooge so invested in keynesian economics that he is literally incapable of seeing his own contradictions, but obviously... that's not in his book.) (And also because he's not looking to explain economics - he's working backwards from \"eeeee regulation bad\" to justify his political bias)",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "idowatercolours",
                                                                                                    "body": "I need to see the quote where he said that companies have to hire more people as a result of environmental regulations. That doesn’t make sense without context. Normally regulations in labor markets would result in companies hiring less people. Now I’m actually curious because this makes very little sense at least the way you described it \n\nLower wages would only occur if either labor supply is abundant or labor demand is low. Supply and demand always apply \n\nMaybe you’re misunderstanding something or misquoting him",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Blecki",
                                                                                                            "body": "Yeah I'm not going to go find his books and read them again.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "idowatercolours",
                                                                                                                    "body": "So you’re not curious if that one passage you read that may face stemmed from a misunderstanding shaped your entire view on economics and may have don’t so erroneously?\n\nTo me it looks like you misread it. Or misunderstood. Because it doesn’t make much sense in the context you explained",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Blecki",
                                                                                                                            "body": "No, I'm not, because my understanding is obviously not based on him.\n\nAnd no, I did not.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "idowatercolours",
                                                                                                                                    "body": "If you don’t think you misunderstood it then go ahead and explain it intelligently. Not “basically this and basically that.” Your explanation didn’t make much sense.\n\nI’m also not sure why you threw in “Keynesian” in there when we’re talking about basic microeconomics not macro. I’m starting to think you never read a book in economics",
                                                                                                                                    "score": 1
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "akcrono",
                    "body": "> \"not caused by greed\"\n\nNo inflation is \"caused by greed\" in the same way no plane crash is \"caused by gravity\".  If anyone ever claimed a plane crash was caused by gravity, they would be rightly mocked for knowing nothing about basic aviation.",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Blecki",
                            "body": "Your analogy doesn't work. Greed and gravity are not comparable.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "akcrono",
                                    "body": "How are they not comparable? They are both constant forces that are applied to their given situation. The cause of the issue results from something that changed elsewhere.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Blecki",
                                            "body": "Let me know when an altruistic planet decides to share some of its mass with the needy.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "akcrono",
                                                    "body": "Ok, if you let me know when companies are less greedy.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Blecki",
                                                            "body": "That's literally the subject of my original post.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "akcrono",
                                                                    "body": "Can you quote me where you described a time when companies were not as greedy?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Blecki",
                                                                            "body": "Me: corporations have always been greedy.\n\nYou: oh YeAh So WhEn WeRe ThEy LeSs GrEeDy SmArT gUy????\n\nYou can understand now why I think poorly of you.\n\nNext your going to ask then, what was different, because if corps were always greedy, then an increase in inflation wasn't caused by their greed; but that is a mistake. The MO of corporations is to take as much profit as the circumstances allow. That does not mean that when the circumstances change, and they take as much as they can, that it's not their fault. It's a bit like your desire to shoot me right now - when I'm over here and you're unarmed, you desire to shoot me just as much as when I'm over there and I hand you a gun. In both cases you do as much shooting as you can. If in the latter case I die, that's still your fault. My death is still caused by your desire to shoot me, regardless of circumstance, just as inflation is caused by corporate greed - regardless of circumstance. Your defense that I'm an insufferable asshole doesn't help absolve you in court for my murder. You don't get to say, well your honor, I always wanted to kill him, my desire to murder this smug son of a bitch who argues circles around me is a constant, so something else must have caused my murdering him rate to go from 0 to 1! I know - it's his fault, for handing me the gun. No, that's not going to work, the judge will laugh at you.\n\nBut I guess in your world it's never corporations fault for being greedy bastards huh?",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Rich_Charity_3160",
                    "body": "Economists at the Federal Reserve used phrases like “not particularly pronounced” for accessibility, not obfuscation. The Fed notes that corporate-profits in the last quarter of 2022 were 15.1% compared to 15.0% at a comparable point in the global financial recovery, for example. Pre-pandemic profits were ~13%.\n\nIf corporate profits behave similarly during economic recoveries, profit rates cannot explain why inflation rates peaked around 3% over a decade ago and soared to 8% in 2022.",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tommy__want__wingy",
            "body": "1) economists will never agree on things\n\n2) any administration/politician can interpret what they will\n\nAnd there is an issue with people not understanding macro and micro economics. \n\nMost importantly from a GLOBAL scale.\n\nEconomies are like networks connected by webs.\n\nIf a web breaks or one economy suffers, it hits others.\n\nFrom my stance politicians appear to take advantage because they cherry pick what’s important to their constituents. \n\nGas went up because of the sanctions on Russian oil.\n\nAnd apparently that’s Biden’s fault. \n\nThey see expensive gas, their congressman says “Biden” and boom it’s the administration’s fault.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "yardaper",
            "body": "I mean, economists never agree on anything.  According to this article, some economists draw this conclusion. What about those that don’t?\n\nAnd the feds conclusion, that the “increase in corporate profits isnt *particularly pronounced* compared with previous recoveries“ could be reworded as:\n\nCorporations always price gouge post inflation cycle, and this time they’ve done it more than usual, but not SO MUCH more than usual as to be egregious.  \n\nLike, hooray?",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "DistinctTrashPanda",
                    "body": "There are plenty of things that the vast majority of economists agree on, and this falls into that category, just like there aren't really any economists that pretend supply chain issues played a role or those that choose to ignore that higher poultry and egg prices were related to Avian Flu more than anything else.\n\n>And the feds conclusion, that the “increase in corporate profits isnt particularly pronounced compared with previous recoveries“ could be reworded as:\n\n>Corporations always price gouge post inflation cycle, and this time they’ve done it more than usual, but not SO MUCH more than usual as to be egregious.'\n\nFirst, \"price gouging\" has a specific meaning, and that's not what he saw over the last two to three years.  Second, companies increase prices during inflationary periods because they expect that the prices of the inputs to their goods and services will continue to be hit by inflation in the coming months, so they take the extra profit as a buffer.  \n\nThen as inflation begins to taper, so do the companies' profit margins, because they don't need that buffer any more, and--as we've been seeing now and in past recessions--the reduction in profit usually and largely is going to employees, getting their wages up to meet or surpass the inflation that the economy had dealt with.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "yardaper",
                            "body": "CEOs got a 9% average pay raise in 2022.  Did workers?   If the price raises you mention as a “buffer” (in other words greed, taking more than you need at the moment in case you need it later) went to workers after the fact, Id like to see proof of that, because nothing Ive seen reflects that.  Cost of living has skyrocketed, workers wages have not kept up.  \n\nThere are a lot of assumptions in your response that I dont really believe flat out.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DistinctTrashPanda",
                                    "body": ">CEOs got a 9% average pay raise in 2022. Did workers? \n\nTo be clear, this nine percent number is from select companies--the 100 most highly-paid CEOs that *also* files data with the SEC--not exactly the most robust cross-section.  On top of that, the 9 percent increase does not refer to pay, but rather remuneration.  This could be from the employer's health insurance premium contribution, it could be reimbursing the CEO for flights (as air travel picked up in 2022), contractually mandated bonuses, etc.\n\n>If the price raises you mention as a “buffer” (in other words greed, taking more than you need at the moment in case you need it later) went to workers after the fact, Id like to see proof of that, because nothing Ive seen reflects that. Cost of living has skyrocketed, workers wages have not kept up.\n\nSure--there's no dearth of information:  while [this write-up](https://www.dallasfed.org/cd/communities/2022/0808) uses nominal wages, they do note that real wages have increased recently, with the biggest gains in wage growth going to the lowest-paid workers.  Even as more current data shows the job market cooling and real wages rising at a more modest rate (but still [rising](https://www.atlantafed.org/chcs/wage-growth-tracker#)), labor is in a much better position than it was two years ago.  \n\nThe rising wages is why we had such a tight labor market and for so long--even as it's loosening, it's still below four percent.  Not every company is going to be content with the status quo--they want the best employees, and will shell out money; they poach from other companies.  Then those have to raise their wages to attract new employees and retain their old ones.  After a time of high inflation, most companies don't have much of a choice but to raise wages.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "yardaper",
                                            "body": "The article you linked seems to suggest that a good portion of that “average nominal rise” is from people quitting because wages were unliveable.  It’s not really a positive story if I’m reading that article correctly, though maybe I’m not.  \n\nCompanies raising wages due to competition implies that there is meaningful competition, something that is shrinking as antitrust suits and regulations continue to dwindle, and corporate oligarchies expand.  \n\nHere in Canada we have not seen wages rise with cost of living, and I suspect it’s the same in the states. That money is going somewhere, and it’s not going to workers as income inequality continues to grow.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DistinctTrashPanda",
                                                    "body": ">The article you linked seems to suggest that a good portion of that “average nominal rise” is from people quitting because wages were unliveable. It’s not really a positive story if I’m reading that article correctly, though maybe I’m not.\n\nNo, they do not suggest that a \"good portion\" is from people leaving work--they merely point out that workforce quits at the lowest level could skew the data.\n\nThey also note that various other factors, such as retirements in the highest quintile could also skew the data.  Retirements, quits, etc. *always* can have an affect on the data.\n\nHowever, as I mentioned, this was an earlier analysis (I thought write-up was pretty good though).  If you look at the data in the other link, you can see that it was generally sustained past the time the article was written--suggesting that the effects of the COVID-era were not the main source for the data, though it obviously played some role.  Even though wages are growing at a slower rate, they are still rising faster than inflation for all quartiles.\n\nCanada is seeing a much softer recovery than the United States in many aspects, and wages have not as much as they have in the US.  It's also worth mentioning that inequality in the US dropped in 2022, and it's believed to have done the same in 2023, though the latter years' numbers have not been confirmed yet, to my knowledge.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "idowatercolours",
                    "body": "Modern day monetary theories  is not really a matter of debate. Most real economists agree on major factors that contribute to inflation, some argue on degree of that contribution. No real economists thinks greed increases inflation. You won’t find that in an economics textbook\n\nEdit \n\nWasn’t referring to MMT was referring to most modern day monetary theories",
                    "score": -3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "yardaper",
                            "body": "Ah, the “no real scotsman” fallacy.  Always enjoy that one.  \n\nHeres a post from Economic Policy Institute on corporate profits role in inflation:\n\nhttps://www.epi.org/blog/corporate-profits-have-contributed-disproportionately-to-inflation-how-should-policymakers-respond/\n\nSo at least some real economists disagree.  \n\n\nAnd to everyone else in this thread who said “it cant be corporate greed, they’re always greedy!”:\n\nWell, we used to have antitrust laws that were enforced (somewhat).  Monopolistic corporations can get away with more now, and they’re testing the boundaries of that more than ever.  Things have changed.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Did you read your own link? Firstly you have to consider the source. You sent me a blog by a guy named Josh Bivens who went The New School: not a reputable school in the field of economics and is known for being breeding grounds for heterodox economic thoughts such as Marxism.\n\nSecondly, even he doesn’t say that “greed”\nIs the primary reason for inflation. \n\n> Supporting such a tax does not mean that a sudden rise in corporate power is the root cause of current inflation,\n\n\nIt’s like me sending you a link to one guy’s opinion and the dude went to Devry university. Try harder",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "yardaper",
                                            "body": "The author is fairly accomplished and well published, that school has existed for over 100 years, his bachelors is from U of Maryland.  What are your credentials?   Why should I trust your opinion on which schools are respected in the field of economics PhDs?",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "I have masters in Econ from a real economics schools not a fake one. \n\nlol Idc if this schools existed for 500 years, the only people this schools produces are activists and policy advocates. You won’t find a CEO or any reputable person in the economics world who graduated that school \n\nIt’s funny how most undergrad and grad schools around the world and the United States use the same economics text books whether it’s Harvard, Chicago school or your local state schools. They used Mankiw’s micro and macro book for undergrad and grad and they use Ljungqvist for grad school. \n\nThe new school reads Karl Marx. No joke.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EchoicSpoonman9411",
                            "body": "Man, conservatives will believe anything as long as it's not true.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "Are you denying the science of economics ?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "EchoicSpoonman9411",
                                            "body": "I'm denying that you are familiar with it.",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Kakamile",
                            "body": "These comments feel like a kid's interpretation of an expert. MMT is an argument about high debt spending, but you're complaining about the years we had lower debt spending and you are a conservative who opposes the tax increases to reduce the debt spending that conservatives did. You also didn't reply to their comment about the wording of the statement in your link.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "idowatercolours",
                                    "body": "I see how this may have seemed confusing. I was not referring to MMT specifically, I meant to say that modern day monetary theory or theories whether it’s MMT, Keynesian, monetarist don’t differ on main factors contributing to inflation. I never inferred that I’m a proponent of MMT and or maintaining high debt/gdp ratios \n\n\n>could be reworded as:\n\n>Corporations always price gouge post inflation cycle, and this time they’ve done it more than usual, but not SO MUCH more than usual as to be egregious.\n\nThat would be rewording of someone who doesn’t understand or denies basic economics. It’s natural for businesses profits to go up following years of thwarted business activity due to regulation or restrictions. I’m not sure where you got the “greed” and price gauging from.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kakamile",
                                            "body": "But then that's changing what greedflation is. Greedflation is a higher cost disconnected from market pressures. Like say if oil production was at a high, and oil consumption was down, and instead of prices naturally lowering the oil companies all said in their own reports to shareholders that they would not produce more and all kept oil prices high after costs dropped and after tripling what they themselves claimed were their 2020 losses.\n\nWhich, as you know, happened.\n\nAlso your article suggests it compared to other similar events and it was in specific markets, not that greedflation didn't happen.\n\nBut also, I still ask why it's conservatives that bring up MMT to complain about even though it more historically matches their own party policies.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "idowatercolours",
                                                    "body": "Your example with oil could potentially hold because oil companies are in many ways oligopolies - players in markets with low competition . But even in their case they have only managed to practice price gauging for extremely short periods of time. Not enough to contribute to inflation. And to demonstrate that all you need to look at is a chart of crude oil prices and weekly retail gasoline prices. They nearly mirror each other. \n\nIn most other markets there is much higher levels of competition as opposed to oil/gas markets. Which drives the prices down to their operating minimum. \n\nI think conservatives have not been great at being fiscally responsible lately. However I disagree that this matches their historic party record. The last Congress that managed to balance the budget was fully republican.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TreebeardsMustache",
            "body": ">\"Federal reserve study concludes “Greedflation” is not a thing.\"\n\n>\n\nThats not what the study concludes.  The study concludes that corporate price gouging isn't a 'primary' driver of the present inflation...   Nowhere does the study say 'not a thing.' \n\n  \n\n\nThere is a  sleight-of-hand going on here... \n\n\n\n>*\"Data for the current recovery show that the increase in corporate profits is not particularly pronounced* ***compared with*** *previous recoveries.\"*\n\n  \n  \n  \nThis is predicated on the assumption that 'greedflation' wasn't a driver for previous bouts of inflation.   It's kinda like saying \"We don't think the problem is as big as all that, since it's no bigger than it was last time...\" which isn't really making any specification of its real size....",
            "score": 5
        },
        {
            "depth": 0,
            "author": "othelloinc",
            "body": ">Federal reserve study concludes “Greedflation” is not a thing.\n\n“Greedflation” never really made sense as a concept.\n\nSure, corporations were greedy in 2021 & 2022...but they were also greedy in 2019 and 2015. Corporate greed is a constant, not a variable!\n\nAny explanation of inflation in 2021 & 2022 would need to point out something that was *different* at that time; not something that was constant before and after.\n\n\n---------\n\n>Biden has blamed “corporate greed” for stubborn inflation rates.\n\nMeh.\n\nRhetoric is not policy. I care more about good policy.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "-paperbrain-",
                    "body": "Corporations are always greedy, yes. \n\nBut customer sentiment and competition generally acts as a check on them raising prices arbitrarily. Coordination across industries is illegal. So they can't all agree together to fleece the customers by raising prices and not undercutting each other.\n\nBut when newsworthy major events happen, they can use that as a market signal to coordinate without coordinating. I don't think it's a stretch at all that many sectors which have near oligopolies took the scarcity coming out of pandemic restrictions and flow of government funds along with the rising global oil prices and shortages caused by the war in Ukraine all together as a starter pistol. \"Hey we can really gouge now and no one will think badly of us because it's just inflation. They'll blame the government!\"\n\nIt's not that greed is a variable. It's that world events allow greed an opportunity to run amok.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FenderMoon",
                            "body": "This was certainly a factor. It wasn't really price collusion, it was more of a \"well, the world is going haywire, we have 8,000 new problems and supply chain shortages going on, let's tack on a surcharge or a price increase to compensate\", and then everybody starts doing it. Soon prices started to increase for products where there weren't even shortages when people were willing to pay those prices.\n\nCouple that with significant pent-up demand following the lockdowns, and we now have demand that is higher than pre-pandemic levels, coupled with less supply than before (a perfect storm for high inflation), along with some labor market disruptions. A lot of people (not everybody, but many) had more money to spend than before (from raises, unemployment/government-assistance programs, shifts in labor demand and sharp increases in tech hiring, increased liquidity from the feds being pumped into various parts of the economy, etc), and that meant that there was less market resistance to price increases than there was before.\n\nIt was a perfect storm. More demand coupled with less supply created macroeconomic conditions that were ripe for inducing lamentably sharp price increases. Inflation didn't really settle down until there was enough market pressure from price increases to eventually create a drop in demand, in tandem with improving a lot of the supply chain issues that were a major catalyst to this whole situation to begin with.\n\nQuite a lot of it was covid-induced.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "-paperbrain-",
                                    "body": "None of what you said is exactly wrong.\n\nBut even through all of those factors I think what persists is that a lot of major corporations raised prices and experienced record profits. I'm not convinced that their competition didn't have the price latitude to keep their prices lower and undercut those who raised them enough to make those records. There was scarcity but that scarcity and pent up demand was short lived compared to the continuing price hikes. The usual forces of companies keeping prices in check through competition was short circuited.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FenderMoon",
                                            "body": "I see what you’re saying, but corporations have kind of always done this. Given no downward market pressure, there are plenty of corporations that would raise prices infinitely if they could. Competition, demand, and all sorts of other things are what prevent this from happening. \n\nThe balance was shaken violently with the economic equivalent of a category 5 earth-rattling hurricane, and corporations responded by doing what corporations have always done. I don’t think we disagree, there was certainly a lot market sentiment that contributed significantly to this, but it wasn’t like all of America’s corporations met together some secret room and said “guys let’s all just decide to all raise our prices” \n\nI think that we are in agreement on the general sentiment that led to a lot of this, but it was more of a response to a significant change in the balance of macroeconomic conditions, not so much deliberate collusion.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "-paperbrain-",
                                                    "body": "Yes, we're probably mostly in agreement. I don't have any reason to believe corporations had any explicit agreement to all raise prices together. But I do think there was a natural understanding that the rising tide could lift all of their boats at the expense of the consumer.\n\nSimilarly, landlords don't talk to each other about rents, but they now largely use the same couple pricing apps to keep their prices as high as they can. It isn't literal price fixing, but the effect is the same.",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "FenderMoon",
                                                            "body": "Yea, I think that's what it was. A sort of natural and mutual understanding, and people just sort of were like \"well, if the market is doing it, we're gonna do it too.\" It's the sort of thinking that the corporate world has always had, but covid sort of unleashed pandora's box of opportunistic thinking on the side of wall street. Combined with supply chain problems, it resulted in a mess of inflation.\n\nWith regards to price fixing rents, in Arizona, there is in fact a lawsuit against several landlords who tried to do exactly this. They managed to price fix nearly 15% of the entire rental market, and the regulatory bodies are finally going after them for it. Price fixing is a really big deal, it's something people can face big fines and long prison sentences for doing.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> > Any explanation of inflation in 2021 & 2022 would need to point out something that was *different* at that time; not something that was constant before and after.\n\n> ...when newsworthy major events happen, they can use that as a market signal to coordinate without coordinating.\n\nThere you go!\n\nThat is already a better explanation than just  “corporate greed”.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "-paperbrain-",
                                    "body": "Sure, but the underlying reason is still \"corporate greed\". And it's sort of the important reason to keep in mind both for public perception and for policy.\n\nThey get away with it precisely because they don't lose consumer loyalty because they're able to disguise the price rises as necessary due to increased costs.\n\nAnd as far as policy goes, we can't regulate away the events that led to the starter pistol, but we have more options to put checks on corporate behavior based on the understanding that they're acting out of greed.\n\nI think Biden's rhetoric is on point.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Skabonious",
                                            "body": ">Sure, but the underlying reason is still \"corporate greed\".\n\nBlaming a problem on an immutable characteristic or phenomenon will not solve the problem. **Policy** solves the problem. \n\n>And as far as policy goes, we can't regulate away the events that led to the starter pistol, but we have more options to put checks on corporate behavior based on the understanding that they're acting out of greed.\n\nWhat would those options look like? The \"understanding of them acting out of greed\" has been known since corporations have existed.",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "SuperSpyChase",
                                    "body": "It's words that mean \"corporate greed\".\n\nYou mention the oil price-fixing in another thread of this post. That is also corporate greed.\n\nFeels a lot like \"you called it a dangerous weather event but actually it's a hurricane\". One is more specific than the other but the first one isn't wrong.",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "othelloinc",
                    "body": ">What do you believe is causing the current persistent inflation?\n\nPossible explanations:\n\n* **Increases in the cost of labor in China:** We all got addicted to cheap manufactured goods from China, but the cost of labor there has been increasing at a rapid clip. It is almost *inevitable* that we would face higher prices as a result.\n* **Inflation Expectations:** Bizarrely, one thing that causes inflation is the [expectation](https://old.reddit.com/user/othelloinc/) of inflation.\n* **Demographic Changes (labor):** As the Baby Boomers enter retirement, the workforce is losing our biggest generation ever; we should expect a drop in productivity as a result.\n* **Demographic Changes (capital):** Also, those of them with retirement savings are probably moving into risk-averse investments. That could lead to decreased investment where it is needed most. Imagine a businessman saying 'the price of X is so high, right now; I should invest in producing more X' but struggling to find the money to make that investment.\n* **Housing is the everything problem:** More people and jobs are in denser urban areas, and near-zero of them have built enough housing to meet demand. Until the housing supply increases, that problem will persist.\n* **Service sector wages are increasing:** The low unemployment rate is leading service-sector employers to raise wages in an attempt to outbid each other. (This is arguably a good thing, but it will almost certainly raise prices to some extent.)\n* **Strong job growth:** Low unemployment means everyone has money in their pockets. The more money we have, the more likely we are to still buy something, even after the price went up!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "hitman2218",
                    "body": "Corporate greed is easier to get away with when everyone expects prices to skyrocket. And on the whole we have been conditioned to always blame government when things are going badly.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "othelloinc",
                            "body": "> Corporate greed is easier to get away with when everyone expects prices to skyrocket.\n\nInflation expectations are a cause of inflation!\n\nThis is a direct quote from the [Reserve Bank of Australia:](https://www.rba.gov.au/education/resources/explainers/causes-of-inflation.html)\n\n> #Causes of inflation\n\n>The main causes of inflation can be grouped into three broad categories:\n\n> 1. demand-pull,\n> 2. cost-push, and\n> 3. inflation expectations.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "hitman2218",
                                    "body": "Right. Like I said, if people are expecting prices to skyrocket then corporations can get away with jacking up their prices accordingly. The average person has a very rudimentary understanding of how the economy works. It’s just easier to blame government for everything.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PowerfulTarget3304",
                                            "body": "So how do you differentiate increases due to expected inflation vs greed?\n\nWe should be looking at net margins right?",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "hitman2218",
                                                    "body": "Look at different metrics like the Producer Price Index vs. the Consumer Price Index. June of 2022 was the peak of inflation. What happened after that?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "PowerfulTarget3304",
                                                            "body": "But the margin is the summary of that. Can’t we just look at the margins?",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "hitman2218",
                                                                    "body": "I guess so, yeah.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "PowerfulTarget3304",
                                                                            "body": "From that perspective I don’t see evidence of the greedflation. Margins bumped up a bit in 2021/22 but are back to normal. That seems more like anticipation to me.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "hitman2218",
                                                                                    "body": "What is a bit?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "PowerfulTarget3304",
                                                                                            "body": "A few percentage points. The point is that prices didn’t go down but the margins went back to normal. That means they were anticipating the current level of inflation.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "hitman2218",
                                                                                                    "body": "There’s also the shrinkflation aspect of it though. We aren’t just paying more. We’re paying more for less.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "PowerfulTarget3304",
                                                                                                            "body": "That's still covered by margin.  It sucks that they do it, but that specifically isn't so much greed as it is manipulation marketing if the margin is the same.",
                                                                                                            "score": 2,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "hitman2218",
                                                                                                                    "body": "The “margin” isn’t the same for the consumer. We’re getting less for our money.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "PowerfulTarget3304",
                                                                                                                            "body": "But the company isn’t making more money. They are selling less to keep the price lower and therefore making less per unit than they would have if they raised the price to keep the margin the same. \n\nIf the margin stays the same it reflects that their costs went up the same amount proportionally.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "hitman2218",
                                                                                                                                    "body": "No. They’re selling less to increase profits. Think about it. If my bag of Doritos was 18 ounces a year ago but now I’m paying the same price for a bag that’s only 15.5 ounces, that means more trips to the grocery store and more bags of Doritos sold.\n\nIt’s not a coincidence that so many companies have raked in record profits the last few years.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "PowerfulTarget3304",
                                                                                                                                            "body": "You skipped a step. The corn to make the chips and the spices all went up in price.  Add to that the cost of the workers at the factory and in the transportation. They chose to reduce the amount in the bag rather than increase the price. If their margin stayed the same then they aren’t making more money per ounce than before. \n\nRecord profits is misleading. You need to normalize them with inflation otherwise you’d expect them to make record profits every year of all things were stable.",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                    "body": "They did both. They reduced the size and increased the price.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "PowerfulTarget3304",
                                                                                                                                                            "body": "Ok? The margin is the same. Where is the greed?",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                                    "body": "I don’t buy that profit margins haven’t increased.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "PowerfulTarget3304",
                                                                                                                                                                            "body": "https://www.macrotrends.net/stocks/charts/PEP/pepsico/operating-margin\n\nDoritos are in PepsiCo. Their margins are actually lower.",
                                                                                                                                                                            "score": 1,
                                                                                                                                                                            "replies": [
                                                                                                                                                                                {
                                                                                                                                                                                    "depth": 21,
                                                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                                                    "body": "Yes, a few companies have reached the point where prices are hurting sales. So like McDonalds they’ll throw us a bone with a one month promotional deal.",
                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                    "replies": [
                                                                                                                                                                                        {
                                                                                                                                                                                            "depth": 22,
                                                                                                                                                                                            "author": "PowerfulTarget3304",
                                                                                                                                                                                            "body": "Your example was Doritos. They have lower margins. \n\nWho are you talking about then?",
                                                                                                                                                                                            "score": 1,
                                                                                                                                                                                            "replies": [
                                                                                                                                                                                                {
                                                                                                                                                                                                    "depth": 23,
                                                                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                                                                    "body": "I just used them as an example off the top of my head. I didn’t research them lol",
                                                                                                                                                                                                    "score": 1,
                                                                                                                                                                                                    "replies": [
                                                                                                                                                                                                        {
                                                                                                                                                                                                            "depth": 24,
                                                                                                                                                                                                            "author": "PowerfulTarget3304",
                                                                                                                                                                                                            "body": "Right. My point is you thought they would have been doing greedflation. Odds are the report is right and there isn’t much of any.",
                                                                                                                                                                                                            "score": 1
                                                                                                                                                                                                        }
                                                                                                                                                                                                    ]
                                                                                                                                                                                                }
                                                                                                                                                                                            ]
                                                                                                                                                                                        }
                                                                                                                                                                                    ]
                                                                                                                                                                                }
                                                                                                                                                                            ]
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        },
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Skabonious",
                                                                                                            "body": "Shrinkflation is accounted for when looking at margin.\n\nIf a company is selling 12oz of oats for their old 16oz price, their margin will naturally increase.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "hitman2218",
                                                                                                                    "body": "Naturally.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Skabonious",
                                                                                                                            "body": "So if a company's margins have *decreased* or stayed relatively the same, we can safely assume 'shrinkflation' is not really having a very significant effect on inflation",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "hitman2218",
                                                                                                                                    "body": "All these record profit years have me questioning if the margins really decreased or stayed the same.",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Skabonious",
                                                                                                                                            "body": "Does record profits mean anything if inflation has lowered the relative value?\n\nAlso, you can reach record profits while having the same margins. If you have a lemonade stand that normally profits $100 at the end of the year, but this last year you hit $200 profit, it could just mean you sold twice as much lemonade...",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "hitman2218",
                                                                                                                                                    "body": "Sure, that could happen if you kept the price the same. But that isn’t happening.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "Skabonious",
                                                                                                                                                            "body": "Again, raising the price while having your expenses rise with it means you essentially have the exact same profit margin. Why are we re-treading old points here",
                                                                                                                                                            "score": 1
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "akcrono",
                    "body": "The analogy I always liked was claiming greed causes inflation is like complaining gravity causes plane crashes. Yes, it's accurate in a literal sense, but it's also useless and says more about the person's understanding of causal forces more than anything else.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "secretid89",
            "body": "To add to these comments:   It should be remembered that supply chain issues are still a problem, because of:\n\n\n(1) The Ukraine/Russia war\n\n\n(2) There are countries where people have yet to see their 1st Covid vaccine!   As a result, people are dying (meaning fewer workers), or getting sick (also meaning fewer workers at a time).  \n\n\nTo be clear, inflation is ALSO an issue, as mentioned in other comments.  Both can be true:  inflation AND supply chain can be issues.  \n\n\nAnd reminder that inflation is a WORLD WIDE problem!   Biden did not cause inflation in Canada and much of Europe!   It doesn’t work that way.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Menace117",
            "body": "OP do you accept their results inflation is not out of control anymore",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "CoatAlternative1771",
                    "body": "Very few people trust their results.\n\nEspecially since they are talking about raising interest rates because inflation isn’t where they want it to be.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Menace117",
                            "body": "So why do you trust their point about greedflation. Seems convenient",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CoatAlternative1771",
                                    "body": "Where did I say I trust their point about greedflation?",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BlueCollarBeagle",
            "body": "> Of course most economists will tell you inflation has nothing to do with that\n\nWhat is your understanding of what \"most economists\" is.  How many have you asked?  What was the breakdown?    \n\n\nFrom the article:  \"Data for the current recovery show that the increase in corporate profits is **not particularly** pronounced compared with previous recoveries,\" the San Francisco Fed researchers wrote. \"Markups also have **not played much of a role** in the slowing of inflation since the summer of 2022.\"\n\n&#x200B;\n\nWhat we have here is a normative argument.   Not particularly, not much....  \n\n\nCan you support your statement that there is none, that greedflation is not a thing?   All you have posted it that some economists you are aware of do not feel it's that bad.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "The news cycle caused inflation. They constantly talked about it as soon as biden was elected, and it became a self-fulfilling proficy. But it keeps people watching your channel/programming. Inflation is a made-up thing that happens to a made-up thing.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "CoatAlternative1771",
                    "body": "The news cycle didn’t cause inflation.  This shit was happening under trump lol.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Odd-Principle8147",
                            "body": "When?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "srv340mike",
                                    "body": "He's right. [Inflation in the Trump years was markedly higher than during the Obama years](https://www.usinflationcalculator.com/inflation/current-inflation-rates/)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Odd-Principle8147",
                                            "body": "That's irrelevant to the money that the trump administration put into the country for covid. A 3.5% inflation rate is more than manageable, and consistent inflation around 2% is actually good. It shows an economy in growth. There is no reason the stimuluses or covid bailout need to cause inflation. It was a narrative pushed by media until it was true.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "srv340mike",
                                                    "body": "I don't disagree with you. I'm just saying it's not wrong to say inflation trended up under Trump.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Odd-Principle8147",
                                                            "body": "It's not technically wrong. It's just irrelevant to the question OP asked. It would be like me saying this all started with the collapse of the Brenton Woods System or the OPEC oil embargo. Technically, that statement has truth. But It's irrelevant to what we are currently discussing. Why not say this all started when currency was invented?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "srv340mike",
                                                                    "body": "Yes, I agree with that. \n\nIt's all a very complicated system, and economics is a far, FAR softer science then a lot of its' proponents like to believe.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CoatAlternative1771",
                                    "body": "You think Trump shoving trillions into the economy had nothing to do with inflation?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Odd-Principle8147",
                                            "body": "Show me the data set.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CoatAlternative1771",
            "body": "Greed has been happening long before 2020.\n\nThe most common way before 2020, was that the price stayed the same but the sizes were shrinking.\n\nNow the sizes are shrinking AND the prices are going up.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "IamElGringo",
            "body": "I don't believe it",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IamElGringo",
                            "body": "I never said it was anything new",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "Menace117",
                            "body": "Do you believe the data that says the economy consistently does better under Dems compared to republicans?\n\nOr that the tax scam act increased inflation and our national debt?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Menace117",
                                            "body": "Where did I say you were a republican\n\nIt's to see if you accept other economic data or just the ones that fits what you want",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Kakamile",
                                                    "body": "It's not OP replying to you. You gave a question and OP didn't reply, it's someone else who can hold a different argument to attack Dems while not having endorsed OP's link.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Menace117",
                                                            "body": "If you read my last comment you'll see. Please read",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "akcrono",
                                    "body": "Not sure what this has to do his point at all.  I think democrats are 1,000,000x better than republicans and also think the concept of \"greedflation\" is nonsense.",
                                    "score": 0
                                },
                                {
                                    "depth": 3,
                                    "author": "Obvious_Chapter2082",
                                    "body": ">believe the data that says the economy consistently does better under Dems\n\nYou mean the data that compares it by President without adjusting for any other factors? You can “believe” the data without drawing that ridiculous conclusion from it\n\n>Or that the tax scam act increased inflation \n\nWhat data are you seeing for this? Per the CBO, the TCJA had a negligible impact on inflation",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sad_Lettuce_5186",
                            "body": "Maybe they want Trump to win and skew the economy more in their favor?",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zeddo52SD",
            "body": "During the beginnings of recovery, it makes sense, and for some goods or services the price increases are reasonably related to increases in expenses right now. Various things keep having supply issues that are affecting the cost at the original point of production. \n\nFor housing costs though, that was pure market driven greed, especially rental price increases. There are certainly circumstances in which prices were increased due to demand without any significant change in supply and no problems keeping things in stock in spite of higher demand.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "hammertime84",
            "body": "Low interest rates for a long time, enormous amounts of stimulus put into the system around covid (PPP + govt debt spending), and low taxes all combine to drive inflation. \n\nWhen we had a supply shock with covid, that made it all blow up and gave us 2-3 years of really high inflation that has mostly tapered off now. We also had some additional energy inflation that was seemingly market manipulation/greed, and we will likely have higher food and energy inflation going forward due to climate change.\n\nThe tapering is slowed because things like housing have long-term impacts on inflation, intentionally because they did not want to include rapid house price fluctuations in inflation metrics for a variety of legitimate reasons.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "twistedh8",
            "body": "Global inflation? You really don't know?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "srv340mike",
            "body": "Some of it is higher commodity prices, particularly oil, but even things like grain have been going through some price weirdness the last few years. Some of it is low unemployment. There was a bunch of COVID related, transient, unusual circumstance (\"pent up demand\", economic dropoff and snapback, stimulus, etc), but that's largely passed. Some of it is ALSO corporate greed - the Fed's conclusion that \"greedflation\" wasn't \"particular pronounced\" compared to previous instances *doesn't mean it didn't happen, it just wasn't that egregious\"\n\nInflation has tapered off quite a bit, but is still slightly higher than normal. The current 3.5 isn't alarmingly far off the 'norm' of around 2 we had 2016-2019, and is far less that the 7-ish we have 2021-2022. That also lines up with the aforementioned transient, COVID-unique circumstances we had in that period.\n\nEconomics isn't a hard science. It's not input -> output or action -> expected resulted the way something like chemistry or medicine is. It's a big, complicated machine with a lot of factors. Government spending is part of it, the deficit is part of it, external pressures (i.e. geopolitical pressures) are part of it, consumer sentiment is part of it, unemployment is part of it, the in-elasticity of certain products/goods/services is part of it. There's a general balancing act the fed does of growth/unemployment vs inflation, and its the end result of a lot of things. In general, if productivity doesn't keep up with the printing of currency, you'll get inflation, but some of it is still natural and 3.5% vs a 2% target really isn't bad. You can still have the government spend and not get unusual inflation - general economic productivity just has to keep up with minting of currency.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lannister80",
            "body": "What *was* causing the the inflation?\n\n\"the combined effect of supply chain disruptions and a drop in labor supply during the post-pandemic recovery that occurred just as consumer demand rose.\"\n\nWhich is mostly gone now and we're \"back to normal\" inflation, more or less.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheManWhoWasNotShort",
            "body": "Realistically, the supply chain disruptions from COVID and subsequent dramatic changes in supply caused inflation in the short run and we have yet to get it fully under control since.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ZeusThunder369",
            "body": "I don't understand why this is such a mysterious and controversial topic.\n\nIf production shuts down while at the same time money is artificially introduced into the economy (and no, I'm not talking about relief checks) , inflation will be the result.\n\nAn argument about whether or not the action was warranted would be valid. But this current narrative of corporate greed, and whatever Trump has been talking about lately is just dumb.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "03zx3",
            "body": "Yeah, I'm not going to sit here and pretend that my employer hasn't jacked prices willy nilly the last few years while doling out pitiful wages and bragging about record profits just because the Fed says otherwise.\n\nSix years ago, a car battery with a 2 year warranty was $109. Now it's $189 for the same battery and  that price jump happened with the supply chain issues and hasn't once went back down.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Certainly-Not-A-Bot",
            "body": "There is not current persistent inflation.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "To-Far-Away-Times",
            "body": "I think Door Dash/Grub Hub played a big part in it. Executives realized what people were willing to pay for low quality fast food with up charged prices plus delivery plus tip. Hard not to look at that and adjust their pricing strategies accordingly. Fast food was like the barometer of price sensitivity, where companies fought to keep prices low. It went out of control after the delivery apps.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Blueopus2",
            "body": "The same fed study that concludes there isn’t current persistent inflation?\n\nI think inflation is slightly above the target because expectations for inflation remain high after the events of the last few years (the supply chain issues), as well as the velocity of money returning closer to normal before the money created during covid has been destroyed.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheCryptonian",
            "body": "Do you admit that greedflation was a fairly recent thing with corporations all over making records profits in the last few years even if it's not there currently? If greedflation raised prices relatively recently, and now everyone else caught up and they stagnated, then greedflation was still the cause, but everyone else has since raised prices to compensate for it.... current persistent inflation.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "chemprof4real",
            "body": "Retailers are lowering prices now because they are conceding that they needlessly raised prices so high that it’s now hurting their businesses. They are literally admitted that greedflation is real: https://www.washingtonpost.com/business/2024/05/24/grocery-prices-falling/",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ElboDelbo",
            "body": "Politicians using easy-to-digest talking points rather than explicitly breaking down the issue?\n\nWho woulda thought!?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lsda",
            "body": ">Do you think our politicians take advantage of this fact and spew talking points that make no scientific sense (in this case from the standpoint of economics) \n\nYes. I do. It was very clearly something a lot of people believed for some reason (especially here on Reddit) and politicians ran with it. But breaking greedflation down, the idea that corporations suddenly became greedy during the pandemic was always kind of silly. \n\nI disagree with you that we have persistent inflation. 12 month Inflation is down to 3.4% for April. Inflation was up due the supply chain issues caused by the pandemic. It was a global phenomenon. \n\nMost people do not understand that inflation never goes back down (nor should it that would break our economy) people feel like inflation is still a thing because they're still comparing prices to pre-covid levels. It will take a while before consumer spending habits adapt to the new economic conditions.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "loufalnicek",
            "body": "Yeah, companies try to maximize profits. Breaking news.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "Meh. Outside of a couple of concrete examples like that oil price fixings scheme, greedflation is generally something I see actual economists dunking on as a concept. Is there some using inflation to cover pricing increases? Probably. But it’s not huge and will work itself out. Plenty of goods are easily substituted so there’s only so far you can push it before a competitor decides to go the other way and Steele market share and brand loyalty.\n\nHowever, it’s politics. If the administration or more importantly, the campaign thinks it’s a winning message, they’re going to go with it.\n\nAnd they should given how economically ignorant most voters are. Most voters apparently think we are in a recession and unemployment is at all time highs. Meanwhile, we are not in a recession, the economy is actually doing great outside of inflation which isn’t out of control anyway unemployment is super low. Plus Income inequality is down mostly because the biggest gains have been seen among low income workers.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Public_Gap2108",
            "body": "I know this will be unpopular here, but even as a left leaning person, I can't help but think that a lot of Biden's rhetoric on the economy is mostly lies. I don't think the inflation is due to price gouging. Although, I don't really think it is completely Biden's fault either. \n\nAlthough, I will say, most of the American public doesn't understand a lot of things. Economics is just one of them that I think neither Republican or Democratic voters are really good at understanding.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Roombaloanow",
            "body": "The fact that we just kept printing more money without increasing gross domestic production. In fact the USA has become such a service economy that talking about manufacturing and farm goods got very niche, politically speaking.  People blaming corporations for inflation just haven't been paying attention.  It wasn't even the bailouts, it was an increase in monetary supply for years.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "fttzyv",
            "body": "Of course \"greed\" is not the explanation.  It's a constant not a variable; you can only use greed to explain inflation if you think corporations *weren't* greedy in 2019.\n\nInflation is a reduction in the value of money.  Like anything else, money is subject so supply and demand forces, and so most inflation is mostly caused by an expansion in the supply of money.  There was a [big spike](https://fred.stlouisfed.org/series/M2SL) in the money supply as part of the COVID response and that led to a predictable decline in the value of money (i.e., inflation).\n\nThe other big component of inflation is the similar [spike in government debt](https://fred.stlouisfed.org/series/GFDEBTN).  There's an extremely closely match between [the rise in government debt](https://www.grumpy-economist.com/p/fiscal-tidbits-part-1) and inflation.  The simple version of the explanation here (though there's a much lengthier version if you want to get into it) is that there's a constant temptation to repay government debt via inflation rather than taxation, so increases in debt tend to generate increases in inflation.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "YouAggravating5876",
            "body": "Corporations have always been greedy… this isn’t the cause of inflation",
            "score": -2
        }
    ]
}