{
    "title": "Liberals and progressives, were any of you ever on the extreme far-left (e.g Marxist, communist, anarchist, socialist, etc...)?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "The following is a copy of the original post to record the post as it was originally written.\n\nThe general trend in leftist circles is that many of them were former progressives and liberals who are now socialists (the kind that think social democrats are also capitalist pigs and that Norway/Sweden are imperialist countries). I'm interested if any of you used to be on the far-left but have no shifted back to being a progressive Democrat/liberal, and what made you switch.  \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/AskALiberal) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Arthur2ShedsJackson",
            "body": "No. I was always called a capitalist pig by my leftist friend and a dirty communist by my right-leaning friends, always semi-joking. Starting in 2015 and thereabouts, the right-leaning friends started meaning it and getting angrier, to the point they're no longer friends.",
            "score": 25
        },
        {
            "depth": 0,
            "author": "ButGravityAlwaysWins",
            "body": "I'm old enough that the experience is basically the opposite, basically what you are asking in the title and not body. Lots of people I know used to be more on the extremes in their early 20s. I was a right libertarian and had a lot of libertarian friends along with a few socialists. I'm still in touch with most of them and they are all pretty mainstream democrats or Never Trump Republicans. The two exception are people that have completely dropped off our social circles.\n\nTalking to people between roughly 35 - 65, that seems to be a common experience.\n\nI don't think it's to be unexpected. Those earlier years are when people are thinking about and playing with their identities the most.\n\nThere is a phenomenon where people that are very far right or far left will change their ideology but completely reverse to another extreme.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "Punkinprincess",
            "body": "I agree with the end goals of the far left but I believe we can get there by continuing to take steps in the right direction. I don't believe we can get there by rapidly destroying our country and expecting a revolution to happen with all the policies I agree with. So the far left thinks I'm a liberal and liberals think I'm far left.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Minimum-Piglet-1025",
                    "body": "FWIW communists don’t think it’s either/or. In fact, Rosa Luxemburg wrote a piece titled, “[Reform or Revolution](https://www.marxists.org/archive/luxemburg/1900/reform-revolution/ch01.htm)” which argues for both.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sleep_On_It43",
            "body": "I was a Reagan Republican. My parents were Republican, I didn’t know much about politics, so I just followed their lead. I turned 18 in 1983 and my first presidential election was Reagan ‘84. By the end of GHWB’s administration, I realized what a scam supply side economics is. That all it does is make the rich richer and does less than nothing for working people…so, I became what the modern day right calls a “RINO”.\n\nI didn’t change parties, but I voted almost exclusively Democratic….this lasted up until the Tea Party morons gave us a glimpse of the future of the GOP. They were disgustingly vitriolic, filled with hate and bigotry and I didn’t want to be part of it anymore. So I finally made the switch before the 2008 election and didn’t look back.\n\nWhen you look at how the GOP has turned itself into a hate filled cesspool? I feel extremely justified and happy with my choice.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "pablos4pandas",
            "body": "If you consider socialism far-left then yeah",
            "score": 4
        },
        {
            "depth": 0,
            "author": "tonydiethelm",
            "body": "Nope. I was a libertarian when I was 14, then I grew up and learned more. \n\n\nI want a post scarcity society. I want the socialist ideal. \n\n\nI just want it to actually work and realize I am stuck in this system now and have to do what harm minimization I can. \n\n\nI'm far left + realpolitik. So, liberal.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Cleverdawny1",
            "body": "I was a socialist for a hot minute after I read The Jungle by Upton Sinclair.  Yes, I'm like the only person who got the anti capitalist message from that book.\n\nThen I graduated high school though.  Had a libertarian phase, grew out of that, became a progressive and then have moderated since 2016.  Now I'm here",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "53rp3n7",
                    "body": "He missed your stomach",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Cleverdawny1",
                            "body": "Ikr\n\nTbh that book made me hungry",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FeJ_12_12_12_12_12",
            "body": "A friend of mine was an openly Marxist when he was younger. I was a neoliberal when I was younger. \n\nIt all fundamentally and seriously changed when we got in college. \n\nMy friend saw the marxists there and - I'll use his phrasing - \"what kind of people they associate themselves with\". He basically turned, to say it once more in his words, an \"anti-woke\" Marxist. When we met with each other and spoke about politics, I always pointed at the contradictio in terminis and now he's slowly moving toward the centre-left. \n\nI, myself, pulled more toward the rightwing. I was originally a neoliberal but slowly evolved, by becoming more and more aware of certain fields, to the rightwing. I'll be the first to admit I flirted with the radical right. Was it truly my opinion? No. Was it me trying to shock others? You may bet your ass. I become more moderate when I entered college, having to discuss what I think and people that would question what I said. It was a rough/rude awakening, but necessary. \n\nIt firmly dragged me from populism and radicalism, and toward what I am now: a conservative. I would place myself between the centre-right and rightwing, but I have rejected 1) populism and 2) radicalism. \n\n My other friends went the same route as me: They went from neoliberalism to conservatism in varying degrees. The radical right never gained as much ground with them, as they weren't exploring politics as much as I did.\n\n----------------------------------\n\nBased upon my experiences, most younger people will become more radical and they're much, much more prone to fall for revolutionary, radical rhetorics. After a few years, when they've seen enough of the world and when they've had to actively debate their positions, they moderate and it  ends in either centre-left to leftwing or centre-right to rightwing.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Admirable_Ad1947",
                    "body": ">My friend saw the marxists there and - I'll use his phrasing - \"what kind of people they associate themselves with\n\nWhat kind of people did they associate with?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FeJ_12_12_12_12_12",
                            "body": "People who openly confessed they wanted a cultural revolution similar to Mao's, they wanted to deport the Jews out of Israel, they didn't recognize the millions and millions of deaths committed by the Soviet regime,... You even had someone that implied it would be better for people like me to be \"re-educated\" similar to the Uyghurs because I dare to be conservative. He contributed this to \"woke-ism\", which I tried and succeeded to debate him into the centre-left and leave the far-left behind.\n\nI'll be honest with you, I've seen enough of the far right and far left to be disgusted by it. There's a reason I put most Marxists (even though their ideological roots with Engels/Marx/Bachunin are interesting to read) in the same category as QAnon/ radical MAGA's (where I've met people that tried to deny, after a couple of beers, the Holocaust and joked about the fact we should reopen the camps for \"certain people\", very vague and \"joke-killing\" if you continued to ask whom he meant).",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "washtucna",
            "body": "It's hard to say. My politics haven't changed too much. I think the far left has grown much larger and more vocal since i was in school (90s-2000s) but was near its nadir in the cold war/post-countercultural era of the 70s/80s/90s, but I used to be a small government/pro LGBT type (am still pro lgbt) but I've moved to believing in what technically counts as a sort of socialism. I think all businesses should have some form of constitution that allows employees to have some decision making power, some ownership powers, and share in both profits and losses. While I favor unions, I think having everybody's interests aligned makes for a stronger & more prosperous society overall. And yes, I do believe in the necessity of social programs and especially universal Healthcare, as well as all sorts of environmental stances (anti-greenhouse primary among them). But my personality and desire for society is rooted in democracy, diplomacy, and compromise, so I'm more characteristically liberal.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Odd-Principle8147",
            "body": "When I was young. That's why I have sympathy for young people.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SiebenSchl4efer",
            "body": "I used to be a socdem as a teenager. I only grew more radical the older I got. (I'm over 30)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "NatMapVex",
            "body": "I was long interested in social democracy and slowly in marxism until I took a trip through the socialist and anarchist subreddits. A half-hour was enough to turn me off",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ElboDelbo",
            "body": "I considered myself a socialist when I was in my 20s, but I mellowed out in my 30s and now at 40 I'm pretty much middle-of-the-road liberal.  \n\nI started seeing some holes around 2016 and it finally broke for me in 2020, when a lot (NOT ALL) of the far left were calling black voters in South Carolina \"low information voters\" because they went for Biden over Bernie in the primaries.  The near-pervasive attitude of it danced around \"Well, if black people listened to us, they'd be better off\" type discussion that really rubbed me the wrong way.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "GimmesAndTakies",
            "body": "Depends on the issue.  Some I'm not super left at all or overblown and some issues are hills I'd die on.  I'm not sure any of those decisions put me solidly into any lefty category.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "serephita",
            "body": "I was more centrist/slight lean towards liberal and as I grew up (mainly by the first election I could vote in, Kerry vs Bush) and saw more of the world plus seeing everything with Iraq, the more liberal I have become. My parents have become more conservative, but still consider themselves to be liberal (pretty sure my mom was more of a socialist at one point, but definitely not anymore).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jon_hawk",
            "body": "I don't know if I was ever \"far left\" but I considered myself a socialist during much of my 20s. I work in progressive community organizing and, as you can imagine, there are a lot of lefties in my line of work who influenced my thinking. As I got older and dug a bit deeper, I started to see how socialism hasn't really worked in practice and that countries I assumed were \"socialist\" actually have well-regulated market economies with strong social safety nets.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "saturninus",
            "body": "I read a lot of anarchist literature in college, but I never considered myself anything more than an intellectual anarchist—I never thought it was practicable ideal. Today I'm not even sure I think that's true: I don't want to debate and vote on every damn little thing. And most people are way less political than me.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jukeyb",
            "body": "Kinda. Grew up with normie lib parents, wanted to feel edgy and swung hard left in my teen years. College, work, and the mess of 2016 pulled me back into normie libdom.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "letusnottalkfalsely",
            "body": "I was an anarchist for about 6 months in high school.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fugicara",
            "body": "I used to be on the right and my view of communism was \"this is the ideal society but it would never work in practice.\"  Now that I'm a leftist, my view of communism is \"this is the ideal society but it would never work in practice.\"  But now I have a lot more actual reasoning behind my positions, while when I was a right-winger it was basically just vibes and religious beliefs.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Minimum-Piglet-1025",
            "body": "> The general trend in leftist circles is that many of them were former progressives and liberals who are now socialists…\n\nI’m not sure this is entirely true. Technically you could say I moved from liberalism/progressivism into socialism/communism - but my politics has shifted from conservatism (I voted for Bush when I was old enough to vote) to a brief stop in liberalism and on through to communism.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hockeynoticehockey",
            "body": "When I was in my 20's and 30's I was totally down with capitalism, and the survival of the fittest in the workplace. As I aged, I grew and I started to see the selfishness and just complete lack of compassion I had for others, and I did not want to be that person. I slowly, but consistently found myself at odds with the conservatives and drifted left. I am in my 60's now, and I don't ever see myself embracing conservative principles any more, not until the right is led by a marginally normal person and the outlook for that is bleak.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MollyGodiva",
            "body": "Let’s look at the word “extreme”. I would say that any political policy position that in other peer counties is normal am/or implemented is not “extreme”.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "favouritemistake",
            "body": "I was more socialist in college, living abroad brought me much more central.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Regular-Suit3018",
            "body": "I never felt for that dumb shit",
            "score": 1
        },
        {
            "depth": 0,
            "author": "cossiander",
            "body": "Yeah, I think around the same time I went through my brief libertarian phase as an edgy teen.\n\nWhat changed? I learned more about economics.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "mtmag_dev52",
                    "body": "What kinds of economics changed your opinion?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cossiander",
                            "body": "There's several concepts I could bring up, but if I had to pick the most salient it would be about how wealth isn't limited. I used to think that there was a set dollar-value for the world's economy, and it only grew when we did stuff like mine gold or print money. Under that idea, stuff like wealth disparity and uber-wealthy individuals would represent a direct threat to everyone else's growth and purchasing power.\n\nBut of course that's not how wealth works. We can grow wealth by any number of means. Building a house, making a movie, whatever. These things don't just *shift* wealth, they *expand* wealth. Jeff Bezos having a bunch of money doesn't hurt me at all unless he uses that money in a specific manner that affects me.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "funnylib",
            "body": "I was a Marxist Leninist in high school. I stopped being insane during my freshmen year in college ",
            "score": 0
        },
        {
            "depth": 0,
            "author": "GiveMeAnEdge",
            "body": "Never. I've always been as centrist as possible, as both sides are the same.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "tonydiethelm",
                    "body": "I can't tell if you're joking or not. The Internet has destroyed my ability to discern sarcasm.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GiveMeAnEdge",
                            "body": "Unfortunately, while I'm not a centrist and I don't think both sides are the same, I do think both sides are equally dumb.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tonydiethelm",
                                    "body": "Not gonna argue with that. \n\n\nDemocrats. They never fail to snatch defeat from the jaws of victory... Ugh.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GiveMeAnEdge",
                                            "body": "I really wish it wasn't the case. At least I just finished renewing my Aussie passport.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}