{
    "title": "Ex-Baltimore prosecutor Marilyn Mosby to be sentenced for mortgage fraud and perjury convictions",
    "comments": [
        {
            "depth": 0,
            "author": "harmier2",
            "body": ">They said she is the only public official who has been prosecuted in Maryland for federal offenses “that entail no victim, no financial loss, and no use of public funds.”\n\nWhat?  It’s mortgage fraud.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "pdawg43",
                    "body": "Isn't that they same thing they trying to get Trump on?",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "okriflex",
                            "body": "No, because Trump didn't actually commit a crime. She withdrew money from public funds and used it for personal reasons. She had the right to withdraw the funds, but she lied about why she was doing it in order to benefit herself personally, which is fraud.\n\nTrump leveraged his real estate based on a specific valuation. The bank agreed with him and loaned him the money. Then he paid it back. No fraud. No victim. Not the same.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PanhandleMan54",
            "body": "Remember. It's *other people* who are supposed to follow the law.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "BHAfounder",
            "body": "\"They said she is the only public official who has been prosecuted in Maryland for federal offenses “that entail no victim, no financial loss, and no use of public funds.”\n\nI have not heard that before but maybe if we added no fraud.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "mahvel50",
            "body": "It's amazing how consistently corrupt these DAs are",
            "score": 4
        },
        {
            "depth": 0,
            "author": "AppState1981",
            "body": "To these people, the whole point of getting elected is to be able to get away with these kinds of things.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "PsychologyHoliday630",
            "body": "Affirmative action was a mistake",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PhoenixGamer34",
            "body": "It's an absolute disgrace that she avoided prison time.",
            "score": 1
        }
    ]
}