{
    "title": "Ted Cruz demolishes CNN’s Kaitlan Collins on voter fraud live. Well done. ",
    "comments": [
        {
            "depth": 0,
            "author": "bladefist2",
            "body": "Wow this is painful to watch",
            "score": 376,
            "replies": [
                {
                    "depth": 1,
                    "author": "RussianPravda",
                    "body": "yeah that one hurt",
                    "score": 54
                },
                {
                    "depth": 1,
                    "author": "scrapqueen",
                    "body": "Horribly so.  I can feel his frustration with her ridiculousness.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "jpj77",
            "body": "She speaks like politics subreddit argues lol",
            "score": 679,
            "replies": [
                {
                    "depth": 1,
                    "author": "oh_io_94",
                    "body": "No she didn’t call him a fascist or Nazi",
                    "score": 288,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mikeyball1523",
                            "body": "Or ban him",
                            "score": 160,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Enough_Discount2621",
                                    "body": "Or make excessive use of skull and laughing emojis",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "oh_io_94",
                                            "body": "💀🤣💀🤣💀",
                                            "score": 4
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "scrapqueen",
                                    "body": "She would have if she could have.",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Theloripalooza",
                            "body": "She didn't call him that on air.",
                            "score": 27
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Dday82",
                    "body": "Zero dialogue. Just trap questions that are identical to other liberal mouthpieces. \n\nNever forget that the media had secret meetings during Trump’s presidency to discuss their agenda. They are public enemy number one.",
                    "score": 137,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bozoconnors",
                            "body": "My favorite thing about that election (and she pretty much echoed it via \"nothing that would've changed the outcome of the election\"), was the absolutely blatant media bias displayed via the, ad infinitum, repeated statement \"no **widespread** voter fraud\".  \n\nThe election would've flipped with something like 58k votes in key districts.  (of ~155 million votes)\n\nYou're arguing that +/- ~0.04% is \"wiDeSprEaD\"?  Get the absolute fuck out of here you slimy biased narrative controlling fucks.",
                            "score": 36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "day25",
                                    "body": "The margin was actually smaller - in the low 40s. That's AZ, GA, and WI combined. In terms of ballots it came down to just 20k if they voted Trump instead of Biden the outcome would have been different. So these numbers are extremely tiny.",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "Dday82",
                                    "body": "Well said. Most logical Americans can admit that Biden receiving 81 million votes, the most of any candidate ever, was fishy. Combine that with the vote delta you pointed out, it’s is highly likely that Democrats engaged in voter fraud via mail-in ballots to give Biden the edge.",
                                    "score": 10
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "uxixu",
                    "body": "No Democrat has conceded on election night since 1988.  It's not something they do. They didn't in 2000, they didn't in 2004, they didn't in 2016.",
                    "score": 57,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "audiophilistine",
                            "body": "I think I remember Hillary conceding on Election night. However, she immediately went on a campaign about how Trump was an illegitimate president, which kinda reversed that concession.\n\nI'm sorry to be pedantic, but it is vital to be accurate in dealing with liars and fraudsters.",
                            "score": 28,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sowellpatrol",
                                    "body": "Hillary couldn't be found on election night because she was angry sobbing and couldnt be seen on tv",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Aeropro",
                                            "body": "Imagining being in the room with her that night always gives me warm fuzzies.",
                                            "score": 15
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "YMarkY2",
                                    "body": "> I think I remember Hilary conceding on Election night. \n\nYou remember wrong. Hilary didn't even address her votes on election night, she sent out her campaign manager, or some guy that stated Hilary would make a statement the next day.",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "uxixu",
                                    "body": "She sent out Podesta to tread water but most definitely did NOT concede.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AstroNewbie89",
                            "body": "> No Democrat has conceded on election night since 1988\n\n>They didn't in 2000, they didn't in 2004, they didn't in 2016\n\nThis is a bit misleading isn't it? The 2000 election wasn't decided until the Supreme Court ruled on Florida ballots weeks after, then Al Gore conceded\n\nJohn Kerry didn't concede on election night because Ohio wasn't called until late (and actually went through a recount weeks later), and he conceded the next morning\n\nHillary Clinton kinda conceded on election night before spending years ranting about it\n\nSo basically what you're saying is Clinton threw a tantum...which we all knew lol",
                            "score": 18
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ButWhyWolf",
                    "body": "\"Senator Cruz, it's a simple question.  Have you stopped beating your wife, yes or no?\"",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "Conscious_Tourist163",
                    "body": "They have an entirely different take on this on r/politics.",
                    "score": 13
                }
            ]
        },
        {
            "depth": 0,
            "author": "vicemagnet",
            "body": "It’s like they invited Ted Cruz to be a backdrop while Kaitlan Collins rudely talks over him for the entire segment. She just wants to spout her position and not let him speak.",
            "score": 173,
            "replies": [
                {
                    "depth": 1,
                    "author": "Alas_Babylonz",
                    "body": "She kept saying Trump refused to give up the presidency.  Is he still in the White House?  I don't remember that happening.",
                    "score": 66,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Remarkable-Opening69",
                            "body": "That’s part of the brainwashing. Repeat it over and over and over. Can’t wait to vote against that shit.",
                            "score": 34
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "j3utton",
            "body": "> I'm conducting the interview here. I ask the questions.\n\n-\n\n> *won't let the person she's interviewing answer the questions by speaking over him*",
            "score": 264,
            "replies": [
                {
                    "depth": 1,
                    "author": "crash______says",
                    "body": "fake news 101.. always has been.",
                    "score": 53
                }
            ]
        },
        {
            "depth": 0,
            "author": "RadiantWhole2119",
            "body": "They didn’t want him to actually speak lol.",
            "score": 216
        },
        {
            "depth": 0,
            "author": "luckycharming1",
            "body": "Let him speak for fucks sake!",
            "score": 221
        },
        {
            "depth": 0,
            "author": "MrLore",
            "body": "Absolute joke of an interview, like *\"Have you stopped beating your wife?\"* tier.",
            "score": 230,
            "replies": [
                {
                    "depth": 1,
                    "author": "directstranger",
                    "body": "I don't have a wife, I was never mar... WHY WON'T YOU ANSWER THE QUESTION?!?? YES or NO?",
                    "score": 88
                }
            ]
        },
        {
            "depth": 0,
            "author": "dont-CA-my-TX",
            "body": "This could have been a really good interview if she would have just STFU. \n\nAlso, it’s crazy how the mainstream media only pushes this question on republicans.",
            "score": 234,
            "replies": [
                {
                    "depth": 1,
                    "author": "crash______says",
                    "body": "It's crazy to ask a question to which you want literally zero answers for.",
                    "score": 47,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dont-CA-my-TX",
                            "body": "Actually I think she did want an answer…. She was pushing him to say “no I won’t accept the election results.”",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "crash______says",
                                    "body": "> Ted Cruz refuses to accept democratic election results\n\n\\m/ fellow texan",
                                    "score": 11
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "art36",
                    "body": "The problem is she knows that the Democrats have a long history of publicly not accepting election results. It’s why she keeps pushing her line of questioning so narrowly. I would argue that the FBI’s looming investigation of the Trump campaign as a result of the Steele Dossier, which was funded by the Clinton campaign, was far more harmful to the transition of power and legitimacy of the presidency than anything that occurred up to and including January 6th. Biden’s ability to take office and lead the executive branch was never undermined, where as Trump was setup to fail and never have the full trust or cooperation of those underlying agencies and also public perception. With a fair and reasonable analysis, it’s clear that the Trump administration was unjustly hamstrung in ways no other administration had ever encountered.",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dont-CA-my-TX",
                            "body": "Very well said! 👏🏻",
                            "score": 5
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "redoilokie",
            "body": "She has every single, perfectly executed, qualification for the ideal ex wife.",
            "score": 118,
            "replies": [
                {
                    "depth": 1,
                    "author": "MiltonRoad17",
                    "body": "Pretty, but extremely arrogant, self-interested, and believes she is intelligent because she read half of Infinite Jest once?",
                    "score": 44
                }
            ]
        },
        {
            "depth": 0,
            "author": "KippySmith",
            "body": "God. I hate when they just shut it down saying, he refused to answer. No he obviously was answering. Have a discourse if you want his answer. Just don't act all smug.",
            "score": 19
        },
        {
            "depth": 0,
            "author": "johndeer89",
            "body": "I finally realize that if a reporter demands a yes or no answer, they aren't interested in facts, they're just a trash reporter trying to corner you.",
            "score": 62
        },
        {
            "depth": 0,
            "author": "capn_KC",
            "body": "What a smug, nasty, arrogant person.",
            "score": 110
        },
        {
            "depth": 0,
            "author": "jman8508",
            "body": "What a powerful and thought provoking interview where you could gain insight and perspective…\n\nOh wait",
            "score": 58
        },
        {
            "depth": 0,
            "author": "Savant_Guarde",
            "body": "Why would anyone waste their time on these propaganda outlets? \n\nFor over 3 years they lamented a fake Russia collusion hoax and now pretend that because the guy that \"won\" last time is owned by the same people that own them, it's legit?\n\nThe fact that these same propaganda outlets don't want to investigate voter fraud isn't the same as no voter fraud. \n\nRecent stories about GA, AZ, PA etc show that fraud was occurring. WTF is the actual meaning of \"widespread voter fraud\" anyway?  If it means \"more than five states\", then it's completely meaningless.\n\nStop watching these outlets, let them wither on the vine.",
            "score": 89,
            "replies": [
                {
                    "depth": 1,
                    "author": "capn_KC",
                    "body": "I cut the cable cord in 2017. Best decision I ever made.  No more propaganda on my TV.",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "MiltonRoad17",
                    "body": "> Why would anyone waste their time on these propaganda outlets?\n\nBecause at the end of the day, you still have to at least try and appeal to the other side.\n\nRepublicans not going on CNN or Democrats not going on Fox News will only increase tribalism and split groups apart more than this country already is.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "flat6NA",
            "body": "The Rubio interview on Meet the Press was more of the same. Kristen Welkers question was so open ended after Rubio pushed back she had to change it.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "Reuters-no-bias-lol",
            "body": "Remember when leftists complained that CNN was becoming right wing after the sale? Ye, CNN stayed right where it was, in the gutter of cat blogs. ",
            "score": 45
        },
        {
            "depth": 0,
            "author": "patriclus47",
            "body": "She’s a piece of shit. “I’m conducting the interview” yea Kaitlin but it’s a voluntary interview and you’re not a prosecutor in a courtroom. Cruz can respond however he likes, including by asking questions that erode the false assumptions she’s built into her own questions",
            "score": 47
        },
        {
            "depth": 0,
            "author": "LouisWu987",
            "body": "At least she's steadfast in her stupidity?",
            "score": 18
        },
        {
            "depth": 0,
            "author": "ponmbr",
            "body": "Ah yes the hairy forearms lady as Crowder calls her.  The clip of Trump calling her a nasty person after she did this to him is so hilarious.",
            "score": 61,
            "replies": [
                {
                    "depth": 1,
                    "author": "davim00",
                    "body": "I would have fallen out of my chair if Cruz had said the same thing here.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Right_Archivist",
            "body": "\"With all due respect\" yet she's calling crazy for not automatically submitting to the results.",
            "score": 20
        },
        {
            "depth": 0,
            "author": "amraydio",
            "body": "And this interview he agreed to accomplished what? \n\nNetworks like CNN, MSNBC and the like are hostile and absolutely hate anyone moderately right and the conservative side will never earn their respect or their admiration. Cruz and anyone else on the right need to learn to stop going on these networks! They’re not going to have “a gentlemanly debate, where we agree on the end goal but how to get there”. They have nothing but contempt for your way of thinking and the constituents you represent. You have the same odds of them saying “yeah you’re right about that” as you do taking steak into the tiger cage at the zoo and sitting down to share a meal with the giant kitty.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "decrement--",
            "body": "I need to make everyone commit to not calling me a cheater before we play monopoly, and I'm the banker.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Panzershrekt",
            "body": "[Heeeeey Kaitlan, here's Georgia at the moment..](https://x.com/BehizyTweets/status/1792045743424819628)",
            "score": 12
        },
        {
            "depth": 0,
            "author": "vpkumswalla",
            "body": "\"demolishes\"?  How about attempts to answer reporters questions in between being talked over when said reporter does like the responses",
            "score": 42
        },
        {
            "depth": 0,
            "author": "jbcgop",
            "body": "I haven't watched CNN in years but its amazing that they found someone more unlikeable than Lemon and Cuamo.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "RealisticTadpole1926",
            "body": "Why won’t you answer the question where I limited your answer to only the extremes and won’t actually give you time to answer?",
            "score": 5
        },
        {
            "depth": 0,
            "author": "luigijerk",
            "body": "Demanding yes or no answers is such a desperate ploy. I expect it in a courtroom, not in a \"neutral\" interview.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Zaphenzo",
            "body": "\"I remember Biden, who was Vice President, certifying the election.\"\n\nYeah, and I remember Pence, who was Vice President, certifying the election. So, continue proving that 2016 was no different, please.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "I_SuplexTrains",
            "body": "This woman apparently wants him committing to recognizing the \"outcome\" of the election in any outlandish scenario that could ever be dreamed up. Entire boxes of ballots are burned on camera? The city of Toledo, OH somehow had 40,000 voters named Joe Smith who all live at 1 Main St and every single one of them voted for Biden? Biden himself brags into a camera that he ordered the results changed at gunpoint? Nope. Still need to commit to recognizing the \"outcome.\"",
            "score": 15
        },
        {
            "depth": 0,
            "author": "HNutz",
            "body": "HA! Love it!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "bionic80",
            "body": "She goes fishing for a soundbite and when he wants to be nuanced tries to play badger games.  This is why we don't trust news anymore.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "flyinghorseguy",
            "body": "She’s just upset that she looks like a guy.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Ticonderogue",
            "body": "She deserves no respect. Someone who's particularly aggressive with one party's members and policies, and waves by and softballs her preferred party, is just a politically biased, devisive, talk show host. But if you don't appear before the left's popular talk show hosts, they say that you're dodging being critically challenged. They're not remotely critical in the wide scope of politics, and their only aim is to make you look horrible. So like Cruz here demonstrates, you appear on TV with them, knowing what they're after, and ready to make Them look like twits. Mission accomplished.\n\nHowever, the Democrat viewers of these twit talk show hosts were likely not phased, don't listen to what Cruz is saying, don't consider that he's even remotely making a valid point, because they've already made up their minds (rather the media made it up for them, and they... drank the kool-aid, so to speak) that Cruz, like everyone on the right, is automatically a liar with bad intentions. These shows, no matter what someone on the right says, will twist it to accommodate their own narrative, the approved narrative on the left. On the contrary, (while I'm not a big fan of Cruz, I'll give credit where deserved) Cruz showed up in good faith, argued in good faith, he's presenting truthful arguments, and this host and likely viewers remain.... unmoved. These hosts Only pander to the left. They aren't enlightening them beyond.. the one, strict, leftist viewpoint and propaganda. Even if you're on the left, they'll only allow you to contend that there was foul play if a candidate on the left loses. All wrongs are done on the right, exclusively. That's their position. It's of course ridiculous, but they'll defend it to no end. You cannot suggest there was any foul play on left however. Zero. \n\nWe don't all agree on the right, but that's a feature not a bug. We allow one another the expression of other and competing ideas. Not so on the left. And that's another thing the left have in common with Palestinians, one expression of law to rule them all. The left practice like a totally secular, hedonist version of Sharia Law. Cancel culture is their version of stoning someone to death for defying them. \n\nThe left's talking heads have one objective, make the GOP members look bad, corrupt, and evil to the core. Generate negative sound bites that go viral. They have the brains of a 12 yr old Tik-Tok wannabe 'influencer'.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Antithesis-X",
                    "body": "If they didn’t have double standards…",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kygunzz",
            "body": "I don’t really think anybody demolished anybody here. They both just talked past each other.",
            "score": 18
        },
        {
            "depth": 0,
            "author": "EnlightenedChipmonk",
            "body": "She is absolutely insufferable",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Blue_Cheese_Olives",
            "body": "She's a bimbo",
            "score": 24
        },
        {
            "depth": 0,
            "author": "0beronAnalytics",
            "body": "Jesus Christ that woman is insufferable, is her jaw wired shut or something? 😆\n\nAt 3:30 he says, “yes, if the Dems win I’ll accept the results…” \n\nBut she just keeps talking over him and repeating the question saying, “with all due respect” while showing him absolutely no respect.\n\nDoes CNN actually think this is a quality hire? Oh wait, it’s CNN.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Fantastic_Rock_3836",
            "body": "The epitome of smarmy.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "MotherofgodIthought",
            "body": "Love the Steve Brule “I know” at 3:17. This chick is only concerned with hearing her own voice. Its comical",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Fyrebat",
            "body": "'I'm conducting the interview with all due respect' proceeds to debate and talk over him",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Flare4roach",
            "body": "I really like Cruz but I wish that after 2 minutes of this type of ugly treatment he would have stood up, taken off his mic and say this is a clown show. I expected a dialogue. I don’t have time for unserious people and walked off. \n\nI get it that the Right should try to reach across the aisle and politics can be rough but it’s one thing to face tough questions, it’s another to be rudely talked over by a 10 cent head.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FormerBTfan",
            "body": "It's hilarious to watch this. How did they ever think they would make an eighth of an inch headway with bringing Cruz on for  this? An absolute slaying. They have been trying the same thing here with Poillievre and it's the same evisceration each and every time. The old left msm play book is exactly that old and tattered . It's fun to watch them self deconstruct in real time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "flockingman",
            "body": "Why doesn't her mouth move when she talks? She's got the Nikki Haley thing going on. \n\nDon't get Botox, kids.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "StriKyleder",
            "body": "she is so insufferable. Idk Trump did the town hall with her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Rocky2135",
            "body": "Interview.  You keep saying that word.  I don’t think it means what you think it means.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lurkay1",
            "body": "[YES OR NOOO](https://youtu.be/M1X0w0UKMrk?t=580)",
            "score": 0
        },
        {
            "depth": 0,
            "author": "readerdad55",
            "body": "Here’s the thing … we know she’s wrong and that Ted Cruz is correct but virtually every Democrat, 95% of the independents and about 10% of the GOP agrees with her.\n\nThe fact is we did NOT set the debate on this correctly and as ANYONE knows who argues for a living, the person who sets the debate wins everytime.\n\nTrump was uniquely unqualified to address this issue given his past experience and personality. Before you get mad at me hear me out.\n\nTrump as a developer sets every debate with money.  Money is power in development and construction.  \n\nWashington and the Democratic left plays\n an entirely different game.  My only hope is he has learned something from losing this game once and will play it entirely different but I’m not holding my breath because too many Republicans in power now would rather lose and complain than take the necessary steps to win - win what should be the easiest win in modern history against one of the worst (I believe second worst) president in American history.  Who by the way is part of a party that much of America agrees is farrrr to leftist for its taste",
            "score": -5
        }
    ]
}