{
    "title": "Factually True…",
    "comments": [
        {
            "depth": 0,
            "author": "rigorousthinker",
            "body": "Similar with Saddam Hussein.\n\nWhat say you, pro Hamas protesters??",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "sowellpatrol",
                    "body": "'No Jews. No news.' --UCLA students",
                    "score": 23
                }
            ]
        },
        {
            "depth": 0,
            "author": "AstroNewbie89",
            "body": "Doesn't everyone but Putin hate this guy",
            "score": 32,
            "replies": [
                {
                    "depth": 1,
                    "author": "DefinitionEconomy423",
                    "body": "Iran and Palestine are friends with him too",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "i_dont_do_hashtags",
                    "body": "You won’t hear a peep from Arab folks about this monster or even Saddam. Through some warped mental gymnastics they see Assad and Saddam as some sort of Pan-Arab heroes, defending Arabia from western influence. Ah yes, I love it when my defenders of justice murder their own people by the 100’s of thousands, y’know for justice.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Black_XistenZ",
                            "body": "Isn't there a common saying in Israel along the lines of \"once the Arabs start valuing the lives of their own people more than murdering Jewish lives, we will finally get peace\"?",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "JackandFred",
            "body": "I mean Assad gets no western support and the us tried to remove him by arming rebels so I’m not sure why you think this comparison is in any way useful.",
            "score": 54,
            "replies": [
                {
                    "depth": 1,
                    "author": "Martbell",
                    "body": "How many colleges held protests over Assad? How many bridges and airports were blocked? How many called it a genocide?",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Black_XistenZ",
                            "body": "Assad was sanctioned and ostracized by our governments, we even armed his opponents. There was no real reason for an anti-Assad protest movement in the West since we all agreed that Assad sucks and should go. The same isn't true at all in the case of Israel; the pro-Palestine protesters advocate for a very different course than the Western governments, so trying to get their will by applying political pressure makes sense from their point of view.",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BlackScienceManTyson",
                                    "body": "Say it louder for the slow kids in the back",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Vessarionovich",
                    "body": "It's useful because it reveals the rabid antisemitism of the left. Assad can slaughter 200,000 Arabs and we don't hear a peep from them. Israel kills 20,000 in response to Oct 7th.....and they scream \"GENOCIDE\" over and over and over again.",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "avd51133333",
                    "body": "Nobody on the left makes a peep about people being slaughtered unless its by Israel. Go look at Yemen, several places in Africa etc. nobody cares!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "DufferDan",
            "body": "The Hypocrats don't care only because nobody told them to...",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "DblThrowDown",
                    "body": "Nailed it.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dutchtdk",
            "body": "I... I don't think assad can set foot in 70% of the worlds nations without being imprissoned and send to the icc",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Briguy28",
            "body": "\"I believe that the Jews are the chosen people. What exactly we were chosen for, I have no idea, but I'm very interested in getting a recount.\" -my college philosophy teacher.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "EngineerRemote2271",
            "body": "They don't care about China culturally eliminating, enslaving and killing off Uyghur Muslims in detainment camps either, because cheap iPhones, Bro. There's been no posts on it for at least 5 months\n\nAlso Leftist Wikipedia quietly changed their titled page about the genocide into a less pointed \"Persecution of Uyghurs in China\"",
            "score": -2
        }
    ]
}