{
    "title": "Newsom promised 1,200 tiny homes for homeless Californians. A year later, none have opened",
    "comments": [
        {
            "depth": 0,
            "author": "Reuters-no-bias-lol",
            "body": "Don’t worry. Soon Americans will be driven out of their homes by illegal aliens and will have these tiny boxes to live in. ",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Conservative-Point",
                    "body": "Exactly. It's not a coincidence that all of a sudden squatters and squatters rights are making headlines. People need to pay attention.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Slobomatic",
                    "body": "Laughs in 2A",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "naturalizedcitizen",
            "body": "The governor set up a big to-do when he made his tiny home promise in March of last year. He had sample tiny homes set up in the Cal Expo event center to use as a backdrop as he spoke. Local officials, including Sacramento Mayor Darrell Steinberg and San Jose Mayor Matt Mahan, flanked him to show their support and gratitude. \n\nThe venue also was strategically chosen — Sacramento planned to set up its allotted 350 tiny homes right there, at Cal Expo. \n\nThe plan was simple: The state would buy the tiny homes. ",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Martbell",
            "body": "Everyone gets all excited for the announcement of some big plan but no one cares about following up on whether it actually did anything.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "naturalizedcitizen",
                    "body": "And our California voters just keep voting the same crooks over and over again.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Martbell",
                            "body": "It's because so many of the saner ones have moved out. At this point people are self-sorting.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GargantuanCake",
                    "body": "Oh all the plans definitely do things. Those things only ever shovel money into the pockets of oligarchs but that's still a thing.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "vpkumswalla",
            "body": "Was visiting LA last year and drove by an area where this major street was lined with older to dilapidated/abandoned RV's with camps surrounding the rvs.  There were probably 200+ lining this street.  Never seen anything like it.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "mashed_potat0",
            "body": "[Remember when a guy made tiny houses for the homeless, only to have them get confiscated by the city of LA?](https://youtu.be/n6h7fL22WCE)",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "naturalizedcitizen",
                    "body": "When the city builds anything on tax dollars, everyone in the food chain gets a piece of the pie. How dare this musician deprive the govt employees their piece of the pie!!\n\n🤡🌍",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "MulayamChaddi",
            "body": "But his hair remains immaculate",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ryanespe",
            "body": "But you can bet that a lot of money was spent on corporate and non profit donors to \"study\", \"strategize\", and \"consult\"",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PhoenixGamer34",
            "body": "He is clearly all talk no action",
            "score": 1
        }
    ]
}