{
    "title": "Beep, beep! New cars in California could alert drivers for breaking the speed limit",
    "comments": [
        {
            "depth": 0,
            "author": "2MuckingFuch",
            "body": "Buy the car you love now, and never look back.",
            "score": 60
        },
        {
            "depth": 0,
            "author": "Da-Jebuss",
            "body": "They want ALL your driving data, and they'll sell it straight to your insurance. ",
            "score": 56,
            "replies": [
                {
                    "depth": 1,
                    "author": "Matthew-IP-7",
                    "body": "Insurance companies have a legitimate use for your data. It’s the not-insurance-company entities that I’m more concerned about.",
                    "score": -22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Da-Jebuss",
                            "body": "They're the motivation behind a full array of data collecting sensors being installed in the first place. While they'll certainly take advantage of it they've no right or need of it.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "zip117",
                            "body": "They all get their data from the same data brokers. Opt-out *now* if you haven’t done so already. Start with [LexisNexis](https://optout.lexisnexis.com) and [Acxiom](https://www.acxiom.com/optout/).",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BartletMcGarry2020",
                                    "body": "Genuinely asking as I'm trying to become more knowledgeable about my digital privacy. What is the benefit of opting out of these? Are they no longer allowed to sell my data? Does it delete the data?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FuriousBeard",
                            "body": "Lol - please enlighten me.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Zedakah",
                            "body": "The problem is the government uses insurance databases against you. My payment lapsed for 2 days (weekend). I got a letter from the dmv a month later saying my license plate for the car was revoked unless I could prove I had insurance for those two days. So I had to spend $200 getting a new tag despite not driving the car for those two days. \n\nNone of this is ever used for the good of society; only as a weapon against the citizens.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FuriousBeard",
            "body": "Yeah no shit this is going to happen. \n\nI wish people would have thought long and hard before deciding that every little thing in our lives needs to be \"smart\" because we need the convenience. The cost of this convenience is the slow erosion of your freedoms. \n\n  \nThe future is going to get a lot worse as it relates to these smart cars (all devices) too. Just wait until you're not able to drive on Monday / Wednesday / Friday because the grid can't handle it and your car will literally shut itself down on those days. \n\n  \nCall me a tinfoil hat wearer all you want but this is 100% coming.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Vloggie127",
                    "body": "Hollywood movies have been warning of this for decades. People just ignore it unintentionally or on purpose.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "AnonPlzzzzzz",
            "body": "Speed limits are social constructs.\n\nNot keeping up with faster moving traffic is more dangerous.",
            "score": 37
        },
        {
            "depth": 0,
            "author": "Natural-Big-4098",
            "body": "They’ll also slow to a stop and shutdown for 20 minutes if you misgender someone",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "scully360",
                    "body": "Won't be long until this is fact.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "KinGpiNdaGreat",
            "body": "In Florida you can get pulled over and ticketed in the left lane on the highway if you’re not going faster than the speed limit if you have a lot of cars behind you.",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "bigsquib68",
                    "body": "Florida gets shit on in just about every other subreddit. Why is no one putting California on blast?",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KingstonEagle",
                            "body": "Because politically Reddit is very California aligned and very NOT Florida aligned",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ScottyJD09",
                    "body": "Good.  People who just coast in the \"passing\" lane while not actively passing someone should be ticketed.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "Delicious_Staff3698",
            "body": "screw that",
            "score": 8
        },
        {
            "depth": 0,
            "author": "gulogulo1970",
            "body": "How fast would you look for that little speaker and cut the wire?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "WrathOfPaul84",
                    "body": "or disable the speed sign reading cameras/GPS modules.  the car should still be drivable with those systems disabled.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RIP_Salisbury",
                            "body": "The underground future of automotives will be things like this that hack the car's systems and disable all these tracking features.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "haapuchi",
            "body": "So, GPS and road data is now mandatory in CA? What about newly built inner roads that are not in their maps. Infinite speed limit.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nolotusnote",
            "body": "A smart car manufacturer will  implement this in such a way that a fuse removal will be all that is needed.\n\nMost popular new car in California.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CMMGUY2",
            "body": "I still don't get how CA lawmakers can ban lawnmowers but allow ICE cars without hesitation. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WrathOfPaul84",
            "body": "If new cars come with this capability, I will be buying only used cars from now on.",
            "score": 1
        }
    ]
}