{
    "title": "Rick Scott Will Run to Replace Mitch McConnell as Republican Leader",
    "comments": [
        {
            "depth": 0,
            "author": "Chuck006",
            "body": "That's not an improvement. If anything it's worse. This guy bungled what should have been a red wave 2 years ago.",
            "score": 37,
            "replies": [
                {
                    "depth": 1,
                    "author": "Starky513_",
                    "body": "Was it Rick or Donald who screwed that up? Lol",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Charles_Magnus800",
                    "body": "He did the job he was hired to to do",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Equivalent-State-721",
                    "body": "Didn't Trump bungle it though? Backing nuthouse candidates who stroked his ego about 2020?",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "IamLiterallyAHuman",
            "body": "I don't mind it, but I'd prefer someone like Blackburn, Kennedy, Hawley, Paul, or hell, Cruz.",
            "score": 22
        },
        {
            "depth": 0,
            "author": "Natural-Big-4098",
            "body": "He won’t have to run too fast, Mitch doesn’t get around so well these days",
            "score": 15
        },
        {
            "depth": 0,
            "author": "dermlvl",
            "body": "Well he is pretty good at committing financial fraud, he will fit right in.",
            "score": 25
        },
        {
            "depth": 0,
            "author": "KinGpiNdaGreat",
            "body": "When he was Governor - Scott was not popular in Florida for most of his 2 terms(based mostly on his personality and looks) but he’s the one that set the stage for DeSantis.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "SuperAwesomeChris",
                    "body": "He must of been popular enough to win reelection for governor in 2014 and win a senate seat against an incumbent in 2018. As far as his win in 2018, it should be noted that he outspent his opponent 2.5 times what they spent. [Source](https://www.opensecrets.org/races/summary?cycle=2018&id=FLS1)",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KinGpiNdaGreat",
                            "body": "Yes, because Scott actually kept state spending under control and kept a balanced budget.  \n\nI think I remember at one point his approval rating was in the low 20s but i think on average his approval rating was in the mid 40s throughout his time as governor. \n\nWhich is a far cry from DeSantis’ plus 50 that he has always has and all DeSantis has done is continued the policies of Scott’s administration. \n\nThe only difference is DeSantis is younger, more likeable, articulates his positions better and let’s face it - better looking than Scott. \n\nI’ve never had complaints about either one of them and I’ve voted for both of them twice since moving down from the failed state of New York in the mid 2000s.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SuperAwesomeChris",
                                    "body": "Yep, what you said is 100% true about Desantis and Scott.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Natural-Big-4098",
            "body": "If it wasn’t for Mitch, the supreme court wouldn’t look like it does today",
            "score": 8
        },
        {
            "depth": 0,
            "author": "rigorousthinker",
            "body": "I don’t know much about Scott but almost anyone other than McConnell will be a welcome change especially if they are anti-establishment. Although, the one thing I will always fondly remember McConnell for is his blocking of Garland to the Supreme Court.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "SuperAwesomeChris",
                    "body": "Well... Here is something about Rick Scott, he is a former governor of Florida.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "AstroNewbie89",
                    "body": "> I don’t know much about Scott but almost anyone other than McConnell will be a welcome change\n\nThis sort of rhetoric is why many people don't take the GOP seriously. Mitch McConnell was one of the most effective senate leaders in US history, whether you dislike him or not, this is a fact",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "rigorousthinker",
                            "body": "What has he done lately? In the 2022 election, McConnell IIRC supported the RINO  Lisa Murkowski instead of more conservative candidates.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "ArctiClove",
                            "body": "So? What has he done for me lately? I have seen his work in the senate, and I am not impressed enough.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "THEessayB",
                    "body": "As a Floridian, I don’t like him.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "harmier2",
                    "body": "Came here to basically say this.",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Blue_Cheese_Olives",
            "body": "\nGood",
            "score": 3
        },
        {
            "depth": 0,
            "author": "saginator5000",
            "body": "How about Deb Fischer?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AstroNewbie89",
            "body": "No thanks. Let's not replace an 82 year old with a 72 year old..not to mention doesn't a sizable % of the GOP senate dislike him?\n\nStill seems like John Thune is the better choice",
            "score": -1
        },
        {
            "depth": 0,
            "author": "dotsdavid",
            "body": "We could do better. Still better than McConnell though.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "MerlynTrump",
            "body": "Rick Scott's [got game.](https://www.wwe.com/shows/outside-the-ring/triple-h-announces-wwe-performance-center-in-florida)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "whiskyforpain",
            "body": "Hawlee or bust!",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "SuperAwesomeChris",
                    "body": "*Hawley.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "whiskyforpain",
                            "body": "Him too!",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}