{
    "title": "Dem Senator Chris Murphy: \"If you want a safe town/neighborhood, you're better off with immigrants\". Ultimate hypocrisy. Murphy raised his family in Southington (89% white) and Cheshire (88% white).",
    "comments": [
        {
            "depth": 0,
            "author": "modscontrolspeech",
            "body": "Better off with immigrants than what?",
            "score": 59,
            "replies": [
                {
                    "depth": 1,
                    "author": "Beware_the_silent",
                    "body": "Blacks, which he didn't raise his kids in that environment.",
                    "score": 41
                },
                {
                    "depth": 1,
                    "author": "Arachnohybrid",
                    "body": "It’s a “dog whistle” as the left often says",
                    "score": 24
                },
                {
                    "depth": 1,
                    "author": "Potential-Highway606",
                    "body": "The 13%, which he conveniently didn’t qualify his statement with.",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "ButWhyWolf",
            "body": "It's not hypocrisy it's double-speak.\n\nHe's right.  Immigrants commit crimes at much lower rates than natives by a very wide margin.\n\nThe double speak is that he's talking about **LEGAL** immigrants.\n\nIllegal immigrants actually commit way more crime than natives or legal immigrants.",
            "score": 82
        },
        {
            "depth": 0,
            "author": "starBux_Barista",
            "body": "Looks like Chris Murphy is A OKAY with a few bus loads to his town then.... gov Abbott lets make this happen",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "AstraVolans_21",
                    "body": "Strength in diversity!",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Drewsk81",
            "body": "I grew up in the LA area and this guy has no clue what he’s talking about.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "limitedtimeoffer1",
            "body": "Except a majority of migrant encounters are single males asshole.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "knutterchini",
            "body": "We don't even need Congress if all they do is lobbying whatever agenda their \"benefactors\" tell them!",
            "score": 10
        },
        {
            "depth": 0,
            "author": "IhateBiden_now",
            "body": "Economic Desperation is not listed as one of the reasons for asylum to be given to illegals. Maybe Senator Murphy should actually read what is or isn't accepted reasons to be granted US Asylum.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "thegreatinverso9",
            "body": "You act surprised when limousine liberals say stupid shit.  These people are disingenuous grifters, saying stupid divisive shit is what they do.  Put him in a more diverse neighborhood and he is rolling up windows, locking doors, and googling the number for 911.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Chebbieurshaka",
            "body": "“Families” ? I see a lot of single men in those videos of the border.\n\nYou can’t conflate illegal migrants with the legal ones taken into the country because we actually screen and vouch for the legal ones. Schools, Jobs and Family vouch for the legal ones. So I assume legal immigrants commit less crime than native citizens but nobody can vouch for illegals because they don’t even exist in our country because they’re undocumented. \n\nWhen is it a moral justification to take in economic migrants? Illegal migrants that are in coming aren’t creating new economic development like my immigrant ancestors did but moving in existing ones and pricing people out with their labor. \n\nMexico isn’t that bad if you’re escaping famine or genocide. It’s just opportunistic folks hopping the border.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "vpkumswalla",
            "body": "I bet the Obama's are being enriched in the culturally diverse Martha's Vineyard",
            "score": 2
        },
        {
            "depth": 0,
            "author": "AstraVolans_21",
            "body": "Will he open his home to couple of those diverse people?\n\nAnyway, democrats want diversity so they should get all the diversity that reached America.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "timid1211",
            "body": "Wonder if Chris Murphy would use this same logic with other minority groups that ARE more likely to commit crime. (The answer is no).",
            "score": 2
        },
        {
            "depth": 0,
            "author": "itsallrighthere",
            "body": "What a cuckold",
            "score": 4
        },
        {
            "depth": 0,
            "author": "NottingHillNapolean",
            "body": "\n\n>Murphy raised his family in Southington (89% white) and Cheshire (88% white)\n\nYeah, but was it safe? No telling how many times he had to endure people speaking without land declarations.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DblThrowDown",
            "body": "Right so he lives in a barrio neighborhood does he? Ohh wait...no",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Toybasher",
            "body": "Chris Murphy's a gun grabbing piece of shit.",
            "score": 1
        }
    ]
}