{
    "title": "Alito’s House Reportedly Flew ‘Appeal To Heaven’ Flag Used By Jan. 6 Rioters—Adding To Upside-Down Flag Controversy",
    "comments": [
        {
            "depth": 0,
            "author": "SeemoarAlpha",
            "body": "Next they'll find that Alito has a bible on his nightstand and accuse him of violating the separation of church and state.",
            "score": 176,
            "replies": [
                {
                    "depth": 1,
                    "author": "AccidentProneSam",
                    "body": "He also drinks water too. You know who also drank water? Hitler. Checkmate Conservatives.",
                    "score": 29
                }
            ]
        },
        {
            "depth": 0,
            "author": "AnonPlzzzzzz",
            "body": "Judges have free speech too.",
            "score": 129,
            "replies": [
                {
                    "depth": 1,
                    "author": "eatingyourmomsass",
                    "body": "Nuh uh! Free for me but not for thee.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "fm67530",
            "body": "I don't see what the issue is. Justice Alito is an American citizen, he has the right to free speech, and flying a flag on your property falls under that right.",
            "score": 132,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wookieebalboa",
                    "body": "It’s like the “outrage” over Thomas a few months ago\n\nThe left is doing everything they can to destroy credibility for the court so they can cry foul when more of their shit gets struck down in the future",
                    "score": 93
                },
                {
                    "depth": 1,
                    "author": "715Karl",
                    "body": "The left hates all those things. Pretty soon we’ll have foreign appointees to the court.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Scerpes",
            "body": "Judges have free speech, but there are still ramifications to that speech.  Judges aren’t supposed to be weighing in on cases or controversies that may come before them.  Some are taking the flags to indicate bias on part of Alito.\n\nIf one of the liberal judges had made political contributions to Al Gore prior to the Bush v. Gore case coming before the court, the right would have pushed hard for that justice’s recusal. \n\nI really wish Alito hadn’t had the flags flying.  But, it’s up to him whether he recuses, so…oh well.",
            "score": 93,
            "replies": [
                {
                    "depth": 1,
                    "author": "bearcatjoe",
                    "body": "Ginsburg did make numerous political statements and never recused herself.  It's not a violation of the judicial branch's code either (and the other branches have no say).\n\nAlso, this is a [very old flag](https://en.wikipedia.org/w/index.php?title=Pine_Tree_Flag&oldid=1184606070) historically flown by Americans from all political stripes (the link goes to a version of the Wikipedia article from long ago - the current one has been captured by editors with political agendas).  It's mostly the media trying to associate it with Jan 6th.\n\nThat said, I'd rather the Alito's didn't do stuff like this.  It creates a distraction where one isn't necessary.",
                    "score": -1
                },
                {
                    "depth": 1,
                    "author": "Zaphenzo",
                    "body": "Flying a Revolutionary War flag at his house is not even remotely the same thing as donating to a politician.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Scerpes",
                            "body": "Depends on the case that comes before them.  Flying a revolutionary flag that has been used by Jan 6 protesters in conjunction with flying the US flag upside down (also used by Jan 6 protesters) suggests that the judge has already picked a side and that he is biased.  A trial court judge would be recused for that.  The only reason that Alito won’t be is that there is no one to make him recuse himself.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Hrendo",
                                    "body": "He didn't fly the flag upside down, his wife did due to a dispute with a neighbor. The other flag is not a \"Jan 6th\" flag either. It's a historical flag that nobody owns claim to. A trial court judge would not recuse themselves, you're completely fabricating reality at this point and embarrassingly falling for a nothing story. \n\nOh and to clarify, the upvotes you're getting now are from the pathetic far-leftists that brigade here.",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Scerpes",
                                            "body": "Can you see how some might not believe the story about his wife, especially in light of the appearance of the Appeal to Heaven flag on January 6 and at his vacation house?  It’s at least a little problematic.  And I’m here for the discussion, not the upvotes, so I really don’t care.",
                                            "score": 9
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Pinot_Greasio",
                    "body": "Except no one even knows why the flag was flown upside down.  It could have just been a simple mistake.  \n\n\nAlso this nonsense that an upside down flag is January 6th messaging made up by the leftist media.\n\n\nThis is just more hysteria trying to make conservative justices look compromised.  This crap didn't work against Justice Thomas and it won't work here.",
                    "score": -47,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Scerpes",
                            "body": "Stop it.  No one flies a flag upside down on accident.  That’s really just ridiculous. Especially given the second flag flying at the vacation house.",
                            "score": 74,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Pinot_Greasio",
                                    "body": "No you stop it.  Falling for this ridiculous fake shit.  It's embarrassing.",
                                    "score": -61,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Scerpes",
                                            "body": "Falling for it?  You should re-read my first post.  I’m not suggesting that he should recuse, but it’s certainly going to be used to muddy the water and I really wish he hadn’t done it.",
                                            "score": 37,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Pinot_Greasio",
                                                    "body": "Muddy what waters?  This fake nonsense the left did to Justice Thomas or Justice Kavanaugh or Justice Amy Coney Barrett.\n\n\nHe's free to fly a flag however he wants.  There's zero reason he has to recuse himself from any case.",
                                                    "score": -36,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Scerpes",
                                                            "body": "He’s free to fly a flag however he wants to, because there is no one who can force him to recuse.  But if he was a trial court judge? He’d be recusing himself or forced to recuse by the appellate courts.  The standard is the appearance of impropriety.  This is an improper way for a judge to be acting.",
                                                            "score": 46,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Pinot_Greasio",
                                                                    "body": "Not even a little improper.   ",
                                                                    "score": 0
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Scerpes",
                                                            "body": "Don’t even put this and Thomas’s nonsense on the same level as the disgusting smear campaign run against Kavanaugh, or even awful way Thomas was treated in confirmation. \n\nThis is all Alito’s doing and he should know better.  Thomas should know better.  They know that they are going to be lightning rods and they are doing it anyway. I’m 50 years old and I’ve been a conservative my entire life.  Both Alito and Thomas need to do better.",
                                                            "score": 21,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Pinot_Greasio",
                                                                    "body": "Can't even take some one seriously with this nonsense.  Have a great one!",
                                                                    "score": 6
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RealisticTadpole1926",
                    "body": "Flying a flag isn’t weighing in on anything other than that flag.",
                    "score": -7
                }
            ]
        },
        {
            "depth": 0,
            "author": "War-Damn-America",
            "body": "Oh no he flew a historic American flag that goes back to the Revolutionary War! Whatever will we do!",
            "score": 72,
            "replies": [
                {
                    "depth": 1,
                    "author": "NYforTrump",
                    "body": "Democrats hate the american flag.  They called the Betsy Ross flag flown at Obama's inaguration a symbol of white supremacy.  The think the Gadsden flag is fascist even though it's literally the opposite.\n\nThe only flag they want seen in public is one with rainbow stripes",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Holiday-Tie-574",
                            "body": "They don’t even know what “fascism” means",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Upstairs_Suit_3960",
            "body": "If true then nah this ain't right. SC judges have to be beyond reproach when it comes to impartiality. Imagine if one of the liberal-minded judges (Sotomayor, Kentaji, etc.) flew a BLM flag, or Antifa flag... Fox et al would *explode*.",
            "score": 48,
            "replies": [
                {
                    "depth": 1,
                    "author": "NYforTrump",
                    "body": "Or imagine if one of the district attorneys who are prosecuting Trump campaigned on a promise to get Trump no matter what.  Ohh wait they all did, and none of them have recused themselves.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "TwelfthCycle",
                    "body": "If you dig deeper you realize this wasn't on j6, and it was about an issue between him and his neighbor.\n\n\nNever trust the press.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "RealisticTadpole1926",
                    "body": "He didn’t fly a Trump flag so it’s fine.",
                    "score": -3
                },
                {
                    "depth": 1,
                    "author": "Zaphenzo",
                    "body": "Are you seriously comparing a flag dating back to the Revolutionary War the same as a flag explicitly supporting a leftist organization, by name, that has participated in countless violent riots?",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Upstairs_Suit_3960",
                            "body": "It doesn't matter what a flag used to represent if its meaning has been repurposed... Reminder that the swastika was repurposed by the Nazis.",
                            "score": 7
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HPIndifferenceCraft",
            "body": "I’ll be ordering one today.",
            "score": 21
        },
        {
            "depth": 0,
            "author": "Odd-Contribution6238",
            "body": "It’s on his personal property. \n\nMy god are we supposed to believe that the leftist judges don’t have any political opinions?",
            "score": 12
        },
        {
            "depth": 0,
            "author": "frostyjack06",
            "body": "Oh no!\n\nAnyway…",
            "score": 4
        },
        {
            "depth": 0,
            "author": "hiricinee",
            "body": "This creepy thing where we have people camping outside justices houses to spy on them has to stop.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Skyrimosity",
            "body": "Nontroversy",
            "score": 5
        },
        {
            "depth": 0,
            "author": "daringescape",
            "body": "Not ONE word about the original history of that flag?  Disgraceful.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "fitch303",
            "body": "I'm really starting to like the guy lol.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "greyoil",
            "body": "Based",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bran1986",
            "body": "They are doing this because someone leaked the media the immunity decision.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Skittlesharts",
            "body": "Typical trashy media always trying to make something out of nothing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "USA_USA_USA_1776",
            "body": "The only flag these clowns fly is the Palestinian flag. Their opinion doesn’t matter. ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bukook",
            "body": "Why do some have an issue with that flag?\n\nSure seems like more and more of our historic flags are deemed unacceptable.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Shit___Taco",
            "body": "This is just straight rewriting history at a hilarious authoritarian level. They are taking a historical Revolutionary War flag with a phrase from John Locke’s Second Treatise on Government and erasing that association and strictly tying it to a modern event where probably no more than two morons carried the flag during that event. To them the flag has no connection to historical context and instead is only related to an event popularized by modern politically motivated media.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "jdtiger",
            "body": "So if \"some rioters\" flew a certain flag on J6, then if you fly that flag you support them??? The most common flag flown on J6, BY FAR, is the normal American flag. So we need to recuse everybody who flies the American flag. Who does that leave? Can Ilhan Omar and Rashida Tlaib preside over a Supreme Court case?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ticonderogue",
            "body": "Impossible to prove Justice Alito's exact knowledge of or intent, in any case.\n\nMy wife did it - is a perfect explanation and justification. She's a free spirit. He didn't stop her. Therefore, he's a great modern man that even the Democrats should applaud.\nHad it been a rainbow flag, how would Democrats react? With cheers? Yeah, probably. No qualms with political bias in that case? Nope.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Gats775",
            "body": "They couldnt get Clarence Thomas so now they are coming for Alito with these weak ass hit pieces. Dems forget they accuse all the right leaning judges of sick crimes during confirmations so they’ve already been through worse. Doubt any of them will break now.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OutlandishnessMain56",
            "body": "Not a huge deal just seems like a boneheaded move that’s gonna attract the libs ire. Especially after his wife flew the American flag upside down because a neighbor pissed her off lol. Maybe he should just put stickers on his garage fridge for a few years until this blows over.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Rotisseriejedi",
            "body": "This would only bother a political group or media if they were communist\n\n&#x200B;\n\n&#x200B;\n\nHmm......",
            "score": 0
        },
        {
            "depth": 0,
            "author": "AstraVolans_21",
            "body": "Ray Epps is not a fed! Ray Epps was a Trump supporter (according to the media), that said people need to go into the Capitol and ended up being charged with a misdemeanor. I repeat, Ray Epps is not a fed!",
            "score": -4
        },
        {
            "depth": 0,
            "author": "AaronRodgersInjury",
            "body": "An upside down flag usually means distress",
            "score": 0
        }
    ]
}