{
    "title": "AOC: Prosecuting Trump Is Like Putting ‘An Ankle Bracelet Around Him’ Because He Can’t Campaign ",
    "comments": [
        {
            "depth": 0,
            "author": "Pinot_Greasio",
            "body": "Thankfully that brain dead corpse Joe Biden is out there \"campaigning\" reminding every one what a terrible job he's done as \"president.\"",
            "score": 217,
            "replies": [
                {
                    "depth": 1,
                    "author": "HaleOfAPatriot",
                    "body": "We’re just not smart enough to realize all the good he’s done. The economy is great. If only we could see that.",
                    "score": 45
                },
                {
                    "depth": 1,
                    "author": "Potential-Highway606",
                    "body": "Biden is such a bad president that he’s going to lose in a landslide to a guy who couldn’t campaign at all due to election interference.\n\nFirst, and likely only, time in US history this will happen.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "AstraVolans_21",
            "body": "The soviets would be envious at how the democrats are treating their political opposition.",
            "score": 122,
            "replies": [
                {
                    "depth": 1,
                    "author": "GabrDimtr5",
                    "body": "Eh… Not really. Stalin sent people to death for not clapping for him. The thing the Soviets would be envious though is how much the Democrat propaganda (mainly on Reddit but also on old Twitter) is working on people.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AstraVolans_21",
                            "body": "Do you remember when Hillary said that the Republicans need some 'deplatforming camps' ?",
                            "score": 21
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DblThrowDown",
                    "body": "Very much so.",
                    "score": 13
                }
            ]
        },
        {
            "depth": 0,
            "author": "cwino2288",
            "body": "Saying the quiet part out loud again",
            "score": 115,
            "replies": [
                {
                    "depth": 1,
                    "author": "Conscious_Tourist163",
                    "body": "She might have just realized it.",
                    "score": 15
                }
            ]
        },
        {
            "depth": 0,
            "author": "DufferDan",
            "body": "She has to speak on occasion just to relieve all doubt!",
            "score": 55,
            "replies": [
                {
                    "depth": 1,
                    "author": "shanktor",
                    "body": "Comfortably dumb",
                    "score": 19
                }
            ]
        },
        {
            "depth": 0,
            "author": "R0binSage",
            "body": "The follow up question should he if she thinks that’s a good or bad thing.",
            "score": 21
        },
        {
            "depth": 0,
            "author": "scully360",
            "body": "Trump lives rent free in her head.  And there is a lot of empty space for him to spread out in.",
            "score": 22
        },
        {
            "depth": 0,
            "author": "DJDevine",
            "body": "AOC: The knife in a gun fight",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "These-arent-my-pants",
                    "body": "A plastic McDonald’s knife",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "eatingyourmomsass",
                    "body": "I’d still hit it though.",
                    "score": -3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Madness970",
            "body": "Trump has quite a few more swamps to drain after Biden created a few more and it’s going to be fun to watch. Let’s get a few more Supreme Court justices while we’re at it.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Nero_Ocean",
            "body": "Sounds like she knows a thing or two about an ankle bracelet.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Nero_Ocean",
                    "body": "Her district would vote for a pile of dog shit as long as it has a [D] next to it on the voter page. I mean as you can see with her they already did this.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "twhiting9275",
            "body": "And this is exactly why they did this... EXACTLY why. The timing is not lost on anyone with a brain",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Uberjeagermeiter",
            "body": "Plus, the Trial further shows the corruption of the Biden(Clinton/Obama) Administration.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "yespleasethanku",
            "body": "Can people in her district please get rid of her already?",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Extra_Suit1637",
            "body": "How does your filthy foot taste?",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "vicemagnet",
                    "body": "Easy…you could summon Quentin Tarantino with that talk!!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ticonderogue",
            "body": "Perhaps that's a good reason to select a VP this early, so they can campaign in Trump's stead. Or invite several potential VPs to all get out there and campaign hard, in his campaign dime, in exchange for a seat somewhere in the Trump administration. Let the right's voters inform Trump as to who they end up preferring most. Enter the Octagon! 4 wouldbe VPs enter, but only one succeeds.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "badkarmavenger",
            "body": "I'm just sitting here watching Trump campaign I'm and around NYC for months. He'd have to flip a million votes, or about 15% of 2020 presidential voters. 28 electoral votes. Just sitting there",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Holiday-Tie-574",
            "body": "She is busted",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ThisFieroIsOnFire",
            "body": "Well, no shit horse teeth!",
            "score": 1
        }
    ]
}