{
    "title": "Someone dropped a Trump mugshot banner that says “Never Surrender” at Yankee Stadium",
    "comments": [
        {
            "depth": 0,
            "author": "thegreatinverso9",
            "body": "7th inning insurrection.",
            "score": 145
        },
        {
            "depth": 0,
            "author": "KinGpiNdaGreat",
            "body": "Erectionists.",
            "score": 105,
            "replies": [
                {
                    "depth": 1,
                    "author": "MAGAJahnamal",
                    "body": "I can only get so erect!",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "lets_shake_hands",
            "body": "Names are now on the FBI watchlist...",
            "score": 92,
            "replies": [
                {
                    "depth": 1,
                    "author": "rigorousthinker",
                    "body": "Haven’t they learned the pro Hamas tricks of the trade like wearing a mask??",
                    "score": 36,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "darthcoder",
                            "body": "Nah, unlike the pro hamas agitators, he actually has the courage to stand by his convictions.",
                            "score": 25
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ufdan15",
            "body": "He's gonna pull a massive crowd tomorrow in the Bronx, isn't he?",
            "score": 54,
            "replies": [
                {
                    "depth": 1,
                    "author": "grapefruitwaves",
                    "body": "Hoping for this. I cannot stand AOC and she is so wound up over this Bronx visit",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "skywarner",
                    "body": "People will be shocked when the pollsters begin to realize just how much in play New York really is.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Arachnohybrid",
                            "body": "Trump won’t win New York but my hope is the campaigning coattails down to some house seats here in the election.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ufdan15",
                                    "body": "I don't think he will win it, but boy howdy if he did we'd know the election results before 10pm",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DFVSUPERFAN",
                            "body": "If Trump were to somehow win NY and NJ, I don't think I would ever stop lol'ing at libs.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "RedditsLittleSecret",
                            "body": "And New Jersey.",
                            "score": 5
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Aronacus",
            "body": "Fun Fact Upstate NY and Long Island were RED in the last election cycle.  However, the abundance of Blue folks in NYC overpowered us.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "vpkumswalla",
                    "body": "I did some project work with some folks in Syracuse.  Good people.  Probably feel the same way as the liberals in my very red state",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "harmier2",
            "body": "Were leftists triggered?",
            "score": 37,
            "replies": [
                {
                    "depth": 1,
                    "author": "misterbule",
                    "body": "Probably waived their Palestinian flags in response.",
                    "score": 61,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vpkumswalla",
                            "body": "Probably sent a petition to the NY Yankees requesting Free Palestine day.  First 10,000 receive poor hungry looking Palestinian kid bobble head",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Imissyourgirlfriend2",
                    "body": "When are Lefties *not* triggered?",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "harmier2",
                            "body": "*Very* true.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "blkmgk533",
                    "body": "Doubt many in attendance.  Hard to come up with the scratch for 4 in the bleachers and a couple of dogs when you won't even buy yourself deodorant.",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "avd51133333",
            "body": "🇺🇸",
            "score": 19
        },
        {
            "depth": 0,
            "author": "Ticonderogue",
            "body": "I'm more surprised to see Kikkoman advertising at the stadium. They're the leading soy sauce manufacturer in the world. They have two plants in the US, and a third is rumored to be slated for Jefferson, Wisconsin.\n\nI should re-watch Mr Baseball soon. If there's one thing I like about baseball, it's movies about baseball.\n\nPolitical Affiliation of MLB Fans (brace yourselves)\nhttps://www.statista.com/statistics/1174866/political-affiliation-mlb-fans/",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "FollowKick",
                    "body": "The Kikkoman advert always strike me as out of place. I wonder on the story there",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "therin_88",
                            "body": "Baseball is hugely popular in Japan. Like, possibly (by percentage) more popular than in the US. It's probably something as simple as the Kikkoman CEO being a Yankees fan.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KinGpiNdaGreat",
                                    "body": "Baseball has become something like a religion in Japan. More people watch that over there than people watch the NBA, MLB, NHL combined in the US.",
                                    "score": 8
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Scattergun77",
                            "body": "Well, they do make incredibly good soy sauce(and the low sodium stuff tastes exactly like the regular).",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Ticonderogue",
                            "body": "I'm curious too. Maybe it's emblematic of Americans tastes having grown for Japanese fare, sushi, hibachi, saki, etc. I'm a fan. Are they the 'Official soy sauce of MLB'? Its a recognizable and respected brand, just normally you see other types of adverts like hotdogs, auto parts, beer, banks, software, etc who sponsor MLB. Baseball being really big in Japan, I wonder if American brands sponsor and advertise in their stadiums. Something to look into.",
                            "score": -6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sowellpatrol",
            "body": "Never give up! Never surrender!",
            "score": 10
        }
    ]
}