{
    "title": "No words at all",
    "comments": [
        {
            "depth": 0,
            "author": "AFXTIWN",
            "body": "We are living in a reality TV show, a circus of tomfoolery.",
            "score": 874,
            "replies": [
                {
                    "depth": 1,
                    "author": "yourzero",
                    "body": "It's like we are in the Truman show, with either really shitty or really clever writers. Either way, it's fucking gripping.",
                    "score": 99
                }
            ]
        },
        {
            "depth": 0,
            "author": "zrennetta",
            "body": "It's sad when George Floyd is the best you've got. They really need to find better martyrs.",
            "score": 848,
            "replies": [
                {
                    "depth": 1,
                    "author": "OldMembership332",
                    "body": "Lmao they said to honor his life. He was a drug riddled gun wielding robber that targeted a pregnant woman.",
                    "score": 87,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NoorDoor24",
                            "body": "With a KNIFE at her belly.....\n\nFuck that crook.",
                            "score": 15
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "straiight-n-right",
                    "body": "George Floyd is the best they have.",
                    "score": 67
                },
                {
                    "depth": 1,
                    "author": "HNutz",
                    "body": "They're trying ",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AmebaLost",
                            "body": "Very trying. ",
                            "score": 10
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dzolympics",
            "body": "George Floyd was a loser. Sorry not sorry.",
            "score": 833,
            "replies": [
                {
                    "depth": 1,
                    "author": "Freedom_Isnt_Free_76",
                    "body": "A criminal loser.",
                    "score": 462,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "somerandomshmo",
                            "body": "*Perfect democrat voter",
                            "score": 258,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ILikeMtnDew",
                                    "body": "Now he has no choice but to vote for Biden again",
                                    "score": 176,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Blonde_Dambition",
                                            "body": "👍👍👍👍👍",
                                            "score": 16
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Choco_Cat777",
                            "body": "Nice pfp",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Freedom_Isnt_Free_76",
                                    "body": "Ditto!",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NoManufacturer120",
                    "body": "Hadn’t he been to prison for armed robbery? And the whole reason he was stopped by police in the first place wasn’t because he was an innocent person…he was committing crimes while also using drugs. I couldn’t believe that’s who they chose to be their martyr.",
                    "score": 145,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "day25",
                            "body": "Yes he was also out spreading covid too. And not just using drugs he had just bought them from his dealer and swallowed them all to hide them when police showed up (as he had already done before with previous encounters with police and had to be taken to the hospital).",
                            "score": 74,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Blonde_Dambition",
                                    "body": ">he had just bought them from his dealer and swallowed them all to hide them when police showed up\n\nWhich is the REAL reason he couldn't breathe... he'd od'd! Strange though that if he couldn't breathe he could talk though... 😏",
                                    "score": 74,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "VCoupe376ci",
                                            "body": "You can witness some crazy things in addicts that have built up tolerance over many years of drug use.",
                                            "score": 8
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "plastimanb",
                            "body": "Holding a gun to a pregnant womans stomach too.",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fdrowell",
                                    "body": "Democrats never have cared about what's inside a pregnant woman's belly.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Gravygrabbr",
                                            "body": "Comment of the day right there.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "tsoxiko",
                            "body": "I believe he tried to pass a counterfeit bill at a liquor store and the owner called police,which started this whole thing…..but I barely paid attention to it and could have mixed up the type of “business” that the gentle giant,aspiring astronaut,on his way to church floyd tried to drop a fake bill for goods at….\n\nblm…..ehh..\n\nwhere I come from,that’s the acronym for bureau of land management 🤪",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "space_face_mace",
            "body": "They already burned down cities and threw Derek Chauvin in prison as the sacrificial lamb.. all to praise their St Floyd. The left really picks the worst people to lionize.",
            "score": 455,
            "replies": [
                {
                    "depth": 1,
                    "author": "sowellpatrol",
                    "body": "Given over to their delusions",
                    "score": 30
                }
            ]
        },
        {
            "depth": 0,
            "author": "GovernmentLow4989",
            "body": "Wasn’t George Floyd that criminal who overdosed on drugs a few years ago and died? It’s a sad story but I’m not sure we should be naming government policies after him",
            "score": 555,
            "replies": [
                {
                    "depth": 1,
                    "author": "The_Sandman32",
                    "body": "Well he already got a gold plated casket and a nationally televised funeral procession when all the rest of us had to stay inside and away from eachother… but that clearly wasn’t enough",
                    "score": 300,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ChemsDoItInTestTubes",
                            "body": "Maybe if the death of your grandmother could be exploited for cheap political points you would have been allowed to attend her funeral, I guess.",
                            "score": 128
                        },
                        {
                            "depth": 2,
                            "author": "Clarity_Zero",
                            "body": "New York (and they aren't alone) also tore down a magnificent statue of Thomas Jefferson while putting *up* an ugly statue of an uglier man. And I'm not talking mere appearances, either.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "TimberMoto",
                            "body": "He even got a statue. Guess maybe they'd truly be satisfied if his mug was on a C note...",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "vipck83",
                            "body": "It’s never enough. The left will always want more.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PR05ECC0",
                    "body": "You left out the part where he held a loaded gun to a pregnant women’s head",
                    "score": 163,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "madonna-boy",
                            "body": "her stomach, not her head",
                            "score": 38,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dible79",
                                    "body": "Yeah but his mother sayed he was realy a good boy at heart lol. An his family have made a fortune out of his death by overdose. An a innocent man getting jailed for doing his job.\nBLM set a dangerous precedent an they don't care cos they got one over on the whites.\nTottaly not racist lol.",
                                    "score": 11
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "hollowtooth1",
                            "body": "And that he completely abandoned his family to go “find work out of state” left his baby mama and kid in Texas and was up in Minnesota",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cultural-Treacle-680",
                    "body": "I’m surprised Michael brown isn’t the title either.  He was the strong arm robber in Ferguson.",
                    "score": 56,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jakerepp15",
                            "body": "Lol [enjoy](https://bush.house.gov/media/press-releases/congresswoman-bush-reintroduces-helping-families-heal-act)",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cultural-Treacle-680",
                                    "body": "That’s just so bizarre.  Steal from a store, try to kill a police officer, and you’re the victim.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Freedom_Isnt_Free_76",
                    "body": "And the result was a railroaded police officer.",
                    "score": 61,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Griegz",
                            "body": "aka jUsTiCe iN PoLiCiNg",
                            "score": 25
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Blonde_Dambition",
                    "body": "There's already a street named after his sorry ass in Atlanta",
                    "score": 14
                }
            ]
        },
        {
            "depth": 0,
            "author": "goodolddaysare-today",
            "body": "The left chooses the worst martyrs. Like remember that piece of shit homeless subway dude in NYC that finally got eliminated with a chokehold for terrorizing the wrong train car that day?",
            "score": 150,
            "replies": [
                {
                    "depth": 1,
                    "author": "Technicaal",
                    "body": "The one with the 24-year-old veteran who feared for the safety of the people in that subway and is now facing 20 years because he happened to be white so it became a national news story? Yes, I remember.",
                    "score": 22
                },
                {
                    "depth": 1,
                    "author": "Marlo_Stanfield_919",
                    "body": "I have a cousin in NYC who still goes crazy about \"justice\" for that man who had been arrested 20+ times, threw things at subway passengers, and yelled \"I'm not afraid to die.\" It's not dead in NYC yet.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Arachnohybrid",
                            "body": "Correction, Jordan Neely had 44 prior arrests",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FonzyLumpkins",
                    "body": "Don't worry, the NYC DA is going after the true criminal, the guy who defended other people from the crazy homeless person.",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "IlIIlIIIlIl",
                    "body": "People there said they've seen the worst of the worst for decades and that was the first time they genuinely feared for their lives.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "JeanLucPicard1981",
            "body": "Yeah, he should be alive today. But instead he got higher than a kite and was violent and a pain in the ass to police officers. Yes, Chauvin should have handled things differently, but no one put Floyd in a collision course with the police other than himself.",
            "score": 158,
            "replies": [
                {
                    "depth": 1,
                    "author": "vikingsurplus",
                    "body": "I kind of agree.\n\n>Yes, Chauvin should have handled things differently,\n\nThat's easy to say, when you aren't in the situation. Should he? IDK because I wasn't there. Could he have handled it differently? Absolutely. But we don't know what that outcome would have been. \n\n>but no one put Floyd in a collision course with the police other than himself.\n\nThis is the part I agree with. \n\n>Yeah, he should be alive today.\n\nShould he, really? A history of drug abuse and violence. A history of assault and battery. How long until someone died at his drug fueled hands?\n\nNot long at the rate that his victim count was rising.",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Justified_Gent",
                            "body": "Yeah he should be alive.\n\nBeing a criminal doesn’t mean you deserve to die by law, unless you are convicted of murder in a few states.\n\n\nSo yes, he should be alive and Chauvin killed him.\nWhether or not you agree with his character is a different story to his right to life.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TongueofMyth",
            "body": "Then how about Laken Riley and so many other victims murdered by illegal immigrants?  Has any leftist honored their life with action? No, Never! even can't pronounce her name correctly which show their indifference and ignorance. They pretend to be a saint, but in the mind fills benefits full of blood.",
            "score": 73
        },
        {
            "depth": 0,
            "author": "EngineerRemote2271",
            "body": "Sitting behind a wheel of a car, off his face on speedballs? Does no Democrat care about the people he may have killed if he'd been allowed to drive off?\n\nPeople should try kneeling on the back of a neck sometime - *It Does Nothing*... because the wind pipe is in the middle and the carotid arteries are at the sides. That's why it's in the training manual. Everything in this case is BS",
            "score": 180,
            "replies": [
                {
                    "depth": 1,
                    "author": "Freedom_Isnt_Free_76",
                    "body": "It's actually more like the shoulder blade.",
                    "score": 46,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EngineerRemote2271",
                            "body": "Yes it was just the shoulder blade, or at least that's my interpretation of the video\n\nBut legacy media spun this as 'kneeling on his neck' because that's more of a slave imagery, just like the border guards horse whipping BS. I'm pretty sure I could take someone standing on my shoulder blade, never mind resting their little knee on it\n\nSickening how every official threw those cops under a bus just to appease the Marxists.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "adminsrfascist29",
                    "body": "They accomplished what they needed to with this at the time. It was so sickening to watch it work. Remember it was during peak Covid lockdown bullshit too. CNN took their death counter banner off their screens for this blm bs. It’s enraging they got away with this, but I blame the people for not seeing through it",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "B4NND",
            "body": "Is it just me or is this shit making you more tribal?",
            "score": 60,
            "replies": [
                {
                    "depth": 1,
                    "author": "sanesociopath",
                    "body": "There's some damn good stuff in that bill that could definitely get bipartisan support if the democrats weren't being insufferable with it and also making race first and foremost",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "BIG_BOTTOM_TEXT",
                    "body": "Careful: that's the Progressives' long con here.  They are intentionally destabilizing the country to provoke an extreme response from conservatives, so the Dems can point to that and pass all kinds of authoritarian legislation in response.\n\nDo NOT give in to anger.  Just stand firm and rejoice in being on the right side of history.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "B4NND",
                            "body": "I do want to give in to anger. \n\nThe difference is that my anger makes me want to move into the woods with my family and homestead as far away from evil as I can. \n\nThe problem is that the last guy that did that had his wife and kid killed by the state.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "RogueCoon",
                            "body": "That only works so much. They take an inch then you stand firm at the new spot until they take another inch. After a hew years your not even close to the original line you wanted to hold.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "_That_One_Fellow_",
            "body": "I wonder why they haven’t made a documentary on his life to demonstrate great man he was. He was a hero and an example what kind of person liberals want to strive to be like, after all.",
            "score": 49,
            "replies": [
                {
                    "depth": 1,
                    "author": "Blonde_Dambition",
                    "body": "Give 'em time... it'll come!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Specialist-Cover-316",
                    "body": "There should be a true documentary about what a POS he was.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rubixcu7",
                    "body": "They did. Its called “the greatest lie ever sold”. Oh wait that doc shows what BS the whole thing was.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "gcr1897",
            "body": "I’ll die on this hill: AOC is the dumbest squad member, but not the most dangerous, that’s a close matchup between Tlaib and Omar.",
            "score": 52,
            "replies": [
                {
                    "depth": 1,
                    "author": "Arachnohybrid",
                    "body": "Wrong. AOC can’t be the dumbest when Cori Bush exists. She genuinely makes AOC look like Einstein.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gcr1897",
                            "body": "This is honestly a valid counterpoint, not gonna lie. So basically AOC doesn’t excel even at sucking, that’s her whole existence in a nutshell.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Blonde_Dambition",
                    "body": "I'll die on that hill with ya because I completely agree!",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "BIG_BOTTOM_TEXT",
                    "body": "They are all, as the Soviets said, \"Useful idiots\" who will be immediately discarded by their handlers once their use as cultural provocateurs has run its course.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "homestar92",
            "body": "Two things can be true at once:\n\n1. He probably should be alive. Yeah I'll agree there. Assuming of course that, had he not died when he did, he wouldn't have OD'ed to death between then and now, of course.\n2. His life was absolutely, positively NOT one worth honoring.\n\nHe wasn't a good dude. Does that mean he deserved to die? No. But he absolutely was NOT a good guy and not worthy of \"honor\".",
            "score": 10
        },
        {
            "depth": 0,
            "author": "GodzillaDoesntExist",
            "body": "Let me guess, it's a 500 page bill that contains 499 pages of funding for Israel and/or Ukraine, and a title sheet.",
            "score": 85,
            "replies": [
                {
                    "depth": 1,
                    "author": "rubixcu7",
                    "body": "Is this bitch wants it, there’s no Israel funding.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "ValuableShoulder5059",
                    "body": "499 pages of Ukraine funding. While in the meantime our closest ally doesnt get shit because they supposedly might have accidentally killed some civilians who were probably hamas or hamas supporters, or at least hamas enablers. Remember there is zero outcry from the \"civilians\" there to get rid of hamas, so...",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "MadamJules",
                    "body": "Yep they’re always “bundling” bills 🤦‍♀️",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "tennisguy163",
            "body": "Pathetic pandering.",
            "score": 30
        },
        {
            "depth": 0,
            "author": "RandolphE6",
            "body": "I will never understand the left and their fascination with putting criminals on a pedestal.",
            "score": 31,
            "replies": [
                {
                    "depth": 1,
                    "author": "CompressedTurbine",
                    "body": "Because they represent themselves. They see their brother, their cousin, their daughter, their parents in these criminal derths of society. Morally bankrupt mentally ill degenerates. \n\nMy own fucking mother has the sickness of group think. The greatest illusion the left ever pulled is tricking all their constiuents into thinking they all share the same plight because of their individual personal fuck ups.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "aybabyaybaby",
            "body": "LMAOAOAOAOAOAOAOAOAOAOAO",
            "score": 31
        },
        {
            "depth": 0,
            "author": "GermanCrusaderKing",
            "body": "The circus continues",
            "score": 22
        },
        {
            "depth": 0,
            "author": "ca17miledrive",
            "body": "George Floyd was a felon, drug addict, thief and man who punched pregnant women in their stomachs. That isn't exactly hero status in my book. This woman is unhinged. Vote red.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Vermithrax2108",
            "body": "Was his death unfortunate and potentially avoidable? Yes.\n\nWas he a piece of shit criminal drug addict? Also, yes.\n\nHis life deosnt deserved to be honored.",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "Blonde_Dambition",
                    "body": ">Was his death unfortunate and potentially avoidable? Yes.\n\nSorry I don't see why his death is unfortunate since he brought it on himself.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "inlinefourpower",
            "body": "I guarantee that even if he wasn't arrested in 2020 he'd be dead by now. If the people really cared about people like George Floyd (and there are thousands every year) they'd be doing something about the drugs and mental illness on our streets. ",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Atomik675",
            "body": "Yep it's an election year, time to bring up George Floyd again to try and steer people away from anti Israel protests.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "LouisWu987",
            "body": "Cunned Stunt",
            "score": 5
        },
        {
            "depth": 0,
            "author": "WilyNGA",
            "body": "The horse is tired...",
            "score": 7
        },
        {
            "depth": 0,
            "author": "j-laugh",
            "body": "FFS Cori Bush is trying something similar for Michael Brown.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cultural-Treacle-680",
                    "body": "Killed by a cop when Brown was trying to steal his gun?  Was that him?",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RandomStormtrooper11",
                            "body": "Yep, good ol' Saint Mike. \"He should still be here with his family!\" Maybe he would be if he didn't rob a convenience store before trying to wrestle a cop for his gun.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Calmizzy_47372",
                            "body": "I remember that day watching the video, I’m glad they released the body cam footage and showed the entire thing instead of the shortened part where everyone was criticizing the cop for doing",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Deekifreeki",
                            "body": "Yes. And beat the shit out of the cop. But don’t forget he was the “gentle giant”",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Spoiler-Alertist",
            "body": "Honor his life?  You mean when he held a gun to a pregnant woman?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Uberjeagermeiter",
            "body": "Hope the Squad goes Bye-Bye soon. Maybe their districts will wake up and vote them out. \n\nAOC’s district is practically 3rd World after she chased Amazon away.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "ibanez3789",
            "body": "How much special interest funding does the back half of this bill have I wonder?",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "sanesociopath",
                    "body": "Oh there's a lot of areas for money to get corrupted away with it.\n\nI'd say it's salvageable with negotiations though if either side actually wanted to help the people instead of grandstand and campaign on platitudes. \n\n[Wikipedia](https://en.m.wikipedia.org/wiki/George_Floyd_Justice_in_Policing_Act)\n\n[raw congress.gov](https://www.congress.gov/bill/117th-congress/house-bill/1280)",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "YankeeRedneck1",
            "body": "🤮",
            "score": 12
        },
        {
            "depth": 0,
            "author": "Holiday-Tie-574",
            "body": "How about slob",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Baller-Mcfly",
            "body": "What everyone carries narcan and fake 20s? What do they want!?",
            "score": 7
        },
        {
            "depth": 0,
            "author": "OkPhase7547",
            "body": "Let me say it slowly for you … he … over … dosed.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "vpkumswalla",
            "body": "Well he did get a celebrity funeral and his casket parading in a gold plated horse drawn carriage.  That is up there with JFK's funeral.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "KippySmith",
            "body": "George Floyd would probably be dead today if police hadn’t been called about the fake money that day anyway. What part of his life was honourable? People like Tlaib need to stop pretending like every life has an equal value when it doesn’t.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "MerelyWhelmed1",
            "body": "One of the other Squad members is pushing a bill in the name of Michael \"I didn't really put my hands up\" Brown. They're all delusional.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LostInCa45",
            "body": "He would be alive today if he didn't od on drugs.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dummyfodder",
            "body": "The democrats killed George Floyd. \n\nDerek Chauvin - Democrat. Had 12 previous use of force complaints \n\nTim Waltz - Democrat Governor who let \"non-violent\" offenders out of jail to protect the inmates from covid\n\nAmy Klobuchar- Democrat and Senior Senator from MI. Previously the DA of Hennipin county who decided not to investigate the use of force complaints about Chauvin. \n\nA guy who probably shouldn't of been a cop. A guy who definitely should've been in jail. And people 'in-charge\" who just do and say whatever it takes to win their next election 🙄",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Jolly_Job_9852",
            "body": "It's an election year, how are you surprised by this posturing? The GOP does the same shit every two to four years as well.",
            "score": -52,
            "replies": [
                {
                    "depth": 1,
                    "author": "Blonde_Dambition",
                    "body": "Wrong sub hon.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jolly_Job_9852",
                            "body": "It really isn't. The bill is brought up not because the left believes it will be passed but because it's a ploy to garner sympathy votes from minorities who believe that systemic racism is that prevalent.",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "tekende",
                    "body": "The GOP tries to pass bills honoring violent criminals every four years?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jolly_Job_9852",
                            "body": "Use some common sense. The GOP proposes bills that appeal to their base as well during an election cycle.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheStinger87",
            "body": "They should be passing the George Floyd Don't Do Lethal Drugs Act.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "plastimanb",
            "body": "She's such a tone deaf smooth brain.",
            "score": -1
        }
    ]
}