{
    "title": "That's why mainstream medias can never be trusted. They're the largest fake-news makers",
    "comments": [
        {
            "depth": 0,
            "author": "GeneticsGuy",
            "body": "There about 1000 other examples. This was literally happening daily.",
            "score": 326,
            "replies": [
                {
                    "depth": 1,
                    "author": "AppropriateRice7675",
                    "body": "The left wing media fabricates outrage over pretty much everything he does. \n\nIt almost seems like an in joke. Like they have a daily meeting every afternoon with the agenda of  \"what's the stupidest thing we can get our viewers to be angry about today?\" And this particular day, somebody came up with \"the pace at which Trump fed Koi.\" Everyone in the room would have been hesitant, thinking there's no way the public will be outraged over something so asinine. But here we are. I'm sure whoever came up with the idea got promoted.",
                    "score": 83,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JCuc",
                            "body": "> Like they have a daily meeting every afternoon with the agenda of \"what's the stupidest thing we can get our viewers to be angry about today?\"\n\nIt's not like, it's true.  The corporate media works directly with the executive office (Democrat offices) is dispurse fake narratives so that all these disinformation spreading companies hop on the same bandwagons.\n\nI strongly believe that these companies and the people who direct their motives are some of the most evil and disgusting entities in this country.  Dividing, misleading, and straight up lying to people to further worsen this country.",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Hectoriu",
                    "body": "My favorite is the \"will he disavow?!?\" Train on every shitty person that supported him no matter how irrelevant they were.",
                    "score": 26
                },
                {
                    "depth": 1,
                    "author": "SerialSection",
                    "body": "And they did it about the most innocuous things and the big things.  It firmed in my mind how awful these companies lie.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Iatedtheberries",
                    "body": "Yup. Just recently I saw people correlating Trump \"freezing\" at NRA when the teleprompter stopped working to when the Dead Man Mitch completely froze. Obviously, Mitch had a medical scare and Trump is just tired with what's going on and was waiting for the teleprompter to come back on.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Arachnohybrid",
                            "body": "Trump was actually just waiting for the music to die down before continuing.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ButWhyWolf",
                    "body": "It's the boy who cried wolf.\n\nImagine how the 2024 election would be shaping up if they hadn't spent the last NINE YEARS lying and distorting everything.  \n\nAre Trump's trials legit?  Are they a witch hunt?  I literally don't know because the only people telling me to take them seriously are the ones who've been lying to me for a decade.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cylerhusk",
            "body": "I STILL see people reference the koi pond thing as they have no idea how the video was deceptively cropped.",
            "score": 116,
            "replies": [
                {
                    "depth": 1,
                    "author": "Black_XistenZ",
                    "body": "And even if their version of the story had been true, it would still have been completely ridiculous. Nothing screams TDS louder than some media honchos genuinely thinking that \"Trump overfed the kois\" should be a headline.",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "Batbuckleyourpants",
                    "body": "People were freaking the fuck out too. \n\n\"HES OVERFEEDING THE KOI! TRUMP IS KILLING THEM!",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "StrictlyHobbies",
                    "body": "I didn’t know until I just saw it. That’s how fucking deceptive they are.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "GargantuanCake",
                    "body": "For a lot of people in that particular camp reality doesn't matter. All that matters is power. If you have to scream ORANGE MAN BAD and lie about him constantly then so be it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Aeropro",
            "body": "Remember when he had TWO SCOOPS OF ICE CREAM!!",
            "score": 41,
            "replies": [
                {
                    "depth": 1,
                    "author": "Eternal_Phantom",
                    "body": "That still boils my blood. I will never forgive him for that atrocity.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "ElectricTurtlez",
            "body": "The number of people who are just realizing this is mind boggling.",
            "score": 136,
            "replies": [
                {
                    "depth": 1,
                    "author": "Blahblahnownow",
                    "body": "The number of people who still don’t realize it is worse",
                    "score": 85,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Shot-Traffic4183",
                            "body": "The number of people who realize it and don’t care are the problem",
                            "score": 25,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Arachnohybrid",
                                    "body": "TDS is an incurable condition unfortunately",
                                    "score": 18
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Alexcox95",
                            "body": "The number of people who do realize it but deny it anyways is alarming.",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "Swizerlan",
                            "body": "The number of people rejecting this as truth is even more dismaying",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "Savant_Guarde",
                            "body": "Exactly.",
                            "score": 18
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sad-Amoeba3186",
                    "body": "I can’t be the only one that remembers when that Hispanic dude was arrested and when it made national news, cnn, msnbc, and all the others ran his mugshot at like 1000% brightness.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "HiSelect7615",
                    "body": "Bruh there's still people who this day think Kyle Rittenhouse shot a bunch of black people in cold blood.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "K00lK1tK4t",
            "body": "Well well well. I wonder why this is not posted to r/facepalm …",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "Enough_Discount2621",
                    "body": "The real facepalm is the people on that subreddit\n\n9 times out of 10 it's literally just r/politics but somehow more insufferable",
                    "score": 20
                },
                {
                    "depth": 1,
                    "author": "Professional_Fix_537",
                    "body": "You’ll be banned instantly 😂",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Xilbert0",
                    "body": "Lol nope, and I think if you post it there, they shadow banned you.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DWDit",
            "body": "The left will say these are innocent mistakes, but when asked for a string of clips of innocent mistakes going against Democrats, there are no such examples.",
            "score": 24
        },
        {
            "depth": 0,
            "author": "therin_88",
            "body": "Videos of back when we actually had a President instead of a narcolepsy patient.",
            "score": 96,
            "replies": [
                {
                    "depth": 1,
                    "author": "SmeV122",
                    "body": "More like Alzheimers patient unfortunately",
                    "score": 19
                }
            ]
        },
        {
            "depth": 0,
            "author": "Chrisshern",
            "body": "Can't believe Trump.was the guy to wake me up to the reality that Dems are kinda an evil party.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Similar-Stranger7375",
                    "body": "One of us, one of us gooble gobble, gooble gobble...",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Potential-Highway606",
                    "body": "I’ve always been a conservative, but I used to mistakenly believe that Democrats loved America, too, but they just disagreed with me in good faith on some policy issues.\n\nWhen I read the mission statement of the Church of Satan and realized how closely it correlated to the Left’s beliefs (a lot of talk of bodily autonomy and strict adherence to scientific principles, among other things), was like a lightbulb moment for me for realizing that the Democratic Party was actually legitimately evil… And their increasingly anti-America radicalism is the polar opposite of “loving America.”",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "nomatchingsox",
            "body": "And then when Trump tells them and us and the world that what's happening to him is a witch hunt the left I'll mock him and ridicule him but they aren't paying attention and when they see these examples they will turn a blind eye",
            "score": 6
        },
        {
            "depth": 0,
            "author": "RightSideClyde",
            "body": "MSM are masters of manipulation, and the sheople eat it up.  They know that once their woke voting base sees it, they take it as gospel with no chance of being swayed by the actual truth later.",
            "score": 43
        },
        {
            "depth": 0,
            "author": "Typical-Machine154",
            "body": "When the media controls the narrative, they control the truth. Only people willing to believe what they can't see know this is what was happening the whole time. \n\nSome of it you can't prove, most of it even if you can, snopes will come and fact check you and say you're wrong.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Black_XistenZ",
                    "body": "This is also why they are even more triggered by Trump than by his predecessors. Trump calls them out on their deceptive bs and actively pushes back against it while Romney, McCain et al. just stood there, \"took the high road\"  and endured the absuse \"with decorum and dignity\".",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ashgar77",
            "body": "I have shown clips like these to people and they just argue that it was the other way around and the far right are using AI to make Trump look better than he is.  You just can't win with some people.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "MaximumCulture7917",
            "body": "This is a great vid",
            "score": 6
        },
        {
            "depth": 0,
            "author": "mertagh",
            "body": "How many times is a news org allowed to lie before losing credibility?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Swizerlan",
            "body": "Gonna be weird to see snopes attack this. They gonna need generative ai",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Difficult_Job_966",
            "body": " Unreal.  I’m so done with msm",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Tredolski",
                    "body": "You still watch it?😂 Shoot I don’t even watch any news anymore. It’s 100% propaganda. Especially freaking ABC. Can’t stand that some of my family who claims to be conservative watches that shit.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "vpkumswalla",
            "body": "and didn't CNN edit the video of the Covington Catholic boys to make it appear they surrounded and harassed the kind peaceful Native American?",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Sparky_Zell",
            "body": "And it's made even worse that when Trump said anything, he was called a tyrant for trying to destabilize/influence the news. And it's not just Trump, even though he is the most frequent target.  Yet countless people still truly believe that all of the msm organizations have a heavy conservative bias. I don't understand how people can still be so willfully ignorant.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Arachnohybrid",
                    "body": "r/politics and MSNBC were accusing the New York Times of being conservative because they released polls showing Biden not doing well in swing states.\n\nI actually have a NYT subscription because it’s my go to news source from the other side. Nothing on their front page even comes close to right of center much less conservative.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "Xilbert0",
            "body": "That's why normies has TDS.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Joshunte",
            "body": "Police in America: “First time?”",
            "score": 3
        },
        {
            "depth": 0,
            "author": "This-Sea-4074",
            "body": "The media does this shit towards Trump as well as trying to convey that he has lost his mind. Meanwhile, back at the ranch, we are being totally screwed. How on God’s green earth are these people so blind?? It boggles my mind.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Moviecaveman",
            "body": "Does anyone have a comprehensive list of fake news?",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "tekende",
                    "body": "List of non-fake news would probably be a lot shorter.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Joshunte",
                    "body": "No, because unlike Democrats, Conservatives actually go to work and spend time with their families. Doesn’t leave a lot of time for much else.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "UWbadgers16",
            "body": "Would be really interesting to see new Twitter/X and if they refute these stories under another Trump presidency.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Arachnohybrid",
                    "body": "Community notes are so good even if they aren’t 100% accurate.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "HiSelect7615",
            "body": "This is just a fraction of reality",
            "score": 2
        },
        {
            "depth": 0,
            "author": "OoopsItSlipped",
            "body": "The newest one is Trump’s “Unified Reich” campaign video. For the truth [check here](https://x.com/kylenabecker/status/1793331353095741626?t=FsTD_T6z30Ge-mTmPoXUew&s=19)\n\nThe TLDR is that 1) it’s not from the Trump Campaign but a video made by a supporter that Trump reposted 2) it’s made using a downloadable vintage newspaper template that allows you to insert a headline over old newspaper front pages 3) the “Unified Reich” part is from an actual news article that’s a part of the template from like the 1880’s about German Industrialization that’s just one of the extra stories on the newspaper’s front page and 4) it’s so obscure and quick that if you blink, you miss it\n\nI can guarantee that 98% of the people going on about this haven’t actually seen the video in question",
            "score": 4
        },
        {
            "depth": 0,
            "author": "catman1352",
            "body": "I was a sucker for believing a lot of those stories. No more.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "UnderLook150",
            "body": "Shit like this is distractions. Who cares about feeding fish and silly handshakes.\n\nPolicies matter. \n\nShit like this is designed to have you focus on bullshit, instead of policies.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Anonymous_Fishy",
            "body": "Can we get more of these compilations? This is super important to see.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TenRingRedux",
            "body": "First rate Trump Derangement Syndrome. They hate him so much.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "v399",
            "body": "If you corner someone into seeing the truth and somehow accepting it, I'd bet they'd just say it was done for the greater good.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TeachShort3",
            "body": "And they'll be the first ones standing on their soapbox screaming how \"Faux news\" feeds their cult members and all this other b.s. but there are thousands of examples from damn near every MSM outlet deliberately bending (to say it nicely) the truth to show Trump in a bad light.  But since a lot of people hate Trump so much (TDS) they eat it up and share it with everyone they can to show just how \"righteous\" they are.  The news on both sides does this but the left puts on a masterclass.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "watermeone",
            "body": "Propaganda targets feelings, not reasoning.\nNegative feelings stay, even after true is shown.",
            "score": 1
        }
    ]
}