{
    "title": "Harvard Corporation Overrules Faculty; ‘Encampment’ Seniors Will Not Graduate",
    "comments": [
        {
            "depth": 0,
            "author": "newgalactic",
            "body": "When you see two of your enemies fighting, leave them to it.",
            "score": 127
        },
        {
            "depth": 0,
            "author": "harmier2",
            "body": "Harvard is damaged beyond repair.  Harvard Corporation should have acted sooner with more spine.\n\nAnd a few commenters to the article noticed this:\n\n>“Because the students included as the result of Monday’s amendment are not in good standing, we cannot responsibly vote to award them degrees at this time.”\n\nMeaning that they’ll confer the degrees when this blows over.  Fuck Harvard.",
            "score": 122,
            "replies": [
                {
                    "depth": 1,
                    "author": "sowellpatrol",
                    "body": "I read into it that the students protesting are shitty students who wouldn't graduate anyway. Which would explain why their demands were to have their tuition paid off and degrees for everyone.",
                    "score": 55,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HNutz",
                            "body": "I could see it ",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "redditisfacist3",
                            "body": "Pretty hard to fail at that level. Most places like that just give a passing grade and are done with it. \nIt would actually hurt their standings if they have people fail there 4 yr graduation rates",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BeardedWonder47",
                                    "body": "This was my thought when these protests first started popping up. Schools and their boosters/financial supporters are NOT going to enjoy those drop in number of graduates.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "redditisfacist3",
                                            "body": "Yeah it sure is they almost don't care most of they're endowments are so large they can run their schools off of them in perpetuity",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Wheream_I",
                            "body": "Naw, these ivy leagues work so that once you’re in it’s impossible to fail out.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "harmier2",
                            "body": "Based on some of the other comments, maybe they’re the shitty students that would have been been failed if they had attended a non-Ivy League university.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thegreatinverso9",
                    "body": "This.\n\nIt's just a technicality, once things calm down and people stop caring they'll quietly move them back to good standing and will grant the degrees quietly.",
                    "score": 23
                }
            ]
        },
        {
            "depth": 0,
            "author": "PanhandleMan54",
            "body": "They'll just blame it on the Jews.",
            "score": 94,
            "replies": [
                {
                    "depth": 1,
                    "author": "nolotusnote",
                    "body": "https://i.kym-cdn.com/photos/images/original/000/960/985/f5c.jpg",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "dummyfodder",
                    "body": "Well ofcourse. Even though they're probably the smallest race/religion/nationality in the world, they secretly control all the levers of power across all levels of public and private society.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Karissa36",
            "body": "My guess is that some non-tenured faculty are going to be fired and budgets will be cut.",
            "score": 37
        },
        {
            "depth": 0,
            "author": "BandicootBig6997",
            "body": "Slow clap",
            "score": 12
        },
        {
            "depth": 0,
            "author": "Oftenliedto",
            "body": "This not at all exaggerated news story is proudly brought to you by MSM!!!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "YoMomsFavoriteFriend",
            "body": "Sucks to suck losers",
            "score": 2
        }
    ]
}