{
    "title": "Target Will Only Learn Its Lesson If We Keep The Boycott Going",
    "comments": [
        {
            "depth": 0,
            "author": "Elbandtito",
            "body": "Just an FYI Walmart has a pride section",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "Haywood-Jablomey",
                    "body": "Why does that bother you?",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CMMGUY2",
                            "body": "Because there's no straight section and so having a pride section is by definition non-inclusive. ",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "vpkumswalla",
            "body": "This might be more important especially if you have young kids:\n\n\"In our stores, we demonstrate our commitment to an inclusive experience in many ways. Most relevant for the conversations currently underway, we welcome transgender team members and guests to use the restroom or fitting room facility that corresponds with their gender identity\"",
            "score": 22
        },
        {
            "depth": 0,
            "author": "szechuan_steve",
            "body": "I never stopped. Won't set foot in one.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Commander-Grammar",
            "body": "Target is the cautionary tale. We boycott Target into bankruptcy so other companies will realize that political BS is suicide. Target volunteered, target is dead to me forever. I don’t care if Target learns a lesson on the way down.",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bukook",
                    "body": "Are we successfully boycotting target into bankruptcy though? \n\nHas Bud even gone into bankruptcy?",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "anonymouswan1",
                            "body": "It's impossible to boycott any major brand. They have so much ownership over other brands that if you go to buy another beer, you're still supporting bud because they probably own it.",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "Im_Pronk",
                            "body": "The vast majority have given up. Kid Rock was wearing a Budweiser hat on Fox a few weeks ago and mumbled through some excuse",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "EngineerRemote2271",
                                    "body": "He's now friends with the Anheuser-Busch CEO\n\nCultural issues like this are irrelevant to the rich, they can always afford to live apart from people they don't care for. Or like Obama, to live with people they hate just because it's safer",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "aggressiveturdbuckle",
                    "body": "shit target has basically became a red walmart with not as much stuff. Most of them are dirty, half the shit is everywhere, I felt like I needed a tetanus shot when I left. There is a reason I don't go to either anymore and only go to Walmart for oil for my car because Mobil 1 is a lot cheaper there than auto parts stores.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "maythe10th",
            "body": "Waiiit, are we the real cancel culture?",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "EngineerRemote2271",
                    "body": "This isn't cancel culture, we don't care if the Left continues to support the current thing. This is just making everyone who shares a certain set of values, aware of who the disruptive elements are.\n\nI don't care if anyone on the Right still goes to Target, but I'm sure if we share the same values then they will understand the war being fought here",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Smaller_irl",
            "body": "Dude legitimately who fucking caaarrreeess. Don’t buy it or stop going to Target. I thought this was the land of the free? they can sell whatever they want. When did society get so childish",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "Theloripalooza",
                    "body": "We don't caaarrreee what they sell for ADULTS. We do caaarrreee that they have been marketing to and designing alphabet crap for children (i.e. a \"tuck friendly\" girl's bathing suit for boys, as just one example). Target had a whole \"pride\" display in their children's sections.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Smaller_irl",
                            "body": "They don’t though. They clearly heard the outrage and stopped. Go on targets website and find me a child’s pride clothing. That being said, who fucking cares if they’re selling clothes to adults?",
                            "score": -8
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PsychologyHoliday630",
            "body": "Thank heavens we have boots on the ground identifying  these far left woke companies ..",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Etra-0",
            "body": "Can't believe people are still revolving their whole life around boycotting Target and Bud Light.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DiscreetSurfer808",
            "body": "Ah boycott a private business because they won’t adhere to my conservative/ Christian ideals. \nGo for it. Cheese and rice, enough with the grandstanding. Do you want an award for each “woke” business you boycott? \nJust walk the walk and shut up already.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DufferDan",
            "body": "Target who? 😆",
            "score": -2
        }
    ]
}