{
    "title": "About damn time",
    "comments": [
        {
            "depth": 0,
            "author": "MiltonRoad17",
            "body": "I wonder how many of those soldiers would actually come back. It's been years since their firing and most have probably found civilian jobs at this point.",
            "score": 180,
            "replies": [
                {
                    "depth": 1,
                    "author": "1984deadman",
                    "body": "The military already tried and only 2 people came back. They aren't coming back under any situation",
                    "score": 112,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vikingsurplus",
                            "body": "Can you blame them? The were given less than honorable discharges.",
                            "score": 84
                        },
                        {
                            "depth": 2,
                            "author": "definitelynotapastor",
                            "body": "Only way I would, is if I was super close to retirement and they gave me backpay.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dubaria",
                    "body": "And probably making double their pay in private sector.",
                    "score": 32
                },
                {
                    "depth": 1,
                    "author": "Angkorus",
                    "body": "Not even sure why they are doing in the first place, do they really need these troops back?",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Daniel_Day_Hubris",
                            "body": "Very much so. A report came out February '23 stating 77% of military aged individuals (17-24) are unfit to enter service, with the largest barrier being that they're just too fucking fat. \n\nhttps://justthenews.com/politics-policy/77-military-age-americans-arent-fit-service-dod",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Black_XistenZ",
                                    "body": "How fatphobic of them. They should really educate themselves on how peo*ple of all sizes can contribute to the defense of their country. It's long overdue that the UN  passes a resolution about \"battlefield equity\" which limits the amount of activity allowed on the front lines per hour, so that war can finally become an inclusive and welcoming environment without sizeism and ableism!",
                                    "score": 12
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Arachnohybrid",
                            "body": "Probably. The enlistment levels are horrendous.",
                            "score": 67,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JohnJohnston",
                                    "body": "Good, maybe we can stop focusing on foreign wars and worry more about our own defense if we don't have the manpower to get involved in every other countries problems.\n\nLess money being spent overseas is a good thing. Keep it at home and lower our taxes.",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PsychologicalHat1480",
                                            "body": "Oh but didn't you get the memo?  Now it's *Israel* who is (yet again) in a fight with their neighbors so of course we need to get ready to get boots on the ground in whichever country they want destroyed this time. Probably Iran.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "JohnJohnston",
                                                    "body": "Believe me I'm well aware of the hypocrisy and immediate 180 both parties and many vocal members of their base made last year on involvement in foreign wars. It was like a switch flipped and the anti-foreign war turned back into war hawks.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "tekende",
                            "body": "We'll need them when we go to war with Russia.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RealisticTadpole1926",
                    "body": "Not under current leadership, way too toxic.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Opening-Citron2733",
                    "body": "Ngl in the reserves they saw the revocation of the mandate coming down the pipeline and so they slow walked a bunch of discharges so they would never happen.\n\n\nA good amount of people got told for over a year \"you're getting discharged so stop showing up\". Once the requirement went away they told the same people \"see you at drill next month 👌\" lol",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Carcinog3n",
            "body": "Who would want to serve a military that turns thier back on them.",
            "score": 65
        },
        {
            "depth": 0,
            "author": "Alpha-Sierra-Charlie",
            "body": "I hope every single one of those troops declines.",
            "score": 27
        },
        {
            "depth": 0,
            "author": "mildlyoctopus",
            "body": "Yeah? Too little too late as fair as I’m concerned. How about a settlement to every service member who was forced to get vaccinated under threat of discharge, even if they’d already contracted and recovered from Covid? I have a loved one who was forced to get vaccinated while she was still in the refractory period from a Covid infection (she’d had Covid so recently the dr’s said she didn’t need the vaccine)",
            "score": 67
        },
        {
            "depth": 0,
            "author": "BargainBard",
            "body": "With all time low recruitment rates?\n\n  \nThese tyrants didn't have much choice.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "invol713",
            "body": "And I hope those troops tell them to go fuck themselves. In a field that requires cohesion to function effectively, I wouldn’t trust superiors to not throw me under the bus in the future for some other spurious reason.",
            "score": 20
        },
        {
            "depth": 0,
            "author": "DufferDan",
            "body": "The ones that should see the wrong in the COVID bullshit will never admit they were dupped.\n\nThe conspiracy theorists just continue to shake their heads.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "scrapqueen",
            "body": "They need to just convert their discharges to honorable.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "randomdudeinFL",
            "body": "They should give them back pay, as compensation for their treatment and humiliation of being kicked out of the service.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "intelligentreviews",
            "body": "We are going to need everyone once China invades Taiwan...",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Rockmann1",
            "body": "Give them back pay and have the president publicly apologize",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PsychologicalHat1480",
            "body": "I hope the don't accept the offers.  The military's just trying to staff up for the next round of everwar in the desert.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AstroNewbie89",
            "body": ">mandatory vaccinations that all service members are required to receive (2021)\n\n>Adenovirus\n\n>Hepatitis A\n\n>Hepatitis B\n\n> Influenza\n\n>Measles, mumps, rubella\n\n>Meningococcal\n\n >Poliovirus\n\n >Tetanus-Diphtheria\n\n >Varicella\n\n>Anthrax\n\n>Haemophilus influenzae type B\n\n>Japanese encephalitis\n\n>Pneumococcal\n\n>Rabies\n\n>Smallpox\n\n>Typhoid fever\n\n>Yellow fever\n\n>***COVID-19*** *this goes too far!*",
            "score": -68,
            "replies": [
                {
                    "depth": 1,
                    "author": "okriflex",
                    "body": "How many of those were created the year before they were required with no mass testing? And how many of those diseases are you still likely to get and spread after taking the vaccine for it? And how many of them did the federal government and health institutions lie about for political purposes?",
                    "score": 74,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dont-CA-my-TX",
                            "body": "Also, the Covid vaccine doesn’t even prevent you from getting infected.  Allegedly it reduces the severity, but I don’t know how you could say that for certain. Correct me if I’m wrong, but don’t all of the other vaccines on the list actually *prevent* the infection? (Besides flu, because I know the strain changes every year)",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AstroNewbie89",
                                    "body": "> Correct me if I’m wrong, but don’t all of the other vaccines on the list actually prevent the infection?\n\nYou are wrong and you have a very common misunderstanding of how vaccine efficacy and effectiveness are calculated. Widely considered the most effective vaccine in use (MMR) are 96% effective against measles, 86% effective against mumps, and 89% effective against rubella.\n\nThe famous polio vaccine that eradicated the disease from the US was  90% effective against Types II and III and 60% effective against Type I\n\nthe most recent COVID vaccine is 54% effective, basically the same as last season's flu shot of 51%",
                                    "score": -16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "2DeviousMHW",
                                            "body": "Are military service members kicked out of the military if they do not get the season's flu shot?\n\nDo you believe that 54% efficacy is worth kicking service members out of the military for not getting the shot?",
                                            "score": 16,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AstroNewbie89",
                                                    "body": ">Do you believe that 54% efficacy is worth kicking service members out of the military for not getting the shot?\n\nConsidering that COVID vaccine mandate was removed recently, it would seem no. However, you'd have to ask the Secretary of Defense why they mandate a flu shot which had a similar if not worse efficacy rate",
                                                    "score": -10,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "2DeviousMHW",
                                                            "body": "I did not ask you why the Secretary of Defense made it mandatory, I think most of us have our suspicions, I asked if YOU believed it was worth kicking service members out of the military for it.\n\nAnd the other questions that I asked?  Do you have answers for those?",
                                                            "score": 8,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AstroNewbie89",
                                                                    "body": "I believe the military can tell their soldiers whatever they want since they basically own them, from George Washington mandating smallpox vaccine in 1777 to present. I'm mostly sharing the reality behind vaccination in the military and the selective (and misinformed) outrage commonly discussed on the internet",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "2DeviousMHW",
                                                                            "body": "> I'm mostly sharing the reality behind vaccination in the military and the selective (and misinformed) outrage commonly discussed on the internet\n\nAgain, you have failed to answer the questions asked of you.  I am asking those questions so that you realize that you fall directly into the group of people that you are describing.  It is you that is misinformed.\n\n>from George Washington mandating smallpox vaccine in 1777 to present.\n\nWhat is your source that all current service members are required to take the smallpox vaccine?",
                                                                            "score": -1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "dont-CA-my-TX",
                                            "body": "Thank you for the correction.",
                                            "score": 9
                                        },
                                        {
                                            "depth": 4,
                                            "author": "RandolphE6",
                                            "body": "54% effective against developing symptoms, not protecting against infection. It's an important distinction to make because it is not actually effective at all protecting against infection and nor protecting against spread, which was the original justification given for the mandate. It is however consistent with reducing the severity of infection, which is why it is effective against developing symptoms, because most people develop minor to no symptoms anyway. It also ignores the side effects and increased rate of developing other issues, which is well documented and the biggest and real reason most people should not get the covid vaccine, particularly young and healthy adults AKA the military.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AstroNewbie89",
                            "body": "The anthrax vaccine was known to be garbage with horrible side effects and they didn't admit it for almost 10 years before re-formulating the vaccine and kept it mandatory...not to mention the ridiculousness of requiring 200k+ soldiers to get that with only 17 known US cases in it's history, certainly more ridiculous than requiring it for COVID during a worldwide pandemic",
                            "score": -6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "2DeviousMHW",
                    "body": "All of those vaccines are required of every service member and must be kept up to date throughout their entire service commitment? \n\nAre there exceptions to any of those vaccines?\n\nWhen did you serve?",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Braz45",
                            "body": "I’m active duty now and was a corpsman for 15 years. That list is no where near accurate lol. No military member is given a rabies vaccine when they join, smallpox was phased out close to 10 years ago. That dude has no clue what he’s talking about.",
                            "score": 20
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "plastimanb",
                    "body": "Yeah and a good majority of them actually worked and ERADICATED the virus/bacteria vs “helps prevent” after the CDC changed their definition of what a vaccine was.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "RollTider1971",
                    "body": "You’re a scientist and don’t understand the difference? Find another line of work.",
                    "score": 1
                }
            ]
        }
    ]
}