{
    "title": "Border officials to encounter 10 million undocumented migrants under Biden by September 2024. A standing army of new Democratic voters...",
    "comments": [
        {
            "depth": 0,
            "author": "ILikestoshare",
            "body": "“Encounter” so that’s just the ones they catch?",
            "score": 37,
            "replies": [
                {
                    "depth": 1,
                    "author": "DaHomieNelson92",
                    "body": "Pretty much. I read a report a couple of years ago where *a* *lot* more get away than the ones who get caught.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cats_luv_me",
                            "body": "I wonder if the ones they're labeling as \"encounters\" are people who've actually been stopped from entering the country, or if they're being let in so they can be \"processed\" and being released or \"paroled\" into the country.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "castitalus",
            "body": "But just remember, the border was the most secure it's ever been the past three years...",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "inlinefourpower",
                    "body": "And the 2020 election was the most secure ever. ",
                    "score": 14
                }
            ]
        },
        {
            "depth": 0,
            "author": "mewybummy",
            "body": "If only an effort was made to pass legislation to deal with this problem!",
            "score": 19
        },
        {
            "depth": 0,
            "author": "kereso83",
            "body": "Don't let it demoralize you. Vote like your life depends on it. Get some friends out to vote too.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "These-arent-my-pants",
            "body": "This country is fucked.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "plastimanb",
            "body": "The dems were too close to getting caught in 2020, they needed these methods to pump their voter base.  Why are we seeing bills trying to pass to allow these illegal aliens to vote? Hmm.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Boogaloogaloogalooo",
                    "body": "Jerry nadler admitted it in a hearing.",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "snusboi",
            "body": "You really have to work to get the democratic voters. Most legal migrants tend to vote right-wing.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AstraVolans_21",
            "body": "The democrats should be happy to help those people experience the American dream. All of that diversity should reach places like Chicago, Martha's Vineyard, New York, Hollywood or San Francisco. Because those areas are full of people that want diversity in their livelihoods.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Sheriff_Hopper",
            "body": "At this point we should give the ten millionth person a cake and balloons since our border is a joke anyway",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dont-CA-my-TX",
            "body": "So much for winning the House. They shouldn’t be passing *anything* until we get the border secured.",
            "score": -1
        }
    ]
}