{
    "title": "Charles Barkley Says He May Reboot ‘Inside the NBA’ Himself If TNT Sports Loses Rights",
    "comments": [
        {
            "depth": 0,
            "author": "The_Notorious_Donut",
            "body": "> “I have my own production company, I would love to do that if if we lose it [NBA rights],” Barkley said. “But I have definitely had — actually somebody suggested that to me, to be honest with you, on the internet — ‘so why doesn’t Charles Barkley sign these three, guys four guys total to his production company and sell it?’ I’m like, ‘That’s a great idea.'”\n\nThis is the most Chuck thing I’ve ever read",
            "score": 1275,
            "replies": [
                {
                    "depth": 1,
                    "author": "brewgeoff",
                    "body": "Charles Barkley is maybe the only person who could convince Ernie to do something outside of TNT. They seem to have a very close relationship.",
                    "score": 244,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CastrosNephew",
                            "body": "The only holdout I’d see is actually Ernie, he’s very loyal and still does Baseball/NCAA. He’s too much of a standup guy to just leave the place that made him who he is",
                            "score": 115,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "makesterriblejokes",
                                    "body": "Hopefully TNT would be cool and just let him do this as a side gig so long as it doesn't conflict with his duties at TNT. Would mean Ernie would probably only be there half the time, but that's better than 0",
                                    "score": 91,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "UnsolvedParadox",
                                            "body": "Ernie would also not be competing on NBA coverage, I think he’d consider it.",
                                            "score": 32
                                        },
                                        {
                                            "depth": 4,
                                            "author": "krg779",
                                            "body": "Yeah, we don’t need the guys sitting in the studio for 5 hours. Don’t Chuck and Ernie do a regular podcast? A chill weekly show where the guys joke around and talk hoops would really be all that I ask.",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ProMikeZagurski",
                                                    "body": "I think it's the Steam Room.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "rowmean77",
                                    "body": "I hope Ernie changes his mind. He is successful because the public has embraced him. He just works for business people.",
                                    "score": 13
                                },
                                {
                                    "depth": 3,
                                    "author": "Ginoblee",
                                    "body": "Not only that but it seems that TNT has done a great job trusting Ernie and giving him a much longer leash production wise than many others in the industry.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "pyordie",
                            "body": "Doing something outside of TNT with Chuck would probably be a puedo-retirement for Ernie - work life balance would probably improve drastically. Knowing Chuck, working at BarkSports (TM) would probably be a half time gig for him.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "iluvugoldenblue",
                            "body": "As long as they keep towels on",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jpaxlux",
                    "body": ">actually somebody suggested that to me, to be honest with you, on the internet\n\nOn the internet??? If he doesn't use social media where tf are people suggesting him stuff? Is the dude still using AOL Chatrooms or some shit? lmao",
                    "score": 275,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "YSLMangoManiac",
                            "body": "He has an IG now",
                            "score": 113,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Not_GeorgeForeman",
                                    "body": "Only for his fans",
                                    "score": 106,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Azrael_",
                                            "body": "Does he get fully nude tho?",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "flaman27",
                                                    "body": "why else would I follow",
                                                    "score": 20
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "TheBaconator1990",
                                                    "body": "He has a towel on",
                                                    "score": 13
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "UnsolvedParadox",
                                                    "body": "You’re thinking of Carlos.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BarnOwlDebacle",
                            "body": "Email? I mean you do realize that the internet existed for decades before social media became the most popular place to talk on it. It was arguably better since back then all the discourse wasn't controlled by private companies with their quirky rules, taking our data et...",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JellyOnMyDick",
                                    "body": "I didn’t start until 08 to play RuneScape sorry unc.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mcfc4l",
                                            "body": "🦀🦀🦀 $11 🦀🦀🦀",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SchmitzFreilandeier",
                            "body": "well it was on the googles",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "TinnieTa21",
                            "body": "In all seriousness, I would love to watch them on YouTube. That’s where I mostly watch them right now anyways.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Actual_Ad_2801",
                            "body": "In real life???",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "homeycuz",
                            "body": "According to Subway great, Steph Curry, Chuck still has a landline.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "showoff0958",
                    "body": "The Grand Tour vibes",
                    "score": 53,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "carloslet",
                            "body": "TONIGHT:\n\nI watch the NBA Finals\n\nCharles Barkley starts a production company\n\nAnd James commits arson",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ShutterBug545",
                    "body": "Love this guy lmao",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "UnsolvedParadox",
                    "body": "Chuck as Shaq’s boss would be hilarious.\n\nIf he wanted to act like the Young Bucks as EVPs in AEW, even better.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "TigerKlaw",
                    "body": "Chucks voice just entered my mind.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Cdog923",
                    "body": "The only way it could be more Chuck was if someone suggested it to him in the steam room.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "MYO716",
                    "body": "“I’ll do my own Inside the NBA, with blackjack…and hookers”",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "JagmeetSingh2",
                    "body": "I gotta start tweeting Chuck ideas lmao",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DrinkWaterPissPant",
            "body": "chuck went from \"i want to retire\" to \"i want to produce my own show\" very quickly",
            "score": 665,
            "replies": [
                {
                    "depth": 1,
                    "author": "HolidayMorning6399",
                    "body": "to be fair, by produce he means put the money up, i imagine his main interest in hiring basically everyone producing/directing/filming it right now, not actually having input",
                    "score": 269,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AppropriateAd5225",
                            "body": "This, Chuck wants the people he worked with to still have jobs. So he's going to invest his own money to make sure they still have a paycheck coming in. ",
                            "score": 194,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "WanderingWormhole",
                                    "body": "Common Chuck W.",
                                    "score": 77
                                },
                                {
                                    "depth": 3,
                                    "author": "Ill_Ad3517",
                                    "body": "And, let's be honest, it's probably one of his main social outlets. It's like your favorite sports bar closing down.",
                                    "score": 58
                                },
                                {
                                    "depth": 3,
                                    "author": "TheHonorableStranger",
                                    "body": "He's gonna pull a Conan",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "2ndCatch",
                    "body": "The “I want to retire” and then the threat of working for the Saudi golf leagues or whatever was an all time ‘secure the bag’ move.",
                    "score": 80,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TigerKlaw",
                            "body": "Yeah he's working the bosses",
                            "score": 14
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Doomdoomkittydoom",
                    "body": "Chuck before sports betting apps: \"I want to retire.\"\n\nChuck after sports betting apps: \"I need a second job.\"",
                    "score": 46,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gedbybee",
                            "body": "This is the real answer.",
                            "score": 10
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "heysuess",
                    "body": "Chuck is a contrarian. We want him on tv forever? He wants to retire. His show ends on terms that aren't his? Fuck you I'll make my own show.",
                    "score": 37,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "karlwhethers",
                            "body": "He’s not a contrarian, he’s just using whatever leverage to get himself paid.",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "butt_fun",
                                    "body": "Yeah, the best way to get a raise is to do your job well and to have your employer know you’re ready to leave if you don’t get what you know you’re worth",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Annual_Plant5172",
                            "body": "It seems like he wants to make his own show to keep people employed. This isn't a contrarian move.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheRealTofuey",
                    "body": "Contract negotiation tactic.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "gradedonacurve",
                    "body": "It's heartwarming honestly.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rfgrunt",
                    "body": "Negotiating 101… actually Barkley should probably teach a 500 level class on negotiating.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "The_Notorious_Donut",
            "body": "> Barkley said that he has discussed the idea with his co-hosts, Shaquille O’Neal and Kenny Smith. And, to note, WBD owns the rights to Inside the NBA but Barkley could find a way to reconstitute it under a different name if he struck out on his own.\n\n> “Morale sucks, plain and simple. You know, I just feel so bad for the people I work with Dan,” Barkley said, before criticizing his corporate bosses at WBD. “These people I work with, they’ve screwed this thing up clearly. And we don’t have zero idea what’s going to happen. I don’t feel good. I’m not gonna lie, especially when they came out yesterday and said we bought college football. I was like, well damn, they could have used that money to buy the NBA.”\n\n> “We’ve never had college football, never been involved with college football,” Barkley said. “And I’m like, wait a minute. Shouldn’t we be spending every dime we’ve got to keep the NBA? So morale sucks, to be honest with you.”\n\n> “We’re just sitting back waiting on these people to figure out what they’re gonna do,” Barkley said. “You know, my two favorite wines are Inglenook and Opus [referencing two high-end California wineries], and these clowns I work for, they’ve turned us into Ripple and Boone’s Farm and Thunderbird [cheap fortified supermarket wines]. Like we got the best studio show — it’s so funny we just won the best studio show [at the 2024 Sports Emmy Awards]. But these fools turn us from Inglenook and Opus into Boone’s Farm and Ripple. It’s crazy.”\n> “I think the first thing is you know they came out and said we didn’t need the NBA. So I think that probably pissed [NBA commissioner] Adam [Silver] off,” Barkley added. “I don’t know that, but you know when we merged that’s the first thing the boss [David Zaslav] said, ‘we don’t need the NBA,’ well he don’t need it. But the rest of the people, me Kenny, Shaq, and Ernie and the rest of the people who work here, we need it. So it just sucks right now.”",
            "score": 157,
            "replies": [
                {
                    "depth": 1,
                    "author": "TiredMillennialDad",
                    "body": "Outside the NBA",
                    "score": 155,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sonsofthesuns",
                            "body": "Send that to Chuck over the internet",
                            "score": 67
                        },
                        {
                            "depth": 2,
                            "author": "Imagurlgamur",
                            "body": "(Charles' Version)",
                            "score": 17
                        },
                        {
                            "depth": 2,
                            "author": "makesterriblejokes",
                            "body": "Pool-side the NBA (Monetize them hot tub streams, Chuck!)",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "loscarlos",
                            "body": "They could build a set where it pooks like they are outside an arena, like just on the other side of a locked gate and a security guard. Hell underdog could wear a security guard uniform. ",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OutsideTheServiceBox",
                    "body": "I’d love if Chuck and Shaq (I think Shaq has the most money out of them so he’d probably be a partner), figured this out, including of course how to make it so Ernie could still do it on the side while staying at TNT. \n\nDoesn’t even have to be tied directly to game nights, just release two episodes a week of them sort of discussing the league, but also basically doing what all these podcasters do with better production and a space big enough to keep up the hijinks.",
                    "score": 47,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Squirrel_Apocalypse2",
                            "body": "They could definitely do a YouTube show and get a ton a views, way more people have access to YouTube then cable TV. With the gambling sponsorships I bet they'd still make bank even with no cable deal. ",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Rude-Yogurt-9151",
                                    "body": "I hate gambling sponsorships everywhere but you’re right",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "JimC29",
                            "body": "Shaq's loaded, especially compared to others who played in his era. Yeah Shaq and Chuck could easily make it work together. Years ago on Inside when Shaq was still playing Barkley talked about how the NBA moms would go on trips together. He said Shaq's mom was the leader because she's got the most money.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "Crimdal",
                            "body": "Theres a podcast ernie and chuck do that's kind of like that.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "Just tough that they probably wouldn't be able to get Ernie. Shaq and chuck can be too much sometimes as it is.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Oxygenius_",
                    "body": "Inglenook and opus, I’m sorry what",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "notmoleliza",
                            "body": "https://www.opusonewinery.com/\n\nhttps://inglenook.com/",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HolidayMorning6399",
            "body": "lmfao that'd be sick, shaq and chuck can def get the money together and sell it, the NBA would be dumb not to give it to them, win win",
            "score": 91,
            "replies": [
                {
                    "depth": 1,
                    "author": "HipGuide2",
                    "body": "Barkleycast basically",
                    "score": 34
                },
                {
                    "depth": 1,
                    "author": "joe_broke",
                    "body": "LeBron might even be willing to be a producer on it at some point",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AnnaKendrickPerkins",
                            "body": "Pass.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MotorolaRazorRamon",
                                    "body": "Great username.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AnnaKendrickPerkins",
                                            "body": "Spidermanpointing.jpeg",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "xen_levels_were_fine",
                                    "body": "mad",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AnnaKendrickPerkins",
                                            "body": "I don't want any current star player or agent (let's be real) near the show.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lilb1190",
            "body": "It wont be safe to be a big ole' woman in San Antonio if Chuck is working for himself.",
            "score": 164,
            "replies": [
                {
                    "depth": 1,
                    "author": "cjcfman",
                    "body": "Best thing about this situation is an unleashed chuck next season. Plus with wemby spurs will have more national games. The big ole women are not safe lol",
                    "score": 43
                },
                {
                    "depth": 1,
                    "author": "joe_broke",
                    "body": "That nasty-ass creek and it's cousin in Galveston too",
                    "score": 24,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Annual_Plant5172",
                            "body": "And Victoria is not a secret down there either.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "carloslet",
                                    "body": "It's a gold mine for Weight Watchers down there!",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ifreddiebenson",
            "body": "Chuck can be even more unfiltered",
            "score": 41,
            "replies": [
                {
                    "depth": 1,
                    "author": "Furyxus",
                    "body": "And that’s awesome",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "jpaxlux",
            "body": "Ngl an online version of Inside the NBA where they don't have to worry about censors would be amazing",
            "score": 129,
            "replies": [
                {
                    "depth": 1,
                    "author": "Oxygenius_",
                    "body": "That’s what you think lol",
                    "score": 40,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "verbleabuse97",
                            "body": "They definitely need Ernie to keep the conversation semi productive",
                            "score": 92
                        },
                        {
                            "depth": 2,
                            "author": "WallyWithReddit",
                            "body": "yeah half the comedy is from them reigning chuck in lol",
                            "score": 17
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jojow77",
                    "body": "imagine the crazy segments they could do and have musical guests",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Bjorn2bwilde24",
                    "body": "Gonna need an unfiltered Kevin Garnett special guest segment.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "wazdopest",
            "body": "chuck really cares about that show and everyone that works on it so i’m sure a lot of this is to put pressure on the powers at be to figure some shit out but i do hope he follows thru on this. him and shaq are rich enough to make this happen if they really want to",
            "score": 28
        },
        {
            "depth": 0,
            "author": "ContinuumGuy",
            "body": "\"I'm gonna make my own Inside the NBA with blackjack and hookers!\"",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "seattlesportsguy",
                    "body": "He probably would go that route and we’d all be here for it.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Successful_Cup_1882",
            "body": "If they pull a top gear to grand tour type exit I’d actually go crazy",
            "score": 15
        },
        {
            "depth": 0,
            "author": "Nickp1991",
            "body": "Chuck: Hey Shaq, remind me who’s your boss??\n\nShaq: I got 4 rings, I don’t have a boss.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "snyckers",
                    "body": "Oh, I see. One less than Kobe.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "makashiII_93",
            "body": "The NBA fandom as a whole loves ‘Inside the NBA.’\n\nPretty clear its not just us.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Doomdoomkittydoom",
            "body": "If you're going to keep Draymond, don't bother.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "papitoluisito",
            "body": "No draymond",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Acework23",
            "body": "JUST DON'T BRING DRAYMOND BRO",
            "score": 13
        },
        {
            "depth": 0,
            "author": "chimchimchow",
            "body": "Please please don’t bring Draymonds ass along",
            "score": 8
        },
        {
            "depth": 0,
            "author": "AnonymousIguana_",
            "body": "Inside the NBA podcast on youtube incoming",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Aaaaaaandyy",
            "body": "This is absolutely going to be a podcast",
            "score": 2
        },
        {
            "depth": 0,
            "author": "thekickingmachine",
            "body": "Shaq is mercurial . But chuck is so into his job and the nba. He is really passionate and it's must see tv for me.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "StoneColdAM",
            "body": "Aren’t the inside guys under contract to Turner? Would they lose those deals if TNT lost the NBA, and if they didn’t, would they accept some sort of buyout? ",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "herseyhawkins33",
                    "body": "They're there for 1 more season and their contract ends after that",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "WaltJay",
            "body": "If Erneh isn't aboard, it won't work.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "vrkhfkb",
            "body": "It would be nice. But I doubt Chucky will do it long term. He wants that 200m. Some network would snag him up.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "_picture_me_rollin_",
            "body": "Put it on HBO.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "pizzastone8",
                    "body": "Chuck needs to do a NFL Hard Knocks type show for the playoffs.\n\nChuck visits the team arena and players. Kenny interviews coaches and staff. Shaq checks out the local businesses. EJ can narrate from Atlanta.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "xenon2456",
                    "body": " would be interesting",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Remarkable_Pound_722",
            "body": "Chuck was gon retire not too long ago, though he was just tryna leverage a big deal it seems.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "a_stopped_clock",
            "body": "I’m ok with inside being over.  It’s funny but the analysis is awful and draymond is unwatchable.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "OnlyMamaKnows",
            "body": "Chucks saying something about this every day at this point. We'll see what happens but he doesn't seem like he wants to work hard enough to get his own thing off the ground.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Annual_Plant5172",
                    "body": "You do realise that TNT still have the NBA rights for one more season? And what suggests that Chuck wouldn't work to get something new off the ground? Obviously it would take time to get the right team around him and also make sure it can work financially.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "lambopanda",
            "body": "Barkley should start his own pod",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RiseStock",
            "body": "It probably also means that he could film it on the West Coast so he doesn't need to stay up so late to cover the games.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheWestRemembers",
            "body": "Call it “Outside the NBA” lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WolverineLong1430",
            "body": "Actually not a bad idea. They should do it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DJMagicHandz",
            "body": "#BarkNBA ™️",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "The_Notorious_Donut",
                    "body": "All Bark No Bite coming soon to Prime Video",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "hypermog",
            "body": "The Grand Tour 2",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yetagainitry",
            "body": "Produce a weekly or twice weekly show. Recap what’s happening in the nba, some weekly highlights. Mostly be chatter between them and then have a guest on to talk about whatever.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pokemongofanboy",
            "body": "This sounds great but I’d imagine Ernie has a non compete where he can’t do both TNT and Chuck’s shtick at the same time. Keeping Chuck would still be huge though.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Superplex123",
            "body": "Within the NBA",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gochuuuu",
            "body": "Chuck is for the people",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Prof-Ponderosa",
            "body": "Zaslav just find a sponsor for Neat-o!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DangerousLiberal",
            "body": "TNT might actually make more money with this plan tbh lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sukari",
            "body": "Imagine Inside the NBA.. but on Twitch",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gunnarbird",
            "body": "I just like the idea of Chuck shooting it in his garage with cardboard cutouts of the other guys",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OtherShade",
            "body": "They need to bring back Open Court, that show was perfect\n\n[https://www.youtube.com/watch?v=3hbUos9r8sY](https://www.youtube.com/watch?v=3hbUos9r8sY)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Meowmeow69me",
            "body": "Charles should just do a podcast",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DEEZLE13",
            "body": "Just let it die bruh",
            "score": 1
        },
        {
            "depth": 0,
            "author": "defeated_engineer",
            "body": "Gotta find a way to fund gambling.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MrAppleSpoink",
            "body": "Lowkey, call me a hater, but I feel like inside the NBA is only good because of Ernie, and all the other guys are either dumbass casuals or insufferable haters 90% of the time. Shaq refuses to ever give any credit to anyone and constantly throws childish insults, Kenny is a tool, and Chuck’s only value is his occasional good take on something political or with regards to league rules and justice.\n\nI legitimately can’t remember the last time I tuned into inside the NBA and heard them give actual accurate insight into strategy or anything to do with actual basketball, which makes sense considering every time they do a halftime show it seems like they’re just watching a few highlights for the first time moments before they give their takes.\n\nEvery 10 games or so Shaq and Chuck have a funny exchange or Kenny does something dumb, but outside of that I seriously don’t see the difference between inside the NBA and first take at this point. Just garbage, casual, surface level bullshit like the rest of NBA media.",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "OutofSprite",
                    "body": "Their halftime is way better than ESPN though I’m surprised Toyota puts their name on whatever ESPN does.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SelfDestructIn30Days",
                            "body": "Stephen A is the exact opposite of must see TV. I literally turn the channel any time he's on.",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cock-a-dooodle-do",
                    "body": "Nobody watches them for their basketball insights. Inside the NBA perfects the experience of reddit game thread and brings it to TV. It's like watching a sports game with your fun friends or uncles around.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "LeagueReddit00",
                    "body": "You don't watch Inside for real insight into the game, that isn't the appeal at all.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "joe_broke",
                    "body": "They all balance each other out\n\nIt's worse without Chuck there\n\nIt's worse without Shaq there\n\nKenny is Kenny\n\nAnd it's not nearly as good without Ernie\n\nThey all make it what it is",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Dymatizeee",
                    "body": "If you’re expecting basketball insight from them then you’re watching the wrong show\n\nNobody is gonna go on tv and explain why a team ran zone or man-to-man because that sht is boring for the average viewer\n\nIf you want insight go watch YouTube channels. Surprisingly the Women’s coverage during the NCAA tourney covering Iowa vs LSU had more technical knowledge from Andrea Carter",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "DumbNBANephew",
            "body": "Lol it would probably be full of \"personalities\" and none of \"analysts\".\n\n\nInside the NBA reminds me of a circus.\n\n\nAt a circus, you have performers (analysts) who do some incredible feats that make people want to watch. Then you have the clowns (personalities) who make the people laugh in between the feats performed by the performers. \n\n\nNow the clowns, they think THEY are the reason everyone comes to watch the show. But the truth is, no one wants to watch a circus with only clown acts. Clowns are ok as a distraction, but people come to watch the performers.\n\n\nChuck and Shaq and Draymond seem to think they are the reason people watch Inside the NBA. But truth is, they're not analysts, they are entertainment. And people wouldn't watch the show if there was not real analysis.\n\n\nThey're not the performers, theyre the clowns. And nobody wants to watch a circus with only clowns.",
            "score": -4
        }
    ]
}