{
    "title": "[Krawczynski] Chris Finch said it was a no-nonsense film session today. \"The Western Conference finals started. Not sure if they got the memo. But they got it this afternoon.\"",
    "comments": [
        {
            "depth": 0,
            "author": "EsotericPotato",
            "body": "I would love to be a fly on the wall in some of these internal meetings the team has. \n\nFinch seems like an extremely chill, laid-back dude, but you hear quotes like this, you hear how Finch has alluded to absolutely chewing out and yelling at the team in film sessions or at halftime of lazy games, then guys like Ant talking about how hard he is on players in practice. It seems he’s got another side where he will just go in mercilessly on the team when they’re not doing well.",
            "score": 656,
            "replies": [
                {
                    "depth": 1,
                    "author": "Knightbear49",
                    "body": "Send da video. No for real.",
                    "score": 289,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aggster13",
                            "body": "Hell nawl can't do that",
                            "score": 64,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mr_Hugh_Honey",
                                    "body": "*can't do dat",
                                    "score": 7
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LeGoat333",
                            "body": "Mavs fan but Send Da Video is an all timer. Love me some Ant",
                            "score": 54,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sintenterooro",
                                    "body": "Any context for a non-us mavs fan?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Synerv0",
                                            "body": "https://knowyourmeme.com/memes/send-da-video",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "hotterpocketzz",
                            "body": "Finch put as a P.S. bring ya ass",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pifflord5",
                    "body": "\"Ant, if you take another shot like this in Game 2, im sending you back to your Ant hill and I'm taking a piss on it.\"\n\n- Chris Finch in the film session, probably.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "WhiskyDrinkinCowboy",
                    "body": "He does not seem chill, he has a serial killer look to him like Quinn Synder",
                    "score": 32,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "urkuri",
                            "body": "You really find a way to hate on anything Wolves related 🤣",
                            "score": 103,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ChevalierEckhart",
                                    "body": "Mans been on a four day hating spree",
                                    "score": 65,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mixmasterbk",
                                            "body": "Dude probably jizzed his pants when they lost yesterday",
                                            "score": 27
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "WhiskyDrinkinCowboy",
                                    "body": "Nah, I actually have a soft spot for Chris the Cripple. Him, McDaniels, and Naz Reid are cool with me.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BigFatModeraterFupa",
                                            "body": "i like the interim coach guy cause he’s got a cool name. \n\nNori. reminds me of Dory from finding nemo. great movie",
                                            "score": 13
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "WhiteHeterosexualGuy",
                            "body": "leave our skinny jeans psycho out of this",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Ozzietheparrot",
                            "body": "Dude, he's a skinnier, slightly more serious version of Chris Farley.",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "rhino57123",
                                    "body": "Aka Jeff Daniels",
                                    "score": 8
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "chillinwithmoes",
                    "body": "> Finch seems like an extremely chill, laid-back dude, but you hear quotes like this, you hear how Finch has alluded to absolutely chewing out and yelling at the team\n\nYeah we as fans have pretty much never seen Finchy angry at anyone but a referee, but to a man, everyone on the team talks about how hard he coaches them",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "jak_d_ripr",
                    "body": "Yeah his post game after the KAT 60 point game definitely gave off no nonsense vibes.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "collinCOYS",
            "body": "If Chris Finch on crutches yelling at his guys for being tired while he's in extreme pain doesn't motivate you I don't know what will",
            "score": 407,
            "replies": [
                {
                    "depth": 1,
                    "author": "CIark",
                    "body": "“MIKE MAKE THE FUCKIN FREE THROW MIKEEEE”\n\n“Don’t make me take out the other hip”",
                    "score": 154,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "need2peeat218am",
                            "body": "\"ANT STOP TRYING TO PASS IT TO ME!! I'M SITTING IN THE SECOND ROW!!\"",
                            "score": 26
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "crimsonconnect",
                    "body": "He made them watch the Awful Coaching youtube video",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "klobucharzard",
                    "body": "a clockwork orange  vibes",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "RacingRaindrops",
            "body": "Neither team played exceptionally well and it was still a great game to watch. This is going to be an amazing series.",
            "score": 113,
            "replies": [
                {
                    "depth": 1,
                    "author": "UpsideTurtles",
                    "body": "TW stars did not play well. Their role players played great though. Mavs role players were poor, but our stars showed up. Both of these were according to the defense’s strategy. TWolves focused in on the role players that killed OKC, we focused in on the star players taking bets that the role players won’t hit threes at 80% like they did in the first half. Kyrie is the only reason we lived to win that bet.\n\nThis whole “we were tired” and “we played poorly” things makes zero sense to me, because both teams’ defenses took away what they chose to take away, and were getting killed by what they took away chance on! Maybe Antman was tired, maybe KAT was tired, but Jaden Mcdaniels sure as hell wasn’t tired. The defenses for both teams were really strong. Seems like in Game 1 Mavs gameplan just won out.",
                    "score": 47,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BuckyFnBadger",
                            "body": "ANT is 100% injured. It’s not a real excuse as everyone is banged up. But his splits after his game 6 fall are very apparent.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SabermetricCentered",
                                    "body": "I don’t think he’s injured, just tired.\n\nFrom what I’ve read, he doesn’t have the most amazing conditioning in the world, and he’s on game 91 with 35 MPG in the regular season and 40 MPG in the playoffs.\n\nHe’s also giving 110% on defense almost the entire playoffs which is contributing.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BuckyFnBadger",
                                            "body": "There was a pretty good stat breakdown in the twolves sub about his drop in performance since that exact event.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "mnsportsfan",
                            "body": "lol just because 1 player played well, the fatigue argument holds no water? We had a much more emotional 2nd round series that went an extra game. \n\nIt isn’t an excuse, but it’s also easy to see that wasn’t the wolves operating at their peak ability. Benefit to winning a series in less games. Hoping they hydrate and do their hyperbolic chambers or whatever millionaires do for miraculous recoveries 😂",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "quidproquolaspe",
                                    "body": "You guys had lots who played well. And are only using excuses like “too tired” for the ones who didn’t, I would think is the point. You guys are picking and choosing who’s tired and who isn’t. Which is fair but at the same time if Ant had a more efficient night, idt that excuse would be levied.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mnsportsfan",
                                            "body": "lol you Mavs fans guys can downvote me all you want… Ant literally admitted he was tired and KAT said they came out with no energy. “Lots who played well”- Kyle Anderson - hardly played in Denver… and Jaden. Naz was decent \n\nIt’s not even an excuse. It’s part of the playoffs being able to manage workload and be ready for games. Denver was gassed second half of game 7. Doesn’t discredit what we did at all \n\nOur other 4 starters (outside of Jaden) played poorly. Anyways, it’s irrelevant.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Slow_Accident_6523",
                    "body": "I thought it was a really high quality game with two teams playing absolute top tier defense",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Knightbear49",
            "body": "YESSIRSKI",
            "score": 131
        },
        {
            "depth": 0,
            "author": "jademadegreensuede",
            "body": "All of a sudden Mavericks fans and Timberwolves fans are the only people who have confidence in the Timberwolves lol",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "2009MitsubishiLancer",
                    "body": "Faith is hard to come by. Media is looking for the narrative for the next morning and a TWolves poor showing and loss after being praised for the nuggets defeat is a great storyline. I’m not worried.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "buffalobill41",
                    "body": "yeah i'm expecting an ass-kicking Friday unless the 3 pt situation flips",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "sintenterooro",
                    "body": "We always expect some basketball terrorism  by THJ",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "masterstriker321",
                    "body": "watch for it, Mavs fans always tryna use the Reverse Jinx",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Destroythereapers",
                    "body": "I think we Mavs fans have a very healthy respect for the Timberwolves. Y’all have a very talented team and this is going to be a tough fight. Plus I think there’s sort of a kindred style of play, very defensive minded while not being dirty a la Lou Dort. I would be very surprised if the Wolves don’t punch the Mavs in the face to start game 2.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Magazine_Mediocre",
            "body": "Finchyyy",
            "score": 37,
            "replies": [
                {
                    "depth": 1,
                    "author": "Danboon",
                    "body": "Great rep!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Princessk8--",
            "body": "Coach says why are you playing bad? Are you stupid?",
            "score": 57
        },
        {
            "depth": 0,
            "author": "TruthSayerFu",
            "body": "This is OT but I don’t understand how more people aren’t picking the mavs to win the Finals. They easily have the best player left. I trust Luka way more than ant and Tatum. Having the best player is half the battle alone.",
            "score": 164,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "That's why they won game 1. In a tight game in the 4th quarter I'm always taking Luka to out execute the other team",
                    "score": 162,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "--Alix--",
                            "body": "I guess they're not taking Mavs maybe because he's still injured? According to Mavs medical staff Luka would need like a month to actually recover, but he seems to somehow be ramping up now despite playing 40 minutes a night.",
                            "score": 67,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "warpedspoon",
                                    "body": "closing in 6 vs OKC def helped but they also have him packed full of painkillers. he can play through the pain because of the painkillers but he's still injured.",
                                    "score": 30
                                },
                                {
                                    "depth": 3,
                                    "author": "pumpkin3-14",
                                    "body": "They came on hot so late that media refused to give credit to their defense and what Luka and Kai had been doing. Really wasn’t until a week after all star break did everything click especially with the new trades.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "hobesmart",
                                            "body": "Also, the national narrative around the trades seemed to be \"wtf is dallas doing?\"",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Dansebr93",
                                                    "body": "Which blows my mind. The Mavs trade deadline moves were great at the time. Everyone in their mother knew they needed rebounding, defense, and size in order to be true contenders, and that’s what they got.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "SugoiHubs",
                                            "body": "This is it. The media narratives about the season were already solidified and then we became the best team in the NBA for the last 20-30 games.",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Skolcialism",
                                    "body": "Bro why has his knee been bleeding for a month. What he’s doing on that knee is insane",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "HumbertoGecko",
                                            "body": "& that's actually the 'good' knee! the right's the one that sprained",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "PuerAeternus_",
                            "body": "Absolutely. When we couldn’t pull away I was starting to get nervous and my fears came to fruition exactly. This is a team we have to put away and play smart against, otherwise Luka and Kyrie are just too good",
                            "score": 24,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pumpkin3-14",
                                    "body": "When Ant hit the 3 to go up 4 with three minutes left I thought y’all were pulling away. Then Luka 3, Jaden turnover, PJ corner 3 happened so fast and that was it.",
                                    "score": 9
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Vicentesteb",
                            "body": "But at the same time we managed to out execute The Nuggets in the clutch 2 separate times and I trust Jokic more than anyone in the world.",
                            "score": 12
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Statistician_Visual",
                    "body": "Don’t forget the best vet player who has a ring (one of 3) to show the other guys how to do it. Kyrie makes all the difference even for luka",
                    "score": 25
                },
                {
                    "depth": 1,
                    "author": "jinyx1",
                    "body": "Because it's not half the battle? You should know this as a Cavs fan.",
                    "score": 61,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "menumelon",
                            "body": "Why? The Cavs had one half down, they were just missing the other half.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "TruthSayerFu",
                            "body": "What???",
                            "score": -13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jinyx1",
                                    "body": "The Cleveland Cavaliers had one of the best players to ever lace them up for 11 total seasons. They made the Finals 5 of those seasons and won the title once. In all 5 of those championship appearances and multiple other playoff runs, the Cavaliers had the best player, yet only succeeded in winning once. Hence why it's not \"half the battle\".",
                                    "score": 80,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "The_NGUYENNER",
                                            "body": "I mean it could be argued that they simply didn't have the other half",
                                            "score": 38
                                        },
                                        {
                                            "depth": 4,
                                            "author": "legendaraurea",
                                            "body": "I generally agree but tbf:   \n  \n07 Bron is not better than 07 Timmy.   \n'15 they lose  \n'16 they win  \n'17-18, they're playing prob the best team ever (KD warriors) \n\nThey do win half the time when they have the best player and aren't playing a super team. \n\nNow if you look at Bron's other finals: \n\n'11 - lose  \n'12 - win  \n'13 - win  \n'14 - lose   \n'20 - win \n\nAs the best player, he did win half the time.",
                                            "score": 14
                                        },
                                        {
                                            "depth": 4,
                                            "author": "WhiskyDrinkinCowboy",
                                            "body": "LeBron is no Luka",
                                            "score": -33,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "-fallen",
                                                    "body": "I think you may have had a bit too much whiskey",
                                                    "score": 15
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "gigantism",
                    "body": "The Celtics are a horrendous matchup for the Mavs. The Mavs defense is reliant on stopping rim attacks and giving up space to players who maybe aren't intuitive processors of the floor game. That is effective against the Wolves but it will absolutely get torched by the 5-out spacing the Celtics play pretty much the entire game. It neutralizes the Mavs' greatest strength.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "NicolasName",
                    "body": "Basketball is a team sport, it's not a one-on-one game. I don't get why that's so difficult. \n\nThat said, all four teams have a shot to win it. Series aren't played on spreadsheets, otherwise it'd be boring to watch to begin with if the results were already pre-determined.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Dear-Tax-7025",
                    "body": "I agree. To me, Boston is stacked with great 1B guys, but no true 1A. I don’t trust Tatum to make the right decisions in the clutch and Brown just isn’t consistent enough to put up heroic games every time.\n\nLuka and Kyrie live for the clutch moments.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "WaterIsNotWet19",
                    "body": "They’re still basing their views off of old narratives",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "fumar",
                    "body": "I trust ANT way more than Tatum. Dude absolutely choked in the 2022 finals.\n\n\nLuka *and* Kyrie are the two most clutch guys left.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TruthSayerFu",
                            "body": "I trust a lot of people more than Tatum. Luka Kyrie Mitchell Booker Ant SGA etc",
                            "score": -1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "StayClassy_US",
                    "body": "We beat the 76ers pretty handily while they had the best player and the third best player on the floor",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Limp_Custard6943",
                    "body": "Mavs haven't beat the celtics since January of 2022",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "Impressive-Turnip-38",
                    "body": "Luka aint winning shit this year. The wolves are gonna beat these guys; and the celtics w/Porzingus definitely are beating them",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "boringexplanation",
                            "body": "Idk why your take is downvoted and everybody else is so damn sure Luka is taking it in a 7 game series.  After a 5 point loss that went to the wire with Luka heroics, no less.  \n\nBy that metric, I guess the Suns were supposed to be the real champs last season after they had the best individual games in the entire playoffs.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Mibrealest",
                                    "body": "You say that like the mavs didn’t shoot 6/25 from the 3 and the wolves role players didn’t shoot out of their minds",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WhiskyDrinkinCowboy",
                    "body": "I am, I picked them to sweep the Timberpuppies.",
                    "score": -17
                },
                {
                    "depth": 1,
                    "author": "AgadorFartacus",
                    "body": "Luka is not meaningfully better than Tatum.",
                    "score": -77,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FuckThaLakers",
                            "body": "Luka absolutely is meaningfully better than Tatum.",
                            "score": 36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": "Offensively, sure. But not overall.",
                                    "score": -23
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TruthSayerFu",
                            "body": "He definitely is lmfao. That’s like saying Tatum is not meaningfully better than Maxey. And that’s not a shot at Tatum or maxey. Luka is not comparable to Tatum… different kind of special.",
                            "score": 51,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": "It's really not.",
                                    "score": -50,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TruthSayerFu",
                                            "body": "Celtics fans do it it themselves. Tatum is a lot closer to booker Mitchell JA Brunson than he is to Embid Giannis Luka.",
                                            "score": 32,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "GuyOnHudson",
                                                    "body": "“Closer to Booker”. Oof that gotta hurt to hear if you’re a Celtics fan.  Truth hurts",
                                                    "score": 0
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "SuckMyyDirk41",
                                                    "body": "Embiid has nothing on these guys. He’s more Mitchell than any of those other guys.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TruthSayerFu",
                                                            "body": "Embid is one of the best offensive players we’ve ever seen. Him and Tatum don’t really belong together. And I don’t really like embid. He’s been injured most of the “playoff failures “ and that’s another conversation that needs to be had but purely who is better at basketball?? Tatum isn’t close.. also comparing someone to Mitchell isn’t a slight lol. You made it seem like it. He doesn’t get hurt and there’s a legit shot he makes 1st all nba. If not he would have definitely made 2nd team",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "SuckMyyDirk41",
                                                                    "body": "Embiid is one of the biggest playoff chokers of all time and constantly injured. Not to mention how dirty of a player and foul merchant he is. I’m not the biggest fan of Tatum but hasn’t he been to the eastern finals like 5 times and to an nba finals? Embiid wishes he could lead a team to one eastern finals.",
                                                                    "score": 3
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AgadorFartacus",
                                                                    "body": "\"Mitchell is basically as good as Tatum because he almost made 1st Team NBA this year, while Tatum has *actually made it* three years in a row.\"",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TruthSayerFu",
                                                                            "body": "This is why accolades don’t tell the full story.",
                                                                            "score": 5,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AgadorFartacus",
                                                                                    "body": "And neither do Tatum haters.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "TruthSayerFu",
                                                                                            "body": "Comparing Tatum to Mitchell is not a shot at Tatum. Mitchell was 5th in epm and 6th in scoring at 29ppg before his 2nd half injuries. He was 6th in mvp voting the year before. Would have made 2nd team all nba back to back years too if not for his injury. The guy is juggernaut offensively and probably a bit better than Tatum in that department.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "AgadorFartacus",
                                                                                                    "body": "> Would have made 2nd team all nba back to back years\n\nI love how you went right back to this argument even after I pointed out how bad it was.\n\n>He was 6th in mvp voting the year before.\n\nThat was the one season Mitchell received MVP votes. Tatum has four such seasons.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "TruthSayerFu",
                                                                                                            "body": "Yes. I’m trying to tell you accolades don’t tell the full story. If Mitchell (if healthy) or Brunson supporting cast was as good as Tatum they would have the same record and probably would have made 1st team over Tatum this year. There’s no way you look at all 3 play and think to yourself Tatum on a whole other tier.",
                                                                                                            "score": 0,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "AgadorFartacus",
                                                                                                                    "body": "You clearly don't understand the importance of defense and size if you think Brunson and Mitchell are on Tatum's level.\n\n>If Mitchell (if healthy) or Brunson supporting cast was as good as Tatum... \n\nTatum has gone on deep playoff run after deep playoff run with a whole bunch of different supporting casts because he has an amazing all around game that allows him to morph based on what his team needs.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "TruthSayerFu",
                                                                                                                            "body": "They are both way better offensive players. Unless you’re a big. You value offense a lot more. Mitchell brings playmaking that Tatum doesn’t. Mitchell isn’t a come either. It’s like when y’all use that excuse for Luka/Tatum. It’s like we don’t care that Tatum is better defensively.",
                                                                                                                            "score": 0,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "AgadorFartacus",
                                                                                                                                    "body": ">we don’t care that Tatum is better defensively.\n\nI know you don't. That doesn't change the fact that it matters. And You're just straight up lying about their offense. Last two years:\n\n* Tatum:  28.5 PPG, 4.8 assists\n\n* Mitchell:  27.5 PPG, 5.2 assists\n\n* Brunson:  26.5 PPG, 6.5 assists",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "TruthSayerFu",
                                                                                                                                            "body": "Using numbers like that is why we can’t have conversations. Mitchell was hurt this year. Dropped his avg big time in the 2nd half. And Mitchell is a way better playmker and he is doing it with worse spacing. Nobody thinks mitchell is a worse offensive player than Tatum",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "AgadorFartacus",
                                                                                                                                                    "body": "> Mitchell was hurt this year\n\nDurability matters, and Tatum is an ironman. But we can throw this year out if you want. Tatum still outscored and out assisted Mitchell last year. Actually, while we're at it, he outscored literally everyone in the NBA.\n\n>Mitchell is a way better playmker\n\nNo he isn't. You're just dug in on a dumb position and looking for a way out.",
                                                                                                                                                    "score": 1,
                                                                                                                                                    "replies": [
                                                                                                                                                        {
                                                                                                                                                            "depth": 18,
                                                                                                                                                            "author": "TruthSayerFu",
                                                                                                                                                            "body": "Last year Tatum also took more shots than Mitchell. He’s just not a better scorer or playmaker.",
                                                                                                                                                            "score": 1,
                                                                                                                                                            "replies": [
                                                                                                                                                                {
                                                                                                                                                                    "depth": 19,
                                                                                                                                                                    "author": "AgadorFartacus",
                                                                                                                                                                    "body": "You're right, that 0.5 shot a game made all the difference.",
                                                                                                                                                                    "score": 1,
                                                                                                                                                                    "replies": [
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "TruthSayerFu",
                                                                                                                                                                            "body": "Did you count the Ft???",
                                                                                                                                                                            "score": 1
                                                                                                                                                                        },
                                                                                                                                                                        {
                                                                                                                                                                            "depth": 20,
                                                                                                                                                                            "author": "TruthSayerFu",
                                                                                                                                                                            "body": "Also you know spacing matters right??",
                                                                                                                                                                            "score": 1
                                                                                                                                                                        }
                                                                                                                                                                    ]
                                                                                                                                                                }
                                                                                                                                                            ]
                                                                                                                                                        }
                                                                                                                                                    ]
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "You simply don't know ball.",
                                                    "score": -9
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ilikesporks_",
                            "body": "only celtics fans would say something this delusional",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": "What makes you think Luka is so much better?",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ilikesporks_",
                                            "body": "tatum could only dream of having half of luka's offensive production. nearly made the celtics lose against the pacers with that god awful 4th quarter but jaylen brown bailed him out",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "Luka is better offensively, but to say he's twice as good is nonsense. Tatum is better defensively and their total impact is pretty close.\nThe fact that Tatum is getting killed for a win where he put up 36/12/4 with 3 steals, a +20, and 10 points in OT just goes to show how insane the discourse around him has gotten.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MostlyMellow123",
                                                            "body": "Luka is an offensive engine. He's like lebron or jokic on offense. When everything crumbles around you those types of players can create offense by themselves. \n\nTatum is on an extremely talented team playing 5 out where everyone just passes to the open three point guy. \n\nThat is a statistically correct offense, but when the lights get bright In the finals traditionally the superstar engine guy seems to beat statistical type team. Celtics defense is where they can really shine and I've been more Impressed with Brown than Tatum on the def end lately.\n\nTatum just lacks big time playmaking skills. Those skills are worth a lot more.",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AgadorFartacus",
                                                                    "body": "Tatum is also an offensive engine He's a lesser offensive engine than Luka, yes, but he makes up for that on the other end of the floor.\n\n>Tatum just lacks big time playmaking skills\n\nThis is just not true. He's not on Luka or LeBron or Jokic's level as a playmaker. That doesn't mean he lacks playmaking skills.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "MostlyMellow123",
                                                                            "body": "You're comparing him to one of the best of all time playmakers. \n\nThat's where the difference is. Those guys see angles the other players don't see. They make passes the others don't make. \n\nIt's like comparing domas to jokic as a playmaker lol. Yeah domas is pretty good but jokic is playing a different sport all together",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AgadorFartacus",
                                                                                    "body": "I'm comparing them as overall basketball players, not just playmakers.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "MostlyMellow123",
                                                                                            "body": "Luka is a better scorer,playmaker, and rebounder\n\nHe's also been playing pretty good defense.\n\nTatum is a better defender and that's it",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "AgadorFartacus",
                                                                                                    "body": "Luka is not a better rebounder. Tatum has three playoff runs averaging >10 rebounds. Luka's never done it. It's also worth noting that Luka's edge in scoring efficiency disappears in the playoffs. Luka has a career .568 playoff TS%. Tatum is at .569. You'd never know that the way people talk about Tatum's shooting.",
                                                                                                    "score": 2
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ginger_snap214",
                                                                            "body": ">Tatum is also an offensive engine\n\nno he’s not",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AgadorFartacus",
                                                                                    "body": "What makes you say so?",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ginger_snap214",
                                            "body": "scoring, playmaking",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "And Tatum makes up the gap everywhere else. ",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "nujabes02",
                            "body": "Lmao",
                            "score": 24,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "collinCOYS",
                                    "body": "Celtics fans try not to make everything about Tatum challenge",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AgadorFartacus",
                                            "body": ">  I trust Luka way more than ant and Tatum.\n\n\nTimberwolves fans try to display basic reading comprehension challenge.",
                                            "score": 12
                                        },
                                        {
                                            "depth": 4,
                                            "author": "BitterAnimal5877",
                                            "body": "I mean, they said Luka’s the best player left… you’re not allowed to disagree? ",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Mooming22",
                                            "body": "This literally is about Tatum though. It was before they got involved. Are you dumb?",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": "Defense, size, and conditioning matter.",
                                    "score": -8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TruthSayerFu",
                                            "body": "What Luka brings offensively out weighs the perimeter’s D advantage Tatum brings. Unless you’re a big.. offense is way more important in todays game.",
                                            "score": 15,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "That's a reasonable opinion. Pretending like there's a meaningful gap isn't. And Tatum does not just provide perimeter defense. He is also a plus rim protector.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TruthSayerFu",
                                                            "body": "He isn’t a interior defender. Play Tatum at C the whole game and see what happens.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AgadorFartacus",
                                                                    "body": "The fact that he's not a full time center doesn't mean he provides no interior defenae.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Front_Photograph_907",
                                                                            "body": "Did you see Luka break up the lob in the clutch yesterday? He also provides some interior support but its not s significant part of either of their impacts",
                                                                            "score": 14,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AgadorFartacus",
                                                                                    "body": "Yes, I saw that. Tatum provides way more rim protection value than Luka. ",
                                                                                    "score": 4
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "jkeefy",
                                            "body": "Luka is an inch shorter with and inch shorter standing reach. They are practically the same size lol.\n\nLuka’s defense is also much improved. Have you been watching him in the playoffs",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "Tatum has three extra inches of wingspan, which is why he's able to play much bigger on defense.",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "jkeefy",
                                                            "body": "… they measured an inch apart on standing reach lmao",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AgadorFartacus",
                                                                    "body": "And?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "jkeefy",
                                                                            "body": "I wouldn’t call a 1 inch difference in size a “much bigger” size difference",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AgadorFartacus",
                                                                                    "body": ">  **he's able to play** much bigger",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "DarwinCreatesSpace",
                                            "body": "Yeah Luka sure was horrible in the fourth quarter. Didn't make huge defensive plays, and certainly his horrible conditioning affected his offense.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "Did I say Luka was horrible in the fourth? I don't remember saying Luka was horrible I'm the fourth.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DarwinCreatesSpace",
                                                            "body": "No you said something about Tatum and conditioning being so much better than Luka. What other metric could there possibly be that actually matters in a basketball game, when talking about conditioning, then performance in the 4th quarter? Luka has also logged the most minutes this playoffs as well.",
                                                            "score": 6,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AgadorFartacus",
                                                                    "body": "Tatum is able to consistently provide a higher level of defensive effort than Luka because of his conditioning edge. That doesn't mean Luka turns into a complete pumpkin in the fourth.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "DarwinCreatesSpace",
                                                                            "body": "Oh yeah? Could it possibly have to do with less minutes logged and not having to run the entire offense? Look I'm not saying Tatum isn't a better defender, or that he gives more effort consistently on that side, but I am saying there's nothing that sticks out that points to \"better conditioning\" other than Luka being a bit chubby. If anything he plays harder in the 4th quarter.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "AgadorFartacus",
                                                                                    "body": "> Could it possibly have to do with less minutes logged\n\nNo. This season is the first time in five years Luka has averaged more minutes than Tatum.\n\n>and not having to run the entire offense?\n\nThis blade cuts both ways. What happens when Luka isn't on ball? What does he do? Does he screen for his teammates? Does he battle for post position? No, he mostly chills out. Tatum has fewer on-ball responsibilities (still plenty) but he's more active off-ball.\n\n>there's nothing that sticks out that points to \"better conditioning\" other than Luka being a bit chubby.\n\nLuka and the Mavs have openly acknowledged it as an issue at times.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "mannotbear",
                            "body": "Do you want to buy a bridge?",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": "Not really, but if the price is right.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "HQuasar",
                            "body": "Celtics fans stuck in the annual \"Tatum is better than...\" cycle until he chokes in the playoffs",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": "Sonics fans stuck in the 90s when their team actually existed.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "HQuasar",
                                            "body": "So what, Celtics fans are stuck in the 1960s when their team was actually relevant",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "Of all possible ways to try to insult the Celtics, calling them irrelevant has to be the dumbest.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "HQuasar",
                                                            "body": "Ah yes, the very relevant pretenders. There are levels to relevancy on the NBA.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "WhiskyDrinkinCowboy",
                            "body": "Andrew Wiggins outplayed Tatum in the NBA finals. He's not even a superstar until he redeems his legacy.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": "That was Tatum's one (1) bad playoff series in the last five years and his haters act like it's the entirety of his resume.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WhiskyDrinkinCowboy",
                                            "body": "It was the most important moment of his life. Don't downplay that. Curry got killed for his 2015 finals and they won. LeBron got killed for 2007. He's gonna have to prove he can win a championship if he wants to be an all-time great.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": ">He's gonna have to prove he can win a championship\n\nAlright. Then hold Luka to that same standard.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "WhiskyDrinkinCowboy",
                                                            "body": "If he got to the finals and choked I would. As of now he hasn't had the talent around him to do so, but he has a great chance this year so maybe we'll get to see how he performs.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "AgadorFartacus",
                                                                    "body": "Like it's somehow better not to get to the Finals? I guarantee you weren't saying Tatum had the talent around him to win a championship before the 2022 season. Even after the regular season you probably picked the Nets in the 1st round.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BitterAnimal5877",
                                    "body": "Luka couldn’t even make the fucking playoffs last year with Kyrie. ",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WhiskyDrinkinCowboy",
                                            "body": "Lol okay. I think they doing fine this year.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BitterAnimal5877",
                                                    "body": "Ah, it’s cool that everything Luka does is exactly what he’s supposed to all the time regardless of his many failures but Tatum, who’s already been to the finals isn’t a “superstar” until he wins a ring. Does Luka need to win a ring? Lol of course he’s a perfect gym rat coaches son ❤️❤️❤️",
                                                    "score": -4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "WhiskyDrinkinCowboy",
                                                            "body": "Tatum got locked down and outplayed by Andrew Wiggins in the finals",
                                                            "score": 4
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "Did you not just watch Tatum build a brick house in the 4th quarter 2 nights ago lmao",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgadorFartacus",
                                    "body": ">Luka:  33/9/8 on 12/26, 3 steals in a W\n\n\n\"Awww, you're sweet.\"\n\n\n>Tatum: 36/12/4 on 12/26, 3 steals in a W\n\n\n\"Hello, human resources?\"",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "Are you truly going to ignore what I said about the 4th quarter...? Tatum was missing everything and a big reason the pacers came back whereas Luka went on massive runs by himself to put the Mavs up.\n\nThis is a perfect example of why people think Tatum stans are idiots.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "BitterAnimal5877",
                                                    "body": "This is literally just not true, lol. You’re wrong. They lost the lead when Tatum went to the bench. \n\nIt’s cool that everything thats important is a moving target that dances around Tatums accomplishments: \n\nBetter overall game and stats? Better on off +/-? Take over OT? Make the playoffs *at all*? Play defense? \n\nEh, who cares… whatever… AH! yes the most important thing in the world today because it happens to line-up with what we can shit on with Tatum: “One rough quarter, come oooooon down!” ",
                                                    "score": 12
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "AgadorFartacus",
                                                    "body": "Tatum was a +20 and the team fell apart any time he went to the bench. He scored 10 points in OT to win the game.",
                                                    "score": 11
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Randyf21",
                                                    "body": "The comeback was at the end of the 3rd quarter when they benched Tatum up 11. Tatum was 2-7 in the 4th so not great but lets not act like the Pacers came back because of him. The 4th was tight the whole time",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "sickfalco",
                                    "body": "Ngl if it weren’t for Tatums 4th quarter reputation he would be up there with Luka. Also if he just realized he  is stronger taller and faster than everyone, that would be nice.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "Tatum is a top 10 player but he just isn't in that upper upper echelon because of games like that. He even addressed it himself in his post game presser how badly he played in the 4th.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Boring_Bill2430",
            "body": "Fully expecting the Wolves to come out with a vengeance Friday night. My hope is the Mavs can keep it close enough throughout to try to win another in crunch time.",
            "score": 39
        },
        {
            "depth": 0,
            "author": "CantaloupeCamper",
            "body": "Dude on crutches is going to kick yo ass.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "executivesphere",
            "body": "Couldn’t watch last night’s game closely but from what I saw, the wolves’ defense was well below their normal standard. I recall the centers coming up to contain Luka on the PnR, but the backside help was really lackadaisical which gave the Mavs a ton of easy buckets by their role players. I expect that they’ll clean that up a lot in the next game.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "wazdopest",
            "body": "yeah they don’t wanna get stuck with being able to solve the puzzle they were meant to (the Nuggets) and then being caught off guard by Dallas. it’s probably too soon for Ant to be the guy on a championship team anyway, guy’s only 22.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "jdmay101",
            "body": "I don't get this. They clearly came out firing, they scored 62 in the first half.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Painwracker_Oni",
                    "body": "Our defense looked like shit the entire game. We were soooo passive. Luka got to freely dribble into the paint over and over and over. We didn't throw a help or do any of our usual moves to try to stop a teams best player. Rudy just went backwards to the hoop and gave him space to keep going forward. Our offense was fine sure, KAT didn't do shit in the first half and ANT got to 13 and then looked like that fall in game 6 really stopped him from driving and resorting to just taking the 3s, so it was never great. \n\nWe competed well enough to keep it close but the team looked like shit. I don't know if it's the fact teams that played a game 7 are 0-14 in game 1 of the next series shit or what but they looked bad.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jdmay101",
                            "body": "I mean I acknowledge all that but you're talking to a guy whose team had 30 points at halftime in game 1 of these playoffs. THAT is not showing up for the game. This was just poor execution of a poor defensive strategy that was too focused on taking away 3s. The effort was all there.",
                            "score": -2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Painwracker_Oni",
                                    "body": "The effort honestly didn’t look the same. They looked like they were all gassed or being selfish and our help defense never showed up. You’d have to watch our games against the suns and nuggets where they played like their hair was on fire and we’re going full speed the entire time to tell. They looked like they were at 75% speed on defense.\n\n\nMaybe that’s the matchup causing it idk but we didn’t look like we had the same effort level at all.",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "echelon999",
                    "body": "Horrible game plan though, they were shooting nothing but threes and that’s just not the Wolves game. Rudy looked awful in the paint and the rebounding for a 7 footer was nowhere. I honestly think Ant is hurt after landing on his tailbone/back more than we know with how he’s played the last two games.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Lochbriar",
                    "body": "Conley's comments suggest the players were not committed to the prepared defensive game plan, so I'd imagine this is entirely defensive film.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "fudgetyler",
                    "body": "Yeah, the first quarter was intense as hell.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Rahnamatta",
            "body": "Cagalos a piñas a estos salames, Prigioni\n\n(Translation: you have to make them play better, Prigioni)",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "DaniRV",
                    "body": "Graceful translation hahaha",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Rahnamatta",
                            "body": "Yeah, I'm learning Spanish, boludo.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "QBert999",
            "body": "I expect the Wolves to come out extremely strong with a \"must win\" attitude in Game 2. It's going to be tough for the Mavs to match that energy having already got one in Minnesota, but I hope they do.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Kvsav57",
            "body": "I get him being upset but I didn't see them losing because of a lack of effort. Dallas just beat them straight-up.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mindless_Bad_1591",
                    "body": "Offensive execution was ass they just settled with 3s all game and the defense lacked any sense of urgency compared to last series. They looked sluggish.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Chalupa1998",
                    "body": "Then you weren’t watching",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kvsav57",
                            "body": "I was. They got beat straight-up. Ant was gassed because he had to deal with Kyrie. Dallas was the better team. The game was close because Dallas couldn't hit threes and Minnesota was doing okay (not great) from three. It just wasn't enough for the win.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chalupa1998",
                                    "body": "Ant was gassed from the tip off, he’s been playing way off since that fall in game 6. If you seriously could watch that rebounding effort and not think that was an effort problem then thats on you",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Jerome_Eugene_Morrow",
                                    "body": "Having watched the team all year they really didn’t look like themselves. Credit to the Mavs defense, but there was a real lack of energy from the Wolves over their normal performances. \n\nDon’t disagree that they just got beat, but it really didn’t look like the team they’ve been for the season so far. Really flat from start to finish.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Slow_Accident_6523",
                            "body": "You guys got beat and were simply the worse team yesterday",
                            "score": -4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Careless-Ad-2545",
            "body": "I have to say, I've never heard a star player shout out acknowledgment to their coach as much as Ant does. I feel like in every other interview, he's saying, \"Finchy this\" or \"Finchy that.\" It's cool how much respect Ant has for him.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "h20knick",
            "body": "It’s actually amazing that they got this far in the playoffs with nonsense film sessions.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Fred479",
            "body": "Hope he didn’t make them study too hard wouldn’t want them getting tired",
            "score": -32,
            "replies": [
                {
                    "depth": 1,
                    "author": "PeekyAstrounaut",
                    "body": "It was a 3 point win in a 7 game series. Relax.",
                    "score": 23
                },
                {
                    "depth": 1,
                    "author": "Conscious_Heart_1714",
                    "body": "Wow, I didn't know we were acting this arrogant already. Not a fan",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mindless_Bad_1591",
                            "body": "You should see your subs brigaders then lol.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "Fred479",
                            "body": "I was just poking fun man lol",
                            "score": -1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "colonelbustard69420",
                    "body": "Maybe they shouldn't have hit the gym after Game 7 lol",
                    "score": -22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dirkslance",
                            "body": "Minnesota TimberDOMS",
                            "score": -19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "colonelbustard69420",
                                    "body": "Lotta downvotes. Must be very sensitive boys in Minnesota.",
                                    "score": -20,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DoYouEvenSmurfBro",
                                            "body": "Or y'all are just not as funny as you think you are",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LifterPuller",
                                                    "body": "at least the Denver trolls were funny",
                                                    "score": 15
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "After-Ad5056",
                                            "body": "Stupid stuff tends to get downvotes around here.   Weird huh?",
                                            "score": 15
                                        },
                                        {
                                            "depth": 4,
                                            "author": "dirkslance",
                                            "body": "Very sensitive lol",
                                            "score": -6
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "colonelbustard69420",
            "body": "Does this franchise ever stop with the excuses gimmick",
            "score": -39,
            "replies": [
                {
                    "depth": 1,
                    "author": "cubonelvl69",
                    "body": "Shitting on your team for \"not realizing the conference finals started\" is not an excuse. He's pretty directly saying they played like shit",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "urkuri",
                            "body": "This was also only half the quote, the full quote he fully went in saying he was disappointed in everything from effort to attention to detail to attitude.",
                            "score": 14
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "After-Ad5056",
                    "body": "Oh nevermind, you're just not that smart.",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "HawaiianPunch42",
                    "body": "How is this an excuse?",
                    "score": 29
                },
                {
                    "depth": 1,
                    "author": "HoopsJ",
                    "body": "Please point to the excuse in this quote.",
                    "score": 3
                }
            ]
        }
    ]
}