{
    "title": "A reluctant Tim Duncan sits down with Richard Jefferson | The RJ & Larry Show",
    "comments": [
        {
            "depth": 0,
            "author": "mikostands",
            "body": "“Tell me more about your children”\n\n“No”\n\nThat deadpan shit got me good.",
            "score": 1205,
            "replies": [
                {
                    "depth": 1,
                    "author": "gridironk",
                    "body": "Tim Duncan looks like that mfer from iCarly that offers bagels or donuts or some shit.",
                    "score": 366,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Exodus100",
                            "body": "Teebo😭😭",
                            "score": 167,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "trkken",
                                    "body": "“You wanna buy a donut?”\n\n“Why’d you put them on the side?”\n\n“What do you mean?”\n\n“They have holes…”\n\n“Oh…”",
                                    "score": 70,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "I_Hate_My_Cat_",
                                            "body": "“Whole stick…$5.”",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "2cu3be1",
                            "body": "he makes me think he is a cheap double for Morgan Freeman playing a cheap remake of Pirates of the Carribean.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Delusional_Lynchpin-",
                    "body": "I'm sold. Tim Duncan clears Kobe Bryant. \n\nI love Tim Duncan. He's so relatable.",
                    "score": 191,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "trulyniceguy",
                            "body": "He also never raped anyone which is a huge positive for some",
                            "score": 305,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NorahCeCe",
                                    "body": "Neither did Kobe….and no, he did not admit guilt.  Only Reddit HS dropout Lawyers repeat that nonsense.",
                                    "score": -39,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "OilOfOlaz",
                                            "body": "He didn't admit it, he apologised though.",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "angrylilbear",
                                                    "body": "Apologized with words and money",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "NorahCeCe",
                                                    "body": "Yes, this happens often in our legal system.  An apology is absolutely not an admission of guilt.  There were things she did that were complete head scratchers after the incident….doesnt mean she was lying about being raped.  No one but the 2 of them know what happened that night.  Judging from her post case actions, she has happily moved on with life….and Kobe also did while he was alive.  Not sure why idiots have to ruin threads by bringing up the controversy when it has nothing to do with the thread.",
                                                    "score": -8,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "OilOfOlaz",
                                                            "body": "> An apology is absolutely not an admission of guilt.\n\nThats pretty much what I said.\n\nI added context, cuz your comment seemed pointlessly agressive. \nPretty sure there are ppl out there with university degrees who think he did it, for exapmle all the persecutioners working on the case.\n\nIn the end everyone is free to make their own opinion about it, the case is well documented and a lot of it is publicly aviable.",
                                                            "score": 11,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "NorahCeCe",
                                                                    "body": "And I was agreeing with you.  Just expounded more.  Cheers",
                                                                    "score": -2
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "angrylilbear",
                                                            "body": "It has everything to do with his character as a public NBA figure that is routinely argued about daily in this sub",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "HeorgeGarris024",
                                            "body": "except for the raping, he didn't rape anyone",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NorahCeCe",
                                                    "body": "Great talk….take care now.",
                                                    "score": -9
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "randy88moss",
                                            "body": "You’re wasting your time having any type of legal discussion with these TopMinds.  The girl could come out today and say she was lying and they’d still argue tooth and nail that Kobe did it.  Weirdly enough, if you checkout the posting history of these dude’s, most post on incel related subs.  Go figure",
                                            "score": -14,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LopsidedCry7692",
                                                    "body": "Lol i feel bad for Kobe stans. Having this delusion because your idol is a rapist",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "randy88moss",
                                                            "body": "You think this is funny, weirdo?  Go bother someone else.",
                                                            "score": -10
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "angrylilbear",
                                                    "body": "She didnt come out and he did apologise with both money and words",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "whocaresjustneedone",
                                                    "body": "What incel related subs does that guy post in?",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "StructureOk3166",
                                    "body": "This is why no one liked the Dallas Mavericks last night.",
                                    "score": -68,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ThlammedMyPenis",
                                            "body": "No one liked the Mavericks becaise Kobe raped someone 20 years ago?",
                                            "score": 39,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Greekbeak8",
                                                    "body": "He is implying that winning a basketball game by 3 pts is akin to sexual assault so that he can feel more masculine even though he was in no way, shape, or form part of the win but deep down in his heart he doth believe it so.",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "I_am_Bruce_Wayne",
                                                            "body": "nah, the person is just plain stupid and thought the wolves logo flair was the mavs",
                                                            "score": 12
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Acrobatic_Flatworm79",
                            "body": "Tim not being a rapist wasn't enough?",
                            "score": 47
                        },
                        {
                            "depth": 2,
                            "author": "123rune20",
                            "body": "Joey Crawford is closing in your location as we speak.",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "Rapshawksjaysflames",
                            "body": "Tbh I personally have Tim Duncan 1 spot ahead of Kobe on my top 15",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "eeeedlef",
                            "body": "I'm sorry, that was a debate?",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "dontredditcareme",
                            "body": "Duncan is a top 3 player all time don’t @ me",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "CameraWoWo2022",
                            "body": "Reddits obsession on Duncan>Kobe will never cease to amaze me lmfao. The rest of the basketball world disagrees with you, but go off",
                            "score": -19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ruffus4life",
                                    "body": "you're easily amazed.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CameraWoWo2022",
                                            "body": "Hard not be when Duncan is mentioned you hear some guy comparing him to Kobe immediately",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ruffus4life",
                                                    "body": "i don't see any think to be amazed about. maybe you been watching too many youtubers and you can only experience the extremes of emotions.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CameraWoWo2022",
                                                            "body": "No, I’m amazed by Reddit’s obsession with Kobe. They claim he’s a ball hogging chucker who’s not top 10 but yet mention him anytime they can. The view on Kobe on Reddit and outside of Reddit is hilarious.",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ruffus4life",
                                                                    "body": "lol they? you learn to speak from trump? get off ya soapbox. i'm sorry but i don't think kobe is a top 10 lock for greatest players. debatable for sure but he's more of that 7-10 range than a top 5 lock.",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "CameraWoWo2022",
                                                                            "body": "How do you even get to trump? Stop thinking politics 24/7, you’ll probably be less miserable buddy",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "ruffus4life",
                                                                                    "body": "i see someone with bad emotional control talk about \"they\" said what. and you're insult at the end of this comment is kinda like him also. sorry you're acting out like a child and i related you to a man child. hey you're already rallying behind one rapist so yeah. good job talking about basketball. you just wanna whine and complain.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "CameraWoWo2022",
                                                                                            "body": "Like I said, get politics out of your life and you will be less miserable.",
                                                                                            "score": -1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "86themayo",
                                    "body": "Huh? Duncan is going to be ahead of Kobe on most lists, Reddit or no.",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CameraWoWo2022",
                                            "body": "Most people have Kobe>Duncan outside of Reddit. Literally only Reddit where the majority opinion is Duncan",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "86themayo",
                                                    "body": "Most people would have Kobe higher for sure. Kobe is way more famous. But you said the \"the basketball world.\"",
                                                    "score": -2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "HowardHughes9",
                                    "body": "oh no a bunch of rapist fans disagree",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CameraWoWo2022",
                                            "body": "Cringe",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Apprehensive_Rice272",
                            "body": "Nah Kobe better ",
                            "score": -20
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "siphillis",
                    "body": "“How are yours, by the way?  Good?”\n\n“No.  They’re not happy.”",
                    "score": 36
                },
                {
                    "depth": 1,
                    "author": "MankBaby",
                    "body": "My friends and I were at Lake Travis in 2013 (a couple of months after the Spurs lost to the Heat in the Finals) and Tim pulled into the boat dock right next to us with his two kids and a dog. But despite us all being huge basketball junkies, we decided to completely ignore him, assuming he was the kind of guy who wouldn't want to be bothered, especially when hanging out with his kids. Looks like we were probably right lol.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "GovernmentDoingStuff",
            "body": "Duncan looks like such a different guy with the long hair and grey beard. Holy shit",
            "score": 727,
            "replies": [
                {
                    "depth": 1,
                    "author": "SelfDestructIn30Days",
                    "body": "Bro had hair the whole time, but did the bald thing for like 10+ years. Meanwhile I was bald before turning 30. If you have hair, let it grow. Props to Tim on growing the dreads, I'm jealous!",
                    "score": 344,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aareyes12",
                            "body": "Got the hair in the divorce",
                            "score": 120,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Responsible_Pace9062",
                                    "body": "More likely, grew the hair now that Pop isn't around him everyday to scream at him about his haircut.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "oatmealcrush",
                                            "body": "Pop grew his shit out too, maybe they kept eachother in check",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Genocide_Angel16304",
                                            "body": "I mean, Devin Vassel has similar hair but Pop aint bothering him about it. Plus Sochan's colored hair.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "qeq",
                            "body": "[That's like using a wheelchair for the fun of it!](https://streamable.com/ft253l)",
                            "score": 46,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "frankyseven",
                                    "body": "I knew a guy in high school who was a really good mountain biker, went pro right after graduation and ended up in the top 20 for downhill racing. One of our friends broke their leg and was in a wheelchair for a bit. Bike guy decided that it would be a good idea to try and ride the wheelchair down the stairs between classes. Didn't turn out very well.",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "LordGooseIV",
                    "body": "Somebody said that he looked like Aaron Gordon's father and I can't unsee it",
                    "score": 114
                },
                {
                    "depth": 1,
                    "author": "ChannelNeo",
                    "body": "Tim with that hairstyle during his playing days would've been so cool",
                    "score": 66,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Notorious-PIG",
                            "body": "Which is exactly why he didn’t do it.",
                            "score": 113,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Themanwhofarts",
                                    "body": "He's like the anti-Dennis Rodman",
                                    "score": 31
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "LeBroentgen",
                    "body": "He looks like he got trapped on an island for years and just got rescued and this is his interview telling the story.",
                    "score": 92,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oapples5",
                            "body": "He grew up in the Caribbean - always an island boy at heart.",
                            "score": 63,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BabyDick-_-",
                                    "body": "Cause I'm an Island Boyyyyyyyyyy",
                                    "score": 12
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "jacobsbw",
                            "body": "An entirely different relationship with Wilson than Tom Hanks.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bearcat--",
                    "body": "He looks like a contestant on Survivor lmao",
                    "score": 20
                },
                {
                    "depth": 1,
                    "author": "MrThunderMakeR",
                    "body": "He looks old man Kevin Nash ",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "elmanutres",
                            "body": "Tore my quads reading this",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "joejoe84",
                    "body": "Kevin Nash vibes",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Numerous-Cicada3841",
            "body": "Tim Duncan is so fuckin funny lol. His deadpan humor works well with RJeff’s over the top stuff.",
            "score": 543,
            "replies": [
                {
                    "depth": 1,
                    "author": "LothCatPerson",
                    "body": "RJ is pretty deadpan too",
                    "score": 64,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FlaccidInevitability",
                            "body": "RJ is too heavy on the sarcastic tone, Timmy fully commits",
                            "score": 51,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "siphillis",
                                    "body": "You need both.  Timmy is funnier because of the contrast.",
                                    "score": 35
                                },
                                {
                                    "depth": 3,
                                    "author": "LothCatPerson",
                                    "body": "Fair",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FlaccidInevitability",
                                            "body": "I still think he's hilarious tho",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LothCatPerson",
                                                    "body": "Oh, same. Definitely. Lol",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Fat-Villante",
                    "body": "It's really a shame the NBA failed to market him, he's got a cool and super likeable personality",
                    "score": 220,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lp_phnx327",
                            "body": "I think Duncan doesn't mind not being in the spotlight.",
                            "score": 278,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Immaculatehombre",
                                    "body": "I think he intentionally did whatever he could to avoid it. Never stopped me from loving Tim Duncan as a kid tho. He was my fucking dude!",
                                    "score": 132,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lp_phnx327",
                                            "body": "Just one of those players who let's his game do the talking.",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "P1NR",
                                                    "body": "That and all those HEB commercials LOL",
                                                    "score": 9
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "spurredoil",
                                            "body": "Yup, same here. I'm from a small town in Northern Alberta and had to order his jersey from the States and wait for a few weeks for shipping, which felt like forever as a kid in 2004.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "thoang77",
                            "body": "His foot locker commercial appearance is one of the best\n\nhttps://youtu.be/AnOQWc1ps5w?si=HyKjjsRf4FpGBCVn",
                            "score": 49,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "trexmoflex",
                                    "body": "Holy shit that's great.\n\n[My favorite Duncan anecdote is when Steven Adams talks about Duncan being nice to him on the court](https://x.com/anthonyVslater/status/725754148000419840)",
                                    "score": 27
                                },
                                {
                                    "depth": 3,
                                    "author": "wh1036",
                                    "body": "NGL at the end when he was eyeing that plant I thought he was going to knock it over in celebration that the interview was over, but he was in no mood for celebrating.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "bradpittisnorton",
                                    "body": "They should add Kawhi next time they do something like this.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "lxkandel06",
                            "body": "I think Tim Duncan intentionally failed to market himself",
                            "score": 34,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TigerBasket",
                                    "body": "He's a lot like Ted Williams. Just plays the game the right way.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ConstantineMonroe",
                            "body": "The NBA didn’t fail to market him, he just didn’t want it.  If he wanted it, the NBA would be more than happy to marry the hell out of him, but he wanted to lay low.",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "10monthbummer",
                            "body": "wym we got so many classic HEB commercials outta him",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "lialialia20",
                            "body": "at least we got [this gem](https://www.youtube.com/watch?v=hWStVQHOwTc)",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "tonypearcern",
                            "body": "He just didn't have that mamba *predator* mentality",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "betterAThalo",
                            "body": "i highly doubt the nba wanted to not market him 😂 seems like he didn’t want to be marketed",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "yapyd",
                    "body": "The line he gave to LeBron after winning in 07 is gold.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "KommanderKitten",
            "body": "I need to see an uncut version of this",
            "score": 131,
            "replies": [
                {
                    "depth": 1,
                    "author": "LothCatPerson",
                    "body": "“Uncut” for some reason makes it sound like the gratuit-tits version of a movie and not just an unedited version. Lol",
                    "score": 45,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WCWRingMatSound",
                            "body": "Uh…I’m in for that too 🤷🏽‍♂️",
                            "score": 15
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "eeeedlef",
                    "body": "uncut jyaahhhhhhmmmmzzzzz",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HeightsGringo180",
                    "body": "Literally what my wife said (I’m circumcised 😉)",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Air_Enthusiast",
                            "body": "Time to log off unc",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheFatmanRises",
            "body": "The most emotion I’ve seen Tim Duncan displayed. I miss big fundamental imagine him and Wemby.",
            "score": 411,
            "replies": [
                {
                    "depth": 1,
                    "author": "Conn3er",
                    "body": "The other team would not score points",
                    "score": 197,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PlacetMihi",
                            "body": "“Nah it’s all good we’ll just shoot from the perimeter!”\n\n*Wemby moves out to the 3 point*\n\n“Oh”",
                            "score": 84,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "The_Buddhist_Prodigy",
                                    "body": "\"I'd fight Tim Duncan and we'd both get tossed. That would hurt his team more than mine\"\n\n- Draymond Green",
                                    "score": 76,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jacobythefirst",
                                            "body": "Honestly should try and get Tim to laugh. That’s a guaranteed tossing right there",
                                            "score": 34,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cod_rules",
                                                    "body": "Especially if Timmy's on the bench",
                                                    "score": 6
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "sits-when-pees",
                                                    "body": "Draymond tickling Timmy D with a feather every possession.",
                                                    "score": 3
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "earthboundskyfree",
                                            "body": "I was going to say that it was dumb to assume TD would fight back but then I remembered that laughing is an ejection for him so that is probably gg",
                                            "score": 10
                                        },
                                        {
                                            "depth": 4,
                                            "author": "GoldenBananas21",
                                            "body": "lol TD played against KG. Draymond isn’t shit ",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "The_Buddhist_Prodigy",
                                                    "body": "What if I told you that KG wasn't a dirty asshole like Draymond",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "LongAvocado8155",
                                    "body": "Low key why I like Sarr and think we should roll up 4 and 8 for him. ***We have so many draft picks coming up that the real limiting factor is actually roster spots, not picks.***\n\nBoth Sarr and Wemby can lockdown perimeter players, while also leaving a disgusting help big in case they get beat.\n\nAlso, Wemby only plays 28 min a game - which is good for his long-term health, but having Sarr cover 20 back up minutes and acting as Wemby insurance would give insane coverage over the course of a season. \n\nOn offense, now you have two 7 footers who can handle. A Wemby/Sarr PNR is dangerous even if they don't develop 40% 3pt shots... But if either/both of them get to 38%, the league is totally totally fucked.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "blangoez",
                                            "body": "Sarr is a top 3 pick and he’s not pick 2 or 3.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Troll_Enthusiast",
                                    "body": "Give it to the player that isn't being guarded by either of them",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Superplex123",
                                    "body": "\"We'll shoot from half court!\"\n\n*Wemby takes another step.*\n\n\"Oh.\"",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lp_phnx327",
                    "body": "Throw in David Robinson.\n\n\"By the way, our \"small forward\" is 7'4.\"",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "Makaveli80",
                    "body": "Two generational big men on the same team would be so broken. If healthy they could cruise to 70+ wins \n\n\nFit might need some help, but both are so adjustable and do whatever is needed to win",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "a77ackmole",
                            "body": "well there was this guy named david robinson that tim played with for a lil bit.\n\n  \n(yes I know it's different)",
                            "score": 39,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TigerBasket",
                                    "body": "Hakeem and Sampson, though it was Akeem back then.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "throwstuff165",
                    "body": "Do you not remember that time he went completely crazy and knocked over a plant while celebrating?",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "FatalTortoise",
            "body": "Imagine him on Inside instead of Draymond.",
            "score": 379,
            "replies": [
                {
                    "depth": 1,
                    "author": "EbbRevolutionary3225",
                    "body": "I would love to have Tim inside",
                    "score": 236,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mhoq",
                            "body": "Pause",
                            "score": 97,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HeadyRoosevelt",
                                    "body": "Resume",
                                    "score": 66,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thesanmich",
                                            "body": "Flip it and reverse it.",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Yours_and_mind_balls",
                            "body": "Of me",
                            "score": 23
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "raylui34",
                    "body": "I was gonna say KG, since they played in the same era at their peak, battled in the west, both rivals. That interview would be so good",
                    "score": 43,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kpabe",
                            "body": "at some point, Duncan and KG were on pretty bad terms personally.",
                            "score": 49,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "LothCatPerson",
                                    "body": "Polar opposite personalities don’t get along? I am shocked.",
                                    "score": 39,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LiSAuCE",
                                            "body": "I don’t think it was just that. Rumor is KG said some pretty heinous stuff to TD during a game.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Anal_Iverson",
                                                    "body": "It goes deeper. \n\nTim Duncan sued his former accountant who scammed him of millions of dollars and KG showed up to that guy's sentencing to offer moral support.\n\nThat guy then later scammed KG lol",
                                                    "score": 61,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bettercallsaul3",
                                                            "body": "Really? I thought KG got scammed so he was supporting Duncan's case.",
                                                            "score": 7,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Anal_Iverson",
                                                                    "body": ">Garnett, in fact, sat in Banks’ corner during the sentencing in federal court in San Antonio.\n\n[source](https://www.mysanantonio.com/news/local/article/Garnett-sues-former-accountant-in-latest-legal-13211669.php)",
                                                                    "score": 27,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "bettercallsaul3",
                                                                            "body": "Lol",
                                                                            "score": 7
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "LothCatPerson",
                                                    "body": "Idk. If that’s all it was, then so many players would hate KG.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "drpootawn",
                                                            "body": "KG allegedly wished TD a \"happy mother's day, motherfucker\" on a SA-MIN game played on Mother's Day. TD sadly lost his mother to breast cancer when he was 14 years old. Extends a bit beyond normal trash talk",
                                                            "score": 31,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "LothCatPerson",
                                                                    "body": "I’m aware, but RJ himself said KG said the most unhinged shit to everyone on the court, like stuff that would get you jumped or worse off the court, My point isn’t that Duncan might not hate KG because he talked shit, it’s that I’d guess it goes beyond what he said and more to the core of the kind of person he is to think it’s okay to say that.",
                                                                    "score": 6
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "barbaraanderson",
                                                                    "body": "Didn’t she die on his birthday as well?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ConsumptionofClocks",
                                                                            "body": "The day before, not like that is any better",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Devoidoxatom",
                                                            "body": "Melo probably did",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MK10",
                    "body": "I was just thinking Timmy, RJ, and maybe Dirk would be a solid new Inside crew. Two HoF rivals with a mutual teammate they both can pick on while RJ is a great instigator lol.",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "syneofeternity",
                    "body": "I thought you said inside of Draymond...",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "SnickersFunSize",
                    "body": "Would be awful. Since draymond joined inside like 2 weeks ago there’s been 3 posts a day about it. People wanna watch a psycho on tv, as much as Reddit doesn’t like it",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "OnlyMamaKnows",
            "body": "Timmys look is wild and they actually have good comedic timing together.",
            "score": 128
        },
        {
            "depth": 0,
            "author": "GenesisReb",
            "body": "Tim is such a funny loveable authentic guy. Wish he would do more stuff like this but the reclusiveness is part of his charm I guess.",
            "score": 63
        },
        {
            "depth": 0,
            "author": "RiDaMcG",
            "body": "I love big Tim.",
            "score": 48
        },
        {
            "depth": 0,
            "author": "drc150",
            "body": "\"Where the hell is Tim Duncan?\" We've finally got our answer folks",
            "score": 97,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheDickSaloon",
                    "body": "Can't wait for his next media appearance in 2030",
                    "score": 38
                }
            ]
        },
        {
            "depth": 0,
            "author": "zeroarelius",
            "body": "Shout-out Vanessa! \n\nI need more of these two.",
            "score": 41
        },
        {
            "depth": 0,
            "author": "makashiII_93",
            "body": "His RT episode was the best they ever did. \n\nAnd I couldn’t believe it was the same guy who killed my Rockets my whole life.",
            "score": 40,
            "replies": [
                {
                    "depth": 1,
                    "author": "bettercallsaul3",
                    "body": "RT?",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Breezyisthewind",
                            "body": "Road Trippin’ podcast with Richard Jefferson, Allie Clifton, and Channing Frye. Episode with Timmy:\n\nhttps://m.youtube.com/watch?v=4iWA1Shnn8o",
                            "score": 14
                        },
                        {
                            "depth": 2,
                            "author": "bankrupt_boy",
                            "body": "Russia Today",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "LeeRohan",
                            "body": "Road Trippin - Richard Jefferson/Channing Frye podcast",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "PabloArandaGarcia",
                            "body": "I assume it stands for Road Trippin, the podcast with RJ.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fiyukyoo",
            "body": "ESPN have been trying to create an inside the NBA squad for years.  RJ should be one of them instead of trying to put him on calling games duty.  He's shown he can do it based on being on NBA today",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "Superlolz",
                    "body": "RJ is great at calling games too though. He has the media voice and personality for it all. ",
                    "score": 24
                }
            ]
        },
        {
            "depth": 0,
            "author": "Dangerous_Ad_6831",
            "body": "I’m getting Nathan fielder/between two fern vibes. I fucking love it. Tim is the man.",
            "score": 113,
            "replies": [
                {
                    "depth": 1,
                    "author": "Shenanigans80h",
                    "body": "Fr this started pretty normal then got some Between Two Ferns vibes by the end",
                    "score": 30
                },
                {
                    "depth": 1,
                    "author": "Clevo",
                    "body": "There are two different ferns right between them, I think that was on purpose",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "qpwoeor1235",
                    "body": "Caleb Presley vibes",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bootyholebrown69",
                            "body": "The editing is super similar",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "rounder55",
            "body": "\"I'll cut the French one\"\n\nThis is fantastic. Very homagesque to Eric Andre meets Between Two Ferns",
            "score": 105
        },
        {
            "depth": 0,
            "author": "Silent_Liam",
            "body": "Random thought, but I feel like Tim Duncan and Bill Belichick should do make a podcast together.",
            "score": 69,
            "replies": [
                {
                    "depth": 1,
                    "author": "Important_Arugula_93",
                    "body": "Would be literally the most boring podcast ever.",
                    "score": 81,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sgtpepperslaststand",
                            "body": "I find that Belichick is a pretty interesting and energetic when he’s not standing at the podium talking to the media lol. He’s been great in everything I’ve seen him in",
                            "score": 44,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Goosedukee",
                                    "body": "Yeah Belichick just despises the media he’s not really boring or anti-social at all",
                                    "score": 19
                                },
                                {
                                    "depth": 3,
                                    "author": "dirkslance",
                                    "body": "His draft coverage was 10/10",
                                    "score": 11
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bihari_baller",
                            "body": "I doubt two of the greatest in their respective sports would be boring. They would have great insights.",
                            "score": 23,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important_Arugula_93",
                                    "body": "Yeah insight they wouldn’t talk about 😭",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheDickSaloon",
                                            "body": "OK but what if we got Tim and Henry Cavill on the mic to talk nerd shit",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "doublepint",
                                                    "body": "I'd sit through a 45 minute YouTube ad to listen to/watch that.",
                                                    "score": 2
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "BlackMathNerd",
                                                    "body": "Honestly hearing them discuss Warcraft builds would be funny",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Tachyon9",
                            "body": "Timmy is one of the funniest people I've ever heard on the rare occasions he actually opens up. There's a reason he's such good friends with everyone he played with.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "LFC9_41",
                            "body": "Idk I think you get a StarCraft fan on there and Tim probably won’t shut up.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Tachyon9",
                                    "body": "Yup, lol. Video games, fishing, and cars.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LothCatPerson",
                            "body": "I’d like to think it’s literally only about 15 seconds long, and each episode starts and ends with them asking how their day was and answering “not bad.”",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Important_Arugula_93",
                                    "body": "Lots of “uh huh’s” and “yups”",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Silent_Liam",
                            "body": "I didn’t say I would listen to it lol.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Alarming-Spend988",
                                    "body": "The implication is you would ",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Significant-Iron-475",
                                            "body": "Because of the implication, you see.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "L0N01779",
                                                    "body": "Can’t believe someone downvoted your Sunny ref, made me sad",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Significant-Iron-475",
                                                            "body": "Thank you for saving me",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TJ_McConnell_MVP",
                            "body": "Yeah you need someone more silly to compliment a straight man persona. Tim and RJ do a good job of that here.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "IceJeyD",
            "body": "There's my GOAT. Should be a lock everytime there's a Top 10 discussion. ",
            "score": 50,
            "replies": [
                {
                    "depth": 1,
                    "author": "DoILookUnsureToYou",
                    "body": "We were rivals a lot in the 2000s but I lose all basketball respect for anyone who doesn't have Timmy in their top 10.",
                    "score": 29,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Breezyisthewind",
                            "body": "Same tbh. Dude was a menace.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "randomCAguy",
                            "body": "Same here. I rank Kobe much higher than the average redditor does, but I still consider Duncan a top ~7.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NJNetsFan5152433",
                    "body": "I agree he's definitely Top 10 All-Time, but I remember you guys hated RJ when he was on the Spurs */s*",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "WCWRingMatSound",
                    "body": "* Wilt\n\n* Bill\n\n* Kareem\n\n* Hakeem\n\n* Bird\n\n* Magic\n\n* Jordan\n\n* Shaq\n\n* LeBron\n\nHis only debate for that slot is with Kobe and I’m giving it to Duncan every time.\n\nEdit: there’s 9 names in that list and it’s in roughly chronological order.",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "_Vaudeville_",
                            "body": "Duncan has an argument over some of these guys for sure. Specifically Bird, Hakeem and Shaq.",
                            "score": 26,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CameraWoWo2022",
                                    "body": "We went full counter jerk with Duncan on r/nba.",
                                    "score": -5
                                },
                                {
                                    "depth": 3,
                                    "author": "ingmarbirdman",
                                    "body": "Bird!?? I know I'm a Celtics fan and biased, but come on.\n\nHakeem, absolutely. Shaq, a case can certainly be made. Bird, get out of town.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "_Vaudeville_",
                                            "body": "Duncan and Bird had similar impacts in the postseason in their primes and then Duncan had another 7-8 good years vs Bird retiring early. It’s absolutely a debate.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "siphillis",
                            "body": "I’d put Duncan over Shaq and Hakeem, career-for-career",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "PureMapleSyrup_119",
                            "body": "Add Duncan and Steph and remove Hakeem and that is also my top 10 list",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Responsible_Bison830",
                            "body": "Weird how even Shaq who has the biggest ego of any athlete in recent history can admit Kobe was better than him and even in the top 3 but you can’t even put him in your top 10. \n\nEven Magic has him as the greatest Laker of all time and people don’t just say that shit lightly. \n\nIt’s just Reddit that knows better than former legends that want to diminish Kobe.",
                            "score": 0
                        },
                        {
                            "depth": 2,
                            "author": "CameraWoWo2022",
                            "body": "Reddit’s hate for Kobe man lmfao",
                            "score": -8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CameraWoWo2022",
                                            "body": "You’re speaking about him now lmfaoo",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "bio180",
                                                    "body": "care === speak? Its amazing his legacy will forever be connected to him being a rapist",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CameraWoWo2022",
                                                            "body": "His legacy will always be mamba mentality and a top 10 nba great. Cope and seethe",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "bio180",
                                                                    "body": "and a rapist LOOOL",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "WCWRingMatSound",
                                    "body": "Bro #10 and #11 GOAT (out of 4,500 players all time) isn’t exactly **hate** lmaooo",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CameraWoWo2022",
                                            "body": "It absolutely is. Kobe is clear of Hakeem, Duncan, and Shaq.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PureMapleSyrup_119",
                                                    "body": "How is Kobe ahead of Shaq when the 3 rings they won together Shaq was by far the better and more important player on their team?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CameraWoWo2022",
                                                            "body": "Because Kobe went to three NBA finals without Shaq and proved he didn’t need him. Kobe had the better career",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "PureMapleSyrup_119",
                                                                    "body": "Agree to disagree. I don't agree that getting one more ring means he had the better career. Shaq won three as the best player on a team that Kobe was also on. Kobe won three as the best player on a team Shaq was not on. Shaq won 4 rings, Kobe won 5 rings. Shaq 1 MVP, Kobe 1 MVP. At Shaq's peak there was no argument he was the best player in the league. They changed the rules because of Shaq. I think there was maybe 1 year where Kobe was unquestionably the best player maybe. Most of his career it was \"who's better AI/TMac/LeBron or Kobe?\"",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "CameraWoWo2022",
                                                                            "body": "Kobe was absolutely the best NBA player from 2005-2009",
                                                                            "score": 0
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "WCWRingMatSound",
                                                    "body": "There’s nine names in that list and they are in chronological order. Just add Kobe if you feel that strongly LOL. \n\nPersonally I’d put Oscar Robertson above him, but 🤷🏽‍♂️ I’ll respect that on paper he should be #10 or #11.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "CameraWoWo2022",
                                                            "body": "Oscar Robertson ahead of Kobe 🤣 holy shit",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "legless_chair",
            "body": "Blows my mind every time I see Tim Duncan the dude decided at age 40 whatever to grow his hair out. Like watching this guy walk into the arena in the 2000s who would have even thought that was something he would do?",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Breezyisthewind",
                    "body": "Dude’s from the Islands. He’s on classic island style now.",
                    "score": 16
                }
            ]
        },
        {
            "depth": 0,
            "author": "JohnnySalmonz",
            "body": "Tim Duncan is a style icon",
            "score": 14
        },
        {
            "depth": 0,
            "author": "peaheezy",
            "body": "Is this like “Between Two Ferns” for basketball?  It’s funny\n\nAnd whoa at Tim Duncan with hair. Always assumed dude was bald and even though that hairline may go halfway back it’s surprising to see. Looks cool.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "ionospherermutt",
            "body": "wish he had asked about the LAN party on the plane after the championship with the Larry O'Brien Trophy just sitting in the corner",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Poon-Conqueror",
                    "body": "\"How was the game\"\n\n\n\"Terrible, just lost three in a row and deranged.\"\n\n\n\"Wait, I thought you just a championship? Like you literally have a trophy right next to you.\"\n\n\n\"Oh yeah, that game. Yes that one went alright I guess.\"",
                    "score": 13
                }
            ]
        },
        {
            "depth": 0,
            "author": "BigGrandpaGunther",
            "body": "Why does this feel like an Eric Andre interview",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "Key_Alfalfa2122",
                    "body": "Hes defintiely going for Eric Andre. The \"but we're four questions in\" was a dead give away lmao straight up stole that shit from eric",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "EnriquezGuerrilla",
            "body": "eeey finally a proper Duncan interview not like the remote shit he did with the ringer 😂",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "RunnerTexasRanger",
                    "body": "Wish it was longer! I miss Timmy",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "YROK1986",
            "body": "As a die hard fan of the 2000s Pistons, you'd be hard-pressed to find two players I hated or was more annoyed by than these two, but this was delightful and hilarious.",
            "score": 26
        },
        {
            "depth": 0,
            "author": "Tachyon9",
            "body": "Timmy has always been the funniest dude of almost anyone else in the NBA. He just hates the spotlight. I'd absolutely love to see him actually do some media circuits stuff, but he doesn't like the attention. Plus he'd talk CoD, WoW, and fishing before anything basketball.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "elLugubre",
            "body": "I miss you Timmy.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "wep",
            "body": "They also got a longer audio pod if ya liked this one. It’s much longer. https://youtu.be/4iWA1Shnn8o?si=drnyhILs-pwYVF0D",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "yworker",
                    "body": "This was one of the funniest NBA interviews.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "ketoburn26",
            "body": "I miss Timmy D.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "donwothe",
            "body": "Lol it’s a between two ferns knockoff but nicer. Down to the random plant in the middle. Good stuff",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Imaginary-Tiger-1549",
            "body": "Why does Duncan look a character from a Key and Peele sketch?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Bloody_Corndog",
            "body": "That was better than expected lmaooo",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Ghost2Eleven",
            "body": "I thought this was a Key and Peele sketch from the thumbnail",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Mr_Unbiased",
            "body": "Timmy loves RJ.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "dragonwhale",
            "body": "Duncan is my GOAT",
            "score": 4
        },
        {
            "depth": 0,
            "author": "18AndresS",
            "body": "Duncan out there looking like the dude",
            "score": 3
        },
        {
            "depth": 0,
            "author": "johnny_mcd",
            "body": "The fern is between them. Nice mixup",
            "score": 3
        },
        {
            "depth": 0,
            "author": "BrawndoCrave",
            "body": "You’ve done a job",
            "score": 3
        },
        {
            "depth": 0,
            "author": "jl_theprofessor",
            "body": "The Goat. Manly tears.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "breadbinkers",
            "body": "Cut the French boi im dead lmao",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PleasantThoughts",
            "body": "I did not expect Tim Duncan to ever have long braids he looks like a totally different dude",
            "score": 3
        },
        {
            "depth": 0,
            "author": "dating_derp",
            "body": "Not just 5x championships, but the number of 50+ win seasons they had was ridiculous.  Can't imagine that kind of consistent success for 19 years.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "FullHouse222",
            "body": "Tim retired, aged like 30 years in a 5 year span, and turned Jamaican lol",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "elLugubre",
                    "body": "Tim retired 8 years ago now. \n\nBut yeah, I'm his same age, and he looked younger than me in 2016 but now he def looks older.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FullHouse222",
                            "body": "> Tim retired 8 years ago now. \n\nThanks for reminding me that I'm old....",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "randy88moss",
            "body": "lol I enjoyed that way more than i thought I would.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "NorahCeCe",
            "body": "One idiot Mavs fan turned this awesome thread into a complete shitshow.  Congrats",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "whocaresjustneedone",
                    "body": "You know that was a Wolves fan that got you all heated about needing to defend Kobe's rape and not a Mavs fan right?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "X_FlashPanther_X",
            "body": "It’s really annoying when I post this exact video earlier and the no loser mods delete it because they want their butt buddy to have more fake internet points",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "cloudy_ft",
                    "body": "lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "KaleidoscopeSad3093",
            "body": "I love how Tim Duncan it's wearing he's watch like it was suppose to be.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Not_A_Meme",
            "body": "He did the interview, how reluctant could he be?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Holiday-Rip-1969",
            "body": "This is so funny lol more RJ and more Timmy please",
            "score": 2
        },
        {
            "depth": 0,
            "author": "TennisHive",
            "body": "RJ should give some credit and money to Zach Galifianakis and Between Two Ferns! Definitely the vibe, the plant, the cuts, the questions and desired awkwardness are \"inspired\" by that show.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "PureMapleSyrup_119",
            "body": "Getting strong \"between two ferns\" vibes. Really love RJ",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Aggressive-Ad-522",
            "body": "Hahahahhaha",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bearcat--",
            "body": "lmao this was a very fun interview to watch. was this RJ's first? Would watch more.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "d0odk",
            "body": "This looks like thumbnail for a Key & Peele skit",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Choppybitz",
            "body": "The cadence of comedy without the comedy",
            "score": 2
        },
        {
            "depth": 0,
            "author": "HORSEthedude619",
            "body": "Every time I see present day Duncan, I still don't believe that's him.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Sifl95",
            "body": "Idk, the awkward interview shtick has been a bit played out since \"Between Two Ferns.\"\n\nDuncan was funny, but the concept just feels forced in general at this point. That Bobbi girl was probably the last round fired into that dead body.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Literal_Satan",
            "body": "fern between 2",
            "score": 3
        },
        {
            "depth": 0,
            "author": "living_on_a_spare",
            "body": "I love me a good trainwreck",
            "score": 3
        },
        {
            "depth": 0,
            "author": "drunkenyeknom",
            "body": "Why is RJ seducing me with his low cut dress",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ezcheesy",
            "body": "You've done 'a job.'  Nicely said.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LnGrrrR",
            "body": "When did Tim Duncan turn into Lister from Red Dwarf?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kkpq",
            "body": "Between Two Spurs",
            "score": 1
        },
        {
            "depth": 0,
            "author": "iCE_P0W3R",
            "body": "Bro Tim Duncan looks so fucking cool I can’t.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "The-Pharcyde",
            "body": "lol Tim is great. Funny without trying.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NobodyLost5810",
            "body": "Cutting Tony validates every single one of my feelings about Manu.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RockyMM",
            "body": "Well, this was pure gold.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SeveralDeer3833",
            "body": "Amazing",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Signiference",
            "body": "I thought this was a Key and Peele sketch",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Epiopop",
            "body": "Tim Duncan looks like he's been spending his retirement perfecting the art of chilling out",
            "score": 1
        },
        {
            "depth": 0,
            "author": "flightgooden",
            "body": "Looks like Tim Duncan and Aaron Rodgers have been hanging out",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ancient_Signature_69",
            "body": "Tim Duncan owns one of those dinghys in the BVI that cruises around to sailboats and catamarans selling t shirts.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackMathNerd",
                    "body": "When I went to the USVI 2 years ago I wish I saw Tim Duncan.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tearz_in_rain",
            "body": "This interview makes me remember how much I miss this guy. \n\nHe was so good for the game for a fans of the game. \n\nWe got a lot of guys like Giannis and Jokic now, and Leonard to a lesser degree when he was healthy, who have a more low-key and less strategic approach to media. \n\nI just love how authentic TD always was.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MightyInfant",
            "body": "Man. Tim Duncan is a bad MF. I never woulda guessed, and that’s how he gets ya.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tkflash20",
            "body": "Tim Duncan's brother has similar hair. They're island boys through and through",
            "score": 1
        },
        {
            "depth": 0,
            "author": "drfunkensteinberger",
            "body": "So we’re just ripping off between 2 ferns?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WearyRound9084",
            "body": "Kawhi and Tim Duncan were Def jam comedians before Popovich destroyed their personalities.",
            "score": -17,
            "replies": [
                {
                    "depth": 1,
                    "author": "BroJackson_",
                    "body": "Popovich is like the Godfather of deadpan humor.   It doesn't always land in media clips, but he's very respectful and genuinely a very nice man.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "Tachyon9",
                    "body": "Tim and Pop are both hilarious with their deadpan and sarcastic humor. They just rarely let it out to most sports media. Tim is only here because him and RJ are biddies.",
                    "score": 10
                }
            ]
        }
    ]
}