{
    "title": "The same exact voter gave Domatas Sabonis a vote for 1st team all defense, 1st team all nba, 4th in MVP, and 3rd in DPOY",
    "comments": [
        {
            "depth": 0,
            "author": "alexor_1",
            "body": "he even voted bobby portis for 2nd team all defense lmaoooooo",
            "score": 951,
            "replies": [
                {
                    "depth": 1,
                    "author": "5platesmax",
                    "body": "Should Lose his vote.",
                    "score": 360,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NobodyLost5810",
                            "body": "Absolutely. Either grossly incompetent or a masterclass troll.",
                            "score": 175,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "abzftw",
                                    "body": "We need troll representation",
                                    "score": 43,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "helgestrichen",
                                            "body": "Not without Troll taxation",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Fit-Avocado-342",
                                            "body": "r/nbacirclejerk member becoming a voter is crazy",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Tapprunner",
                                            "body": "Exactly. Diversity makes us stronger. We can't have a truly representative, inclusive NBA if we're going to ignore the lived experiences of trolls. TLM.",
                                            "score": 4
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Mr_Hugh_Honey",
                                    "body": "You know I think that real awards voting, which happens to determine compensation for players, is not the time and place to troll but maybe that's just me",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dutchfromsubway",
                                            "body": "I agree, as much as I appreciate a good troll, this is not the time",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "IHateTomatoes",
                            "body": "still not as egregious as leaving Domas off the All-Star Team",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MightWaste",
                                    "body": "most sane Sacramento resident",
                                    "score": 12
                                },
                                {
                                    "depth": 3,
                                    "author": "rebelnz",
                                    "body": "well said",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "qpwoeor1235",
                    "body": "Dudes a menace",
                    "score": 149
                }
            ]
        },
        {
            "depth": 0,
            "author": "DidTheyCallSaul",
            "body": "Two people, Ignacio Garcia from MARCA and Tolis Kotzias of SDNA, have basically all of the ridiculous votes we've seen. Between them, they're responsible for:\n\n*  All of the crazy Sabonis votes\n* Jrue #1 DPOY and Giannis #2, with no Gobert\n* Haliburton #1 MIP\n* SGA 5th for MVP\n* No Luka on MVP ballot\n* Luka All-NBA 2nd Team\n* LeBron All-NBA 1st Team\n* Bam All-NBA 2nd Team\n* No Brunson on All-NBA\n* Jose Alvarado 2nd for 6th Man and Jaime Jaquez Jr. 3rd\n* Tatum 1st for Jerry West Clutch Player\n* Bobby Portis All-Defensive 2nd Team\n\nStill going through, but this is crazy\n\nEdit: One exception, Kendrick Perkins is the one who was missing Brandon Miller on All-Rookie. But Kotzias was one of the two people without Podziemski.",
            "score": 498,
            "replies": [
                {
                    "depth": 1,
                    "author": "cheerioo",
                    "body": "Nba player legacies are getting defined by these types of clowns lmao. Seriously though.",
                    "score": 286,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "purplenyellowrose909",
                            "body": "*NBA player paychecks are getting defined by these types of clowns\n\nEdit: A guy like Maxey is getting severely low balled because they're stuffing the all NBA teams with old heads",
                            "score": 130,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "whereyagonnago",
                                    "body": "Which old head do you think Maxey should have made it over? And really, it’s which 2 old heads. Because to me, the voters, and most others, Jaylen Brown was the clear biggest snub so if you kick one person out Maxey still wasn’t making it.",
                                    "score": 63,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "purplenyellowrose909",
                                            "body": "No one specifically. If you're gonna make contracts tied to it tho then these guys like Maxey or Fox get screwed out of millions of dollars because the same list of 10-12 players appears every year. You have to get a crazy amount of seemingly arbitrary media buzz like Ant or Brunson to crack the list and get paid because KD, LeBron, Steph, etc are locks",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "whereyagonnago",
                                                    "body": "Yeah I can’t disagree with you there. Tying these bigger contracts to something that is only available to 15 guys per season is flatly ridiculous to me. The young talent that we have in the league these days is crazy, and the older players are sticking around at the high levels of play even longer than they used to. \n\nI think the 65 game requirement will help some of these fringe guys hit all NBA every now and then, but we won’t know for certain until we see how it looks in 5-10 years.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Aggressive-Name-1783",
                                                            "body": "I mean, are we arguing Fox is a guy worth a super max? Let’s be honest, a super max is reserved for the best of the best like Luka and Giannis. Are we really putting guys like Fox and Maxey on the level of a Luka, Tatum, Ant, Lebron, Jokic?",
                                                            "score": 12,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "whereyagonnago",
                                                                    "body": "Fox is worth what teams would pay for him, and I think there are plenty of teams that would pay him the super max. \n\nDon’t compare Fox to only those first team All-NBA caliber players, compare him to the borderline guys. Hali is now going to get the supermax. Do you really think Fox is a substantially different caliber of player than guys like Hali or Sabonis?",
                                                                    "score": 8,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "mpbeasto123",
                                                                            "body": "Yeah, I think he Fox is better than both those guys. Kings are only ever good when Fox is firing. Beginning of this year before he got hurt and his form took a dip, Fox looked like a top 10 player.",
                                                                            "score": 4,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "MountainYogi94",
                                                                                    "body": "We’ve seen careers end due to injury. And now, while unfortunate that Fox won’t truly maximize his earning potential, he still gets to play and will still get the biggest contract available to him. Last I checked, the regular max is still a generational amount of money. Hell when some of these old heads retire he’ll make a few All NBA teams in his career, he’s still only 26.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Aggressive-Name-1783",
                                                                            "body": "Hali and Sabonis shouldn’t be getting super maxed either. That’s kinda the point of why the super max is ridiculous",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "purplenyellowrose909",
                                                                    "body": "Why not let the market decide instead of a council of 99 behind the scenes sports writers?",
                                                                    "score": 4,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Aggressive-Name-1783",
                                                                            "body": "Because the market would decide Lebron is worth 100 million/year….\n\nDo you want baseball style free agency? Because that’s how you get a world where the Nets, Cavs and Clippers winning every title for the next decade while the timberwolves become worse than Charlotte or the wizards",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "purplenyellowrose909",
                                                                                    "body": "Except there's a salary cap in the NBA so it would be more like the NFL where if you want to pay Russell Wilson $245M and have the rest of your team suck, it's your God given right to do so",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Aggressive-Name-1783",
                                                                                            "body": "Then you would need to significantly raise the cap and completely change the NBA’s rules. Because with that the only teams that could pay a super max are basically shitty teams with no talent. Nobody would get the super max and it would be the same problem we have now, teams paying their own guys a supermax just because they have to and then trading them",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Ocular__Patdown44",
                                                                    "body": "I’d say yes, a top 10 scorer is worth the super max. ",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "FeminismIsTheBestIsm",
                                                            "body": "Considering the implosion in talent, what makes more sense is extending All-NBA and All-Star teams to have slightly more players, but that's sacrilegious on this subreddit lol.",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "The_Assassin_Gower",
                                                    "body": "They're not really being screwed out of it,  they want to be paid like a top 15 player? They should be a top 15 player.  The distinction exists for a reason",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "whereyagonnago",
                                                            "body": "It’s the arbitrary cutoff that’s the issue. I can make the number 10 and say “if Hali wants to be paid like a top 10 player, then he should be a top 10 player” \n\nLet the market decide. Max contracts are a silly concept in general, but the arbitrary super max is sillier.",
                                                            "score": -1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "M_Nark",
                                            "body": "Maxey should have made it over Kawhi - it’s unjust he didn’t.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "nothing3141592653589",
                                            "body": "There's an excellent argument to leave Brown out of the all-NBA lists",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "whereyagonnago",
                                                    "body": "Voters thought otherwise. You can look up the full results and he was the clear first person off. Maxey was actually tied with PG for 2nd player off.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "colosusx1",
                                    "body": "I think it’s the opposite.  At least three voters have said they don’t want to leave guys off if they’re up for an extension and they’re close.  Ie this would have influenced some to vote Haliburton over jaylen brown.  Maxey was probably far off everyone’s list because his stats weren’t otherworldly and the sixers were pretty bad without embiid.",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "ChocoChowdown",
                                    "body": "I don't think I'd feel comfortable being a journalist and having an impact on player salaries. Like me throwing out my takes here are ultimately meaningless but we're talking millions of dollars being awarded here.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Hon3ynuts",
                                            "body": "It's a weird spot b/c the players union agreed to this system, the journalists were not involved with getting that claus into the CBA.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "secretsodapop",
                                            "body": "Have you ever seen one of these come down to one vote?",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "WhiteHeterosexualGuy",
                                            "body": "Id be fine with it lol were talking about guys that are already going to be on 9 figure contracts north of $200M.  You scared their kids gonna go hungry cus you didnt vote right? Lmao",
                                            "score": -1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Tagst",
                            "body": "Not just legacies, generational wealth. These awards are tied directly to contracts.",
                            "score": 13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DreadWolf3",
                                    "body": "I am sure players who are deciding between just having a measily max deal or super max will manage with either",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Slight_Public_5305",
                                            "body": "Yeah I’ve always been entirely unmoved by the “ethics” argument that if it’s close media feel like they have to vote for the guy whose contract eligibility it affects. There’s a salary cap and in the long run most teams are going to pay other players more if they have a regular max. From an ethical standpoint I’d rather the NBA salary wealth be shared around rather than all go to star players, even if slightly less gets paid out total because of the soft cap.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Rapshawksjaysflames",
                                            "body": "The players aren't the ones deciding, it's the award voters that decide which max they get.",
                                            "score": -3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "angrylilbear",
                            "body": "And yet the NBA social world will still argue using these dumb media awards",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "nothing3141592653589",
                            "body": "In my headcannon Shaq won a unanimous MVP and Curry was the second to do it.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "elsporko321",
                            "body": "And their paychecks..not that I'm over here feeling sorry for any of these millionaires, but in the context of their profession it's still pretty shitty.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NiceFloor7",
                    "body": "I understand the game is growing globally, but if they don't want to take it seriously, take their votes away.",
                    "score": 97,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jawadhaque089",
                            "body": "There were always bad votes before, people just know who exactly is voting now. Nothing has changed from before",
                            "score": 53,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NiceFloor7",
                                    "body": "There were bad votes before, but these are straight up bad ballots. Voting for a guy down the line because you covered him early in your career is BS bias.",
                                    "score": 42,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mogul_w",
                                            "body": "I bet all you have to do is take one dudes vote away and people will straighten up",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "JesyouJesmeJesus",
                                                    "body": "Maybe since it’s a smaller pool of voters it’ll have that effect, but baseball HOF votes have been taken away and you still get ridiculous or indefensible ballots",
                                                    "score": 6
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Rapshawksjaysflames",
                                            "body": "Maybe the dude really values availability?\n\nSabonis finished first in total rebounds, over 100 more rebounds than 2nd place.\n\nHe also finished 4th in assists and 26th in points while playing 82 games.\n\nI personally find value in TOTAL season points over averages, but I know the general consensus doesn't.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Robcobes",
                            "body": "You should see the Ballon d'Or votes, it's ridiculous.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pollinium",
                    "body": "half of what you listed I disagree with but if they're THAT objectionable of votes to you I don't think you understand the purpose of these votes",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DZ_tank",
                            "body": "Only half? I think we have a future awards voter on our hands here.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "chanman876",
                    "body": "Also Kotzias was the only person to vote Giannis 1st for mvp",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hottestkarlmalone",
                            "body": "You'll never guess what his twitter profile header is: https://x.com/ionikos1972",
                            "score": 31
                        },
                        {
                            "depth": 2,
                            "author": "yahmean031",
                            "body": "That's not a unrealistic vote though.\n\n30/11/6 60% FG and great defense is a good case for MVP.",
                            "score": 25
                        },
                        {
                            "depth": 2,
                            "author": "Betaateb",
                            "body": "I honestly don't think that is egregious at all.  Giannis had an incredible season.  Domas for DPOY and Giannis 1st for MVP are literal different universes of crazy lol",
                            "score": 24
                        },
                        {
                            "depth": 2,
                            "author": "swapmeetpete",
                            "body": "At least there’s one voter who gets it.",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "panamolegos",
                    "body": "I think it's important to note that SDNA has the worst sports \"journalists\" in Greece",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Substance59",
                    "body": "Perkins also voted Podz 2nd team all defense lmao",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "iCE_P0W3R",
                    "body": "Lebron first team is not nearly as crazy as the other stuff you listed",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MapleHelix",
                            "body": "What seed was his team again?",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cudizonedefense",
                                    "body": "Luka was first team all nba and missed the playoffs last year",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "The_Assassin_Gower",
                    "body": "> Haliburton #1 MIP\n\nWhat's so outlandish about this one? I agree other dudes like Williams deserve it more but hali did make a pretty massive jump this year himself",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CWinsu_120",
                            "body": "His stats are like identical to last year.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Cudizonedefense",
                            "body": "Statistically, Hali had a better year last year on average. Slightly better counting stats on better efficiency",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JJVM99",
                    "body": "Was the SDNA dude who put Luka in 2nd team all nba and didn’t include him in his MVP Ballot?Because I can’t imagine a writter from MARCA the pro Real Madrid newspaper screwing over a Real Madrid Legend.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "NOTtheGoldenKnights",
                    "body": "Perk has never even heard of Brandon miller to be fair",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "supergrega",
                    "body": "How you gonna do Bam like that :(",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "frozen2665",
                            "body": "Love Bam, and he certainly played on that level for the first part of the season, but he definitely did not deserve it by the end",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "REGIS-5",
                    "body": "> Tatum 1st for Jerry West Clutch Player\n\nI could rationalize all of those to a certain extent, but this is just the dumbest thing I've seen in a long time.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Acceptable_Driver",
                    "body": "Lol Tatum for clutch player... Ridiculous indeed",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Waesrdtfyg0987",
                            "body": "the least \"clutch\" superstar I've witnessed",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BillowingPillows",
                    "body": "The three of these people should not have votes.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "UnsolvedParadox",
                    "body": "Are they 2 of the top 99 people covering the NBA? How do they have votes to begin with?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ObviousAnswerGuy",
                    "body": "Richard Jefferson put SGA for second place in defensive player of the year.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "JuanG12",
                    "body": "This should be the last time they vote. Some of those are egregious.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ForgivenessIsNice",
                    "body": "Jose Alvarado 2nd in SMOTY? The voter should be banned for life.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "buffalotrace",
                    "body": "What it means to be an impactful defender has changed. The way we measure stats now, it leans heavily toward centers. However, it is vastly more difficult to be a perimeter defender. \n\nThe wolves best defense the entire playoffs was with Gobert not on the building. The Celtics are fundamentally a worse team defensively without holiday on the floor. The drop off for the bucks from holiday to Lillard was massive. Giannis is the best pick and roll defender and individually a better man on defender than Gobert. Is it crazy to think those guys should also get recognized?\n\nFor Christ sake, Gobert didn’t even defend jokic and just bullied him under the hoop. Reid and KAT has to do that hard work which allows Gobert to play free safety back there ",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DG_Now",
                    "body": "LeBron should be first team.",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "s3v3r3",
                            "body": "Well hello there Mr Kotzias",
                            "score": 13
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Wesley_Cao",
                    "body": "Thank you. Keep it coming. This is top tier popcorn.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "Glass_Mango_229",
                    "body": "Brunson didn't make ALL-NBA so there's no way it's just these two voters.",
                    "score": -8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Bitter-Safe-5333",
                            "body": "yes he did?",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "Skinnecott",
                            "body": "he made 2nd team",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bjb406",
                    "body": "I see nothing wrong with any of those votes, except Lebron 1st team but I can forgive it. You got a problem that he disagrees with the group think?",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BillowingPillows",
                            "body": "You see nothing wrong with no Luka on mvp? With Sabonis as DPOY? With Lebron first team all-nba? \n\nAre you senile?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ilikesporks_",
            "body": "why is a marca reporter riding this hard for sabonis anyways lol",
            "score": 354,
            "replies": [
                {
                    "depth": 1,
                    "author": "km912",
                    "body": "He started his career in the Spanish league. Grew up there for a while too if I remember correctly.",
                    "score": 244,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ilikesporks_",
                            "body": "then why not ride for luka or would it be too shameless to vote for luka on an all defense team",
                            "score": 104,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bernardoferreira",
                                    "body": "i mean are we sure Sabonis isnt worsee on defense? (if we compare the value of a good defensive center).\n\nIt probably is someone that rly values rebounding lol thats the only thing i see, not that it makes sense",
                                    "score": 70
                                },
                                {
                                    "depth": 3,
                                    "author": "Visible_Season8074",
                                    "body": ">then why not ride for luka\n\nMaybe he hates madrid.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GuestBadge",
                                            "body": "Marca is Madrid newpaper. They love madrid teams.",
                                            "score": 40,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Visible_Season8074",
                                                    "body": "Maybe not that particular journalist.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Iyammagawd",
                                                            "body": "He wouldn’t get hired otherwise lol MARCA (Spanish sports in general) takes their sports seriously",
                                                            "score": 17
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "kantariat",
                                                            "body": "He’s not an average journalist, that guy runs the newspaper",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Ilikesporks_",
                                            "body": "marca reporter hating madrid would be so odd considering they are the real madrid newspaper",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "sevaiper",
                                                    "body": "Eh they aren't explicitly pro madrid like AS is, they at least try to cover everyone and then have a real madrid bias. They're ESPN loving the Knicks but not a regional sports network with their team basically.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Overall-Cow975",
                                                            "body": "Exactly. Marca post-Inda is not Real Madrid centric as it was before him.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "the_che",
                                            "body": "He wouldn’t be working for Marca in that case.",
                                            "score": 6
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CammyTheGreat",
                                    "body": "Luka did get a 2nd team vote his second year for All Defense. Voter said for his rebounding on defense was the reason",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Pure_Context_2741",
                                    "body": "Probably a fan of his dad who won MVP and Finals MVP for Madrid twice each",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "z_102",
                            "body": "It’s still insane. There might be some extra sympathy for Domantas in Madrid but no one really cares that much (way less than Luka), and NBA followers know he’s nowhere near 1st team lmao.",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "commiecat",
                    "body": "Marca is a Madrid publication subjectively biased toward Real Madrid. Arvydas played for Real Madrid, and Domantas played in Spain.",
                    "score": 61,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sercialinho",
                            "body": "Surprising he didn’t have Luka 1st in MVP if it’s just a Marca/Real Madrid effect. And that would be questioned a whole lot less than the Sabonis votes.",
                            "score": 23,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Wild-Examination-155",
                                    "body": "He did have Luka first team though at least, wasn't the one guy without him",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sercialinho",
                                            "body": "Yes, he did, but that’s not anything like an aberration since N-1 others did as well. But voting Luka 1st for MVP would be notable. If he’s really in the pocket of Real Madrid, he would probably use his less-common vote on Madrid’s own Wonderboy rather than Domas.\n\nThe Greek chap who didn’t is an odd case — he also left Luka off of the MVP ballot. And while he had Brunson 4th for MVP, he also left Brunson off of the All-NBA (1st, 2nd or 3rd team) ballot altogether.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Allthingsconsidered-",
                            "body": "I have some knowledge about this... Marca reporters arent just biased, they're braindead",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "N4m3r",
                                    "body": "I should've known it was a Marca \"reporter\". They are a pamphlet and a propaganda tool.",
                                    "score": 6
                                },
                                {
                                    "depth": 3,
                                    "author": "sevaiper",
                                    "body": "Marca miente",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EggplantBusiness",
                            "body": "Its a little more complicited Marca boss and real Madrid boss hate each others. The reason it seem there is a \"Real bias\" Is because Marca is based in Madrid and their main audience are real Madrid fans. Marca goal is click, they have no problem creating false controversies even for Real. Said also didint pick Luka who was an easy choice",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Overall-Cow975",
                                    "body": "This is the truth. Marca in the Inda era is not pro-Real Madrid.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "sgeswein",
                            "body": "I figured Arvydas got to somebody",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Rapshawksjaysflames",
                    "body": "Maybe the dude really values availability?\n\nSabonis finished first in total rebounds, over 100 more rebounds than 2nd place.\n\nHe also finished 4th in assists while playing 82 games.\n\nI personally find more value in TOTAL season stats over averages, but I know the general consensus doesn't.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "ReverESP",
                    "body": "He started his career in Spain and his father played also in Spain, mainly in the Real Madrid. Marca is completely onesided for the Real Madrid, it wouldnt surprise me that he have also voted for Luka everywhere he can.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ocular__Patdown44",
                    "body": "Domas will answer in Spanish to reporters if they ask lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "693275001",
            "body": "Why are there voters who are literally just trolling",
            "score": 112,
            "replies": [
                {
                    "depth": 1,
                    "author": "jaydizzsl",
                    "body": "He works for Marca. That's kinda their thing.",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sevaiper",
                            "body": "People in the US have never seen the jerking prowess of the Spanish sports media",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "constantlymat",
                                    "body": "Between spanish sports tabloids, the Italian formula 1 press and the English Daily Mail, the European sports yellow press is still a menace.\n\nFeels like aside from the New York Post that type of publication died out in the US.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SelfDestructIn30Days",
            "body": "This should automatically prohibit him from voting in the future.",
            "score": 80,
            "replies": [
                {
                    "depth": 1,
                    "author": "CuclGooner",
                    "body": "Disagree, we need more of this I am very entertained",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Waesrdtfyg0987",
                            "body": "I also enjoy watching r/nba's collective head explode",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dustinharm",
            "body": "Public enemy #1 has been identified.  \n  \nThe weird thing is I looked at his other votes and they’re not really that terrible. It’s literally like he’s just ultra high on Sabonis. Or maybe it was a protest vote after the All Star voting or something. Super weird, I’d be curious if he comments on it.",
            "score": 71,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cold_Carpenter_1798",
                    "body": "He put Portis on his all defense ballot. He has 3 bucks players taking 10 spots on all defense in a year when their defense rating was below average",
                    "score": 59,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dustinharm",
                            "body": "Ok Portis is bad I missed that one lmao. Brook Lopez I’m not that offended by, he wasn’t the only one who included him. And Giannis is fine*.",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "EdwEd1",
                    "body": "Think he’s just a big fan of Sabonis and his dad",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Waesrdtfyg0987",
                    "body": "Clutch Player of the year is really a stupid award but it's absolutely not Tatum. That's absolutely him being a dick about it",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "cjcfman",
            "body": "We need zach lowe to vote again.\n\n\nDude is a sicko he watches every game, even the shitty teams",
            "score": 22
        },
        {
            "depth": 0,
            "author": "GSatina",
            "body": "His voting isn't even as bad Tolis Kotzias, at least sabonis dude had a baseline of some sort. The only prerequisite for the others guys ballot was \"if you're Greek you are first on my ballot\"",
            "score": 91,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cold_Carpenter_1798",
                    "body": "What Greek player other than Giannis did he put on his ballots?",
                    "score": 40,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GSatina",
                            "body": "Thanasis is the only other Greek player in the league, if we want to be pedantic all the of votes I disagree with strongly are \n\nGiannis first in MVP voting (No Luka in top 5)\n\nJrue Holiday first in DPOY (Gobert and Wemby not included on ballot)\n\nLebron and Anthony Edwards first team all NBA (Wemby second team, Brunson not ranked) EDIT: LUKA SECOND TEAM\n\nTatum clutch player of the year\n\nNo Maxey or white on MIP ballot\n\nJaylen Brown all defense first team (No wemby, Josh hart second team???)\n\nGenuinely just a disastrous ballot from top to bottom",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cold_Carpenter_1798",
                                    "body": "I’m not disagreeing that his ballot is bad. I’m disputing that it’s about guys being Greek, which is not pedantic by the way.",
                                    "score": 62,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GSatina",
                                            "body": "he put the ONE greek rotation player in the NBA on his ballots for MVP, all defense and DPOY at rankings that in 2/3 of the total ballots the player isn't ranked by anyone else... \n\nHis baskerball fandom in Europe is the team that Luka beat in 2018 before he came to the league... voters having inherent biases while voting for bullshit have no place",
                                            "score": -25,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Clemsontigger16",
                                                    "body": "The play happens to be a top 3 player and perennial DPOY candidate, it’s not like he voted for Julius Randle in these spots",
                                                    "score": 42,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "GSatina",
                                                            "body": "I mean he objectively wasn't a top 3 guy this year and no other vote had the idea to put him first in DPOY. Almost like legacy voting on inherent biases is bad for the awards that have significant amounts of money attached to them.",
                                                            "score": -27,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Clemsontigger16",
                                                                    "body": "You’re making it seem like he put a role player for these awards, he put frickin’ Giannis…there is no “objective” answer for these top guys, Giannis had an amazing year too…you could argue he got pushed out of the conversation mainly due to narrative reasons.\n\nThere are much worse votes out there than putting Giannis in any of these spots, you’re being a big dramatic.",
                                                                    "score": 27
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Cold_Carpenter_1798",
                                                                    "body": "lol there’s nothing “objective” about that assertion",
                                                                    "score": 5
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "mpbeasto123",
                                                                    "body": "Giannis was easily better than SGA this year. He averahed 30 on 60% shooting with better defence and a worse supporting cast.",
                                                                    "score": 3
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Robinsonirish",
                                                    "body": "I don't understand, who are you talking about? Giannis?\n\nWhy say Greek instead of Giannis? \n\nNobody should be clowned for having Giannis as their MVP, all defense or DPOY. He's a legit candidate for all of them.\n\nI wouldn't have him as my MVP this year, but if you really value defense then he's not a bad choice. Out of the top 5 he's the best 2 way player. He's won DPOY before... like what even is this? He had a great season. If you'd tune out all the noise and narratives that goes on in the NBA he's not a bad choice.\n\nI'm all for clowning him for all his other choices in the voting... but I don't have an issue for anyone voting for Giannis. There is some voter fatigue when it comes to him in my opinion. Bucks were a disappointment in the playoffs last year, their regular season was a disappointment so there goes that narrative.",
                                                    "score": 22
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "yungsantaclaus",
                                    "body": "They're not being pedantic. You made a claim and are now blustering and backpedaling when that claim was given the smallest amount of scrutiny. It's embarrassing to watch. One data point (voting for Giannis, a great player and an acknowledged top 5 player in the league) doesn't equal \"if you're Greek you are first on my ballot\"\n\nAnyway, he's got bad and questionable votes, but they're questionable without rhyme or reason, not evidence of some extreme Greek bias",
                                    "score": 24
                                },
                                {
                                    "depth": 3,
                                    "author": "ToddYates",
                                    "body": "Giannis had the best counting stats of all MVP contenders with the highest TS% and had a top 3 seed. That makes total sense. No Luka is crazy though.",
                                    "score": 15,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "QBert999",
                                            "body": "Yeah. I think any of the top four are fair as the MVP. Giannis has a reasonable argument. I honestly think there's some groupthink going on with the Jokic dominating thing. He leads in some advanced stats and everyone is acting like that matters more than everything else? I don't see how 26.4/12.4/9.0 on 65% TS is miles better than Luka's 33.9/9.2/9.8 on 62% TS or Giannis' 30.4/11.5/6.5 on 65% TS. People act like it's obvious Jokic should be MVP and I just don't agree. I don't see it. I think it's bullshit. \n\nAnyway. We can argue about the 2024 MVP forever. That's the beauty of r/nba.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ToddYates",
                                                    "body": "Gotta say the narratives around the MVP the last few years have felt a little disingenuous. 2021 I get Giannis had a down regular season, but 2022 all the sudden seeding and record didn’t matter when Jokic won with the six seed. Last year he was basically ignored despite maybe having his best season, and even got left off all defense. He got the one seed with Middleton missing much of the year. However because Embiid beat Jokic in a head to head and then took their next game off he got it. This year the team had a down year but he improves his scoring and efficiency. However now team record and seeding matters (we were still a top 3 seed) and Shai who scored, assisted, and rebounded less with a worse TS%  and got embarrassed in their head to head near the end of the season is unanimously ahead of him because he’s the new toy. Giannis also misses out on any defensive honor once again. It’s crazy imo and feels like the goalposts are moved so he can’t win. I’d have given either Giannis or Embiid 2022, Giannis last year, and then either Giannis or Luka this year. Feels like the voters have a favorite and it sucks.",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "GSatina",
                                            "body": "It makes so much sense to the entire voting base that the only person to vote Giannis first in MVP was the Greek journalist!",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ToddYates",
                                                    "body": "More people should have had him at least top 3 legit only thing SGA had over him was team record. I’d have put him first or second debating him or Luka",
                                                    "score": 7
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "PM_ME_UR_PICS_PLS",
                                    "body": "He's also the reason Luka wasn't unanimous 1st team",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "sevaiper",
                                    "body": "The only objectively stupid thing here is LeBron instead of Luka for all-NBA first team (and no Luka top 5 MVP). Guys are allowed to have different opinions.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "FartrelCluggins",
                                    "body": "Not even Celtics fans are that biased toward our own team lmao",
                                    "score": -2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "claseazulpapi",
                    "body": "According to his votes Brunson is the 4th best player in the league this year but unfortunately that isn’t good enough to make any of the all NBA teams",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NotManyBuses",
                            "body": "Tolis is a legend. He voted while on a boat in the Mediterranean.",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "DCJon",
                            "body": "Brunson finished 5th in votes, not 4th. Jokic, SGA, Luka and Giannis best him. \n\n\nBrunson is All-NBA 2nd team...\n\n\n He beat out Tatum for MVP but lost in All-NBA. It's not a crazy outcome.",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "claseazulpapi",
                                    "body": "Brother I’m talking about Tolis Kotzias. He voted Brunson 4th in mvp but didn’t include him at all in any of his all-NBA teams",
                                    "score": 18
                                },
                                {
                                    "depth": 3,
                                    "author": "Bitter-Safe-5333",
                                    "body": "ur not the brightest are you",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bengcord3",
                                            "body": "I mean the phrasing on the original comment was horrendous, that isn't clear at all",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Bitter-Safe-5333",
                                                    "body": "i thought it was pretty clear he said brunson was 4th best player (mvp) but not all nba (top 15)",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "moonsalt88",
            "body": "This is just one guy that made it super obvious. I'm sure at least half the voters don't watch the game at all and the other half just checks the box score. Crazy stuff",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Brief_Koala_7297",
                    "body": "Most of them just go with the narrative but narrative do exist for reason but outlier votes like these should be followed up with an explanation. ",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Aggravating-Rip487",
            "body": "His All NBA First Team was Jokic/Luka/SGA/Sabonis/Ant\n\nNo Giannis or Tatum 💀",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "jeremy9931",
                    "body": "Lmfao",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DirkNowitzkisWife",
                            "body": "I remember some discourse around “should Brunson potentially take Giannis or Tatum’s spot?” But for both to be off and be replaced with edwards and Sabonis is hilarious",
                            "score": 7
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Misterstaberinde",
            "body": "The union is insane for tying contracts to shit voted on by randos.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "CommonerChaos",
                    "body": "Franchises should vote to get it changed in the next CBA, because it affects their team salary, too. A player making 30% of the cap instead of 25% is a considerable difference. \n\n5% of their salary cap is *literally* in the hands of bozos like this.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "tomdawg0022",
            "body": "Carrying the water for Domantas, one vote at a time",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Cold_Carpenter_1798",
            "body": "Take his vote away",
            "score": 25
        },
        {
            "depth": 0,
            "author": "Top-Surprise6577",
            "body": "That's why Marca is trash and NbaManiacs is a better basketball news media",
            "score": 4
        },
        {
            "depth": 0,
            "author": "FrnklndaTurtle",
            "body": "Well it would be weirder if it wasn't the same voter",
            "score": 7
        },
        {
            "depth": 0,
            "author": "wilkinsk",
            "body": "Sabonis had a good year, 24 triple doubles.\n\nNot saying he deserved those votes, but still",
            "score": 4
        },
        {
            "depth": 0,
            "author": "bubbles2255",
            "body": "Kings fans, we gotta send this dude an Edible Arrangements or something.  Love it!",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "make-that-monet",
                    "body": "Nah, this just looks worse. A lot of people really dislike Sabonis and are always champing at the bit to call him overrated, this adds more fuel to that fire.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "ManhattanChristmas25",
            "body": "“Marca”, anyone from Spain or that follows Spanish football knows what this means lol we ain’t surprised",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kantariat",
                            "body": "Daimiel always based and real",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "QBert999",
            "body": "Bro loves him some Sabonis. I don't honestly think it's that out of pocket though if you're just looking at the numbers. Basketball Ref predicted he'd be 6th in MVP voting: [https://www.basketball-reference.com/friv/mvp.html](https://www.basketball-reference.com/friv/mvp.html) .. he was actually 8th. I mean if he had put him #1 I'd think that was pretty wild, but 4th is just a little curious.\n\nLeaving Luka off the top 5 seems like a much bigger crime. Who did that?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Eglend",
            "body": "Somehow he wasn't even the worst voter, that honor belongs to Tolis Kotzias.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Jazzlike-Life7608",
            "body": "If the rest of you want to hate on the guy for speaking his mind, that's fine...\n\nFor Señor Garcia, cervezas gratis por un año aquí en Sacramento...",
            "score": 6
        },
        {
            "depth": 0,
            "author": "grandmasterfunk",
            "body": "Surprised it wasn't a local Sacramento reporter",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "everyoneneedsaherro",
                    "body": "Fully expected it to be Mark Jones.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "Wild-Examination-155",
                    "body": "Our sac bee guy actually nailed all three teams. Kind of impressive",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "make-that-monet",
                    "body": "It’s not like Fox has ever gotten a ton of erroneous or undeserved votes for things; Sac media isn’t any more delusional or homer-ish than most media markets.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "makashiII_93",
            "body": "Votes should be reviewed on a 3-5 year basis for quality. \n\nYou’re allowed an opinion but Mr. Ignacio Garcia needs to explain himself at least.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SXNE2",
            "body": "So stupid how voters are selected or able to vote",
            "score": 2
        },
        {
            "depth": 0,
            "author": "LillPapaia",
            "body": "Im spanish and I follow most of spanish yt channels and podcast and I didnt heard his name until today. He may have voted him cuz his father was very famous in Europe. What a shame to have a guy like that representing the spanish comunnity",
            "score": 2
        },
        {
            "depth": 0,
            "author": "texasphotog",
            "body": "I don't know how these guys get votes but /r/nba doesn't.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "InsuranceAny4285",
            "body": "It’s fucking wild the seemingly random people that get to decide on things that could potentially cost players millions of dollars",
            "score": 2
        },
        {
            "depth": 0,
            "author": "deuceandmo",
            "body": "He knows ball. A Sacramento hero.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "desirox",
            "body": "I just don’t believe in media voting for player awards, it should be their peers, coaches and front offices",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Give_me_soup",
            "body": "Must be friends with Arvydas",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Chmona",
            "body": "My name is Ignacia Garcia. You killed my fantasy team. Prepare to wine.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LordGooseIV",
            "body": "I think this guy is a Sabonis fanboy",
            "score": 3
        },
        {
            "depth": 0,
            "author": "RunnerUpKing",
            "body": "Why do we let so many garbage voters decide these things",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Donde-esta-la-playa",
            "body": "Why does this clown still have a vote ?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gilr0id",
            "body": "This is why media voted awards shouldn't determine contracts.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "youkrocks",
            "body": "Chris Broussard asking some questions about this man",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cranicus",
            "body": "It’s a bias’d take and I kind of respect the NBA for giving votes to so many differently minded people. It would be easy to just get a group of guys that look at stats and vote according, but I respect having the eye tests and personal bias to some extent. Would be very boring if we all didn’t think differently ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Amazing_Owl3026",
            "body": "Ppl like him and Perk have a vote when they clearly have no interest at all in being fair. Why give them a vote at all?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "VegaGT-VZ",
            "body": "Can we brainstorm a better way to give out these awards?\n\nWhy not just have insiders (players, coaches, FOs) do all the voting. Why do the people who ask the stupidest questions in press conferences (\"hey russ, did you lose the game, or did they win it?\") power over player contracts.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AdmiralUpboat",
            "body": "Take this fucking jokester's vote. WTF. I get it's subjective to a degree. Like if you want to give Jokic or Luka MVP I'm not arguing with you, but if you want to give it to Brunson obviously you're a dope, a homer, or drunk.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ohBloom",
            "body": "This dude 100% trolling lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ExposingMyActions",
            "body": "Never forget who truly has the power. The editor, the writer, the transcriber, the voter",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lysek8",
            "body": "Marca is basically the Spanish journalism equivalent of shitposting",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BillowingPillows",
            "body": "Does he think Sabonis is spanish or something lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dasmith1999",
            "body": "I genuinely don’t understand how some of these people get votes\n\nA strong case can be logically made that some of them don’t even cover the nba!!!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MFFL12_17",
            "body": "Media shouldn't decide people's livelihood",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Effective-March-3032",
            "body": "So anybody gets a vote. Even if they don't have a working brain. Good",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CodyCryBabies69",
            "body": "Who the fuck is this guy? Who gave him a vote",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Pristine_Internet_28",
            "body": "Being marca it wouldn't surprise me it's related to his dad playing for Madrid and they got to keep it linked back to them.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GuillyCS",
            "body": "No one talking about Perkins? The guy had Jalen Brunson ahead of Jokic. \nJust out of curiosity (if that's you), what makes you sit down after a work day or week and decide \"yeah, I gotta listen to what Kendrick Perkins has to say!\"?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "montiel_scores",
            "body": "Get this MF out",
            "score": 1
        },
        {
            "depth": 0,
            "author": "scmsf49",
            "body": "it'd be weirder if it was different people doing it, this is at least consistency",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lil_durk_ls",
            "body": "Well remove his vote",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Thimit22",
            "body": "These people should not be deciding if these young guys are going to make these 40m incentives",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tapk69",
            "body": "Why is a Spanish dude voting? Kings games start at 2/3/4 am for Spain. I highly doubt he is watching games.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ImIncredibly_stupid",
                    "body": "In Europe, we watch the condensed games when we wake up.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ocular__Patdown44",
                    "body": "Shit, take all the east coast reporters off then too. I know they aren’t staying up until 1AM to watch the Kings. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DowntownJulieBrown1",
            "body": "Unironically take his vote away immediately.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "1antinomy",
            "body": "He also left Giannis off the All-NBA Team\n\nVoters like him need to be removed from the ballet",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sartheking",
            "body": "Bud had Sabonis 3rd in DPOY and Portis on 2nd Team All-Defense.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ham_-_",
            "body": "Bruh you know what take away media votes lmao",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jsun_",
            "body": "And this is why I stopped caring about NBA awards.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bigkeys11",
            "body": "This is disgraceful. These awards affect millions for players. This dude should never be allowed near a ballot again",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rugbyman12367",
            "body": "Man like this is a wild ballot. But it does suck that these votes are tied to the money these guys can make.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BigGrandpaGunther",
            "body": "He should lose his vote.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "zeek215",
            "body": "Has anyone ever lost their ability to vote because of poor/shady voting?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hoodiejuli",
            "body": "voters have to be selected some other way man lmfao\nppl in this thread are sayin this guy's employer publication is essentially a tabloid. why would a journalist from there get a vote??",
            "score": 1
        },
        {
            "depth": 0,
            "author": "santodomingus",
            "body": "I hope this just makes you all realize this shit is stupid and not to pay much attention to it. Pay attention to teams with good chemistry and good outcomes. That’s really all that matters.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "GalickBanger",
            "body": "To be fair, if you thought Sabonis was the MVP, you probably also thought he was the best at everything",
            "score": 1
        },
        {
            "depth": 0,
            "author": "11x_dev",
            "body": "should at least set some restrictions on who can be voted for each category so we don't get obvious trolling like this",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "tomdawg0022",
                    "body": "Being \"that guy\", Sabonis was 5th in VORP and 6th in BPM.\n\nI can see how he'd get a 1st team All-NBA vote tossed at him from a hardcore analytic type (besides a fanboy). Not saying he *should* but that there's at least an argument to be had from someone that's not super out of left field.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DreTownblues",
                            "body": "There is absolutely zero logical argument to make for sabonis deserving a first team vote",
                            "score": -9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Rapshawksjaysflames",
                                    "body": "First in rebounds\n\n\nFourth in assists\n\n\n82 games played",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AlbinoFarrabino",
            "body": "u/TomasRoncero show yourself up and explain to us why a guy from your newspaper is dick riding Sabonos.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ImIncredibly_stupid",
                    "body": "Roncero works for AS, SER and Chiringuito, not Marca but ok\n\nThe editor-in-chief of Marca is this guy https://x.com/jfelixdiaz?t=XmBRUDlY9_6LaUrFkOCNDA&s=09",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AlbinoFarrabino",
                            "body": "u/TomasRoncero i have to apologize for this stupid mistake of mine.\n\nPlease continue to get under the skin of Sória, Joti and the remaining Barcelona goons, i deeply appreciate your service as a Chringuito viewer.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ImIncredibly_stupid",
                                    "body": "If you search the wanted man here you have him\n\n@jigochoa on Twitter",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Due_Connection179",
            "body": "Not surprising is he also works for ESPN.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Legitimate-Software7",
            "body": "As a wise man once said \n\n“There’s no limit to the glaze”",
            "score": 0
        },
        {
            "depth": 0,
            "author": "DocumentAggressive56",
            "body": "how do people like this end up getting an opinion? literally anyone in this thread is more qualified than this clown.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "jpaxlux",
            "body": "Dude shouldn't be voting again next year lmao",
            "score": 0
        },
        {
            "depth": 0,
            "author": "CosmicCoder3303",
            "body": "Prediction: it's 2029 and advanced analytics is finally caught up to this guy and he is totally vindicated. Moneyball 2 stars a Spanish Jonah Hill looking guy who does a \"Kevin Youklis is the Greek God of walks\" speech except it's about Sabonis and his defensive rebounding and outlet passes",
            "score": 0
        },
        {
            "depth": 0,
            "author": "jbrunsonfan",
            "body": "You can’t let this happen with tens of millions of dollars being decided on these votes. They need to have their votes taken and given away to someone else.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Brief_Koala_7297",
            "body": "There is gotta be a committee that should nullify egregiously bad votes like these.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheBestAtWriting",
                    "body": "there is, it's called \"all the other votes\"",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Punjabiveer30",
            "body": "Stuff like this should get voting rights automatically revoked",
            "score": 0
        },
        {
            "depth": 0,
            "author": "need2peeat218am",
            "body": "This is the thing that makes sabonis looks worse. He's clearly undeserving of those and now he's going to get slandered even more because of this clown voting.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ocular__Patdown44",
                    "body": "We don’t care about that any more than you don’t care about the Gobert hate. ",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "outsidehere",
            "body": "Revoke his vote if he's going to play around with it",
            "score": -1
        },
        {
            "depth": 0,
            "author": "CuclGooner",
            "body": "lmao of course it was MARCA",
            "score": -1
        }
    ]
}