{
    "title": "[Wojnarowski] ESPN Sources: In approving a new WNBA franchise in Toronto, the WNBA Board of Governors voted 13-0 and the NBA’s Board of Governors voted 29-1. Only the New York Knicks voted against the expansion. Knicks are suing Raptors in case over alleged “theft of proprietary information.\"",
    "comments": [
        {
            "depth": 0,
            "author": "SPC54",
            "body": "The fact that these teams made one of the most impactful trades of the season in the midst of a lawsuit and amidst this petty behaviour is fucking hilarious.",
            "score": 2001,
            "replies": [
                {
                    "depth": 1,
                    "author": "confuddly",
                    "body": "I think basketball operations is kept pretty separate from ownership/governance stuff in New York, ever since James Dolan's earlier days of meddling in the team.",
                    "score": 631,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ArmiinTamzarian",
                            "body": "That's a pity, he was good for a funny signing every now and then like Eddy Curry or Jerome James",
                            "score": 219,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "confuddly",
                                    "body": "and whenever he was presented with an actual good trade (like Iman Shumpert +2018 1st for a 28 year old Kyle Lowry) he said no",
                                    "score": 127,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "YesImKeithHernandez",
                                            "body": "You gotta save those approvals for moments like when you can trade a useful player and picks for an about to be amnestied Andrea Bargnani.",
                                            "score": 35
                                        },
                                        {
                                            "depth": 4,
                                            "author": "SirJoeffer",
                                            "body": "Keep Shump, flip that first for Tristan Thompson and then give up a young player to attain a pick from the Rockets via the Nets.\n\nAll those assets in a trade and boy howdy you’re star hunting",
                                            "score": 59,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "zaop1990",
                                                    "body": "“Baby, you got a stew goin’!”",
                                                    "score": 26,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "SirJoeffer",
                                                            "body": "I think I want my money back",
                                                            "score": 16,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Yankees3Fan7",
                                                                    "body": "[https://i.pinimg.com/originals/6d/d4/ad/6dd4adc705d89e110fdde2f11cfc1a52.gif](https://i.pinimg.com/originals/6d/d4/ad/6dd4adc705d89e110fdde2f11cfc1a52.gif)",
                                                                    "score": 8
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "shxylo",
                                            "body": "he was shook after getting fleeced for bargnani, worked out for the raptors that they didn’t make the deal.",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "dutchfromsubway",
                                                    "body": "Working out for the raptors is kind of an understatement lol he became the greatest raptor. Crazy knicks could’ve had a Brunson 10 years ago",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "shxylo",
                                                            "body": "oh, most definitely. sometimes, it’s the deals you don’t make that can change the course of an entire franchise. the near trade, and sit down masai had with him after was a wake up call. \n\ndon’t think they’d have built a culture around kyle to be successful.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "FastJellyfish200",
                                            "body": "All because he thought he was getting bullied by Masai again LMAO",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "PunningLynguist",
                                            "body": "Made even funnier that he rejected it partly because he got burned on the Bargnani trade",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DurantsAltAccount",
                                                    "body": "I’d like to thank Masai and Primo Pasta for bullying James Dolan into the current Knicks state.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "HoyaDestroya33",
                                    "body": "Don't you put that evil on me Ricky Bobby!",
                                    "score": 14
                                },
                                {
                                    "depth": 3,
                                    "author": "VanGrants",
                                    "body": "shut your mouth bro don't say that shit or he'll force Leon to trade for Luke Kornet and max him",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ArmiinTamzarian",
                                            "body": "I mean that is straight up funny",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "VanGrants",
                                                    "body": "i still have nightmares about Bargnani",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "ArmiinTamzarian",
                                                            "body": "That trade netted us an extra lottery pick 11 years later so thanks, very swell of you Knicks",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "VanGrants",
                                                                    "body": "i hope San Antonio fails to build around Wemby and he asks out at the end of his rookie contract",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ArmiinTamzarian",
                                                                            "body": "#D:",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "VanGrants",
                                                                                    "body": "im sorry that was too far, Porzingis still makes me mad",
                                                                                    "score": 5
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Snuggle__Monster",
                            "body": "Yeah but wasn't it scouting information that was supposedly stolen?",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "szobossz",
                                    "body": "exactly. fo was blamed in the lawsuit",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OasissisaO",
                    "body": "Not terribly dissimilar to how Samsung and Apple are constantly suing one another but Samsung is happy to sell components to Apple.",
                    "score": 65,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "szobossz",
                            "body": "they are not constantly suing each other. they sued once and settled in 2018 after like 7-8 years over the same issue",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OasissisaO",
                                    "body": "They have sued (and countersued) each other in multiple jurisdictions. 2 of the cases were in the US and were over separate patent claims.\n\nThey may no longer be suing one another, but it wasn't one time one thing, either.\n\nI rescind use of the word \"constantly.\"",
                                    "score": 16
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "airmagswag",
            "body": "Professional hating",
            "score": 197,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gamesgtd",
                    "body": "Drew McIntyre levels of hating",
                    "score": 32,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AnnaKendrickPerkins",
                            "body": "/r/SquaredCircle is leaking, Maggle!",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sunshinebusride",
                                    "body": "You just made the list!",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Literal_Satan",
            "body": "least petty dolan moment",
            "score": 757,
            "replies": [
                {
                    "depth": 1,
                    "author": "ArmiinTamzarian",
                    "body": "Nobody was banned from MSG so I would argue yes this is quite mild in the James Dolan scale of being an asshat",
                    "score": 200,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DessertStorm1",
                            "body": "Oh I guarantee anybody who is part of the raptors organization has their face on the “do not allow entry” database at MSG",
                            "score": 36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GoldenBananas21",
                                    "body": "NY Knicks versus the Toronto Holograms",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RaspberryBirdCat",
                    "body": "[This](https://nymag.com/news/sports/45787/) is my favourite NBA-related article.",
                    "score": 25
                },
                {
                    "depth": 1,
                    "author": "Snuggle__Monster",
                    "body": "TBH I think he's just doing what his lawyers are telling him, not the other way around.  He's paying them millions for legal advice and they're probably directing him to do everything possible to avoid not jeopardizing the ongoing suit.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "AdmiralUpboat",
                    "body": "Have I lost my mind or is Dolan actually a good owner now, at least on court basketball wise? Like, you can literally *feel* how much less he's meddling. There's no way the Knicks do a trade with Toronto in the middle of this lawsuit pettiness if Dolan is still meddling in basketball ops.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Literal_Satan",
                            "body": "i think he's been pretty good for a while, he's stayed out of basketball ops for a while but it just didn't work out with Phil and mills, but now that leon rose is there he shouldn't have to intervene to fire anyone. When he doesn't mettle he's good because he's never cheap",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AdmiralUpboat",
                                    "body": "Makes sense it's been that way for awhile, Knicks didn't just get better overnight",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "At6-8FromSyracuse",
            "body": "How the hell did that OG trade happen",
            "score": 362,
            "replies": [
                {
                    "depth": 1,
                    "author": "HokageEzio",
                    "body": "Gotta include it on Leon's EOTY resume",
                    "score": 171
                },
                {
                    "depth": 1,
                    "author": "confuddly",
                    "body": "it was such a win-win it wouldve been malpractice for Masai to say no",
                    "score": 124,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Punjabiveer30",
                            "body": "Masai and Leon both cooked on that one, props to them",
                            "score": 34
                        },
                        {
                            "depth": 2,
                            "author": "iabeytorm",
                            "body": "I can’t believe Dolan didn’t veto just to be a dick",
                            "score": 79,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kevinfederlinebundle",
                                    "body": "At one point Dolan issued a blanket veto against any dealings with Masai after the Bargnani trade because Masai \"bamboozled\" him",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Living_LaVida_Koloko",
                                            "body": "That's what gave Masai the reputation of fleecing other GMs but in truth when you look at the majority of his trades, they're all mostly fair for both teams or the Raptors have to overpay i.e. Thad Young and Poeltl from SA, Siakam for scraps, Norm Powell for GTJ",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "kevinfederlinebundle",
                                                    "body": "I have to imagine it's difficult to *not* fleece Dolan",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "snatchi",
                                                            "body": "You don't think JD & The Straight Shot got a good deal on their studio time?",
                                                            "score": 5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "johnhenryirons",
                                                                    "body": "He used to book himself as the opener for certain boomer bands that played MSG lol.",
                                                                    "score": 3,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "snatchi",
                                                                            "body": "fuck me that's sad.",
                                                                            "score": 3
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "blueshirt21",
                                                                    "body": "I think they’re gonna fly in Jeff Chris from Indiana to fix it",
                                                                    "score": 3
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Chief_White_Halfoat",
                                                    "body": "He does have another trade that was one of the best underrated fleeces in NBA history. \n\nHe traded a completely broken Greives Vasquez during the draft for a second round pick and the Raptors took Norman Powell, and a later first round pick which the Raptors used to take OG. \n\nThat was one of the key trades that allowed the Raptors to win the championship eventually. \n\nThey eventually got Gary Trent Jr for Powell and he's provided some additional value, and obviously the OG trade brought Quickley and Barrett which is also going to accumulate value, particularly Quickley. \n\nWhen it all gets added up, it's going to be one of the most lopsided longterm deals you can find.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "johnhenryirons",
                                                            "body": "the most lopsided deal in the past 30 years or so was the clippers trading an unprotected 1st rounder to clear cap space to Cleveland. The Clippers traded Baron Davis and an unprotected first for Mo Williams. Clippers ended up using that cap space on....Ryan Gomes and Randy Foye. That pick became Kyrie Irving.",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "RobbobertoBuii",
                                            "body": "it set us back for so many fucking years tbf",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ConstantineMonroe",
                                    "body": "Thibideau and Leon Rose managed to slap some sense into Dolan",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "StarryScans",
                                    "body": "Masai is Dolan's father",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "keeeeener",
                            "body": "Fr, raptors fans (I’m one of them) think the raps won the trade pretty hard.  I love OG but he just can’t stay on the court. Also, not having to watch him try to dribble is nice too.\n\nI just want to see him on one healthy playoff run.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BasicWilliam",
                                    "body": "And we think we won the trade pretty hard, so good trade I guess",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Rapshawksjaysflames",
                                            "body": "I think we \"lost\" both the OG and Siakam trades, but that's only because they should've been traded a year earlier.\n\nI think it's the best we could've gotten, but both the Knicks and Pacers received a great player.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Chief_White_Halfoat",
                                                    "body": "That's true of the Siakam trade, but I'm very skeptical we would have gotten a better player than Quickley for OG even the year before. I also don't imagine any of the late picks we were being offered would have the value Quickley brings.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "beefJeRKy-LB",
                                                            "body": "The reports were that we could get 3 or such firsts for OG the year before. If those were Memphis firsts, I don't think we would have found two players of equal value to RJ and IQ with them so I would agree that the OG deal was unlikely to be more fair than what we got this year.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "taffy-derp",
                                    "body": "what did the raptors get?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Sharcbait",
                                            "body": "Barrett and IQ.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Living_LaVida_Koloko",
                                                    "body": "and DET's 2024 2nd Round pick",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "brolybackshots",
                                            "body": "Our current 2nd and 3rd best player",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "YSLAnunoby",
                                    "body": "I don't think we won, but it's mutually beneficial. I'm going to miss him though cuz he was my fave raptor even with his flaws",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "johnhenryirons",
                                    "body": "I think it was win-win. The RJ contract isn't great. And we'll see how much IQ gets from y'all.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "keeeeener",
                                            "body": "Obviously, we won’t know how it turns out for a couple years.  But RJ was amazing, having a guy that isn’t scared to shoot or go to the rim is so nice.  Imo, RJ has a higher potential than IQ.  Can can see RJ breaking into that all star level easier then I can see IQ doing so.  But they’re both good.  \n\nI do think OG is a better fit on a playoff team atm though for sure.  It just comes down to health with OG.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "johnhenryirons",
                                                    "body": "It’s a fit thing too. RJ didn’t fit on our team anymore and didn’t fit into our offensive schemes. And IQ should start but wouldn’t start here with Brunson. OG fits like a glove with us.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "keeeeener",
                                                            "body": "To be fair, OG fits like a glove on any team.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cvnilivee",
                    "body": "Leon Rose is Tony Soprano.. James Dolan is Uncle Junior.",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mankls3",
                            "body": "Big pussy?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "TheArgsenal",
                            "body": "He never had the makings of a varsity athlete!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Par25",
            "body": "Raptors: Hello friends!\n\n\nKnicks: I hate the way that you walk, I hate the way that you talk, I hate the way that you dress",
            "score": 991,
            "replies": [
                {
                    "depth": 1,
                    "author": "3pointshoot3r",
                    "body": "The funniest part about it is that the Raptors actually passed on bidding for the WNBA expansion team. This won't even be the Raptors WNBA franchise, although it will be one of the minority owners.",
                    "score": 185,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bjtrdff",
                            "body": "The Raptors are owned by Bell, Rogers (both media / telecom conpanies) and Larry Tannenbaum.  Board decisions need to be unanimous vs a majority. \n\nThe consistent rumor has been that Rogers said no to the team, and Larry said fuck you, I’ll roll solo.\n\nRogers were also the chunk that were getting saucy about the Masai extension, and will probably be what run all the teams into the ground again at this rate.",
                            "score": 80,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "xelLFC",
                                    "body": "Fuck Ted Rogers, the guy is a moron but I do think the Keith Pelley hire is great and he will sort out Rogers from doing dumb stuff",
                                    "score": 38,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Cringelord_420_69",
                                            "body": "It’s Ed Rogers\n\nTed is dead",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Par25",
                                                    "body": "> Ted is dead\n\nDo not, under any circumstances throw him in the lake",
                                                    "score": 9
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "KnightHart00",
                                                    "body": "In Toronto when it comes to Rogers and especially Ed Rogers you are on one of two speeds.\n\nEither not knowing who he is and hating Rogers to your core. Or wishing motherfuckers like him should just shut up and die and also still hating Rogers to your core.\n\nI look forward to the day we fucking toss the statue of Ted Rogers into Lake Ontario, and rip it down like the Saddam statue.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bigt2k4",
                                                            "body": "over/ under 48 hours until the police show up at KnightHart00's door.\nhttps://globalnews.ca/news/2576949/blue-jays-fan-threatens-ted-rogers-statue-gets-visit-from-the-police/",
                                                            "score": 3
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "DiscountLlama",
                                                    "body": "I'm not sure I believe it, the body wasn't staked before burial",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Plorgy",
                                                    "body": "> It’s Ed Rogers\n\nReal life Kendall Roy",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "3pointshoot3r",
                                    "body": "I mean, it's more than rumour - it's been solidly reported in the Globe and Mail that failson Ed torpedoed the Raptors WNBA bid (which Masai was championing), as well as that Ed Rogers was the holdup on the Masai extension.\n\nI can't imagine a bigger bag fumble than passing on a WNBA franchise in Toronto, at this time in women sports.",
                                    "score": 11
                                },
                                {
                                    "depth": 3,
                                    "author": "RunicLordofMelons",
                                    "body": "Allegedly with the WNBA under MLSE thing is that while Rogers was the main dissenting voice, the rest of the MLSE board wasn't really fighting for it either. As it was a big upfront cost with a LONG path to profitability. \n\nTl;Dr while Rogers argue'd against it, the rest of MLSE aside from Tanenbaum didn't really fight for it either.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "3pointshoot3r",
                                            "body": "> As it was a big upfront cost with a LONG path to profitability. \n\nI don't see how that is likely at all. There is an obvious huge market for women's sports in Toronto, and women's basketball in particular is having its moment. The WNBA tv contract is up this year for renewal, and the WNBA is basically about even with NHL hockey in American tv ratings - there is going to be a windfall of new tv money, and that's even before accounting for the tv money coming from the Canadian market with a Canadian team. This is a league with a $2M salary cap!\n\nI would expect a Toronto WNBA franchise to be immediately profitable.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TuneMysterious8816",
                                                    "body": "League revenue almost 4x from 2019 ($60M) to 2023 ($200M). Most individual teams have been making money the last 5 years. \n\nBig growth expected this year with all the college fans following Caitlin Clark and Angel Reese. Aside from annual revenues, the growth in the value of the asset is key to modern day sports franchises and this seems like a great opportunity.\n\nKeep in mind that MLSE has always sucked on the sports side and only succeed financially because they have a captive audience for some of Canada's most popular sports franchises.",
                                                    "score": 3
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "singrayluver",
                                                    "body": "Wasn't there some issue where if it was MLSE they would have to play in Scotiabank Arena?",
                                                    "score": 2
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "RunicLordofMelons",
                                                    "body": "1. Clearly MLSE's financial analysts don't  think it would be immediately. Otherwise they would have bought in. Which is really all thats needed as they are better at this than any of us on this subreddit. But I'll indulge...\n\n2. Even if you are right and the Toronto WNBA team might be profitable from year one based on revenue - operatings costs = profit. It would still likely take years if not longer to recoup that 100m start up cost. Keep in mind last year the ENTIRE WNBA made in revenue somewhere around 200m. So even if the Toronto team is making a couple million per year in pure profit, it would take DECADES to pay off that start up cost and actually be in the black. \n\nNot trying to argue that \"Hurrrr Womens basketball isn't profitable they shouldn't do it!!!\" at all. Thats not how business works, especially in a still growing league like the WNBA. There's good business reasons and opportunity to owning a WNBA team, which is why Tanenbaum went off on his own to buy/own one. Long term it will be profitable and more importantly, the overall franchise valuation will only increase which is REALLY what a private ownership group like Tanenbaum and his team care about. \n\nJust pointing out that there are CLEAR business risks/costs involved with starting a new WNBA team, that clearly did not entice MLSE to take on.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "3pointshoot3r",
                                                            "body": "> Clearly MLSE's financial analysts don't think it would be immediately\n\nLets be clear that world champion failson Ed Rogers was against the Raptors bid, but most of the board supported it. \n\n2, no. Nobody spends $10M on an apartment building and expects $10M+ in profit year one. Of course they likely won't recoup their $100M investment in year one. But in addition to profit, the value of the franchise itself will also be increasing. In short, they would almost certainly see a year on year capital gain in their asset, in addition to any operating profit.\n\nIt's worth noting that the WNBA currently gets $60M/year from its tv contract for American broadcast rights. The NHL gets around 10x that much, *even though ratings for the two are almost exactly the same*. You can obviously knock some value off that for the WNBA because there are fewer games (and thus less content), but the WNBA contract is up this year, so the Toronto team will be walking into a completely different revenue world.",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TuneMysterious8816",
                                    "body": "As has been the case since the beginning, basketball in Toronto is happening because of Tannenbaum. He has been vital to the success of basketball in that city and Canada more generally.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "MapleLeafsFan3",
                                    "body": "This makes me wonder who’ll broadcast the games? Would it still be SN/TSN even though they’re owned by Bell/Rogers?",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MethoxyEthane",
                                            "body": "I could see CBC sneaking in with Toronto's rights, splitting non-Toronto WNBA coverage with one of SN or TSN.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "iwprugby",
                                            "body": "Either are still possible, probably not both. Just because they didn't want to own the team doesn't mean they won't broadcast it. Bell/TSN seems more likely though. ",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "northernjigby",
                                    "body": "When there was a delay on siakam getting his initial max extension after the chip it was leaked that the board was pushing back, \"the board\" was reportedly just Rogers not wanting to pay for a max player in general. \n\nI can't comprehend why these nepo kids who are born as billionaires and get to do amazing shit like own an NBA team and choose to act like absolute dickheads",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HokageEzio",
                    "body": "I'd rather do that than let a Canadian owner make Reed turn in his grave.",
                    "score": 56
                },
                {
                    "depth": 1,
                    "author": "spurredoil",
                    "body": "Knicks:......  *And I hate how much I love you, boy*",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Punjabiveer30",
                    "body": "Don’t gotta disrespect Kendrick like that, [this](https://youtube.com/shorts/tZYt4tKNTP0?si=L8QVgiD0BLBjwz6A) is more Knicks territory",
                    "score": -7
                }
            ]
        },
        {
            "depth": 0,
            "author": "lopea182",
            "body": "Generational, litigious hater shit",
            "score": 107
        },
        {
            "depth": 0,
            "author": "GSatina",
            "body": "Say what you want about Jimmy but no one does this hating shit like him",
            "score": 93,
            "replies": [
                {
                    "depth": 1,
                    "author": "scorelesswilliamson",
                    "body": "The legend is moving forward technology just to hate some more. First ballot HoF playa hater",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "Xclusivsmoment",
                    "body": "Like a Drew McIntyre",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "rmigz",
                    "body": "for real. lot of front runners out there hating for clout, meanwhile dolan does that shit for the love of the game. he’s hating on a rainy tuesday afternoon.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "johnhenryirons",
                    "body": "Ishibia vs Gilbert is a pretty good rivalry too",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "wallz_11",
            "body": "LOL",
            "score": 46
        },
        {
            "depth": 0,
            "author": "Legitimate-Software7",
            "body": "Oh to be a fly on the wall during the OG/Precious-RJ/IQ trade negotiations",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "HoyaDestroya33",
                    "body": "Leon banished Dolan to the shadow realm.\n\n\"Listen up MFer. You hired me to fix this team now don't you dare interfere when I do my job. Go focus on your shitty band.\"",
                    "score": 24,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jt21295",
                            "body": "It's similar to what he did when Dolan tried hiring Mark Jackson to commentate. Leon, at the insistence of the coaching staff, refused to let Mark Jackson on the team plane.",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "cjackc11",
                            "body": "I mean that’s probably it, hell it was probably a prerogative of him taking the job in the first place. Rose did not need to take this job",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Expensive-Buy1621",
            "body": "Generational hater",
            "score": 33
        },
        {
            "depth": 0,
            "author": "YoKemosabe",
            "body": "Dolan is so petty 😂",
            "score": 26
        },
        {
            "depth": 0,
            "author": "BasicWilliam",
            "body": "This franchise is so fucking funny man",
            "score": 46,
            "replies": [
                {
                    "depth": 1,
                    "author": "Expensive-Buy1621",
                    "body": "Dolan*",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "onebandonesound",
                    "body": "It is an endless source of entertainment. Whether that's for us or for everyone else, spin the wheel to decide!",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "StefonDiggsHS",
            "body": "haters lmfao",
            "score": 20
        },
        {
            "depth": 0,
            "author": "HungLuke",
            "body": "James Dolan: Team Owner, Musician, Professional Hater",
            "score": 17
        },
        {
            "depth": 0,
            "author": "HokageEzio",
            "body": "Hilariously petty",
            "score": 41
        },
        {
            "depth": 0,
            "author": "ihateeuge",
            "body": "what the hell is wrong with this dude lmao",
            "score": 24
        },
        {
            "depth": 0,
            "author": "americanbeaver",
            "body": "It's honestly just funny how petty the Knicks are.",
            "score": 29,
            "replies": [
                {
                    "depth": 1,
                    "author": "gradedonacurve",
                    "body": "It's Dolan.  Dude once puleld $1M in advertising from the Village Voice after they made a lame joke about his dick.  LOL.",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "HoyaDestroya33",
                    "body": ">It's honestly just funny how petty ~~the Knicks are~~ Dolan is",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "AluminiumLlama",
            "body": "If the Knicks were still terrible, we would all be hating on Dolan for this.\n\nBut since they’re good now, it’s hilarious!",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "brolybackshots",
                    "body": "Harrassment vs Flirting vibes",
                    "score": 23
                }
            ]
        },
        {
            "depth": 0,
            "author": "horseshoeoverlook",
            "body": "LMAO KNICKS",
            "score": 22
        },
        {
            "depth": 0,
            "author": "texas2089",
            "body": "So petty 😂😂",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Electrical-Salad-528",
            "body": "lmao eat a dick Dolan",
            "score": 8
        },
        {
            "depth": 0,
            "author": "PomfAndCircvmstance",
            "body": "Ignoring the Dolan being Dolan stuff this is great for the WNBA. The talent is there for it and adding more teams is a good sign that the league is growing. Best of luck to the Toronto team.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Oozeinator",
            "body": "The NYK's say NO to women's sports!",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Railshock",
            "body": "There's the Dolan we haven't seen in awhile.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Kaddnaakul",
            "body": "Rich from a team that tampered like hell in getting Brunson",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Powerglove2000",
            "body": "LOLKNICKS",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Not-Josh-Hart",
                    "body": "I mean it is objectively hilarious. Dolan is the pettiest of the petty 😂",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Powerglove2000",
                            "body": "It’s actually kind of amazing how consistent he is about this lol.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Not-Josh-Hart",
                                    "body": "Amazing, pathetic tomato tomato",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheR3dMenace",
            "body": "The Raptors have nothing to do with the Toronto WNBA franchise. \n\nLarry Tenenbaum (part owner of Raptors) is bringing the team to Toronto via a different ownership group. But Tenenbaum is the Raptors delegate to the NBA BOG (and chairman I think)\n\nSo this is beef between the two individual governors Dolan and Tenenbaum",
            "score": 8
        },
        {
            "depth": 0,
            "author": "NYdude777",
            "body": "Dolan being the pettiest man in sports is undefeated.  LOL",
            "score": 4
        },
        {
            "depth": 0,
            "author": "StarryScans",
            "body": "Fuck Dolan",
            "score": 3
        },
        {
            "depth": 0,
            "author": "bmanley620",
            "body": "It’s personal",
            "score": 3
        },
        {
            "depth": 0,
            "author": "shingofan",
            "body": "Dolan knows how to hold a grudge, apparently.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Mygaffer",
            "body": "There are a lot of absolute scumbags among NBA ownership and Dolan is definitely one of them.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Ok_Respond7928",
            "body": "The whole law suit is so stupid. Knicks are suing over Synergy files something that anyone with Synergy can access and view. \n\nI know NBA teams have a more advanced version of Synergy but having used a more basic one I don’t know how anything on their could be under the ownership of a single team. The files are provided by the NBA to begin with which means all times have access to them.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "FritoConnaisseur",
                    "body": "From the ESPN article on it, seems to be more than just a few files that everyone has and are the same:\n\n>According to a copy of the lawsuit, which was filed in the U.S. District Court in Manhattan and was obtained by ESPN, the Knicks state that Ikechukwu Azotam, who worked for the Knicks from 2020 to 2023, sent the Raptors thousands of confidential files -- including play frequency reports, a prep book for the 2022-23 season, video scouting files, opposition research and more -- after the team began recruiting him to join their organization in summer 2023.\n\n>The Knicks accused Azotam -- who worked for the Knicks as an assistant video coordinator, then as a director of video/analytics/player development assistant -- of violating a confidentiality clause in an employment agreement and alleged that members of the Raptors \"directed Azotam's actions and/or knowingly benefited from Azotam's wrongful acts.\"\n\n>Further, the Knicks alleged that the Raptors \"conspired to use Azotam's position as a current Knicks insider to funnel proprietary information to the Raptors to help them organize, plan, and structure the new coaching and video operations staff,\" the lawsuit states.\n\nhttps://www.espn.com/nba/story/_/id/38235601/knicks-sue-former-employee-raptors-cite-disclosure-proprietary-information",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "letmetellubuddy",
            "body": "Rename the Knickerbockers to the Pettybonkers",
            "score": 3
        },
        {
            "depth": 0,
            "author": "trappapii69",
            "body": "People are saying it's petty but it's a step beyond it. The expansion happened but this man would rather stick it to a city than to help development basketball. It's genuinely trash that people like Dolan own teams.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "HokageEzio",
                    "body": "A 29-1 vote means it was basically a formality heading into the meeting, this is solely just being petty.",
                    "score": 47,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "trappapii69",
                            "body": "Yeah I know that his vote meant nothing in the end but it's just wild that grown men with money get petty when the legal system is already doing its job (albeit slowly) and they need to do more to show up the other person/group. I just think it's the principle since they're just saying fuck it, might as well show them we don't like them still.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HokageEzio",
                                    "body": "Why does it matter in a 29-1 vote?",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "trappapii69",
                                            "body": "Because that one vote against is the Knicks saying they don't want a W team in the Bay and now Toronto. It's dumb because they're the literal only team that is against it.\n\nEdit: this isn't even getting into Dolan PURPOSELY devaluing and not doing anything for the Liberty and treating his players like absolute shit. This man is the literal worst owner in WNBA history besides Kelly Loeffler.",
                                            "score": -5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HokageEzio",
                                                    "body": "I don't remember anything being said about the vote for Golden State's WNBA team not being unanimous, do you have a source on that?\n\n>this isn't even getting into Dolan PURPOSELY devaluing and not doing anything for the Liberty and treating his players like absolute shit\n\nYeah, he's terrible. Thanks for the newsflash. That still means nothing to this specific vote that was 29-1.",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "The_Uncut_Gem",
                                                            "body": "People telling us the Knicks have been awful since the 2000s and that Dolan is a piece of shit like we don’t know",
                                                            "score": 4
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "FzxH",
                                                            "body": "Go back to the anime buddy",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "3pointshoot3r",
                    "body": "On top of which, *this isn't a Raptors owned WNBA team*, it's just a Toronto team. The Raptors passed on bidding for the expansion franchise.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "thy_armageddon",
                    "body": "Bro it was a 29-1 vote.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "TheKidPresident",
                    "body": "I think you should probably find a different term than developmental lol its the highest level in the sport for women",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "trappapii69",
                            "body": "Yeah my grammar was trash, i meant develop",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "greatestnbascout3",
                    "body": "I will never understand how people root for his team and buy his tickets and aren't just fucking ashamed when they look in the mirror",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "RobbobertoBuii",
            "body": "Dolan hasn't gotten over the Bargnani trade lol",
            "score": 2
        },
        {
            "depth": 0,
            "author": "greatestnbascout3",
            "body": "Idk why Knicks fans support a Dolan run team, knowing all we know",
            "score": 2
        },
        {
            "depth": 0,
            "author": "sequence_killer",
            "body": "petty loser organization",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "JMoon33",
                    "body": "Has the Knicks achieved anything with that ownership?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sequence_killer",
                            "body": "not really it seems... i feel bad for em, having a bad owner is the worst",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FrnklndaTurtle",
            "body": "are they only adding one team?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "HokageEzio",
                    "body": "Golden State and Toronto",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FrnklndaTurtle",
                            "body": "ahh I forgot about Golden St. Expansion draft will be interesting with two teams. Lots of movement.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "charger03",
                                    "body": "Golden State is starting next season, Toronto doesn't start until 2026",
                                    "score": 8
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "-Darkslayer",
            "body": "I love the little random add-on at the end of the Knicks randomly suing the Raptors 😂",
            "score": 1
        },
        {
            "depth": 0,
            "author": "7373838jdjd",
            "body": "Shouldn’t the Knicks just have not voted like Dan Gilbert did for an ownership change because of conflict of interest",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Manablitzer",
                    "body": "You think Dolan is going to let a little thing like business ethics get in the way of his beefs?",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Productpusher",
            "body": "Just a day or two ago in the Knicks sub I said how I was shocked we went all post season without Dolan hate comments . Streak had a ended",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "cjackc11",
                    "body": "Dolan hasn’t really done anything bad since he hired Rose tho\n\nIdc about any of this shit it’s already known he’s an asshole but he’s not selling the team and I want the Knicks to win so he’s doing alright in my book rn",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FastJellyfish200",
                            "body": "Yup literally all he has to do is shut up and keep the wallet open and people won't wanna spit on the ground as he passes. And he can get to delude himself into thinking he's part of the Knicks come up as long as we get to forget he exists.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "PluvioPurple",
            "body": "This is the level of petty I wish I was. Well played, Dolan.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dymatizeee",
            "body": "Knicks petty af 😭😭😭",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SCREAMING_DUMB_SHIT",
            "body": "Can someone explain this situation more",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "solo118",
                    "body": "tldr a member of the coaching staff left the Knicks for the Raptors and supposedly gave the Raps some inside info\n\nhttps://www.nbcsports.com/nba/news/knicks-seek-10-million-from-raptors-in-lawsuit-alleging-a-mole-stole-proprietary-information",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ramsboi",
            "body": "Knicks gotta win something this post season! Hopefully Dolan stays healthy and can withstand the pace of the lawyers. Knixtape back baby! ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jubez187",
            "body": "But doesn't there need to be equal teams in each conference? how do you make 1 team which would assumedly be in the east? Sorry I'm ignorant.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "JoshSran04",
                    "body": "Wnba has 12 teams rn golden states getting a  team next year and we’re getting one in 2026 so that will be 14 teams",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "jonnysh",
            "body": "Was the proprietary information regarding setting up a WNBA franchise?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SoKrat3s",
            "body": "Raptors management is to Knicks management as 76er fans are to Raptors fans.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "matthitsthetrails",
            "body": "the negative karma from knicks ownership never ends lmfao",
            "score": 1
        },
        {
            "depth": 0,
            "author": "neo9027581673",
            "body": "Pettiness. I love it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cooperstown24",
            "body": "Reverse Flash is watching this and taking notes",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tearz_in_rain",
            "body": "A petty vote. Sweet!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Luck_Top",
            "body": "Give us OG back. Y’all  don’t deserve him",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tapk69",
            "body": "Look at those New York assholes. Fine them.",
            "score": -8,
            "replies": [
                {
                    "depth": 1,
                    "author": "HokageEzio",
                    "body": "What exactly would they be getting fined for?",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tapk69",
                            "body": "For smelling horribly",
                            "score": -5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cjackc11",
                                    "body": "Dawg, you’re a fan of a Cleveland team you shouldn’t be talking about stink when your river is famous for lighting on fire because of how polluted it is",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "solo118",
                                            "body": "lmaooooo",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Good_Schedule3744",
            "body": "I tried watching the WNBA when the season started but it was like sitting through a low scoring high school game. Missed layups and the worst defense imaginable.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "moodie31",
            "body": "Do the WNBA Board of Governors vote on NBA matters? Or is this a one way street.",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "drakanx",
                    "body": "because the NBA bankrolls the WNBA.",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "Menessy27",
                    "body": "I think the nba has partial ownership of the wnba so it makes sense they’d have some level of decision making power",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Original_Natural4804",
                    "body": "If the wnba want to start paying for the NBA im sure theyd get a vote",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "SEJ46",
                    "body": "Lol",
                    "score": 3
                }
            ]
        }
    ]
}