{
    "title": "[Frederick]: Interesting from Mike Conley. Any drop coverage you saw tonight was in error:  “We were told to be up.”",
    "comments": [
        {
            "depth": 0,
            "author": "Salvalicious252",
            "body": "But they played like for like 90% of the game? How do you not adjust at half time if supposedly you never intented to do it?",
            "score": 1008,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "It's puzzling, to say the least",
                    "score": 380,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TexasTornadoTime",
                            "body": "Which makes me think this wasn’t just an error but a strategy they tried and didn’t work and just never adjusted",
                            "score": 237,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pumpkin3-14",
                                    "body": "There were definitely times they blitzed hard on Luka but it wasn’t consistent enough to think that was the primary strategy.",
                                    "score": 75
                                },
                                {
                                    "depth": 3,
                                    "author": "TheeMalaka",
                                    "body": "There was tons of plays where our guys were out of position or on the wrong man. They just looked super confused on who was supposed to be where.",
                                    "score": 66
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "caulpain",
                            "body": "they played a game seven 48 hrs earlier.  fatigue reveals itself in many ways.  hopefully they can get it together for game two",
                            "score": 27,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "johemdee",
                                    "body": "No shade, but I'm consistently confused by multiple people (including the players) pointing out that they just played a game two days ago and should recover for game 2. Issue is they play every other day for the whole series.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Pandamonium98",
                                            "body": "Yeah it’s not like games get any easier. Nobody has enough time off to actually catch up on rest at this point unless you end a series early",
                                            "score": 9
                                        },
                                        {
                                            "depth": 4,
                                            "author": "KoreanProdigy17",
                                            "body": "What I find interesting is yes players say that, Nuggets literally had full 3 days off between games 2-3. Pacers Knicks literally played their games 2-3 inbetween the Wolves and Nuggets games 2-3, hence why Knicks were SO gassed, and why Nuggets looked so much better in their game 3. That extra day off for rest helps a lot.",
                                            "score": 5
                                        },
                                        {
                                            "depth": 4,
                                            "author": "caulpain",
                                            "body": "playoffs are incredibly taxing.  its one of the reasons we praise **anyone** for winning a chip.  it is as difficult as anything in team sports.  four best of seven series in a row?????  thats tough",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Return_Icy",
                                            "body": "They literally made the biggest comeback in a Game 7 in NBA history. That, along with the emotional energy involved, probably takes *a bit* more out of you than a normal playoff game",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "slymm",
                                            "body": "One, the fatigue balances out now going forward. Two, they didn't start thinking about Dallas until after game seven but that's all they will be thinking about since then. Dallas was probably lightly preparing for both wolves and nuggets",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "collinCOYS",
                                    "body": "You can't say that around here. Teams aren't allowed to be fatigued",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "traw2222",
                                            "body": "Draymond was trying to say it was only one day but I think it made a huge difference.  Dallas won at home and had a couple days to chill.  Wolves won and probably immediately got on a plane back to Minnesota and had a day to recover off all the adrenaline.  In the regular season, the hardest game to win is the first home game after a road trip.  That’s essentially what this was, I’m scared for what’s about to hit us in game 2.",
                                            "score": 20,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "coleslonomatopoeia",
                                                    "body": "The other aspect of the fatigue convo is that Dallas to OKC is not that tough of a flight compared to MPLS to Denver. \n\nAlso for Dallas it was go to OKC for 2, then Dallas for 2, then OKC for 1 and closed out in Dallas for 1.\n\nFor Minny it was go to Den for 2, back to Mpls for 2, Denver for 1, back to Mpls THEN BACK to Denver for the close out, followed by travel back home.\n\nIt’s a pretty big rest disparity in that light.\n\nNot an excuse by any means, but definitely a potential reason they ran out of gas relative to Dallas a bit at the end.",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Pandamonium98",
                                                            "body": "I wonder whether Dallas even flies to OKC or if they just take a bus for a 3.5 hour drive",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Glitchhikers_Guide",
                                                                    "body": "I take the party bus 100/100 times given that choice",
                                                                    "score": 2
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "fakejacki",
                                                                    "body": "They took the plane. They flew up a little early to adjust for the weather because they had a bunch of tornados in the area.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "allcazador",
                                                            "body": "This is why it's so criminal to put us in the Western conference. \n\nWe have a Midwest division in every other sport, and it creates amazing regional rivalries. We should be playing Chicago, Milwaukee, Cleveland, etc. \n\nThe Wolves are consistently one of the furthest traveling teams in the NBA, if not number one. I've Long believed it has had a big impact on their success over the years",
                                                            "score": 6
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "jawni",
                                                            "body": ">The other aspect of the fatigue convo is that Dallas to OKC is not that tough of a flight compared to MPLS to Denver.\n\nonly a ~20 min difference",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "quidproquolaspe",
                                                    "body": "Don’t be scared brother, we have LuKai on this team. It’s hands down the best 2/3 players no matter who you match us up against. Twolves included. Having the best 2/3 ALWAYS gives you at least a punchers chance if not favored outright. We just take this series one game at a time. Pretend game 1 never even happened and it’s 0-0.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "themasterhardy",
                                                            "body": "I'd be more comfortable if we pretend its 0-1. G2s are our jam",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "kevinkip",
                                    "body": "All teams are tired this deep in the playoffs.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AstronomicAdam",
                                            "body": "All teams are tired, but it’s just nonsense to suggest the wolves, who just played a wire to wire game 7 in Denver, aren’t more exhausted coming into this series than the mavs. It’s the advantage you buy yourself by ending a series early.",
                                            "score": 15
                                        },
                                        {
                                            "depth": 4,
                                            "author": "X_FlashPanther_X",
                                            "body": "Sure but that’s not relevant to the point that user was making. ",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "lostentorres",
                            "body": "Luka and Kyrie. 2 best guards to play basketball, of course they will beat any defense you throw at them. Defense can’t be perfect every time",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ineednapkins",
                    "body": "I haven’t watched like any mavs basketball this season. Do you know why kyrie could take literally any layup he wanted in the first half but then that kinda went away in the second half? Did he just stop going for it or was it due to defensive adjustments against him?",
                    "score": 52,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Salvalicious252",
                            "body": "Funninly, it's been the opposite this season. Where Kyrie is passive the 1st half and then cooks the 2nd half + late in the 4th. I think these playoffs he's averaging like 6ish ppg in the 1st half and 15ish ppg in the 2nd half. Luka and Kyrie kind of switched roles yesterday.\n\nHe's usually preserving energy in the 1st half, setting up teammates, playing in the flow and just having the offense come to him. Last night he made a concerted effort to get going early and it was needed for sure.",
                            "score": 87,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "villain75",
                                    "body": "He said everyone was a little jumpy at the start, so he took over and was hitting shots, so he kept doing it until everyone else started playing better.",
                                    "score": 63,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "frecklie",
                                            "body": "That was a great interview. Listening to him I got such a sense of how dangerous he and the Mavs are now - after so much drama in the past you can just tell he is in a good place mentally. Lot of credit to him, but also to the Mavs for making him feel supported. I have been very critical of his drama in the past but I have to acknowledge how well he has put that stuff behind him in Dallas, at least for the moment.",
                                            "score": 30,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Glitchhikers_Guide",
                                                    "body": "Jason Kidd has mastered two things as a coach: defense and vibes/player buy in. Everyone on the Mavs plays with that team first mindset, and the trust they all have in each other to make the right play no matter how shit they've been all game seems to be a huge contributor to the mental toughness of the team.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DeepeningWasTaken",
                            "body": "I think he went at it in the first 3 just so he can tire out edwards and it worked fs",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Visible-Suit-9066",
                                    "body": "Agreed! I think this was a very deliberate ploy to target Anthony Edwards. Mavericks assumed Luka would be able to work Jaden McDaniels over all game. \n\nThe focus therefore was reducing Edwards’ impact in the second half by relentlessly testing him in the first half. Settling for 12 threes is proof it worked. Will be interesting to see if they persist with this strategy.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "traw2222",
                            "body": "It’s kyries strategy where he comes alive when it’s needed.  Most of the time he’s fine scoring 4-6 points in quarters 1-3, then he turns it on in 4th qtr in the clutch and that’s how we’ve won tons of games.  He mentioned he felt the team anxious and nervous to be there so he went out and set the tone early.  But Kyrie isn’t someone who’s going to be aggressively looking to score the entire game, he picks his moments.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Visible-Suit-9066",
                                    "body": "It’s pretty remarkable to think about isn’t it? 90% of players are headless chooks every game, running around trying to have a deliberate impact for every second they are on the court. \n\nPlayers with Kyrie’s composure know they don’t need to be involved in every possession, but instead that the game will literally “come to them” and there will be a 4 or 5 minute passage at some stage where they can quickly score 10+ points. \n\nDuring the OKC series Kyrie was a little too passive and the game never did swing his way a few times. But in game one he played that role perfectly.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ChrysMYO",
                            "body": "On top of what everyone else is saying, the Mavs love to ride the hot hand. Luka doesn't always have it going like that in the 4th. They were going to spam that pick and roll until the Wolves stopped it. Kyrie and Luka have made it a point to just let the other one work and double down on defense on the other side.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Visible-Suit-9066",
                                    "body": "They really do love riding the hot hand. If Luka and Kyrie score on consecutive trips you know a third and fourth shot is going up. THJ is an obvious example, but we’ve also seen that when PJ and DJJ are heating up Kyrie and Luka start feeding them relentlessly.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ChrysMYO",
                                            "body": "Yep, even when Josh or Jaden come in and score on a first attempt. They will immediately run an action to get them another look. But yeah, THJ is the prime example. Even if its Kyrie on the court without Luka, if THJ hits the first shot Kyrie steps out the way next possession.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SeaOwn2023",
                            "body": "usually it's the other way around (he cooks second half).  \n\nhe said himself many times that at this age he learned to do what the game needs him to do now.  let it come to him and the game dictates if he needs to score, pass or defend.\n\n he's like obi wan fucking kenobi out there.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Falconsbane",
                    "body": "It's one game. We'll see how the Wolves adjust. The Wolves lost by 3, I think everyone losing their minds is a bit dramatic but not unexpected I guess.",
                    "score": 97,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Salvalicious252",
                            "body": "Oh trust me I know. If anybody knows not to overreact to Game 1 it's Mavs fans. This our first Game 1 win in the Jason Kidd era and we won 4/5 series after losing Game 1 lol. It kinda feels weird to win Game 1, it almost feels ominous.",
                            "score": 69,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AFonziScheme",
                                    "body": "Yeah. This is either a sweep or we lose in 5. Anything else wouldn't feel right.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "sickfalco",
                                            "body": "I literally told my friends it’s Mavs in 5 or wolves in 5 now 😂",
                                            "score": 7
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Yamata",
                                    "body": "Y'all never lost a playoff series to a team outside of California, it's all smooth sailing from here.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Drkillpatienttherapy",
                                    "body": "Yeah I can't believe y'all won last night. I'm pissed. I loved the Mavs to win this series and wanted to put some money on it. But I thought there was no way they would win game 1 and I'll get way better odds today after they lose game 1. And of course they go and win game 1. Assholes",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "fakejacki",
                                            "body": "Nobody cares about degenerate gamblers.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Drkillpatienttherapy",
                                                    "body": "Nuh uh. Nobody cares about you. Poopy head",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Neemzeh",
                            "body": "Yes the final score was only a 3 point difference but there were some alarming things that came out of this game. I am way less confident now then I was before the series started despite only losing by 3. With how we played I felt we should have won by 10 at least. Dallas' rim protection seems to be elite which is really troublesome for us. Not sure if we just accept to shoot 50 3s a game. Maybe we do?",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sickfalco",
                                    "body": "Just have McDaniels shoot all 50",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Humble-Cat-122",
                                            "body": "The guy with the white head band? I thought his name was Steph Curry for a few hours.",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RubMyGooshSilly",
                                    "body": "Biggest thing to me was the points in paint difference and Dallas just refusing to hit threes for 90% of the game. If we can maintain our paint dominance and threes start falling it’s gonna be a tough road for Minnesota.\n\nMaybe MN figures out the inside and levels that playing field, maybe not. I am certainly not an NBA coach nor am I able to figure out what can be done",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Neemzeh",
                                            "body": "It seemed to be quite a discrepancy and I’m not sure how we can adjust but yeh, I’m not an nba coach",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "jawni",
                                    "body": ">With how we played I felt we should have won by 10 at least.\n\nsay what now?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Good_NewsEveryone",
                            "body": "Not really the point at all. If Mike is saying the game plan was to be up and they clearly weren’t there’s an obvious disconnect.\n\nThey can “adjust” all they want but if they don’t execute the game plan it’s moot.",
                            "score": 26,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Falconsbane",
                                    "body": "It is the point. Do you honestly think the Mavs executed their game plan perfectly? Game 2 will probably not resemble game 1 much at all.",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Good_NewsEveryone",
                                            "body": "There is an obvious difference between the unattainable goal of perfect execution and a player coming out after the game and saying the game plan was to play a scheme that they obviously did not actually implement for the majority of the game’s possessions. \n\nI have no doubt the series will be competitive and the Wolves defense will tighten up. It is not “dramatic” to find Conley’s comments here to be meaningful. \n\n“Adjustments” mean changing the scheme. The Wolves did not execute the idea of the scheme they were supposed to, if Conley’s comments are accurate.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Falconsbane",
                                                    "body": "They lost by 3 points. I get what you're saying but it's not like they failed to compete with Dallas in the game regardless of the execution. There will be a losing team in every game. It is overly dramatic to me but that's to be expected like I said originally. I'll just leave it at that this is so pointless.",
                                                    "score": -4
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "pumpkin3-14",
                            "body": "Yeah every game will be different in terms of how teams win. Wolves will makes less 3s, mavs will make more than 6, and either team can still win. It was tight the entire way.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "betweenthebars34",
                            "body": "Yes, but we're still commenting on Conley's puzzling statement nonetheless.",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Good_NewsEveryone",
                                    "body": "Nah you just gotta say “adjustments” or “rotations” and deride people who are “reactionary”. Doesn’t matter if it’s relevant",
                                    "score": 12
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "curburdepression",
                            "body": "Why does it matter how much they lost by? L is an L. ",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "kshep9",
                            "body": "They lost by 3 while hitting 12 more 3 pointers than the Mavs. HOW they lost is more important in this context, I think.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Briggity_Brak",
                            "body": "It's one game, but Wolves lost by 3 AT HOME. Dallas has now stolen home court. Mavs already won two series where they DIDN'T win game 1 on the road. Saying the T-Wolves are in \"deep\" shit would probably be taking it a little TOO far, but they are not in a good place.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "le_sweden",
                                    "body": "Wolves went 3-1 in Denver.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "listentoyourpenis",
                                            "body": "which means absolutely nothing against a completely different team, just like that Mavs lost game 1s stats.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "le_sweden",
                                                    "body": "If you don’t think you can draw some conclusions from how a team has played in the series immediately previous I don’t know what to tell you. Nothing means anything and we’re all gonna die.",
                                                    "score": -6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "listentoyourpenis",
                                                            "body": "If you draw meaningful conclusions from one series, more power to you. I for one care about sample size.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "le_sweden",
                                                                    "body": "So we’re gonna watch 1 game and act like that’s significant sample size?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Forward_Criticism721",
                                                                            "body": "its a good barometer how series will go i think,wolves will struggle with offense like all season and hope to win with their defense which really doesent look too good vs dallas.\n\nmade to beat jokic with bigs to guard him,but cant guard elite PGs like luka and kyrie",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "le_sweden",
                                                                                    "body": "Ok. Come back to this later. Luka and Kyrie are the best backcourt in the NBA but the Wolves have made adjustments all year. They have one of the best perimeter defending platoons in the league and this was their first game against the new look Mavs. I’d put money on them figuring some stuff out. If you think the defense will be bad all series, good luck with that.",
                                                                                    "score": 0,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Forward_Criticism721",
                                                                                            "body": "jaden is really good defender but hes just not strong enough to guard luka-props to him for not floping like dort,but dort could stood hes ground while our fatty can backdown jaden with little resistance.\n\ni guess you can trap/blitzt luka and hope kyrie&co doesent 4v3 you and if they gonna shoot like tonight its probably gonna work",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "listentoyourpenis",
                                                                            "body": "I never said it was a significant sample size. I deemed both stats irrelevant at deciding how the series will turn out.",
                                                                            "score": 0
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "NoWayNotThisAgain",
                                    "body": "The definitely didn’t want to lose. It’s a 6 game series now, 3 games on each floor. The Mavs advance by going .500 while the Wolves need to go .666 to advance. They went .683 over the regular season, but that includes plenty of games against the Pistons, Wizards, and Spurs. \n\nThe Mavs started the series in the best possible way.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "NoFlaccidMint",
                            "body": "Happens every time. People overreact after game 1 and forget it’s a 7 game series. Just a few days ago we saw what this Wolves team did to the Nuggets in a game 7, on the road. \n\nLet the series play out. Game to game Adjustments are what make the NBA playoffs so damn mental and fun to watch.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Riskybusiness622",
                            "body": "It’s the 3% shooting that makes it look real bad and scary, they shot lights out and Dallas only made 5 total and still won.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "InnerBlackberry6",
                                    "body": "Except they didn’t shoot lights out. Their 8 man rotations 3pt% was exactly the same as their postseason average: 36.6%. They did take more threes than usual, but part of the reason was Dallas coalescing in the paint and encouraging threes.\n\nThe Mavs will shoot better from three in the future. But don’t expect the Wolves three point shooting to regress necessarily. In fact, I think they will improve their performance inside the arc, even if they shoot less threes. Meanwhile, the Mavs will struggle to go 60% from 2 again",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "grehgunner",
                    "body": "There was no drop coverage in ba sing se",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "GenShanx",
                    "body": "If the plan coming in was to play up, why would “adjusting” at half time help.  You would just be telling them to do the same thing you already told them to do and they didn’t execute.   \n\nYou can’t adjust execution without benching players.  Rudy was a net positive even if he was running outside of the game plan most of the night.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Vicentesteb",
            "body": "Hilarious because thats basically the only coverage we played aside from the ocassional blitz. Surely, this shit should have gotten fixed at the half.",
            "score": 90,
            "replies": [
                {
                    "depth": 1,
                    "author": "AmazingDragon353",
                    "body": "I was sitting there yelling at the TV about that coverage. I think even the announcers mentioned it at the end, but what the fuck. How do you let Luka shoot wide open midranges over and over and over again? Double, blitz, whatever, I know their rotations can handle the pressure cos that was a work of art against the nuggets. They got lazy and suffered for it and apparently it was just a series of about 60 mistakes? Come on",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "imianha",
            "body": "maybe we don't live in North Korea after all...",
            "score": 371,
            "replies": [
                {
                    "depth": 1,
                    "author": "gradedonacurve",
                    "body": "I laugh at this dude's videos, but so much of what he points out is obviously either the players  and not the coaches fucking up OR something the D is conceding (D usually has to give up \\*something\\*)",
                    "score": 127,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Gros_Shtok",
                            "body": "Sometimes it's not even giving up a bad shot, the shooter will have someone in his grills and taking a shot the defense will always live with, and he'll shit on the defensive possession if it results in a score. It's completely result-based rather than process.  \n\nStill funny, but nothing serious to consider.",
                            "score": 49
                        },
                        {
                            "depth": 2,
                            "author": "fatkamp",
                            "body": "That’s exactly why I love his videos\n\nPeople who understand basketball even at the highschool level are confused and frustrated that nba teams constantly have mental lapses or just straight puzzling game plans \n\nAwful coaching will be vindicated because I bet you the wolves don’t employ this type of coverage at the start of game 2",
                            "score": 26
                        },
                        {
                            "depth": 2,
                            "author": "coacoanutbenjamn",
                            "body": "I fucking hate him and his garbage analysis. He doesn’t know what he’s talking aboutp",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "gradedonacurve",
                                    "body": "1. I think (hope?) it's clearly a bit\n\nand\n\n2. He is not even monetizing these videos, lol.  They are all ad free and completely to entertain himself / viewers",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "coacoanutbenjamn",
                                            "body": "The reason why I don’t like him is he makes a bunch of fans think their coach is a dumbass who knows less than a youtuber when that isn’t the case whatsoever",
                                            "score": 14,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "gradedonacurve",
                                                    "body": "Well that is definitely true!\n\nBut fans don't need that much help in being convinced they're smarter than the coaches, lol.",
                                                    "score": 17,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "coacoanutbenjamn",
                                                            "body": "That is very true as well",
                                                            "score": 7
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "redinblue",
                                                    "body": "Except for Darvin Hamas, certified left curve",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "syllabic",
                                    "body": "but he knows how to get you to watch him",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "Infamous_East6230",
                                    "body": "I remember seeing him when he first started doing videos and I’ve been dumbfounded by his success. I think it’s mostly that fans don’t actually know ball but they love the idea that coaches are grade a morons",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "GlennethGould",
                            "body": "If the players are fucking up though that is coaching. If they're not in the right place or not ready to guard or not getting back they're either not having fundamentals reinforced or they're not being shown their bad habits on film.",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TurtlePower5289",
                                    "body": "Is it ever the players fault then? lol",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GlennethGould",
                                            "body": "Sure, and coaching. Saying it's the players and not the coaches is just wrong.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Carolake1",
                                    "body": "Exactly. Every time a player misses a shot? Coaching. After all, if they miss, it just means coaches didn't show them missing shots on film before. If they saw enough film, they'd stop missing those shots.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GlennethGould",
                                            "body": "It's not all coaching, and it's not all players. Has this sub become that brain dead?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Carolake1",
                                                    "body": "I can’t believe you didn’t detect my sarcasm. Also, you are the one who said if the players mess up, it’s bad coaching. You literally said it’s all the players.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "I'm ootl on the north Korea bit",
                    "score": 25,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MeMeRevieweR_23",
                            "body": "check out awful coaching on youtube.",
                            "score": 37,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "coacoanutbenjamn",
                                    "body": "Actually don’t, it’s terrible analysis",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jessandjaysaccount",
                                            "body": "Watch it it's the best analysis",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "hcvc",
                            "body": "Really annoying YouTube video series. Just constant yelling making Stephen a smith sound like a quiet guy ",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sickfalco",
                                    "body": "Man I love Awful Coaching that shit is comedy",
                                    "score": 21,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CosmicCoder3303",
                                            "body": "Meh, they think every coach sucks if that's the YouTube channel I'm thinking of. I know that's their shtick but it gets boring and annoying",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "luchajefe",
                                                    "body": "Sports does not need a \"CinemaSins\".",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "pumpkin3-14",
                                    "body": "Nah he’s hilarious. He also has videos praising good defense and he’s not yelling. One for Luka and one for the entire Knicks defense that I’ve seen.",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FastJellyfish200",
                                            "body": "I love how he just shamelessly flip-flops on teams, like Thibs is on his shit list now too.",
                                            "score": 10
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "acekingoffsuit",
                                    "body": "He does throw in some videos where he drops the telling and focuses on great performances (Luka in Game 6, KAT in Game 7) which are far more enjoyable to me.",
                                    "score": 5
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Appropriate-Cap-4140",
                    "body": "He's begun to call out other basketball channels like ThinkingBasketball and BBBreakdown it's so out of nowhere and out of pocket it's hilarious",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "this_my_account",
                    "body": "His latest video on the wolves is his angriest yet. And that's saying something 😂",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zeckzeckzeck",
            "body": "I get all the dialogue around it and about drop or blitz or all manner of coverage but...Luka doesn't struggle against any of them. That's what makes him so damn good, he's so quick on any read and confident in his ability to make any pass or reset the entire call.",
            "score": 347,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mahomeboy001",
                    "body": "It’s not about Luka. We saw Lively commit some crucial turnovers yesterday when Minnesota was blitzing off the screen. He is not comfortable dribbling the ball and reading the defense and making a decision in a half second. Unrelated but this is where Draymond Green gets underrated. He was able to run that 4v3 better than any Forward/Center for a solid 5 years",
                    "score": 267,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WindyCity54",
                            "body": "Yep, and then Golden State started adding layers to it too.\n\nInstead of having Draymond screen, it would be a traditional big who’d slip once the defense sent 2 to the ball. Only Steph would still throw it to Draymond any way (like on the wing). He could them either hit the wide open big on the slip or Steph could chase back after the ball with his defender trailing way behind him.\n\nHaving a guy who can play 4-on-3 advantages perfectly is such a weapon.",
                            "score": 95,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DarkDragon1025",
                                    "body": "This is part of why Draymond is the ultimate ceiling raiser and a horrible floor raiser, he can’t create advantages on his own but if someone else creates them for him he can morph it into being almost unstoppable",
                                    "score": 89,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Cyclops_Guardian17",
                                            "body": "Fully agree for offense. For defense, he honestly raises both",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "poopbuttballspoon123",
                                                    "body": "At his best he was guarding 1.5 guys all game",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ma_Pies",
                            "body": "Yeah, they showed both Lively and Gafford fumbling the ball in the paint on replays when Luka was blitzed.",
                            "score": 29
                        },
                        {
                            "depth": 2,
                            "author": "NjallTheViking",
                            "body": "Lively‘s main weakness right now is that if he doesn’t have the immediate path to basket or pass out, he struggles getting the ball to high up. If he can develop a good midrange game he’ll become quite the force to reckon with. Hopefully they can work on it over the summer.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "PolarBearLaFlare",
                            "body": "I think a couple of those were late game and he thought he would get fouled though, so he panicked.",
                            "score": 19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Numerous-Cicada3841",
                                    "body": "Still. You’re better off making Lively or Gafford make the right play than you are giving Luka space.",
                                    "score": 9
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "gOPHER3727",
                            "body": "Exactly. Very similar in that respect to the Nuggets series where you know Jokic is gonna get his in some way, same with Luka, you gotta pick your poison and make role players step up and beat you.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ORNJfreshSQUEEZED",
                                    "body": "Tbf, this is every post season strategy",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "imcryptic",
                            "body": "That’s why I was dying when draymond was lightly rumored to be a target of the Mavs and our sub was losing their mind because they didn’t think he would fit in our system since he can’t shoot. \n\nLuka and Kai get blitzed every game in the postseason and we were running Dwight Powell as the short roller in those scenarios last year. People really didn’t think he would’ve worked here?",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "DocumentAggressive56",
                            "body": "They blitzed all last series. Lively and Gafford (with a combo of kick outs and paint buckets) exploited it very effectively. There isnt an easy answer, thats why the Dallas Mavericks are the winningest team in NBA since trade deadline outside of boston and their cupcake schedule",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BigFatModeraterFupa",
                    "body": "i haven’t seen drop coverage against Luka in years lol. I think he was just as shocked as us at all the room he was getting",
                    "score": 41,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PM_me_the_magic",
                            "body": "Its gotta be especially weird after getting non-stop harassed by Dort the last six games",
                            "score": 28,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "aushaus",
                                    "body": "Dort is also *so much better* at fighting through screens than McDaniels was in game 1. I expect that to change, but this is such a breathe of fresh air for Luka to actually have space and a guy he can body",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "KushGod28",
                                            "body": "McDaniels strength is navigating screens though. I don’t think he played that bad defensively. Luka is just better and we need to figure out how we’re helping Jaden out defensively. Rudy hanging back is clearly not working.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "browseabout",
                                                    "body": "Good keep doing it",
                                                    "score": 5
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "bd1047",
                                                    "body": "I think you’re definitely right. The difference is Dort got away with a lot, and McDaniels was a super clean defender",
                                                    "score": 3
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Neatly",
                                                    "body": "but if gobert doesn’t drop then it’s a lob. they need to have another defender take away the drive off screen rather than blitz",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Kdetr4128",
                            "body": "In the playoffs you mean atl did it during his 71 point game ",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BigFatModeraterFupa",
                                    "body": "yep exactly. atlanta really only started doubling in like the 4th quarter of that 73 game",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "yoknows",
                            "body": "I swear I saw him shrug to the bench after 2 or 3 alley oops in a row.",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "Agreed. I think what the wolves want to do is get out on the level vs luka and reset on the roller to force the pass to lively/gafford be outside the paint. If I'm the wolves I'm ok with McDaniels being switched onto a big. They're athletic enough to scramble on defense",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Zeckzeckzeck",
                            "body": "I haven't watched enough Wolves to know this but I wonder if they have anyone that would be worth pressing Luka full court and just trying to deny him the ball for the first 10 or seconds of the clock. Let someone else have to initiate.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "collinCOYS",
                                    "body": "If it was that easy everyone would do it",
                                    "score": 27,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "PM_me_the_magic",
                                            "body": "Why not just keep the ball away from Luka, are they stupid?",
                                            "score": 24,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "junkyardgerard",
                                                    "body": "And when he does get it, stop letting him score, dam",
                                                    "score": 10
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "bd1047",
                                    "body": "That’s why having Kyrie is such a big deal. His passing has been absolutely fantastic, and even if they were able to deny Luka I think Kidd would be perfectly fine with him initiating",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mickeyj623",
                    "body": "It's not all about Luka, it takes things away and makes play how you want them to",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "wooIIyMAMMOTH",
                            "body": "I’m sorry but there’s a video on YouTube that highlights like 9 different ways to attack the drop coverage and it’s just clips of Luka. And the video is a couple years old. \n\nGoing drop against him isn’t the way.",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fatkamp",
                    "body": "Then double him. Not even joking literally double.\n\nMake a rookie center become the playmaker and make the correct read 4 on 3\n\nThis is the exact reason why the Warriors were so hard to beat as Looney and Green were damn good as the 4v3 playmaker, and the reason the Wolves are struggling to create advantages when Gobert is wide open on a blitzed screen",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "binhpac",
                    "body": "they made lively and gafford a playmaker and they dont do so well with the ball in hand and decisions.\n\nthat was their best defense to be honest, putting the ball into the hands of their centers and let them do the playmaking.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "creditors-bargain",
            "body": "Sounds like Rudy was fucking up, unless I’m reading this incorrectly.",
            "score": 426,
            "replies": [
                {
                    "depth": 1,
                    "author": "indecisive_aspie",
                    "body": "from what I saw, the possessions where Rudy came out closer to the FT line generally had Luka or Kyrie dusting a trailing defender first and Rudy basically trying to split the difference to prevent an easier shot or drop-off.\n\nMcDaniels in particular had a pretty rough game defensively.\n\nand there were a bunch of possessions where they got drop-offs after Rudy had to help, which seems to signal this is just more of them being caught off guard and team defense being compromised. ",
                    "score": 42,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ExpressPlankton",
                            "body": "I think this is the correct take, the Wolves will have to adjust how they handle Luka and Kyrie at the point of attack. Luka would attack on the PNR and muscle McDaniels “jailing” him behind him, while Kyrie would blow by Edwards or Conley. Both situations would leave a trailing defender, a big rolling hard to the rim, and Gobert stuck in no man’s land. \n\nThe primary defenders were “up” on them but they were up at the 3 point line and Kyrie / Luka are too good ball handlers to get behind the 8 ball like that. If Gobert was expected to be there with the primary defenders there needed to be better rotations behind him - there was not. \n\nThis is why the announcers (and anyone watching the game) naturally assumed the goal was to take away the Mavs 3 point shooting. The guys that would have to rotate were sticking close to the corners.",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "allcazador",
                            "body": "Interesting, disagree. I thought Jaden played his ass off and was dodging illegal screens all game. \n\nThere were multiple drives when it looked like Rudy and the ball man were confused and would be talking to each other after the bucket.",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "That would be my assumption as well",
                    "score": 149
                },
                {
                    "depth": 1,
                    "author": "Mindless_Bad_1591",
                    "body": "Yeah i think he was. 1st game kinks i expect it to be better from here on out.",
                    "score": 112
                },
                {
                    "depth": 1,
                    "author": "Outrageous_Block1061",
                    "body": "Rudys ptsd striking again.",
                    "score": 47
                },
                {
                    "depth": 1,
                    "author": "Mr_Wyatt",
                    "body": "Would explain why he had some extended breaks in the middle of the game.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "Victor_Wembanyama1",
                    "body": "If that was the plan, yes. But had Gobert came up there's a plethora of trouble still brewing as the big rolls hard.\n\nEither that or someone else rotates to the big and the corner gets open",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "UrGirlThroatGame",
                    "body": "happened in Utah too. I remember their coach calling timeout mad that Rudy kept dropping back on the screens in a playoff series yet redditors just blamed Rudy's teammates",
                    "score": 43,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Krakenborn",
                            "body": "Yeah this is bullshit Snyder only ever ran drop coverage screens. The only time he ever deviated was against the Rockets in 2019.",
                            "score": 22
                        },
                        {
                            "depth": 2,
                            "author": "DXLXIII",
                            "body": "Gobert has a stan following for some reason. Anytime you criticize Gobert, his stans come flocking in with the advanced regular season stats and blame it on his teammates.",
                            "score": -75,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Longjumping_Fig1489",
                                    "body": "its just funny to say after dude was getting shit all last series for no reason",
                                    "score": 80
                                },
                                {
                                    "depth": 3,
                                    "author": "yarkcir",
                                    "body": "Every jerk will have a counter-jerk, that's just how Reddit works",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bagfka",
                                            "body": "Newtons 4th law",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "DXLXIII",
                                            "body": "Gobert isn’t the caliber of player I expect to have a stan following.",
                                            "score": -38,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "yarkcir",
                                                    "body": "Gobert haters are fairly rabid, so it makes sense that his defenders match the intensity of the criticism.",
                                                    "score": 36
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Brilliant_Mud_2749",
                                                    "body": "You’re really a fan of the word “stan”",
                                                    "score": 7
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "popfgezy",
                                                    "body": "He has 4 DPOY awards ....\n\nHe's the greatest defender of this generation",
                                                    "score": 21,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DXLXIII",
                                                            "body": "You would take him over Draymond AD and Kawhi?",
                                                            "score": -5,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Longjumping_Fig1489",
                                                                    "body": "over draymond? yeah.\n\n defensively over ad + kawhi? yeah.",
                                                                    "score": 14,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "DXLXIII",
                                                                            "body": "You should put defensively with Draymond also bc Gobert doesn’t do half the things that Draymond does offensively. \n\nSoon you will realize, like Jazz fans, that Gobert isn’t all that defensively. He’s great at what he does but he’s flawed.",
                                                                            "score": -9
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "DorkandPoon",
                                    "body": "I think it’s a reflex. Gobert gets unfairly shit on a lot on this sub. So the Gobert fans go hard defending him. I get it because I’m the same way about Trae Young lol",
                                    "score": 20,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Longjumping_Fig1489",
                                            "body": "trae youngs been a certified baller since Oklahoma state, anybody telling you otherwise are very silly people",
                                            "score": -7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "elimanninglightspeed",
                                                    "body": "I get your point but saying he went to Oklahoma state instead if Oklahoma is fucking criminal 😂 im not an Oklahoma fan haha but that would not make them happy",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TruthSayerFu",
                                    "body": "If they lose to the mavs they’ll blame Mitchell again",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DXLXIII",
                                            "body": "Draymond put it perfectly. If you are DPOY, the opposing team should want to put you in as little action to involve you defending as possible but it’s the opposite for Gobert. Teams attack him as often as possible.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Blothorn",
                                                    "body": "That’s a bit of an oversimplification—because his job for much of the Nuggets series was roaming, attacking some other on-ball defender is no guarantee that he won’t get involved as a help defender.\n\nIt also ignores that different players have different strengths. Very few DPOYs are capable of guarding 1-5 at a high level.",
                                                    "score": 20,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DXLXIII",
                                                            "body": "And what the Nuggets tried to do was get Gobert switched onto Jokic and let Jokic play 1 v 1. You can say that’s not fair to Gobert because he had no help defense but still the Nuggets game plan was to attack Gobert and involve him directly on the plays.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "HypatiaRising",
                                                                    "body": "Because trying to defend Jokic 1v1 is basically suicide for everyone. AD, Bam, and Draymond have all failed on that front.",
                                                                    "score": 6,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "DXLXIII",
                                                                            "body": "AD and Draymond did a much better job in their playoff series than Gobert did. Yes no one can stop Jokic one on one. However as a DPOY, you should be able to make it more difficult than 8-9. \n\nhttps://youtu.be/W3t5okZUIDI?si=t5kmBVLVk4pcA0R7",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "TrRa47",
                                                                                    "body": "Much better is pushing it. They did slightly better, and for Draymond specifically, it's probably easier to contain someone and a teams actions when the second best offensive player is Will Barton.\n\nAlso, stressing an 8/9 game that no one would've stopped when otherwise Jokic shot 42 percent against Gobert in the other 6 games is ridiculous.",
                                                                                    "score": 7,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "DXLXIII",
                                                                                            "body": "A lot of these plays are one on one post up plays with no help though.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "TrRa47",
                                                                                                    "body": "A vast majority of them were from the first two games, where Jokic was struggling by his standards anyway. Jokic made tougher shots in that game 5 than the ones than the ones he was forced into in that highlight package.",
                                                                                                    "score": 3,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "DXLXIII",
                                                                                                            "body": "He feasted on Kevon Looney every game, including game 1 and 2. Jokic didn’t just struggle for no reason. He struggled bc Draymond was guarding him.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "ScottSummersEyes",
                                                            "body": "people say this like its some revelation, everyone knows that was his job, and its simply an easier job. if draymond got to play roamer every game he would be the bappiest man on earth. he doesnt get brownie points for doing something that is easier.",
                                                            "score": -2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "spaceysht",
                            "body": "Because Rudy knows he can’t defend shit outside the paint. If he plays up he’ll get exposed and clowned all over again.",
                            "score": -13
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HelloMcFly",
                    "body": "And yet Rudy was by far the team leader in +/-, one of only two in the positive",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SpeclorTheGreat",
                            "body": "Yeah the Mavs were generally going on runs whenever Rudy was off the floor cause they kept on getting east layups.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "NotUpForDebate11",
                            "body": "Good thing +\\- is likely the most pointless stat for single games of all time.",
                            "score": 39,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ok-Map4381",
                                    "body": "For single game +/- this is true, but Rudy has been leading the Wolves in +/- for basically all of the playoffs in big minutes.  This isn't some random variance, the Wolves have been consistently winning these playoffs with Rudy on the floor.",
                                    "score": 29,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tj1721",
                                            "body": "I mean sure, but is it not pretty clear they were talking about the first single game in this new series?",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelloMcFly",
                                                    "body": "I'm not saying Rudy was their best player, but I am saying all you need is the +/- (or your eyes if you watched the game) to tell you this loss isn't because he was messing up drop coverages.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tj1721",
                                                            "body": "I mean sure i wouldn’t dispute that, but justifying with single game plus minus isn’t a great way of doing it.",
                                                            "score": -2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "detlefschrempf11",
                                                                    "body": "I mean sure",
                                                                    "score": 6
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Svettie323",
                                                    "body": "If your team loses a close game in which they were outscored by 13 in the 10 minutes one player was on the bench, it strikes me as rather stupid to be like \"Yeah it was that player's fault\".",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Duckys0n",
                                                            "body": "You’d think they’d get this",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "HelloMcFly",
                                    "body": "Everyone - like ALWAYS - rushing to hang this loss on Rudy. Yet across the playoffs he's had the best +-, and this game extends the trend. So is it perfect? No.  In this instance +- is quite informative in answering whether Rudy messing up coverage the reason for their struggles yesterday? No he was not, because they lost with Rudy off the court, not with him on. That was true watching the game, it's true looking at the evidence.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Svettie323",
                                            "body": "I'm blown away that Gobert's playability in the playoffs is somehow STILL on trial.  They beat the defending champs.  He's the playoff leader in +/-.  What more do morons need?",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelloMcFly",
                                                    "body": "It's unreal, I truly do not understand it. I don't understand how you can come to that conclusion looking at the stats afterwards which is mostly what people around here, or by watching the game.  \n\nYet people fucking love Naz Reid, when that man just bleeds points. But sure, go get a Naz Reid tattoo, let's celebrate the 6MOY. I like Naz Reid too, but why does he get such a free pass? Ant is getting fucking blown past by Kyrie over and over, but it's Gobert's fault they lost? It's the same Donovan Mitchell shit all over again.\n\nNot hanging this loss on Ant by the way (or anyone in particular, for that matter).",
                                                    "score": 8,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Svettie323",
                                                            "body": "The Mavericks shot 14-of-16 (88%) in the paint without Rudy Gobert on the floor and 17-of-31 (55%) with Rudy Gobert on the floor last night.\n\nr/nba:  \"Wow Gobert got exposed!\"",
                                                            "score": 15
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "NedStarx11",
                                    "body": "It’s way overrated but not pointless",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "tjshipman44",
                            "body": "When Gobert was on, the Wolves hit 15/37 3pointers. \n\nWhen Gobert was off, they hit 3/11.\n\nUnless you think Gobert is the reason why the Wolves hit so many 3s, his plus/minus for the game is very misleading.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Svettie323",
                                    "body": "When Gobert was on, the Mavs scored 76 points in 38 minutes.\n\nWhen Gobert was off, the Mavs scored 32 points in 10 minutes.\n\nFor the slow of mind - holding a team to 76 in 38 minutes is absurdly elite defense (on pace for 96 points total for the game).  Holding a team to 32 points in 10 minutes is egregiously terrible defense (on pace for 154 points total for the game).\n\nThe Mavs feasted in the paint, and I mean FEASTED, damn near every possession that Gobert was not on the court:\n\n[https://x.com/jackfrank\\_jjf/status/1793674187288273266](https://x.com/jackfrank_jjf/status/1793674187288273266)",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tjshipman44",
                                            "body": "Dallas was only down on offense because of poor 3p shooting. It's fool's gold.",
                                            "score": -3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "HelloMcFly",
                                                    "body": "It may be fool's gold if one were trying to say \"Gobert is their most important player\" but it's absolutely not fool's gold to say \"Gobert's play is not the reason they lost this game.\"",
                                                    "score": 7
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Svettie323",
                                                    "body": "They were poor on 3p shooting with Gobert off the court as well.  But their offense was still dramatically better.  Know why?\n\n\"Mavericks shot 14-of-16 (88%) in the paint without Rudy Gobert on the floor and 17-of-31 (55%) with Rudy Gobert on the floor last night.\"",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "HelloMcFly",
                                    "body": "Again, I am not trying to make the case Gobert is their best player, but the idea that the only player whose +/- was above 1 (at +10) is responsible for the loss because he was messing up his coverages just isn't true.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "kr1saw",
                    "body": "He ain't fucking up, he just doing what he knows best.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "pandasunited7",
                    "body": "Whole team was messing up defensive assignments the entire night. Safe to say the wolves did not come locked in and paid the price. Will be interesting to see how they come out in game 2. When the wolves are locked in they feel unbeatable.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Tenx3",
                    "body": "Watch the game, he was clearly not the issue.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Pandamonium98",
                    "body": "I don’t understand this though. I understand making the wrong decision in-game a couple times, but how many chances throughout the game did the coach have the chance to say “Rudy, stop playing drop coverage”? Like I don’t get how you can play the wrong scheme that many times just by accident",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "eeeedlef",
                    "body": "My suspicion is he was trying to cover for Kyrie's constant driving right past Ant. I think he wanted to shade far enough back that he wouldn't be too slow to react on the drive, and therefore wasn't coming out to the screen far enough.",
                    "score": 0
                },
                {
                    "depth": 1,
                    "author": "Losalou52",
                    "body": "Eh, hey should have done a better job of defending the ball near the 3 point line instead of ending up behind the ball like they did over and over. Had Rudy not came out to meet them he would be getting dogged for a the middy bonanza that would have followed.  To me, if you want to blame Rudy you gotta do a better job staying in front of the ball handler.  They kept Rudy in no man’s land.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "gradedonacurve",
            "body": "Draymond just got goosebumps.",
            "score": 136,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "This is making Draymond feel young again!",
                    "score": 32
                },
                {
                    "depth": 1,
                    "author": "UrGirlThroatGame",
                    "body": "Draymond was right all along",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "pskill43",
            "body": "People just love to blame the coaches, for example when an ATO call was broken or when players are doing dumb things. They don’t understand it’s not always the coaches fault and lots of times it’s the execution. It’s always “why is this guy taking the last shot, the coach sucks for drawing a play for this guy”, when the fact is the play was broken because of execution",
            "score": 57,
            "replies": [
                {
                    "depth": 1,
                    "author": "ech01_",
                    "body": "I think that's something that is true across every sport. People for some reason just don't want to call out players for things going wrong, its always the coach. Sometimes a guy has to get fired just to change something, but I feel like more often than not coaching changes don't actually fix anything.",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chillinwithmoes",
                            "body": "It's a hell of a lot easier to replace the coach than to replace a whole roster, or to turn over the key players on a team. That's why fans focus their anger at the coach and a lot of them become scapegoats",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ech01_",
                                    "body": "Oh yeah I get that. If things aren't going well and you need to make a change the coach is the only one who can theoretically be changed at any moment.\n\nI just think from a fan perspective people put to much blame on coaches when the vast majority of the time its the players who aren't getting it done.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Burnem34",
                                    "body": "I think it also has to do with the perceived entertainment value/attachment to players. They think *my* teams players or *my* favorite players couldn't just be worse than the other team. It's not just coaches, I really only ever see fans talk about commentators, analysts (besides TNT crew), and refs to say they hate them too. In terms of entertainment value I think alot of fans just see everything outside of the players as being disposable/unimportant",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "chillinwithmoes",
                                            "body": "> They think my teams players or my favorite players couldn't just be worse than the other team\n\nYeah this is very true. I swear nobody in the history of reddit has ever admitted that their team simply got outplayed lol",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TurtlePower5289",
                            "body": "There’s a comment in this thread somewhere that literally says “if the players are fucking up it’s the coaches fault” lmao",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "betweenthebars34",
                    "body": "People in here literally have no idea what coaches and players do and don't do.\n\nGranted they've been listening to sports media which gives no real insight, but shit... never going beyond that is silly still.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Burnem34",
                    "body": "Then people will just say \"well they'd be executing if the coach got them to buy in\" or \"it's the coaches job to have them ready\". The mental gymnastics people will do to blame the coach are unbeatable, they'll always come up with some new way to flip it",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "ChiRaider",
                    "body": "Yea it’s sad people are blaming Finch when Rudy being ass is the issue",
                    "score": -3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Icy-Lime-9760",
            "body": "So they didn't make any adjustments during timeouts?",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "Seems like the adjustment was to not play drop and they just didn't listen",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PostItToReddit",
                            "body": "Just feels like a weird statement for a long time vet like Conley to make. He's either saying the coaching staff noticed the mistake and didn't ask them to adjust back to the game plan, the coaching staff somehow didn't notice the mistake, or the players just straight up didn't listen to the game plan their coaches gave 'em. If any of that was true, feels like it'd be better to just keep it in house and fix it.",
                            "score": 59,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "collinCOYS",
                                    "body": "It appears to be the latter. That the coaches wanted them at the level and they didn't listen",
                                    "score": 17
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "funkstrong",
                            "body": "I think this is the answer, Finch's post film session comments today kind of cement it:\n\n> “Yeah, it was a rough film session. I told the guys, ‘It’s been a long time since I’ve been this disappointed in your effort. Your performance, your attitude, your application and attention to detail just wasn’t there.’ The Western Conference finals started. Not sure if they got the memo. But they got it this afternoon.”",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "blackgenz2002kid",
                            "body": "was Rudy scared to play the coverage or something?",
                            "score": 8
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sir_Grindalot",
            "body": "It's too late, Mike: Awful Coaching already made a video about your team's drop coverage attempts.",
            "score": 45,
            "replies": [
                {
                    "depth": 1,
                    "author": "joepurpose1000",
                    "body": "Great comment and content",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "2ndCatch",
            "body": "It was infuriating to watch, can’t imagine how the coaches felt.\n\nMaybe some of the players thought they knew better in the moment? Even though it was a close game Luka and Kyrie cooked us so hopefully they learn from it.",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "NerbertHenry",
                    "body": "It’s hard to completely shut down both guys because how they play/facilitate to elevate the other guys on the floor. I’m not sure you can stop either or both, just hope to slow down while the other guys on the floor miss their shots.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Return_Icy",
                            "body": "A corner defender is supposed to rotate into the paint to protect the big man, and if Luka kicks it to a corner they either A) scramble back to defend or B) defender from up on the wing rotates down. Rudy couldn't decide what he was going to do (because Jaden was honestly pretty awful at navigating the screen) so literally just played in the middle which was the absolute worst possible place to be, since the corner and wing defenders didn't know what Rudy was doing, so they essentially got frozen between their own man and the big down low",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "C-House12",
            "body": "This game confused me because every time I read about the Timberwolves defense or watched them play the whole point was that they weren't dropping everything and that KAT/gobert were stunting and scrambling really well for their size and that Gobert was a driving force behind that change this year. Gobert didn't look slower than usual to my eyes or anything like that so what caused this to happen?",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "This isn't popular to say on here, but I think the wolves don't have their legs right now. They looked tired from a grueling series in Denver. Didn't want to attack the rim at all and weren't at their usual intensity on defense. All credit goes to Dallas though because they were the better team. It'll be curious to see how the wolves respond in game 2",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "juzzbert",
                            "body": "I think Ant said something similar in his postgame.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "collinCOYS",
                                    "body": "And was ripped relentlessly in this sub",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "juzzbert",
                                            "body": "I didn’t see the posts/comments but that’s lame. I thought he was just being genuine about some of their issues this game.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "collinCOYS",
                                                    "body": "That was my read but it seems like the pendulum has officially swung the other way on ant around here. It was a fun run while it lasted!",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "braggpeak",
            "body": "Got their HC in the 2nd row having to look over dudes",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "I think that's been hurting the wolves more than people think. It's also so loud in the building that I'd guess they can't hear anything from the sidelines but I'd have to imagine they have hand signals for what coverage they want to play",
                    "score": 28
                }
            ]
        },
        {
            "depth": 0,
            "author": "brandnameb",
            "body": "Hot Take but defense isn't why they lost...Offensively was terrible down the stretch",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "UteFlyersCardJazz",
                    "body": "This series, KAT has to score at least 25 PPG in the series. He should have an advantage Dallas. He should not be scoring 16 against the Mavs.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Return_Icy",
                            "body": "6-20 😔 (sad cat noises)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "IntelligentDust6249",
            "body": "The most jarring thing for me was how bad their rotations were. In the Denver series they were able to double Jocik and recover perfectly, but in the first half there were maybe a dozen totally blown rotations off of Luka/Kyrie penetration.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "youngusgs",
            "body": "LOLL\n\nThis is funny as hell if this is true. Cuz Gobert dropped a heck of times more than he didn’t",
            "score": 14
        },
        {
            "depth": 0,
            "author": "MSHinerb",
            "body": "Sure happened a LOT for that to have been against the plan. Maybe the plan just didn’t work and you’re going to walk it back.",
            "score": 29,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "I would say that they didn't play at the level enough to even know if the plan would have worked or not",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MSHinerb",
                            "body": "They played drop coverage like 75% of the game.  Maybe more. I just don’t see how that’s an “error” by then outside of them realizing it was a mistake.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "collinCOYS",
                                    "body": "Agreed. I don't see why Conley would lie. If it's truly an error it's a really bad one and don't get how it happened so frequently",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "zeek215",
                                            "body": "Yeah that's puzzling to me.  Either you followed the plan and lost (because the plan wasn't good), or you did not follow the plan and lost (but why did they not follow the plan?).",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "MSHinerb",
                                                    "body": "Yeah, I’m sure it was an accident that almost every player involved in a screen played drop.",
                                                    "score": 3
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "coolmcbooty",
                                            "body": "Both Conley lying and them going against their game plan for most of the game honestly seems unlikely which is the wild part",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TurtlePower5289",
                                            "body": "And Conley is considered one of the more stand up guys in the league too! Hard to know what to think here",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BigFatModeraterFupa",
                                    "body": "playing drop against Luka and Kyrie is just begging for a beating",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nonufwiendz",
                    "body": "Yeah this is weird like im pretty sure if they couldnt get it right for 2 or 3 posessions they wouldve called a timeout and corrected it",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "adonWPV",
            "body": "The players in this league default is drop",
            "score": 5
        },
        {
            "depth": 0,
            "author": "shxylo",
            "body": "watching the game, i doubt the coaching staff reinforced drop coverage and didn’t adjust. especially after seeing rudy getting exposed possession after possession. might be a little hangover from the nuggets series (defending ag at the rim), just found it crazy that he kept dropping no matter what. against two of the best finishers, scorers in the league.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Troll_Enthusiast",
            "body": "They lack BBIQ i guess",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Carolake1",
            "body": "They were also told to \"make their shots\" but often didn't follow those directions, either.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "KoppleForce",
            "body": "This gotta be one of the dumbest excuses of all time.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "collinCOYS",
                    "body": "I don't think this constitutes as an excuse",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "A_Saiyan_Prince",
            "body": "Everybody acting like either of these teams have been here before… mistakes happen at high levels of play. To everybody.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "I_am_Bruce_Wayne",
                    "body": "Ehh... Mavs were there 2 years ago, granted... not everyone from that team is still on the team. However, their main players have along with the coach.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SugoiHubs",
            "body": "Wtf? So the drop wasn’t their game plan and the team just didn’t execute? How is this happening in the conference finals?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sezneg",
                    "body": "I can hear Awful Coaching shouting himself into an aneurysm already.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SugoiHubs",
                            "body": "What’s worse than living in North Korea?",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MysticPurpSports",
            "body": "Durrrrr",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dassiebzehntekomma",
            "body": "Let's be honest their real problem was not playing the hot hand. If Naz Reid gets 5 more mins of playtime Wolves finish this with a 10 point lead.\n\nThey had the momentum but then made really, really bad rotational decisions and that's what hurts the most.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rockop0tamus",
            "body": "Yeah I don’t get it haha how do you accidentally play the wrong defense for most of the game?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "matthitsthetrails",
            "body": "drop coverage should be code for lazy defense. its for bigs who don't want to get up on defending on the perimeter. hopefully its just fatigue",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hoops_n_politics",
            "body": "Chris Finch: No drop! Play up!\n\nMicah Nori:  What’s that, Chris?  You want _more_ drop coverage?  You got it, big guy!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ExcellentJuice4729",
            "body": "Cool, they wanna stay high then the roll man streaks to the basket for an and1",
            "score": 1
        },
        {
            "depth": 0,
            "author": "iuse2bgood",
            "body": "99% of /r/nba doesn't know what drop coverage is I bet",
            "score": 1
        },
        {
            "depth": 0,
            "author": "betweenthebars34",
            "body": "Makes no sense. \"We were told to not drop, so we kept dropping\" \n\nRight....\n\nThey're just embarrassed that they lost the first game at home. Already scrambling.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jon-Rambo",
            "body": "The hey accidentally played drop a lot then.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheRiverHome",
            "body": "Gobert is comfortable in drop coverage but got exposed, he’s supposed to listen to the coaches.  It was a close game regardless.  No adjustment needed.  Shooting percentage will drop.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TennisHive",
            "body": "I don't believe in any of this stuff that comes for the press.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Initial-Stick-561",
            "body": "So what’s the excuse now for Gobert? We had “he can’t defend everywhere” “he don’t have good on ball defenders” and “he was told to drop”. So what is it now?",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "_BigT_",
                    "body": "He was +10 still. Next best was Conley at +1. When Gobert was out of the game we got killed. They were going to the rack at will. I seriously feel like I'm watching a different game. People really can't wrap their head around on how defense is played unless there's a big block or steal.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bellmonk",
                            "body": "yeah Rudy smothered the paint in the 4th quarter.  seems like most people slamming on his d this game didn’t actually watch it.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "booyakasha32",
                    "body": "Wolves were significantly better with Rudy on than they were with him off. Every time he subbed out the Mavs went on a run",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "No_Stay4471",
            "body": "Wemby would never…",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Svettie323",
            "body": "The Mavs scored just 76 points in the 38 minutes Gobert played (on pace for 96 total for the game).\n\nr/nba:  \"Wow Gobert got eXpOsEd!!!\"",
            "score": 0
        },
        {
            "depth": 0,
            "author": "SlashUSlash1234",
            "body": "Ant and KAT went a combined 12-36.   That’s why they lost.  Derek Lively played 26 minutes and got 11 boards.  \n\nThe drop coverage actually worked on average because the Mavs didn’t get a bunch of 3s out of the short roll and settled for long twos.  That’s partially why the 3 point percentage was so low - they took less open ones.  \n\nIf they blitz they will die from the 3pt line. It’s not like Luka or Kyrie aren’t great passers and the Mavs screeners are athletic and long with massive catch radiuses.  \n\nLuka and Kyrie will always be a mismatch— I bet the wolves need at least 110 to win any of the games going forward (which is doable - Ant and KAT will have better shooting nights).\n\nAt the end of games maybe you want the ball out of Luka’s hands, but he’s generationally patient.  If he and Kyrie hit every shot down the stretch you’re going to lose anyways.",
            "score": 0
        }
    ]
}