{
    "title": "Replay of Hawkeye_View technology to confirm the ruling of offensive basket interference committed by the Timberwolves.",
    "comments": [
        {
            "depth": 0,
            "author": "DreTownblues",
            "body": "They really should play this on the broadcast right away so those that don’t know about the system understand how it was confirmed so fast",
            "score": 775,
            "replies": [
                {
                    "depth": 1,
                    "author": "JetSky81",
                    "body": "Yea some fans are convinced on twitter that it’s rigged cause they only looked at it for 10 secs for review lol",
                    "score": 238,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SQLZane",
                            "body": "Honestly the calls that drove me crazy were a few really late whistles on Jaden where the reply showed he didn't touch the person...",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Luminous-Savior",
                                    "body": "The refs were back and forth on letting them play vs calling weak fouls. For the most part it went pretty smooth. Thankfully not a Tony Brothers game",
                                    "score": 24,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Shhadowcaster",
                                            "body": "I was saying basically the same thing to my buddies today. Not perfect, not horrendous, but it wasn't Tiny Brothers and I'll take that every time. ",
                                            "score": 8
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "LargePeopleLiveHere",
                            "body": "What’s Twitter?",
                            "score": -36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FrnklndaTurtle",
                                    "body": "X gonna give it to ya",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LargePeopleLiveHere",
                                            "body": "Knock knock",
                                            "score": -21
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Jubez187",
                    "body": "yea the fact this isn't showed is baffling",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "LeonidasSpacemanMD",
                    "body": "Yea I think a lot of people don’t realize the above-the-rim cam isn’t actually centered directly above the middle of the rim, so you’re seeing a slight tilted angle",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Torrent4Dayz",
                    "body": "I don't understand why the nba can't review every call this way. I'm definitely sure they have the technology. I watch a lot of badminton and tennis, and every call they review the play using some hawkeye type review system as well.",
                    "score": 30,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "N0rTh3Fi5t",
                            "body": "I think there's too much going in for this to work on a lot of calls. Badminton and tennis have less players and less positions those players can be in, so there's less difficulty in getting cameras with the right angle.  I would bet the technology is possible, but just not advanced enough right now to be trusted.",
                            "score": 18
                        },
                        {
                            "depth": 2,
                            "author": "lostnotleast",
                            "body": "It would slow the game down way too much. Basketball is very much a fast paced game and imagine if a team like the Pacers who want to push have to constantly stop and wait for an OoB call to be reviewed as correct. Even 10 seconds would kill their momentum.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "binhpac",
                                    "body": "but they take away 3s afterwards, if you step on the line or give 3s if you didnt. same as being with the foot out of bounds and making a basket. sometimes minutes after the action.\n\nThis is also an easy call ot take away a putback if it was in the cylinder and the other team had the ball anyways.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lostnotleast",
                                            "body": "That’s different, the basket counted either way it’s just retroactively adding or subtracting a point. It doesn’t disrupt the flow of the game at all.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "binhpac",
                                                    "body": "not when you step out of bounds and made a 3pointer like in the playoffs, that famous one of struz. they took his 3 pointer away like 3-5 minutes afterwards.\n\nthats the same situation like a putback taking away.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lostnotleast",
                                                            "body": "That scenario virtually never happens. If they reviewed every made basket it would be chaos.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "binhpac",
                                                                    "body": "but those scenarios happened. like every shot from the sideline and from the 3pt line is reviewed and they have corrected and taken baskets away.\n\nit happens several times every game.\n\nyou now adding the putbacks to the reviews. its not something that is drastically different. how many more reviews do you add? 20 per game to the already 100s you review? and with hawkeye technology its also fast and efficient.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lostnotleast",
                                                                            "body": "You advocated for everything not just putbacks to be reviewed",
                                                                            "score": 3,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "binhpac",
                                                                                    "body": "the putback is the most easily to adapt to the current system, because there is an easy objective answer.\n\nif you talk about fouls, there is so much subjectivy involved and leeway of the refs. its impossible even with reviews to have a correct answer. different refs would review the same situation total different in different game situations. look at the reddit discussions here on this subreddit even days after a crucial call, people discussing if its the right call or not. yeah that doesnt make sense.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "lostnotleast",
                                                                                            "body": "I agree with putbacks, just not every OoB or foul.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "jl_theprofessor",
                                                                            "body": "Go watch another sport please.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "binhpac",
                                                                                    "body": "i do it also. i dont watch exclusively basketball.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "gedbybee",
                                    "body": "Do it like soccer and assess fouls after the fact. Like sure you got a dunk, but now you’ve got a 5th foul. Only stop for 6th foul/ freethrows.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lostnotleast",
                                            "body": "I disagree, that would lead to a ton more players fouling out. You could probably call at least one foul per possession if you really looked at every player closely. I think the refs are fine besides things like goaltends which really should be automated.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "gedbybee",
                                                    "body": "It’ll foul them out until they adjust. They’ll figure it out. Or just call less fouls. Or call a certain percentage of fouls.",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "jl_theprofessor",
                            "body": "EVERY CALL? Get out of here.",
                            "score": 0
                        },
                        {
                            "depth": 2,
                            "author": "CosmicCoder3303",
                            "body": "With how embarrassingly bad some modern tech has been, I'm not really sure I would trust technolog this implicitly already",
                            "score": -2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WhiteHeterosexualGuy",
                    "body": "At some point, you can't bend over backwards to justify things to conspiracy theorists.  The mental gymnastics people like that will go through to call things rigged or whatever are crazy.  They literally have a lottery process for the draft, hosted by EY, with EY's reputation on the line, yet people still talk like it's some conspiracy every year.  You can't change people like that.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "herseyhawkins33",
                            "body": "I mean that wouldn't be bending over backwards tho. They show the automated line calls in tennis all the time.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SelfDestructIn30Days",
                    "body": "They played the video, which clearly shows the ball outside the cylinder before Towns touched it. Watching a computer aided rendering is not a better view than the actual video.",
                    "score": -75,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "POKEMONMAN1123456789",
                            "body": "The angle of the camera lol",
                            "score": 53,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RubMyGooshSilly",
                                    "body": "Literally the only way to see this perfectly on video would be to have a camera directly below or above the rim and pointed through it lol",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CosmicCoder3303",
                                            "body": "I'm literally surprised that's not a thing. Get one of those ring doorbell cameras for like 20 bucks lol",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "SelfDestructIn30Days",
                                    "body": "Angle of the camera, cheatin' ass refs. I guess it all depends on which team you root for.",
                                    "score": -51,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "POKEMONMAN1123456789",
                                            "body": "Do you not realize every viewpoint has some distortion? Do optical illusions not exist? The software uses multiple camera angles to find the real locations. Of course there were some bad calls but this was not one of them.",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SelfDestructIn30Days",
                                                    "body": "Makeup call immediately on the next possession says it all to me.",
                                                    "score": -30,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "20goingon60",
                                                            "body": "This just screams sore loser, dude. This is not it.",
                                                            "score": 13,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Winter-Donut7621",
                                                                    "body": "This dude's denial is just sad lol",
                                                                    "score": 5
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Tiegrr",
                                                                    "body": "There’s always fans of perennial loser teams that become unbearable when their team finally gets good.",
                                                                    "score": 5
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "coachtomfoolery",
                                            "body": "Hurr durr, etc",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DreTownblues",
                            "body": "I mean if a literal Hawkeye system that is meant to account for exact ball placement doesn’t sway you nothing will",
                            "score": 25
                        },
                        {
                            "depth": 2,
                            "author": "coolmcbooty",
                            "body": "It’s weird referencing a video as backup reasoning when the video is literal proof you’re wrong",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "KosovoCavalier",
                            "body": "False",
                            "score": 9
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "macc_aviv",
            "body": "This is the NBA's first season using Hawkeye. They have been known for their tech in tennis but cool to see how quickly they've added to the NBA's ability to use tech to make the game better.",
            "score": 209,
            "replies": [
                {
                    "depth": 1,
                    "author": "mrhjt",
                    "body": "Soccer too. Great for off side decisions",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EffTheIneffable",
                            "body": "Hawkeye is the goal line tech (did it cross the line fully, is it a goal?) It’s awesome, been virtually perfect.\n\nThe offside implementations wish they could be as accurate as Hawkeye, but even the best ones have a ways to go.\n\nWhich makes sense, it’s just easier when the lines are set and you’re only tracking one particular spherical object.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "Salahs_Chest_Hair",
                            "body": "Until they start adding the sqwiggly lines, it's a joke.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "PartrickCapitol",
                            "body": "Go ask r/soccer and see their opinions on VAR implementation LOL",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "flying_dino777",
                                    "body": "Nobody minds the technology itself; it is perfectly functional. It's just unfortunate that the technology is used by people who don't know the rules of the game+ the fact that people who operate it aren't willing to overturn an onfield decision because it makes the \"referee look stupid\"",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "mrhjt",
                                    "body": "Honestly I have first hand experience with its implementation into the MLS and Premier League so I don’t need to. I’m sure people are split on opinions and refs are not without fault.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SABJP",
                    "body": "I think it was first used in Cricket. I'm really surprised that it took this long to use it in the NBA. I remember this tech being used in 2011 Cricket World Cup.",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "macc_aviv",
                            "body": "Yes, you are correct. I think most people here in the US first noticed Hawkeye with tennis however. There were competing technologies for a while in the NBA that were more useful for the holistic package of what teams were looking for. Hawkeye is now a fair bit ahead of the competition. There are 7 or 8 other big players in this space right now.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Hondalol1",
                            "body": "This has been used in tennis since at least 2006",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "citrondevigne",
                                    "body": "It was developed for Cricket in 2000/2001 according to [Wikipedia](https://en.m.wikipedia.org/wiki/Hawk-Eye). Looks like Tennis began to use it for calls in 2006. Snooker broadcasting also used it in 2006 to show possible shots.",
                                    "score": 15
                                },
                                {
                                    "depth": 3,
                                    "author": "SABJP",
                                    "body": "From Wikipedia \n\n>The Sony-owned Hawk-Eye system was developed in the United Kingdom by Paul Hawkins. The system was originally implemented in 2000 for television purposes in cricket.\n\nApparently, Paul Hawkins got so frustrated with inconsistent umpire calls in cricket that he felt need of this type of technology to get more consistent calls.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MrNegative69",
                                            "body": "The Umpiring in cricket is 100x better because they are not afraid of overruling onfield decisions. For some reason nba is afraid of admitting/overruling mistakes made by the referees on court even though the budget is on a higher level in nba",
                                            "score": 12,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SABJP",
                                                    "body": "Right? I was so surprised by this when I first started watching NBA. Why was it not implemented earlier though? Was it because of Refree union or something like that?",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PartrickCapitol",
                    "body": "NBA’s VAR era, here we come and let’s see if everyone is prepared for it.   \n  \nIncoming “this bucket is undergoing a VAR check, refs asked to see the monitor…”",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "20goingon60",
                    "body": "Agreed! I wonder just how advanced it can get, because if it could eventually replace the refs, that’d be a major W",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "m3ngnificient",
                            "body": "I'm going to put on a tin foil hat and say what my hunch says. It will take out the drama and fans raging at borderline decisions. They could easily take out the ump who stands behind the strike zone in MLB but they aren't doing it anytime soon. I think that will be the same for the NBA. It also nerfs some player's skills too, like pitch framing, foul baiting.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DrinkWaterPissPant",
            "body": "Refs do not get enough credit for being able to spot this during a game.",
            "score": 244,
            "replies": [
                {
                    "depth": 1,
                    "author": "dantheflyingman",
                    "body": "I might be crazy but I thought it was pretty clear live. I was wondering if the bounce was gonna go in.",
                    "score": 108,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MK10",
                            "body": "It was pretty clear live and obvious from the sideline angle that the ref had. TNT kept showing the flawed angle from the top of the shot clock over and over instead as if it was perfectly over the rim or something though.",
                            "score": 40,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DuckDuckSkolDuck",
                                    "body": "Yeah my friends and most online wolves fans were insisting it was a terrible call but it was pretty obvious to me from the overhead view too, like as long as you're aware that the camera is at that angle idk how you come to any other conclusion.\n\nThis was a nice way to visualize it though",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "qeq",
                            "body": "Yeah, just look at how little the ball moves when he grabs it",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "TheOneWithThePorn12",
                            "body": "Same. It was very obvious the ball was still above the clylinder and was going to hit rim.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "sevaiper",
                            "body": "Yeah Luka was screaming for it immediately",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "--Alix--",
                    "body": "This game was officiated extremely well. Both teams were in flow for most of it and most calls were quick and nice. Only exceptions were the stupid challenge calls.",
                    "score": 107,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NotVexingPi3",
                            "body": "Typical and extremely common Marc Davis W",
                            "score": 31,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KingOCream",
                                    "body": "Only ref I know the name of that I don’t hate",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "5outof7_yes",
                                    "body": "Same legend who didn't give Malone a tech or two for barking non stop. Respect",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "gOPHER3727",
                            "body": "I agree it was generally officiated decently, however there were an insane amount of late calls where they waited to see if the ball went in first (and even two where a team had rebounded the ball and started to go the other way).\n\nThey did an excellent job of not calling fouls when there was clear foul baiting going on in the first half, but they didn't do as good a job in the second half.",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "captaincumsock69",
                                    "body": "That’s basically how it always goes when they try to determine if it was incidental contact. There’s a lot of stuff that’s in the gray area between foul and play on",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lostnotleast",
                                            "body": "I think it’s more so the refs only calling a foul when they see that the shot misses instead of just calling it regardless. If it’s a foul call it, don’t wait.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "captaincumsock69",
                                                    "body": "Thats because they see contact but again contact happens on every play and they have to decide whether the contact actually influenced the possession or not.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lostnotleast",
                                                            "body": "What? What difference does the shot going in make for deciding if there’s contact or not? If they wouldn’t blow the whistle if the shot goes in they just shouldn’t blown it at all there.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "captaincumsock69",
                                                                    "body": "It makes a difference in determining whether the contact was incidental or not",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lostnotleast",
                                                                            "body": "How? Different players are better at finishing through contact, that would just be punishing them for being good at that by assuming that the contact didn’t alter their shot if it went in",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "captaincumsock69",
                                                                                    "body": "Welcome to the NBA where different guys get different whistles",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "lostnotleast",
                                                                                            "body": "What? You’ve yet to explain why the refs shouldn’t just call a foul when they see contact instead of waiting for the shot to miss",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "captaincumsock69",
                                                                                                    "body": "I’m not explaining why they shouldn’t. I’m explaining to you why they call a late whistle.",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "lostnotleast",
                                                                                                            "body": "I’m well aware of why they do it lol. I literally just said they shouldn’t do it because it makes no sense, if it’s a foul it should be called either way.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "captaincumsock69",
                                                                                                                    "body": "Sure it’s easy in theory but it’s actually difficult to do in practice because there is contact on every play and basketball ultimately is a contact sport. So you need some way to differentiate between contact that is a play on and contact that is worthy of a foul. Hence why you see late whistles because the ref thought the contact was borderline but had the shot gone it they would’ve deemed it incidental.\n\nIf it was as easy as just calling a foul a foul there would never be any ref drama",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "lostnotleast",
                                                                                                                            "body": "You’re explaining something I understand. I think it’s a very bad way to handle it. If you think the contact was there call it regardless. They’ll blow the whistle when the other team has already gotten the rebound and it’s absolutely ridiculous. I’d rather them blow the whistle less in general than wait to see if the shot goes in and then whistle. \n\nIt is that easy. Decide when you see the contact whether it’s marginal or not regardless of the basket afterwards.",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "InfernoidsorDie",
                                    "body": ">however there were an insane amount of late calls where they waited to see if the ball went in first \n\n\nI mean if you want a better paced game you can't have them call every shooting foul. It's just one of those things that refs are gonna see how much the contact affected the shot sometimes if it's not egregious. Why stop a playoff game for a foul that didn't alter the shooter that much?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "gOPHER3727",
                                            "body": "Well, you see I'm probably biased against it because it literally almost never happens in the Wolves favor. If I were to watch the season back I bet it would be nearly 10:1 Wolves opponents seeing those late calls. Of course I'm sure I'm probably exaggerating, but maybe I should start actually keeping track.",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CP3sHamstring",
                                    "body": "They do the late call on purpose. ",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "itssensei",
                            "body": "Turns out the refs are capable when they aren’t given an agenda",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "LeBroentgen",
                    "body": "Being an NBA ref is like being a cornerback in the NFL where we only recognize mistakes. We only talk about the bad or missed calls and never all of the great calls they get right..",
                    "score": 20
                },
                {
                    "depth": 1,
                    "author": "insertdankmeme",
                    "body": "They will always make the call in the last 2 minutes because they are able to review it. Anything close will be whistled.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Victor_Wembanyama1",
                    "body": "Luka and Dallas pointed it out. The refs eventually decide to call it goaltend so they can review it. They couldnt review it if they didnt call it that way. Great decision, I say. sucks for Minny tho that can be deflating in some ways",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "DangerZoneh",
                    "body": "He got the assist from Luka on the call, though, lmao.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "jaytrain12",
                    "body": "luka and mavs called a goaltend",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Denjek",
                    "body": "I cannot tell you the number of times I've said a call was complete and absolute bullshit, only to see it on replay and think, \"Oh, shit. Yeah, that's a foul.\" \n\nClearly, I'm not meant to be a referee.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "n0t_4_thr0w4w4y",
                    "body": "Or for having the balls to actually call it",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "CJ4ROCKET",
                    "body": "Lol give me a break ... anyone watching on live TV knew that it was possibly a goaltend, and in those circumstances where it's close, you're supposed to call goaltend so it can be reviewed",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "n0t_4_thr0w4w4y",
                            "body": "\\*basket interference",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CJ4ROCKET",
                                    "body": "No, it is goaltending.  Can't speak for FIBA or other leagues but this is considered goaltending in the NBA.  Both the Hawkeye replay and NBA's L2M report call it goaltending.  Outcome is the same regardless, so kinda pointless to distinguish, but the NBA calls this goaltending.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "kikimaru024",
                                            "body": "[In FIBA it would have counted as a basket.](https://www.fiba.basketball/rule-differences) \n\n> **Goaltending/basket interference**  \n>Once the ball strikes the rim, any player can play the ball (i.e. swat it away or tap it in).",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CJ4ROCKET",
                                                    "body": "Sure, my only point is that this is correctly characterized as goaltending (not basket interference) in the NBA.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Betaateb",
                                            "body": "Um...no they don't?(at least not always)\n\nhttps://videorulebook.nba.com/archive/obi-offensive-player-contacts-the-ball-while-it-is-within-the-cylinder/\n\nOffensive Basket Interference is what they call it.\n\nIn the rulebook it is \"Basket Interference - Goaltending\"\n\nhttps://official.nba.com/rule-no-11-basket-interference-goaltending/\n\nSo they can use it interchangeably, but it is certainly not incorrect to call it basket interference.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CJ4ROCKET",
                                                    "body": "What do you mean \"no they don't\"?  The hawkeye video replay calls it goaltending, as I stated.  You can see it if you open the video.  The L2M report called it goaltending, as I stated.  You can see it in the L2M report.  I also pointed out that distinguishing between goaltending and basket interference is pointless.\n\nMaybe you meant to respond to the other guy?  He tried to correct my first use of goaltending (even though that's what the NBA called this play in multiple official capacities) with \"*basket interferernce.\"",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Venator850",
                    "body": "They don't credit because of all the other screwups they have.",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "coltsmetsfan614",
            "body": "I was surprised there was any controversy around this last night. It's not a new rule, and the replay was clear, even without this clip to show it. Maybe I've just watched enough basketball to know what to look for, but it was weird to me that people got up in arms over it.",
            "score": 106,
            "replies": [
                {
                    "depth": 1,
                    "author": "theseyeahthese",
                    "body": "I don’t think there was any actual controversy, it was more of a “very close so therefore Rule of Cool should win” lol. Also, the initial replay view was more deceiving than this.",
                    "score": 52,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LeonidasSpacemanMD",
                            "body": "Yea and maybe some people not realizing that the league has the tools to just immediately know whether the call is right or wrong. The broadcast cameras often get great views but it’s not always what the refs are seeing",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "Betaateb",
                            "body": "But it wasn't even very close, half the ball is over the cylinder when he grabs it lol.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "shockwave8428",
                    "body": "It’s mostly that the camera angle from above we see isn’t directly above and people are treating it like it is. Like it’s not directly above the cylinder but that’s because of the angle",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "junkyardgerard",
                            "body": "It was clear that was the case, but the announcers didn't help explain that, like at all",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Egonzos",
                    "body": "I think the problem is that it was much closer to being out of the cylinder just before KAT touched it. When he touched it it was 100% in the cylinder, but people are watching the overhead replay and seeing it clear the rim and like “omg that’s not a goaltend” when KAT hadn’t even gotten to it yet.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ode1st",
                            "body": "This is my issue with the rule yeah. If the ball is clearly not going in, then it should be fine to do a putback.",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Egonzos",
                                    "body": "Yeah and if it bounced one more time like it was going to it was 100% bouncing away from the hoop. Just unfortunate timing.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Pipes_of_Pan",
                    "body": "Did the broadcast crew know the the refs were doing this type of review? I just remember them saying “well that was a fast review!” and commenting how close it was.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "coltsmetsfan614",
                            "body": "They definitely should've known. I'm not sure why the networks don't get the footage to show live on TV though.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "EvenInsurance",
                    "body": "As just a casual NBA fan - why was this a foul, I thought it was just a run of the mill put back dunk. Does the entire ball need to be out of the blue area to be allowed to dunk it?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "coltsmetsfan614",
                            "body": "Not a foul, just a change of possession. You can't interfere with the ball when it's in the \"cylinder\" above the circle of the rim. If the offense does it, it's a turnover. If the defense does it, it's goaltending (basket counts).",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sstphnn",
            "body": "Damn, now they called an Avenger to confirm the call.",
            "score": 39
        },
        {
            "depth": 0,
            "author": "pitcherintherye77",
            "body": "Enhance!",
            "score": 8
        },
        {
            "depth": 0,
            "author": "CosmicCoder3303",
            "body": "Wtf is Hawkeye view technology? ",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "constantlymat",
                    "body": "A technology for video replay that has been used in European football and tennis for over a decade.",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "theseyeahthese",
            "body": "Alright, that is cool as fuck.\n\nShow this to us during the game! Like they do in tennis.",
            "score": 22
        },
        {
            "depth": 0,
            "author": "bronet",
            "body": "Oh, I've always thought it had to he more than halfway over for some reason",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "tickub",
                    "body": "yeah they've never been consistent in reffing these because we've all seen many so many putbacks where the ball was still partially inside the cylinder",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Glitchhikers_Guide",
            "body": "it's weird cuz the angle of the ball means it's gonna clank off rim and out, but idk how you'd write a rule that says \"if the trajectory of the ball indicates it will hit the rim and not bounce away from the basket after it makes contact it's not interference\" without leaving some dumbass loopholes or just making people mad. \n\nGiven I've never seen this called before either imma assume most players just never make this mistake and wait for the next bounce even though it feels dumb.",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "JustGottaKeepTrying",
                    "body": "I think I missed something in your post but basket interference (offensive and defensive) is called all the time.",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Glitchhikers_Guide",
                            "body": "I mean I may just not watch enough games lol, but in mavs games i like never see it happen",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Jcarter1632",
                                    "body": "Basket interference happened a lot in Mavs games this season..",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cheap_Low_3316",
                    "body": "It’s a rule that’s in conflict with itself. It first bans touching the ball at all if it’s off the backboard whether it’s on the way up or down, because as it concedes, spin and compound effects make it too complicated to judge and/or legislate which shots actually have the chance to go in. But then it uses “imaginary cylinder“ for above the rim shots, even though spin, momentum, etc all can clearly still allow that a ball still “has a chance to score” which is the wording used within the rule.   \n\n\nThey‘d have to taper the imaginary cone out to a zone of statistical possibility for the logic to be consistent and then somehow make calls based on that, which I guess looks a lot more possible with this tech being shown here. Everyone would hate that though.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Glitchhikers_Guide",
                            "body": "it would basically have to be an automated system because no one could be expected to see that, and I doubt the refs union wants robo-refs, even if it's for a single type of call.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "The_Almighty_GFK",
                    "body": "Same thing with \"ball hit after bounces off backboard\" goaltend. No way to really tell if it would go in or not.\n\nThere was an instance in the Celtics-Cavs series where a Cavs player went for a layup, it his the bottom corner of the backboard, where the padding is, then Derrick White(I think?) hit the ball right after it hit the backboard, and was called a goaltend. No way was it going to go in, prob hit the bottom or side of rim, but because it hit the backboard first then White slapped it away it was goaltend.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Tajikistani",
                    "body": "Should be 51% over the rim (heading out) isn't interference, they clearly have the technology",
                    "score": -11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "4000kd",
                            "body": "That is almost impossible for a ref to call, unless you want them to stop and use the replay centre every 5 minutes.",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "myRedditAccountjava",
                                    "body": "That took them 15 seconds to confirm with this view.",
                                    "score": -6
                                },
                                {
                                    "depth": 3,
                                    "author": "Tajikistani",
                                    "body": "They go back and change 3s to 2s all the time, no reason the replay center can't just buzz down seconds later and wipe it off or add it back",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AlexBucks93",
                                            "body": "This is different. This is just changing the play from 2 to 3, defensive interference would change the whole outcome of the play.",
                                            "score": 12
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "RubMyGooshSilly",
                            "body": "Just upgrade the refs eyeball software, super easy.",
                            "score": 5
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HarryPauler",
            "body": "Man that’s frustrating. That ball looked outside the cylinder, and ended with a huge momentum swing for the Mavs.\n\nEdit: looked outside the cylinder live, not on this replay.",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "Afraid-Department-35",
                    "body": "Unfortunately the broadcast camera isn't the same as the ones that the replay center uses.  The above the rim cam is placed at an angle so the ball position relative to the rim is very deceiving.",
                    "score": 42,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "anonymous_lighting",
                            "body": "nor is the broadcast camera the same angle as the officials ",
                            "score": 7
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "purplenyellowrose909",
            "body": "The subtle but effective push was the controversial call in my head.\n\nCalling the goaltending in real time knowing how the crowd would react took balls of steel, but was clearly the right call after a 10sec replay",
            "score": 10
        },
        {
            "depth": 0,
            "author": "swarshmallow103",
            "body": "LET'S GO NBA VAR",
            "score": 3
        },
        {
            "depth": 0,
            "author": "NuggLyfe2167",
            "body": "Doesn't matter, Wolves fans have convinced themselves the league is out to get them.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "TexasTundraPower",
            "body": "I'm not sure this is called like this consistently.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "AmbitionExtension184",
            "body": "lol why would anybody need this? We have eyeballs.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "jl_theprofessor",
            "body": "CHECKMATE, ATHEISTS",
            "score": 2
        },
        {
            "depth": 0,
            "author": "512fm",
            "body": "Good call",
            "score": 7
        },
        {
            "depth": 0,
            "author": "HawaiianPunch42",
            "body": "This is really cool. I wish they'd show stuff like this on the broadcast, I didn't even know the NBA used this tech",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Skolcialism",
            "body": "If it’s a 10 second review the scorekeeper should review every putback like they go back and review toes on the line for 3s",
            "score": 3
        },
        {
            "depth": 0,
            "author": "sinik_ko",
            "body": "Obvious interference",
            "score": 2
        },
        {
            "depth": 0,
            "author": "RedditUser538xxx",
            "body": "Is that when he touched the ball?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "herseyhawkins33",
            "body": "Ok that's pretty cool",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RayPout",
            "body": "Correct call. But this rule sucks! Booooo",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "HurricaneSalad",
                    "body": "I'm biased in this particular situation, but I agree with you.\n\nMore than half the ball is outside the cylinder and it's moving out and away from the hoop and backboard.  But somehow it's goal tending.  Agree it's stupid.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RayPout",
                            "body": "They don’t have this rule in euro ball. Would be cool if they got rid of it.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Dull_Counter7624",
                                    "body": "Wemby would win the next 10 titles if they did that",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "FrnklndaTurtle",
            "body": "Just go to Fiba rules.",
            "score": -16,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ilikesporks_",
                    "body": "if we had fiba rules kawhi's shot would've been swatted",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "POKEMONMAN1123456789",
                            "body": "Imagine wemby and fiba rules",
                            "score": 32
                        },
                        {
                            "depth": 2,
                            "author": "Phanti3",
                            "body": "No it wouldn't, even in FIBA you aren't allowed to touch the ball after the game clock has expired",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "4000kd",
                                    "body": "This Kawhi shot would get swatted\n\n[https://youtu.be/5nBsXxeXm10?si=AKbgodJsO-Ldb1Km](https://youtu.be/5nBsXxeXm10?si=AKbgodJsO-Ldb1Km)",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Phanti3",
                                            "body": "Yes this one would get swatted. I'm not here to argue about which rule is better btw, just anytime this topic is brought up someone mentions the Kawhi against 76ers shot when this is one of the example where FIBA rules wouldn't have mattered",
                                            "score": -1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FrnklndaTurtle",
                            "body": "Or Kawhi knowing it could have been swatted bull rushes the rim and slams it in.",
                            "score": -16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lazybum914",
                                    "body": "Or if you knew he shot it with under 1 sec to go, that wouldn't be possible. ",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "FrnklndaTurtle",
                                            "body": "That was many beers ago",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RocketoPunchy",
            "body": "That looks like it’s coming off though, like, that’s not going in, shouldn’t that be a good put-back?",
            "score": -16,
            "replies": [
                {
                    "depth": 1,
                    "author": "ZealousCatracho",
                    "body": "Doesn’t matter, it was over the ceiling at the time KAT touched the ball.",
                    "score": 32,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RocketoPunchy",
                            "body": "I used to interpret the rule as,\n\nIf it’s over the basket, going in anyway, then that’s a goal tend/interference. \n\nGuess I’ve been wrong.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "collinCOYS",
                            "body": "What was wild was it came over the cylinder but then the spin on the ball put it back over",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Briggity_Brak",
                                    "body": "That's what i thought too, but this angle doesn't really look like that at all. I think it's a trick with the over-the-backboard cam where the higher the ball gets, the more inaccurate it looks.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mug3n",
            "body": "Maybe it's time to adopt FIBA rules.  No defensive 3 seconds in the restricted area, no goaltending rules and you can grab a rebound in the cylinder.\n\nBut nah, the NBA decided it needs to adopt a multimillion dollar video replay system instead to address something that costs $0.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Quadriporticus",
                    "body": "Lol this is kinda weird coming from a Raptors fan. I'm pretty sure you haven't forgotten the Kawhi shot.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "spiderman96",
            "body": "Eli5? It's a goaltending because the ball was coming back down? Or because he touched it at all",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "sintenterooro",
                    "body": "Because it was inside the cylinder",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spiderman96",
                            "body": "So it doesn't matter if its a shot that's bouncing off or a lob pass  no matter how it enters this zone it cant be touched by anyone",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dtrando",
            "body": "Still dumb to call in the first place. Not like there was any contest or anything, just KAT with a clean finish.",
            "score": -5
        },
        {
            "depth": 0,
            "author": "Saucy_Totchie",
            "body": "It's the correct call but the NBA should just drop the rule.",
            "score": -13,
            "replies": [
                {
                    "depth": 1,
                    "author": "4000kd",
                    "body": "No they shouldn't. It would break the league if 7 footers could just swat every ball that bounces.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "20goingon60",
                            "body": "1000% this. It would also be SO boring to watch the players just jump up and guarantee every shot goes in.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "antieverything",
                                    "body": "This is how the rule works in FIBA play. They have plenty of 7-footers in other pro leagues around the world (top leagues have the same average height as the NBA).\n\n\nIt is a non-issue. \"Every shot\" does *not* \"go in\". This is hysterical and demonstrably false.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "antieverything",
                            "body": "...found the guy who doesn't watch non-American basketball. It was fine in the Olympics last time, it was fine in the European Championships, it was fine in the World Cup, it will be fine in the Olympics this Summer. The FIBA basket interference rules have never been a major issue at any point anywhere in the world where they have been in use.\n\n\n7-footers do *not* just swat every ball that comes off the rim. Guys aren't just farming putbacks. And, no, the players aren't smaller as some might suspect (even third tier leagues like BAL have the same average height as the NBA).\n\n\nThis argument is hysterical and demonstrably false.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bagfka",
                                    "body": "The 7 footers in other leagues don’t share the same athletic ability as those in the NBA",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "antieverything",
                                            "body": "We regularly get to see top NBA players play with FIBA rules...that's why I mentioned international tournaments and not Euroleague or NBL or CBA (where it is, also, not a problem). \n\n\nWemby literally just came from a European league. He was not making a mockery of the rule at that level. He would not do so in the NBA, either. \n\n\nYou are grasping at straws. There is a mountain of data to look at and it simply doesn't support your claim.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "theroguesoybean",
            "body": "if its over half out it should count as a live ball. No way that spins itself in.",
            "score": -20
        },
        {
            "depth": 0,
            "author": "-XanderCrews-",
            "body": "The real issue I had with this call is that those shots are routinely called fine and then all of a sudden it’s not. It’s not the rule, but the consistency of calling it.",
            "score": -10
        },
        {
            "depth": 0,
            "author": "collinCOYS",
            "body": "It's always funny how refs make a call on this but they are just guessing. It's nice they have this VAR system to confirm calls because no ref can tell from the ground",
            "score": -22,
            "replies": [
                {
                    "depth": 1,
                    "author": "xPeaWhyTee",
                    "body": "I mean you had 2-3 Mavs players and some on our bench immediately signaling that it was interference so I don't see why a ref wouldn't be able to tell.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Brief-Objective-3360",
                            "body": "Because he put no thought into his comment",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "collinCOYS",
                            "body": "It was interference. But I'm not sure that Mavs players are unbiased observants",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "xPeaWhyTee",
                                    "body": "Sure and that's a good point. I'm just saying that it's possible to tell when interference happens. The refs did make the call after all and were correct.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "collinCOYS",
                                            "body": "I was never arguing it was the wrong call. It's a tough call to make and one that I often see made incorrectly. My point is it's nice to have this system that can make judgements on it. I was never complaining about the call",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "xPeaWhyTee",
                                                    "body": "I understood the point you were making. You said the refs are just guessing and I pointed out how you can tell on the court when it happens.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RubMyGooshSilly",
                                    "body": "To be fair, it’s also significantly easier to see in person with depth perception, than through a tv that does not have depth perception",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "theseyeahthese",
                                            "body": "Yeahhh but that’s not why they were signaling; if there was even a 1% chance of goaltending they’d be doing the same thing haha. Nothing wrong with that, just saying I seriously doubt they were asking for a review because they were 100% sure.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "RubMyGooshSilly",
                                                    "body": "I mean Luka was standing right next to it, I’m sure he could tell. You don’t see a whole lot of situations of that many players calling for interference when it isn’t",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bd_3",
            "body": "Mavs benefitting from weird, albeit clear cut rules the last 2 games, between this and the sga block. I think most would like both of those types of plays in the future to not go against the offender.",
            "score": -25
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -10,
            "replies": [
                {
                    "depth": 1,
                    "author": "antieverything",
                    "body": "This is literally as objective as officiating can possibly get. Why in the fuck would it create \\*more\\* errors?",
                    "score": 8
                }
            ]
        }
    ]
}