{
    "title": "[Dan Patrick Show] Charles Barkley says morale sucks amid the uncertainty of \"Inside the NBA\" moving forward. And discusses the possibility of hiring the crew to his production company, continuing to do the show, and selling it.",
    "comments": [
        {
            "depth": 0,
            "author": "2ndCatch",
            "body": "I would love this but I’m scared of it being like when the original Topgear producers left the BBC to start the Grand Tour.\n\nEven subtle changes can make something feel different from before and make it lose the magic of the original. Hope that’s not the case but still…",
            "score": 147,
            "replies": [
                {
                    "depth": 1,
                    "author": "szobossz",
                    "body": "i really liked the mongolia special. it’s my favorite one of both series combined. I think the issue was they grew old and have too many responsibilities to frequently go on trips.",
                    "score": 39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chief_blunt9",
                            "body": "Vietnam is my sneaky favorite. The mopeds made it for me watching them fall",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "Achutha_Sri",
                            "body": "Nah their humor is gone too. This was evident even in later seasons of Top Gear (17-19) when it felt less off the cuff and more scripted. The best part of TG was the banter b/w the three. \n\nWith the Grand Tour it's just a mixed bag, ironically when they were more restricted Jeremy wrote his best stuff. Once Amazon gave them more freedom the quality of humor went down big time imo",
                            "score": 14,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CursedLlama",
                                    "body": "I read the same criticism, that the restrictions from budget back at the BBC actually made them more crafty and creative, whereas with an unlimited budget from Amazon they lost that same charm.",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BigFatModeraterFupa",
                                            "body": "necessity is the mother of all invention",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TreadMeHarderDaddy",
                    "body": "Different strokes I guess. The Grand Tour is a gem. \n\nGranted I'm someone who likes travel shows, so I've always been drawn moreso to the specials",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "BenedictKhanberbatch",
                    "body": "I think the first season or two of TGT were good, they switched to only the long form videos and that's where I lost a little interest",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "BigCollarsAndBallers",
            "body": "If EJ is included in this somehow great, if not it won’t be the same.",
            "score": 635,
            "replies": [
                {
                    "depth": 1,
                    "author": "captainkhyron",
                    "body": "EJ really is the glue.  However, since they're all under contract to Turner (Chuck has the opt-out), I doubt Turner releases them.  It stinks because I have no idea what Turner would do with them now.  \n\nIt would be better for them to release their contracts and let them do it elsewhere.  However, we have no idea if the new network will have restrictions on what they can say...\n\nWould be much better for the show to be on network TV too.",
                    "score": 243,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "medievalmachine",
                            "body": "Turner will be ready to deal to stay in the game. And they still have college games, so keeping the crew happy in some fashion might work out. After all, they just did a CFB deal with frenemy ESPN.",
                            "score": 89,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "The_Notorious_Donut",
                                    "body": "ESPN let TNT have CFB games and TNT let’s ESPN have the inside guys lmao",
                                    "score": 35
                                },
                                {
                                    "depth": 3,
                                    "author": "jabronified",
                                    "body": "ESPN lets Kirk do NFL on amazon while still doing CFB on ESPN, NBC let Al Michaels do regular season on Amazon while retaining him for the playoffs until this year, so there is precedent for these guys being contracted for different things on different networks",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "SalvadorZombie",
                                    "body": "No one gives a fuck about college basketball nearly as much as the NBA.\n\nI'm being a *tiny* bit hyperbolic but there is so much less interest in any other basketball compared to the NBA. The WNBA is seeing a huge surge and it's still nowhere near it. Inside the NCAA does not work.",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Death_Calls",
                                            "body": "Hard to get attached to players on teams when you only have them for a year if they’re good.",
                                            "score": 14
                                        },
                                        {
                                            "depth": 4,
                                            "author": "PolarBearLaFlare",
                                            "body": "The only people who watch it outside of March are people who support their team lol and even then I’d say it’s still a very small crowd",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Briskpenguin69",
                                    "body": "ESPN, Fox, and WB Discovery are partners…",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BehavioralSink",
                            "body": "> It stinks because I have no idea what Turner would do with them now.\n\nHow about an MST3K style show where it’s the Inside guys watching movies and commenting as the film rolls?",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PineapplePandaKing",
                                    "body": "They watched those movies repeatedly and meticulously to write jokes and fit them appropriately into the flow of watching the film.\n\nI'm surprised when it sounds like Chuck and Shaq do their job and watch the games.",
                                    "score": 16,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BehavioralSink",
                                            "body": "Oh, totally understand it wouldn’t be the same thing, but just imagine the commentary if the 4 Inside guys sat down to watch something like Deliverance. 🤣",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ronaldo119",
                            "body": ">  I doubt Turner releases them\n\nI mean by not matching NBC's offer, they're being shrewd business wise. And continuing to pay them to do nothing out of spite for losing the rights is the opposite of that. Buy them out and let them go do whatever would seemingly match up with their actions so far",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "86themayo",
                                    "body": "\"by not matching NBC's offer, they're being shrewd business wise\"\n\nThey did match the money, but the NBA is claiming it's not a true match because WBD can't offer network coverage like NBC. Once WBD proclaimed they didn't need the NBA and let their exclusive negotiation window expire (thinking they could get the best deal that way), they lost their chance at keeping the rights. Nothing shrewd about their negotiations at all, it was big fuck up.\n\nNow WBD is considering suing the NBA, claiming that since they did match the money, the NBA has to stay with them. So there will probably be some bad blood there, one reason they might not let the rest of the crew out of their contracts.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ronaldo119",
                                            "body": "Ok if that's the case then they would definitely just keep them for the vanity of making the product of their replacement suffer",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "robsteezy",
                                    "body": "So in the industry, this is called “shelving” a product. It sucks to say that the spirit of fair play is disregarded, but it’s (from a business sense) purposely killing/hoarding a product for the exclusive purpose of keeping it out of the market for competitors. Really fucking sucks but it’s true.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ronaldo119",
                                            "body": "Yea and I could definitely see them doing that because public opinion would hate NBC for breaking up the show but I just thought that they decided the rights weren't worth the price and if that's their thinking then it makes even less sense to keep the guys on board when they could save money by buying them out.\n\nHowever, somebody else said that TNT just fucked up the negotiations and it wasn't just that they didn't want to pay for the rights. If that's the case, I definitely see them being shelved",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RickySuela",
                                    "body": "Yeah, I don't get why Turner would insist on keeping Shaq and Kenny under contract when they are NBA analysts on a network with no NBA games.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "SalvadorZombie",
                                    "body": "Non-competes are illegal now, remember? We literally just passed this law. You can't hold someone to a contract they don't want to be a part of.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SalvadorZombie",
                                            "body": "To the downvoters: https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes\n\nNon-compete clauses are illegal. As of LAST MONTH. Any existing ones are null and void.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "rowmean77",
                            "body": "Even if they all go together for a different show not under Turner, they need to be in cable TV. A lot of their schtick needs the cable TV network due to their adult comedy, which major TV networks can't do. \n\nI can't imagine the cursing and the green jokes making it in NBC, ABC lol. \n\nAmazon though yes.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "jpaxlux",
                            "body": "Tbh idk why Chuck would even opt out anyways. He'd be making an absurd amount of money to do nothing.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SquirtDoctor23",
                                    "body": "The idea of doing nothing is much less appealing to some people",
                                    "score": 63,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "EngleTheBert",
                                            "body": "They do bring him and Kenny in for March Madness recently. That being said I doubt Chuck just wants to sit home all year except for March",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheIndyCity",
                                                    "body": "who doesn't want to do that!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "andoCalrissiano",
                                                            "body": "Charles could be doing that since about 1987, he chooses not to",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "treple13",
                                            "body": "Charles can afford to do nothing now, and he's choosing not to",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Few-Chemist-3463",
                                                    "body": "doing nothing sucks, they have dream jobs for as long as they want them",
                                                    "score": 9
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "lordb4",
                                            "body": "I had a job for a couple months where I did nothing. It was the worst thing ever....",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "SquirtDoctor23",
                                                    "body": "I think it’s a personality thing hahah. I personally could accept not doing anything if it meant I could live my life and be comfortable still.  \n\n\nI know people that even if they didn’t need money they’d need to be busy.",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "The_Outcast4",
                                            "body": "Something I just can't wrap my head around. If I could do nothing and have a comfortable life, I'd never move a muscle again.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "cactusmaster69420",
                                            "body": "Redditors when they discover ambition",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "captainkhyron",
                                    "body": "They could pay him even more to get ratings.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "SalvadorZombie",
                                    "body": "He's been working with a group of guys (not just the hosts, but people behind the scenes) for about 20 years. That's a huge chunk of his life. That's a second family. He already has more money than anyone can really do anything with. Super-brief google check says anywhere from $60-70M. Shaq's worth half a BILLION, Kenny's worth something like $20M and Ernie's not that far off of that. They don't need any kind of contract that's not being honored and they have a 20-year long second family they're working with. That's motivation enough.\n\nAnd if there's no show, there's no contract. Their contract is to do Inside the NBA. If that show doesn't exist then they can walk. Non-competes were ruled illegal, remember. If WBD finds a new home for Inside the NBA, working out a deal to put it on one of the three other channels, then sure. But if not, those four guys are well within their rights to build their own show, hire all the old guys, and sell it to anyone else they want.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "UnsolvedParadox",
                            "body": "I’d like to learn more about the rights will be set up.\n\nIf TNT could change it to Inside Hoops & just lose game recap footage/ability to do interviews inside the arena, I’d still watch.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "IsraeluEvkk",
                            "body": "Especially when we know what a petty scumbag Zaslav is. ",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "fumar",
                            "body": "Turner's best bet is to license out the whole show to either NBC or Amazon if they lose the rights.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "SalvadorZombie",
                            "body": "If there's no show, there's no contract. Non-competes are illegal now. https://www.ftc.gov/news-events/news/press-releases/2024/04/ftc-announces-rule-banning-noncompetes\n\nIf there's no show, there's no contract, because the contract is payment for doing the show. Shaq isn't a blanket employee for WBD, neither are Ernie and Kenny. If there's no show, there's no contract.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Possible-Summer-8508",
                                    "body": "This cannot be correct. For a topical analogy: NBA players are held under contract by a team who reserves the right to have them play ball for them. Many of these players don’t actually play ball for them despite being perfectly able-bodied. Naturally, this does not mean that their contract is invalid and they can go play for another team. \n\nThe ITNBA cast members do not have typical employment contracts like you or me.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Funny-Mission-2937",
                                    "body": " they can still potentially negotiate that away.  they're not ordinary employees.  depends on how the contract is written, but it's normal for example when a TV show gets canceled or they get fired they might still draw salary through the end of their contract and be limited in their ability to do competing work for a similar show. ",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "StoneColdAM",
                            "body": "It’s more so if NBC would buy out their contracts. Seems highly unlikely. They’ll just get Maria Taylor and some random players floating around the networks like Paul Pierce, Crossover, and Draymond Green",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "caseylk",
                    "body": "I have to imagine Charles and the guys feel the exact same way. I think they’ll do everything they can to keep it the 4 guys",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "whtge8",
                            "body": "5* :(",
                            "score": -7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "caseylk",
                                    "body": "We including dray? Lol",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "whtge8",
                                            "body": "Unfortunately yes. It’s clear they want him there full time. Why am I being downvoted like I personally put him on the desk full time? 😂 I hate Draymond too",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "caseylk",
                                                    "body": "That could change with this whole thing though",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "IllllIllIllIllIllll",
                    "body": "Inside w/o EJ still better than anything else",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "captainkhyron",
                            "body": "True, but I want Ernie \"We're all black friends here\" Johnson to be united with his brothers.",
                            "score": 23
                        },
                        {
                            "depth": 2,
                            "author": "Inconsensical",
                            "body": "Monkey paw curls and in EJ's spot you get......Draymond Green!",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "here_for_food",
                            "body": "Doesn't work without him. Nobody wants to watch lefkoe",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Hurtelknut",
                    "body": "If not, it's dead. EJ is the cornerstone of the entire thing.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "SalvadorZombie",
                    "body": "This is the best thing to do going forward.\n\nHell, something very similar happened a few years ago with a UK show called Top Gear (there's a US version that is nowhere near as good), it's basically a show about cars, but it's really about the personalities of the three hosts. The BBC lowballed them, so they picked up and moved to Amazon, called the show \"The Grand Tour,\" and are doing it however and whenever they want now. And this was after nearly 20 years of doing it, similar to this.\n\nIf Chuck owns the show, first of all it keeps him in the show no matter what (which was always the worry the last two contract negotiations), and he could sign a deal with anyone *with the three NBA rights owners* to air the show. Inside the NBA (or whatever the new name is) could be on ESPN, Amazon, NBC, wherever (please not Amazon, their live services are trash). And he could even work it so that all of the main four (himself, Shaq, Ernie and Kenny) all get cuts of the profits, both motivating them to make a better show than ever *and* make future negotiations even easier. Hell, Chuck could then even get all of the key guys from Inside the NBA (and the behind the scenes guys really are crucial).",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Wentzina_lifetime",
                            "body": ">The BBC lowballed them,\n\nSlight embellishment of the truth. The leader of the three hosts (Jeremy Clarkson) had been very controversial for some years and the BBC gave him a last warning for his conduct on the show. On the next series he punched a producer and the BBC kicked him out. The other two hosts followed him out the door as well as the executive producer. It was only after this that they went to Amazon.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SalvadorZombie",
                                    "body": "Oh that's actually true. I wasn't embellishing, I forgot about that entirely. Yeah, Clarkson's kind of a POS IRL (not even \"kind of\").\n\nThe point remains, though. The Inside the NBA team can absolutely do the same thing if Inside the NBA stops being a thing. If WBD works out a deal to put it on one of the other three options, then sure, they stay as Inside the NBA. But the second Zaslav's stupid ass decides to can the show, they're free to go wherever. And that includes every single person on the show, too. The four hosts could absolutely fund a new version of the show with a different name, hire all of the old workers, and sell it to anyone (including the three rights-holders).\n\nActually, they could sell it to MORE THAN ONE of the rights holders. Disney for airing on ESPN and ABC, and Amazon for online streaming rights.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "fumar",
                                            "body": "Part of what made that top gear crew was that Clarkson was kinda a POS. \n\n\nSucks what happened to Freddy because that crew was pretty good after years of shit.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CosmicCoder3303",
                    "body": "I like Ernie a lot but he is vastly overrated on this subreddit. I think a lot of redditors identify with like the nerd guy on this on the panel lol. No offense",
                    "score": -5
                }
            ]
        },
        {
            "depth": 0,
            "author": "BigBootyBanger",
            "body": "Farewell tour next season and then Ernie stays, Chuck and Shaq go somewhere. Kenny gets a bag",
            "score": 48,
            "replies": [
                {
                    "depth": 1,
                    "author": "echtav",
                    "body": "And Draymond gets the boot",
                    "score": 33
                },
                {
                    "depth": 1,
                    "author": "TreadMeHarderDaddy",
                    "body": "I'm gonna call it. Kenny goes to coach at UNC",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "F5SeasonOfficial",
            "body": "Small glimmer of hope that the rodeo isn't over?",
            "score": 87,
            "replies": [
                {
                    "depth": 1,
                    "author": "caseylk",
                    "body": "I think it’s bigger than glimmer and they’re just waiting on confirmation / official meetings so that they can head toward next steps from legal perspectives and stuff like that. There’s no way these guys aren’t gonna cover the nba anymore",
                    "score": 37,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "szobossz",
                            "body": "they could just buy highlights package rights and build a show. Fox regularly covered nba despite never having the rights. skip and shannon was centered on nba.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "caseylk",
                                    "body": "Yup! I think this is the way to go. Maybe sell the product to a streaming service? YouTube live or something? Idk just thinking out loud",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "SkiptomyLoomis",
                                    "body": "Would they be able to interview players if they did that though? That's one of my favorite parts of the current show.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lilb1190",
            "body": "I would rather you retire the show on a high note than bring Draymond on full time after he retires.",
            "score": 224,
            "replies": [
                {
                    "depth": 1,
                    "author": "mikro17",
                    "body": "I'm pretty neutral on whether they bring Draymond into the studio to try and replace Chuck tbh.\n\nOnce Chuck is gone, I'm already not watching, so at that point I don't really care who specifically I'm not watching.",
                    "score": 52,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ant1H3ro",
                            "body": "Pretty much exactly where I’m at. It’s lightning in a bottle, the moment you pop the cork to mix it up is the moment you lose the whole thing.\n\nThey had a GREAT run, I’m personally okay with letting it go",
                            "score": 15
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Thin_Ad5822",
                    "body": "WDS",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Skylightt",
                    "body": "I don’t really get this sentiment. I’d rather the show just keep going and then tune out after Draymond’s there rather than stop it a few years early.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "johnyg13nb",
            "body": "David Zaslav is a plague on humanity and every day I hope for his downfall",
            "score": 89,
            "replies": [
                {
                    "depth": 1,
                    "author": "ObviousAnswerGuy",
                    "body": "in his defense (and I feel icky saying that), he had a matching deal with the NBA, but the NBA bumped up the price for them, basically saying that since NBC is a network and reaches more eyes, TNT should pay more.  \n\nSo looks like they are probably taking it to court to dispute that.  If this was a sport we didn't care about, everyone would saying the league is screwing them over.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FromAdamImportData",
                            "body": ">basically saying that since NBC is a network and reaches more eyes, TNT should pay more.\n\nI hope the NBA did do something like this. They've been paywalling their content for so long behind expensive cable packages that they accidentally trained an entire generation of fans that they don't have to watch the games to follow the league.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Hungry_Bat_2230",
                            "body": ">the NBA bumped up the price for them, basically saying that since NBC is a network and reaches more eyes, TNT should pay more.\n\nThe asking price was bumped up because Disney, adamant on not letting ESPN's “A” package  hit the open market, [doubled](https://www.mediaite.com/sports/charles-barkley-goes-scorched-earth-on-tnt-management-clowns-for-losing-nba-tv-rights-they-screwed-this-up-so-badly/#:~:text=In%20the%20current,WBD%20currently%20pays.) their bid. \n\nThis drove up the NBA's valuation of the \"B\" package held by TNT. \n\nZaslav however refused to play ball by raising the bid to double the amount TNT currently pays. WBD supposedly still has the right to match offers to retain the “B” package.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ikigaii",
            "body": "It seems like an obvious win-win-win-win situation if TNT just lets NBC use Inside The NBA's branding and Ernie. Just shoehorn some advertisements for Turner products into the contract and everyone makes money, hard to figure out about this?",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "phonage_aoi",
                    "body": "TNT just sub licensed a bunch of football games from ESPN.  So it’s possible they do a few NBA games for like a weekly thing?  Please?",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fluffytheman69",
                            "body": "Even like one day a week!!!\n\n3-4 games!!!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "LarBrd33",
                    "body": "Yeah NBC can just co-produce the show with TNT like when Sony let the MCU use Spider-Man.  Then just like Sony produces terrible Spidey spin-offs like \"Morbius\", TNT can have their own spin-off shows starring Draymond Green.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "brncct",
            "body": "They had a good run",
            "score": 6
        },
        {
            "depth": 0,
            "author": "african-nightmare",
            "body": "I swear we have this exact same thread every day with the exact same comments.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Railshock",
                    "body": "It's gonna get moldy soon enough.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Paralta",
            "body": "Keep in mind, Ernie is the \"serious\" aura you need in order for charles to break it, which makes it funny. Without Ernie it'll be trash, I promise you.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Poon-Conqueror",
                    "body": "It's a back and forth, I mean, have you seen what the show was like before Chuck? It wasn't bad, but Kenny legit used a completely different accent lmao.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "A-Centrifugal-Force",
                            "body": "Ernie and Chuck are the dynamic duo that makes it work. The point guard and the big, just like how basketball used to work. Ernie sets up the show and Chuck dunks it. You need them both. That’s not to say Shaq and Kenny aren’t important too (there’s a reason why Inside is better than The Steam Room), but Ernie and Chuck are truly irreplaceable",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Poon-Conqueror",
                                    "body": "I agree, there's tons of comparisons you can use for those two. Ernie was a perfectly competent analyst/host pre-Chuck (hard to consider him a host when he was solo 8 of those 10 years pre-Kenny, but w/e), but he was a straightforward suit who gave you the breakdown. \n\nThen they brought in Kenny as the ex-pro voice to give his take, and like Ernie, he was a suit guy, he chimed in with a made-for-TV neutral American accent. Still a fine show, now there's dialogue instead of just news, but nothing groundbreaking or novel.\n\nThen they brought in Chuck, who was nothing like Kenny, or at very least nothing like what Kenny was trying to present on TV at the time. He completely warped the dynamic with his personality. Without Chuck, you have a perfectly fine show about basketball, without Ernie, you have an entertaining podcast/talk show that may or may not even talk about basketball, but what people consider 'Inside the NBA' would not exist without either of those two. I don't think either are replaceable, Ernie is just so good at managing the personalities and keeping the show (mostly) on track, while still allowing the others to be themselves without losing control. I don't think that can be replaced, and as for Chuck, I don't think there's another person in the world like him.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AlexeyShved1",
            "body": "Can the crew you hire not include Draymond Green please?",
            "score": 40,
            "replies": [
                {
                    "depth": 1,
                    "author": "Oxygenius_",
                    "body": "It’s going to be Chuck, Shaq and Draymond \n\nAnd you’re gonna like it",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "btmalon",
            "body": "Shaq ain’t about to sign on to be Chuck’s employee lol. But I hope it all works out.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "bananaruns",
                    "body": "Has Shaq ever turned down a bag?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "RareWestern306",
            "body": "Surely they can still air Inside the Nba without airing games",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "bryan49",
                    "body": "Seems possible, although I would think ratings would slump without having the actual games to draw TV viewers in",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LarBrd33",
                            "body": "actually probably will get way more viewers if it just exists as a YouTube thing we can watch on our own with built in ads.  Just like more people watch SNL clips via Youtube than the actual live broadcasts.\n\nStreaming show makes total sense given how modern NBA fans interact with the NBA through highlight videos, podcasts, etc.\n\nI fully expect this show to exist in some capacity when the deal ends.  Whether it's a new production with the same team, or TNT continuing to produce it for NBC or Amazon, or just a streaming show... it will exist.  Ernie will be involved.  Money will be made.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bryan49",
                                    "body": "Oh yeah I mostly watch on youtube. But I'm sure they also get a lot of views from people who are watching the game on TV and stick around for the half game and post game show",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "A-Centrifugal-Force",
                    "body": "FS1 is basically able to do that with First Thing’s First and Undisputed so maybe. They’d have to work out a side deal with the NBA to show highlights though probably, similar to what McAfee had to do with the NFL prior to the ESPN acquisition (where they paid millions of dollars to show NFL highlights but weren’t allowed to pause them or use logos because that was an additional charge LMFAO)",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "FlatBirthday333",
            "body": "Im sure one of the streamers will throw a big bag at them if they go independent",
            "score": 3
        },
        {
            "depth": 0,
            "author": "luke_workin2",
            "body": "Is there no chance they could just produce a pre/postgame show and keep it on TNT or upload it to YouTube or something? Just don’t broadcast the live game if you don’t have the rights.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "trekfan1013",
            "body": "I'd be for it. These guys deserve to go out on their own terms.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "hungrywantmooshoo",
            "body": "If the money is right - there is always a deal to be made. If I’m NBC or Amazon, and I just shelled out $2b for the rights, am I really going to spend another large sum of money for a network tv show? I would guess no, but I could be wrong",
            "score": 2
        },
        {
            "depth": 0,
            "author": "wpmason",
            "body": "If Chuck is Shaq’s boss he gonna get fired every episode.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "The_Notorious_Donut",
            "body": "Help us Chucky Wan, you’re our only hope",
            "score": 2
        },
        {
            "depth": 0,
            "author": "pompcaldor",
            "body": "How? I assume the crew is working on other Turner productions during the off-season.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "At6-8FromSyracuse",
            "body": "Seems more likely than not that what ends up happening is Inside getting picked up by another network",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Zachary_Stark",
            "body": "Hire me Chuck!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "entityrob",
            "body": "Might be the best course of action if TNT completely loses the rights. Sign a distribution deal and sell it to Amazon for their coverage.\n\nHas a different broadcaster ever done the studio shows or have they always done them in-house? It'll never happen, but what if TNT could somehow produce Inside the NBA for Prime so they don't have to deal with trying to get around copyrights and trademarks. What's the point if there's no \"Who he play for?\" or \"EJ's Neat-o Stat of the Night (unsullied by sponsorship since 1988)\"\n\nErnie will still be bound to his Turner contract and probably still wants to do golf and baseball for them. While he does do March Madness on CBS, that's a co-production with Turner, maybe they can amend his contract one more time to allow him to do Inside the NBA 2.0 on Amazon like Kirk Herbstreit does\n\nThere is the question about how they might work with less restrictions if they possibly go to Amazon, if it's like the Thursday Night Football deal, the game is still shown OTA in the team's markets, so ironically, there might be more restrictions on what they can say",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Pipes_of_Pan",
            "body": "I love how Charles is worried about the staff, wants to take care of them, and is trying to figure out how to keep working with them. I don't know but I suspect that the behind-the-scenes stuff has a huge impact on the casual and loose vibe of the show. Nothing is more charming than when you can hear the crew cracking up. I don't think the show will be even close to the same if you drop the four on-camera guys onto an NBC set.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Theanswer17",
            "body": "Final piece is most likely (although probably turner directly rather than chuck)\n\n  \neither amazon or nbc will pay turner to produce it. Makes 0 sense for everyone involved for show to die.\n\nturner gets money (which they need)\n\namazon gets instant relevance\n\nfans get the show\n\nhosts keep getting paid",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DumbNBANephew",
            "body": "I don't understand why people are up in arms about this show ending. It was always about saying things that would get reactions instead of actual analysis. That's why they had Chuck in the first place. \n\n\nNow Chuck, he played the line really well. Saying things bound to rub people the wrong way, but being somewhat nice about it and had a decent reason to say what he said. Then they added Shaq.\n\n\nUnless Chuck, Shaq is just one dumb motherfucker who was just there for entertainment and while he said stupid shit, he was entertaining.\n\n\nThen they added Draymond.\n\n\nThis asshole brings no real analysis to the table, isn't as agreeable or loveable as Chuck and isn't nearly as entertaining as Shaq.\n\n\nThis show put it's foot in the grave when they added him. This whole TNT not getting rights thing just got ahead of that. If Chuck retired like he said he would and it you had to listen to fucking Draymond and and Shaq, would you really watch it?\n\n\nThis is like NBA taking it's horse out back and shooting it so it doesn't have to suffer in it's end days.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "histprofdave",
            "body": "With Amazon jumping into the ring, I feel like it wouldn't take a ton of convincing from Chuck to get a halftime show for their broadcasts.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "thealternateopinion",
            "body": "Please drop Kenny",
            "score": 1
        },
        {
            "depth": 0,
            "author": "5-toolplayer",
            "body": "No Draymond Green please.\n\nSeriously how does he have a job and get to sit with these guys?\n\nHow do they sit next to him knowing what he does on the court?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LarBrd33",
            "body": "I fully expect this show, with entire crew, to exist in some capacity during the new deal.  It's way to premature to act like TNT losing rights means there isn't some route to keep this show alive even if it's a co-production or outsourced production, or whatever.  \n\nThey have a winning formula with a built in fan base that will tune in.  Either NBC or Amazon will be airing it live or via their streaming apps with or without TNT producing it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "yousonuva",
            "body": "Bring ya ass\n\n\n-ESPN",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "thesmellafteritrains",
                    "body": "No shit, where'd you hear that? The title of the post?",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Best_Extent_411",
                            "body": "It’s a bot ",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "thesmellafteritrains",
                                    "body": "I've been had",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "HughGereckshun",
            "body": "Honestly I’m losing interest in trying to watch sports these days. At this point you’re going to need cable/live service, Prime AND Netflix to watch basketball and football. B/R is going to start charging for sports on Max soon. Don’t even get me started on baseball. That is way too much of a cost for me when I have so many other forms of entertainment for much less and ad-free. The fact Prime gets the first round of the playoffs is ridiculous. The only benefit to this is you’d get Sunday night basketball OTA when there’s no NFL but just imagine Inside the NBA becoming an ESPN product just makes me want to throw up.\n\nI hope they go the route of simulcasting on YouTube and whatever other service.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ruhtraeel",
            "body": "Just please don't include Shaq",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SchmitzFreilandeier",
            "body": "How would they do the show if they cant show NBA clips/ be affiliated with the nba?",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Totally_PJ_Soles",
                    "body": "They won't show clips from the game or Kenny's little presentations but the rest is usually graphics of stats or them reading them.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SchmitzFreilandeier",
                            "body": "well they wont have access to interviews with players, you will have to change the channel or go to some online stuff parallel/after the games, cant show any basketball, no official association.. i just cant see how this would be feasible",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "GaimeGuy",
            "body": "I'm sure Zaslav's lawyers will let that slide",
            "score": 0
        },
        {
            "depth": 0,
            "author": "WearyRound9084",
            "body": "So we not holding Chuck accountable for ducking the grind? \n\nThe same way he told KD to stay with Westbrook, he should stay with Zaslav.\n\n\n-15 legacy points",
            "score": -11
        },
        {
            "depth": 0,
            "author": "dirkslance",
            "body": "Ima keep it real with y’all, all we’re getting out of this is either a Charles Barkley podcast or Kazaam 2",
            "score": -1
        }
    ]
}