{
    "title": "Both Billie Eilish and Taylor Swift have discounted and released remixes of their songs",
    "comments": [
        {
            "depth": 0,
            "author": "greee_p",
            "body": "I love artists who just release one version and don't bother doing all this.",
            "score": 2978,
            "replies": [
                {
                    "depth": 1,
                    "author": "MedicalPersimmon001",
                    "body": "I truly believe that Harry Styles did not deserve AOTY over Renaissance, but that man had the song of the year in the bag with absolutely NO remixes.",
                    "score": 568,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "greee_p",
                            "body": "It's pretty crazy that As It Was broke so many records with one single version.",
                            "score": 211
                        },
                        {
                            "depth": 2,
                            "author": "everydayisstorytime",
                            "body": "Agree. Renaissance should have gotten AOTY. Still wild it didn't.",
                            "score": 57
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Honest_Assistance910",
                    "body": "Isn’t Billie’s like isolated vocals and stuff like that so people can use it to mess around with. Like DJ’s and shit.",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "gaijin91",
                    "body": "same, but I'm also somehow not mad at Billie",
                    "score": 832,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "greee_p",
                            "body": "Yeah, I get that. But doing this after saying she finds it \"irritating\" when people care so much about numbers is also not the best look.",
                            "score": 1415,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PmMeLowCarbRecipes",
                                    "body": "I thought she was just saying about releasing multiple physical copies, because it’s bad for the environment?",
                                    "score": 387,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "greee_p",
                                            "body": "She also said this:\n\n\n> It's irritating to me that we're still at a point where you care that much about your numbers and you care that much about making money.”",
                                            "score": 496,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PmMeLowCarbRecipes",
                                                    "body": "Ooooof!",
                                                    "score": 88
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "tiny_venus",
                                                    "body": "I heard that she’d put out a free download code for people had already bought it? Could be wrong but I’m rooting for billie in this beef lol",
                                                    "score": 64
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Novel_Flamingo_732",
                                                    "body": "To be fair she isn't contradicting herself",
                                                    "score": -19
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "messythelioma",
                                            "body": "yes! that's true, but also I would assume digital copies have a carbon footprint similar to how emails do so still not a great look (though obv physical copies would be worse for the environment)",
                                            "score": 30
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "hakk_g",
                                    "body": "Billie also said artists are forced to do it to stay competitive in the industry. She even admitted to doing it herself. People always read the headlines and not even the whole article. Plus once again, she's right because now she's forced to do this because Taylor Swift wants to block her. Taylor is a miserable salty sore winner.",
                                    "score": 129
                                },
                                {
                                    "depth": 3,
                                    "author": "movienerd7042",
                                    "body": "To be fair (I also posted this in popheads and I’m getting downvoted lol), she admitted that she was part of the problem and at the same time specifically said that she found it frustrating when artists try to increase sales by releasing 40 different variants and then they have exclusive content on each",
                                    "score": 29
                                },
                                {
                                    "depth": 3,
                                    "author": "olegass",
                                    "body": "Billie not giving two shits about charts does not equal her team/label wanting push the record to #1. That’s not hard to understand at all.",
                                    "score": 38
                                },
                                {
                                    "depth": 3,
                                    "author": "Anxious-Ad304",
                                    "body": "She's clearly doing it for what she's been going through with Taylor, I think it's fair. She's 22, let her fight the big bad bully in her own way.",
                                    "score": 55,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "blodreina11",
                                            "body": "Yeah I'm not gonna be mad at her for hitting back after being specifically targeted by the biggest artist in the world",
                                            "score": 16
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "purple_butterflies_",
                                    "body": "I thought her main qualm was about the many physical releases. Was it also in general about numbers?",
                                    "score": 6
                                },
                                {
                                    "depth": 3,
                                    "author": "rocknroller0",
                                    "body": "Labels are very involved in this. Especially in Billie’s case",
                                    "score": 19
                                },
                                {
                                    "depth": 3,
                                    "author": "Time_Basket9125",
                                    "body": "Am I naive/tin foil hatting if I think Billie is doing this to spite Taylor?",
                                    "score": 10
                                },
                                {
                                    "depth": 3,
                                    "author": "SpiffySleet",
                                    "body": "She’s young and probably didn’t realize the contracts she’s under for labels to release music however they want",
                                    "score": -12
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sometimesomwhere",
                            "body": "Taylor being greedy doesn't exempt Billie from being hypocritical by engaging in the behavior she criticized.",
                            "score": 25
                        },
                        {
                            "depth": 2,
                            "author": "coralsmoke",
                            "body": "I feel the same and I think it’s because Billie is 22 and young, she’s kind of following the lead set by those who came before her and set the norm. \n\nYou know, like Taylor Swift. The 34 year old woman who can only seem to find worth in sales and numbers. \n\nIt impacts the whole industry trying to keep up.",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sunshinechew",
            "body": "the girls are fightingggg\n\nhttps://preview.redd.it/iztis34o042d1.jpeg?width=956&format=pjpg&auto=webp&s=c983731cd73a568ee8292d2700d3e4e2f5eb6afc",
            "score": 1497,
            "replies": [
                {
                    "depth": 1,
                    "author": "Right_Way_4258",
                    "body": "I love it!! Finally someone being petty back! Billie even posted about a streaming party on her IG today.  Like I would do the same! She’s being chill about it though and not crying and tweeting like so many artists we’ve seen. She knows she has a good album and even with all these online antics so many ppl are not paying attention to this petty bullshit and will listen if they enjoy it and the general consensus with the public is it’s great. If you’re not super online, so many ppl are so unaware of this and I haven’t seen Billie stans act crazy so far?? I’ve seen ppl saying stream and stuff but nothing cult like",
                    "score": 281
                }
            ]
        },
        {
            "depth": 0,
            "author": "Weekly_Yesterday_403",
            "body": "Ok serious question… who is buying singles on iTunes",
            "score": 234,
            "replies": [
                {
                    "depth": 1,
                    "author": "rain820",
                    "body": "right??? like thats still a thing?",
                    "score": 65
                },
                {
                    "depth": 1,
                    "author": "blodreina11",
                    "body": "1. Stans who want their artist to win on the charts\n\n2. Old people\n\n3. Anti-streaming people",
                    "score": 37,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "willienelsonmandela",
                            "body": "4. Republicans every time one of those MAGA rappers has a new song and they think they’re taking a brave political stance. (So reason 1 but for brain dead white guys).",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bbmarvelluv",
            "body": "“Sped Up?”\n\nBack in my day, we called that nightcore. Bonus points if the image has an anime character.",
            "score": 861,
            "replies": [
                {
                    "depth": 1,
                    "author": "r4rtv",
                    "body": "Back in my day, we called it chipmunk version",
                    "score": 793,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PmMeLowCarbRecipes",
                            "body": "THANK YOU",
                            "score": 103
                        },
                        {
                            "depth": 2,
                            "author": "bbmarvelluv",
                            "body": "how did i forget 😭",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "TranceIsLove",
                            "body": "Back in my day it was The Smurfs Go Pop! version",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MM2225",
                    "body": "omg i used to have an OBSESSION with nightcore mv 🫣",
                    "score": 109
                },
                {
                    "depth": 1,
                    "author": "louisemichele",
                    "body": "God you just took me back 10 whole years, the good old days",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "holyflurkingsnit",
            "body": "Oof. I know Billie just spoke out against the bland avalanche remixing/versions practice, and I really wish she would have made a point by NOT doing this exact thing, regardless of whether or not it keeps her \"brand\" \"competitive\" or whatever the end goal is.\n\nAlso, can we make a cultural movement back towards turning remixes of songs into completely new absolute fuckin BANGERS? The 90s r&b, rap, and hip hop remixes were the BEST, and often totally leveled up solid or even genuinely great tracks into creatively reimagined gems. Or, at the very least, you could see and hear the effort put into the remix by the artists involved, instead of jamming a rap in the middle or at the front and calling it a day.",
            "score": 1116,
            "replies": [
                {
                    "depth": 1,
                    "author": "liqou",
                    "body": "Listen to the remixes Beyoncé did for Cuff It and Texas Holdem. Completely reinvented the songs. She comes from the old school of remix when Destiny's Child used to release remix EPs.",
                    "score": 75
                },
                {
                    "depth": 1,
                    "author": "Shenanigans80h",
                    "body": "Exactly, make a “remix” into an actual remix that adds something new or recreates the song into an entirely different genre. Just speeding up or slowing down a song is lazy and peak chart/social media gaming",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "exploitationmaiden",
                    "body": "Releasing remixes itself isn’t the problem. It’s the producing of multiple physical versions that she criticized. As far as I know her remixes are exclusively online. I think you can at least make an argument for the artistic merit of producing alternate versions of the same songs with different production vs releasing the same album with different bonus tracks thus incentivizing fans to buy multiple versions of that album.",
                    "score": 413,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ventodivino",
                            "body": "I thought the whole blurb started with Billie saying “I hate the whole physical versions thing, but it’s something the label is doing and I’m making sure it’s at least more sustainable than it otherwise could be”",
                            "score": 24
                        },
                        {
                            "depth": 2,
                            "author": "Right_Way_4258",
                            "body": "I just looked at this entire remix album is $7 and only available for 24 hours. And not available internationally. It’s kind of a collectors item and she knows it’s obviously going to be shared for free somehow after she takes it down past the 24 hours. I prefer this like you said compared to releasing 5 bonus tracks but you have to physically buy 5 different vinyls to hear 5 extra songs. That’s insanity. And she dropped an extended remix of this fan favorite part of a song people were already wishing was longer and I’ve had that on a loop. Now I don’t have to listen to one song to get to the part I like at the very end. She’s being smart about it and doesn’t feel like you HAVE to collect everything bc her fan base probably wants to be eco friendly as well compared to Taylor’s fan base. I’m sure there are collectors but I don’t get the vibe that’s what Billie wants her fans to do. She has to play the game. Even Beyonce does a few variants. But it’s how you approach it and I’m sure there will be other singles and remixes that Billie drops but no other artist is blatantly trying to block someone’s success each week in a super obvious way than Taylor. Context matters",
                            "score": 55
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "meatbeater558",
            "body": "Ah yes, capitalism driving prices down",
            "score": 268
        },
        {
            "depth": 0,
            "author": "Sudden_Clementine872",
            "body": "![gif](giphy|fQoIDlLW6A6BAhyev8|downsized)",
            "score": 80
        },
        {
            "depth": 0,
            "author": "Throwaway500005",
            "body": "Billboard really needs to stop allowing these remixes and versions to count for extra units on the charts",
            "score": 54
        },
        {
            "depth": 0,
            "author": "Dizzy_District_4801",
            "body": "Artist needs to learn from Lorde.  She is so environmentally conscious that she released a no-CD CD that ended up not being considered for billboard sales. Plus she is funding scholarships for antarctica research",
            "score": 86,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lunadelmar1",
                    "body": "whats a no cd cd? to be honest i dont listen to Lorde, but she always seemed self aware and not in your face. Both Billie and Taylor need to learn from her",
                    "score": 16
                }
            ]
        },
        {
            "depth": 0,
            "author": "Financial-Painter689",
            "body": "Taylor hates other women succeeding. and billies comment about millions of variations really really bothered TS like damn",
            "score": 597,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fun-Loss-4094",
                    "body": "Funny thing is her fandom acts like calling for climate change is wrong, as if Taylor is doing some nice thing about climate crisis like grow up. ",
                    "score": 119
                },
                {
                    "depth": 1,
                    "author": "Right_Way_4258",
                    "body": "It’s crazy! Hit dogs holler",
                    "score": 40
                }
            ]
        },
        {
            "depth": 0,
            "author": "sweetrebel88",
            "body": "Billie said you wanna play dirty so I’ll play dirty too",
            "score": 62
        },
        {
            "depth": 0,
            "author": "thereisalwaysrescue",
            "body": "Taylors version of feminism is… awful honestly. She hates to see other women succeed (and this is coming from a Taylor fan!)",
            "score": 63
        },
        {
            "depth": 0,
            "author": "whos-on-ninth",
            "body": "One has multiple Oscars and a realistic chance at an EGOT, the other writes weird lines about the 1830s…",
            "score": 38,
            "replies": [
                {
                    "depth": 1,
                    "author": "blodreina11",
                    "body": "Now that you mention it yeah, she might be gunning for youngest EGOT winner. Current record is 39 years old and she's already halfway there.",
                    "score": 14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GroundbreakingBite96",
                            "body": "I don’t see her doing anything Broadway related tbh",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "repladynancydrew",
                                    "body": "Maybe they’ll do a Barbie broadway show and tap Billie to participate",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "bubblegumwitch23",
                                    "body": "Wasn't her mother on Broadway? I could be misremembering. I could see her taking some time off after the album promo and getting more into acting/stage stuff.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "spearitualzone",
            "body": "Gotta be team Billie on this. Those new mixes from her website don’t even look chart eligible and like random .wav files but I don’t know for sure. I think it’s Taylor who’s going to come out worse from all this in the long run",
            "score": 20
        },
        {
            "depth": 0,
            "author": "Original_Data1808",
            "body": "I feel bad for Billie. Her album was much better than Taylor’s, and I say this as someone who gave both albums a fair chance",
            "score": 20
        },
        {
            "depth": 0,
            "author": "bubblegumwitch23",
            "body": "Can somebody put into bullet points what this beef is about and how they're exactly beefing? I saw a thread sharing screenshots of them supposedly beefing but I didn't get how that was the case? And how is them releasing remixes evidence of that?",
            "score": 1
        }
    ]
}