{
    "title": "Miley Cyrus stuns in new photo from Netflix’s ‘My Next Guest Needs No Introduction with David Letterman.’",
    "comments": [
        {
            "depth": 0,
            "author": "Mochimojo100",
            "body": "Love she is brunette again this is the best her hair has looked in years",
            "score": 1651,
            "replies": [
                {
                    "depth": 1,
                    "author": "hikehikebaby",
                    "body": "She looks more like her old self than she has in most recent photos and I love it.",
                    "score": 382
                },
                {
                    "depth": 1,
                    "author": "down_by_the_shore",
                    "body": "Couldn't agree more. It looks so full and HEALTHY!",
                    "score": 104,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Raoul_Dukes_Mayo",
                            "body": "It’s a wig but I agree it looks really nice.\n\nEdit: dang y’all! I’ve learned so much more about wigs, clip ins, extensions, y’all are awesome!",
                            "score": 112,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "damnitimtoast",
                                    "body": "I actually think it is extensions. If you look at the top it is very full with short layers to give volume and hide whatever is keeping the hair on her head. The longer part is all kind of one layer and looks *just slightly*  different in color and texture than the top part. Source: wore extensions for years and learned all the tips for hiding your tracks.",
                                    "score": 62,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "iammissx",
                                            "body": "I think it’s extensions, too. Look at the damage to her hair at the bottom, there’s no way that’s all wig.",
                                            "score": 13
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "TheWorldIsAhead",
                                    "body": "When will you wear wigs?",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Raoul_Dukes_Mayo",
                                            "body": "Me? As soon as I can afford one that’s not from party city.  \n\nI think wigs are awesome! I have a few family members who wear them from medical ailments and they always look great. One who switches out a couple for fun!",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheWorldIsAhead",
                                                    "body": "Ah just a joke. [https://www.youtube.com/watch?v=-xqEABqaEuo](https://www.youtube.com/watch?v=-xqEABqaEuo)",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Raoul_Dukes_Mayo",
                                                            "body": "Oh damn, haha! Sorry! Totally missed that. \n\nI still would. 😂",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "PropofolMami22",
                                    "body": "Oh wow I had no idea! How do you tell?",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Raoul_Dukes_Mayo",
                                            "body": "I am be TOTALLY wrong -  but wigs are super common with musicians especially during concerts. It’s also really thick and if you look at the front the hair line is kinda covered up. \n\nBut I may be wrong and I could care less what she does with her hair - I still loooooove her.",
                                            "score": 59,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "LostHusband_",
                                                    "body": "The other thing you have to remember is that Dolly Parton is her godmother.  If anyone knows a thing or two about a good wig it's Dolly.",
                                                    "score": 74,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Raoul_Dukes_Mayo",
                                                            "body": "“Take a lot of money to look this cheap”. God bless Dolly. A saint, an angel and a bad ass.",
                                                            "score": 39
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Eternal_MrNobody",
                                                    "body": "That’s first thing that came to mind, in the front it looks unusually thick and full.\n\nI thought maybe extensions to, extensions are also very enhancing, nonetheless she looks nice brunette.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Beezo514",
                                    "body": "If it is, that lace line is unclockable. \n\nIf it isn’t, it’s also possible she has some clip ins or sew ins underneath to give her the extra volume. \n\nNo matter what, that is definitely not all of her own hair.",
                                    "score": 9
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "syvette20",
                    "body": "Agreed!!",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 303,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 146,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": -19,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": -11,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 5
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ampmetaphene",
                    "body": "It's all my eyes are drawn to now.",
                    "score": 87
                }
            ]
        },
        {
            "depth": 0,
            "author": "dragondragonflyfly",
            "body": "I’ll always have a soft spot for her. She was the first concert I ever attended!! (she was Hannah Montana, haha~)",
            "score": 1450,
            "replies": [
                {
                    "depth": 1,
                    "author": "PerkisizingWeiner",
                    "body": "Me too! I saw her when she toured with the Cheetah Girls haha",
                    "score": 185,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dragondragonflyfly",
                            "body": "I was a whole whopping 12 and freaking out lmao! 😂",
                            "score": 72
                        },
                        {
                            "depth": 2,
                            "author": "itsmeb1",
                            "body": "Omg took my daughter to that for her first concert. You guys were all so cute and overly cheetah dressed 🤣",
                            "score": 26
                        },
                        {
                            "depth": 2,
                            "author": "jpegtaylor",
                            "body": "i wanted to go to that tour so bad 😭😭 begged my mom for months",
                            "score": 29
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "soapiesophs",
                    "body": "I was, and still am, so obsessed with her! my older sister and her husband were in Vegas when she was doing a Hannah Montana concert and they got me a wig and it was my most loved item, next to my Miley Cyrus microphone that were used lovingly together 😂",
                    "score": 43
                },
                {
                    "depth": 1,
                    "author": "bananaslug178",
                    "body": "Mine too. Her and the Jonas Brothers 😅",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dragondragonflyfly",
                            "body": "Oddly, I never got into the JoBros! It was Cheetah Girls and Hannah Montana for me :)",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "Impossible-Success45",
                            "body": "Omg the combo one was my first concert too!!! it was a gift to me and my bff who had just been diagnosed with cancer. it’s genuinely one of my sweetest memories with her 💕",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "BustaLimez",
                            "body": "I went to the one with her and the Jonas brothers as well!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dumbguy_dumbguy",
                    "body": "Did she play “if we were a movie” ??",
                    "score": 24,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dragondragonflyfly",
                            "body": "I think so!",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "youllneverknowhy",
                    "body": "WHAT!? Hannah Montana was Miley Cyrus????",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Redshirt2386",
                            "body": "Oh my God this comment makes me feel so old 😭",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "icestormsea",
                    "body": "Me too! She’s so talented",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "PhoenixorFlame",
                    "body": "Me too! My parents put me in the car, wouldn’t tell me where we were going, and COMPLETELY surprised me!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dragondragonflyfly",
                            "body": "Awww, that is honestly the cutest thing.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fleeceflowers77",
                    "body": "I saw her in early 2008 in New Orleans with my dad and best friend!! we were 8 lmao it was Mardi Gras and my dad had to get two young girls through the crowds back to wherever we were staying lol",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dragondragonflyfly",
                            "body": "2006 for me :)",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Merry-Cherries",
            "body": "I’ll always love her to bits. I think I’ve literally stanned her almost my whole life, as Hannah then Miley",
            "score": 828,
            "replies": [
                {
                    "depth": 1,
                    "author": "MYSTICALLMERMAID",
                    "body": "Straight up, I know we shouldn’t idolize celebrities but fuck it I LOVE her",
                    "score": 137,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Merry-Cherries",
                            "body": "Me too! The amount of vitriol against her throughout the years was so tough to witness as a young fan of hers, she deserves so much happiness. And I’m glad she seems to be doing much much better these days",
                            "score": 71
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fuzzybitchbeans",
                    "body": "I’m too old to have been a Hanna Montana fan and my kids weren’t the right age to be interested to watch her but man I can’t help but love her. \n\nHer godmother is Dolly Parton and I think she’s followed her own path like Dolly did. She’s just so herself and she’s weathers a lot of bad publicity and parents behaving badly.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PrincessPindy",
                            "body": "I'm 65, and I adore her. She is so talented,  a true entertainer. I have this image of her singing \"Party in the USA\", swinging on a pole. It was an amazing performance. She was just putting it all out there.  I always defended her against her critics. \"She's just being Miley, y'all.\"",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Ok-Yogurtcloset3467",
                    "body": "Me too! It must be amazing to be an artist where so many of your fans can say this and mean it",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Merry-Cherries",
                            "body": "Right? She deserves that sort of loyalty after all the shit the media put her through. I’m so glad to see her doing so well these days",
                            "score": 26
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Remarkable-Call-3302",
                    "body": "I never stopped supporting her even when she was being absolutely destroyed by the whole world, which looking back I hope everyone realizes was incredibly unfair! I am a Miley apologist/stan for life and I’m so happy to see her thriving 🥹",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "down_by_the_shore",
                    "body": "Me too. I feel like she's the first celebrity that I really connected with who was the same age as me, and that I felt like I \"grew up with.\" I don't know if I have that feeling with anyone else. I don't really care if that comes off as parasocial or whatever. I just love her and what she's done with her life.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "bookloverpink",
            "body": "She IS the moment",
            "score": 1924,
            "replies": [
                {
                    "depth": 1,
                    "author": "One_Ad1822",
                    "body": "She looks like Vicky from r/TheVampireDiaries",
                    "score": 440,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HandleDry1190",
                            "body": "OMG YEAH",
                            "score": 55
                        },
                        {
                            "depth": 2,
                            "author": "down_by_the_shore",
                            "body": "omfg that's *SO* spot on, it almost makes me want to rewatch",
                            "score": 38
                        },
                        {
                            "depth": 2,
                            "author": "nolliracc",
                            "body": "i'd let her trial her nascent vampirism on me",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "donutgetmad",
                            "body": "Omg stop don’t say that don’t ruin it for me😭😂",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JohnCenaJunior",
                    "body": "MOMENT by Miley Cyrus",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -104,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "taylorexplodes",
                            "body": "![gif](giphy|Lsv3nTOVxq1QHI9SdM|downsized)",
                            "score": 84
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 130,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "SelectZucchini118",
                    "body": "Was looking for this",
                    "score": 22
                }
            ]
        },
        {
            "depth": 0,
            "author": "noirdaisy",
            "body": "I’ve always loved this hair color on her! Takes me back to  Party in the USA Miley.",
            "score": 156
        },
        {
            "depth": 0,
            "author": "thesaddestpanda",
            "body": "Its giving fortune 500 CEO",
            "score": 177,
            "replies": [
                {
                    "depth": 1,
                    "author": "gee8",
                    "body": "It’s giving Bristol Palin biopic",
                    "score": 89,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "brawl",
                            "body": "Only one of them has talent.",
                            "score": 17
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Matryoshkuh",
            "body": "She looks like a guest star on Frasier or Just Shoot Me.",
            "score": 67,
            "replies": [
                {
                    "depth": 1,
                    "author": "littlelizu",
                    "body": "this reference is so precise it made me snort.",
                    "score": 22
                },
                {
                    "depth": 1,
                    "author": "Greenerie-nwz-plz",
                    "body": "I’m listening",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "velvethippo420",
                    "body": "Roz's ambitious intern, or Nina Van Horn's scheming niece",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "littesb23",
            "body": "Miley Cyrus? Baby, that’s Miley Stewart",
            "score": 81
        },
        {
            "depth": 0,
            "author": "aliceanonymous99",
            "body": "She’s good shit. Met her at a random house party one time and she was extremely nice",
            "score": 125,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sunshine030209",
                    "body": "So you met her at a.. Party in the USA? \n\n(Sorry, couldn't help myself)",
                    "score": 107,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aliceanonymous99",
                            "body": "Oh my god amazing!!! I wish it was but it was Canada hahahaha",
                            "score": 79,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sunshine030209",
                                    "body": "Aw man, my day is now ruined hahaha \n\nI'm super jealous though!",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "aliceanonymous99",
                                            "body": "I’m sorry!!!! Hahaha it was at a random punks house",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sunshine030209",
                                                    "body": "Did you know she was going to be there before you went? Or were you just chilling out at some random punk's party and Miley Fucking Cyrus strolled in?",
                                                    "score": 7,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "aliceanonymous99",
                                                            "body": "There was a text from a mutual friend saying she was going to be there; but we thought it was bullshit. She was already there just hanging out, no one really made a big deal it was awesome",
                                                            "score": 14
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "nervousopposum",
                                    "body": "Party in the US \"eh\"",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "aliceanonymous99",
                                            "body": "YOU ARE BRILLIANT",
                                            "score": 8
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "butyourenice",
            "body": "No hate, but... she looks exactly the same as she always has? “Stuns” makes me think that she showed up looking unexpected in some way, like she changed up her look dramatically or had a major “glow up” or even, conversely, showed up completely disheveled and out of sorts. But she looks like herself. Is it because she has a more mature, sort of demure styling going here or what?",
            "score": 507,
            "replies": [
                {
                    "depth": 1,
                    "author": "siinjuu",
                    "body": "It’s kind of obscure but like other commenters have said, it’s probably a meme reference. Pretty sure it originates from Trixie Mattel’s “Madonna stuns in new selfie” so it’s like a drag race thing lol",
                    "score": 71
                },
                {
                    "depth": 1,
                    "author": "chemicalfields",
                    "body": "Yeah, it’s generous lol",
                    "score": 131
                },
                {
                    "depth": 1,
                    "author": "PizzaReheat",
                    "body": "The title is a meme, you might be overthinking it.",
                    "score": 53,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "butyourenice",
                            "body": "I’m probably overthinking yeah. Memes are getting more and more vague these days.",
                            "score": 76
                        },
                        {
                            "depth": 2,
                            "author": "all_of_you_are_awful",
                            "body": "I don’t think you know what a meme is.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PizzaReheat",
                                    "body": "I’m pretty sure I do. It’s an ongoing joke that Twitter accounts like pop crave, pop base etc will just post any picture of a celeb with “x stuns in new picture”.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "all_of_you_are_awful",
                                            "body": "If it’s paired with a mediocre or random  picture. She looks good here.",
                                            "score": -6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PizzaReheat",
                                                    "body": "OP clearly didn’t think so because they wrote a whole paragraph about how she looked normal.",
                                                    "score": 11,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "butyourenice",
                                                            "body": "Not true at all. I never said she didn’t look good, just that she didn’t look unusual. She looks as lovely as she ever does.",
                                                            "score": 0
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "itsathrowawayduhhhhh",
                                                    "body": "No I feel like the youngs have a different meaning for meme. I had a gen zer explain it to me. We (olds) think of a meme as a picture with words (we’re right) but gen z thinks it’s what this person said, an ongoing joke or something not so serious or whatever",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Athlete-Extreme",
                    "body": "It’s her OG hair maybe",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "lilmugicha",
                    "body": "... so you're blind",
                    "score": -50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "butyourenice",
                            "body": "Is this also a meme I don’t get it",
                            "score": 34
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "IceStorm22",
            "body": "She looks great. But the whole, her siding with the mother that married the 50-something that was fucking her teenage sister kind of turned me off of her.",
            "score": 99,
            "replies": [
                {
                    "depth": 1,
                    "author": "Minute_Reporter5435",
                    "body": "I need them to come out with the real story because that is some psycho creepy shit. And if it was fake her team would have denied that shit so fast, so it's really scary that there's no news...",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IceStorm22",
                            "body": "Honestly, it’s almost more disturbing that we have no info. Like… is this the promotion they want?\n\n🤮",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Minute_Reporter5435",
                                    "body": "Exactly. She's fucking Miley Cyrus. Any wrong and disturbing rumors she would have her team shut down IMMEDIATELY \n\nAnd now suddenly she's back in the spotlight doing interviews????????\n\nLmfao she's cleaning up her image. I am so done with her. There really is no good celebrity besides dolly parton lol\n\nThe rest are psychos",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Orchid_Significant",
                    "body": "Same",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "capn_corgi",
                    "body": "Did anyone actually involved in the situation confirm that that’s what happened? Or is it still “person close to the situation said blah blah blah”?",
                    "score": 26
                },
                {
                    "depth": 1,
                    "author": "laureng0423",
                    "body": "Wait - serious question but was Noah a teenager when she was with Dominic? I mean, it’s obviously gross if she was with him at all since he’s like mid-50s but idk that she was a teenager. I could be wrong though.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Right-Bat-9100",
                            "body": "no, as far as i can tell she was in her 20s",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Right-Bat-9100",
                    "body": "is it gross, yeah, but she wasn't actually a teenager at the time and at the end of the day she's still Miley's mum- plenty of people have forgiven their mothers for worse, especially if your childhood was as weird as Miley's and it's hard to break that bond",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "HowYouDoinz",
            "body": "I love her and she looks good here",
            "score": 191
        },
        {
            "depth": 0,
            "author": "absol_utechaos",
            "body": "YESSSSS been waiting for the brunette moment!! 😍",
            "score": 122
        },
        {
            "depth": 0,
            "author": "real_bag164",
            "body": "Love Miley!!! I must say, I like the brunette hair color on her more than the blonde (she’s beautiful regardless)",
            "score": 59
        },
        {
            "depth": 0,
            "author": "annajoo1",
            "body": "young, rich, celebrity is beautiful. \n\n\"florals for spring?\" \n\nbut nah i like miley so this is just a lil dig at the title",
            "score": 25
        },
        {
            "depth": 0,
            "author": "lxelle",
            "body": "I love her hair darker so much. She looks stunning.",
            "score": 19
        },
        {
            "depth": 0,
            "author": "Shoujo_wit_a_shotgun",
            "body": "She looks so much better with darker hair.\n\nI get that after being a Disney kid for so long she wanted to break that mold, experiment with her look and image. That is all fine.\n\nBut this is better. She will never not look like a million bucks when she is in brunette mode.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "filthytelestial",
            "body": "Wealthy person who has literal teams of people whose job it is to make them look good.. looks good. \n\nIn a photo styled, lit, and photographed by experts whose job it is to make sets and the people in them.. look good. \n\nThe effusive praise in this post is laughably over the top.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 69,
            "replies": [
                {
                    "depth": 1,
                    "author": "fistotron5000",
                    "body": "Letterman. The picture is cropped so you can’t see the taser",
                    "score": 279,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "icestormsea",
                            "body": "This should NOT have made me laugh as hard as it did. Thank you internet stranger!",
                            "score": 48
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mutzadella",
            "body": "she looks incredible. this hair color looks amazing on her ",
            "score": 13
        },
        {
            "depth": 0,
            "author": "taurist",
            "body": "She does look great but I can’t stand that hairstyle, it’s like 3 different cuts at the same time. Big hair needs to come back though",
            "score": 14
        },
        {
            "depth": 0,
            "author": "JerryCalloNotGallo",
            "body": "This is sending me. I had tickets for one of letterman’s Netflix is a joke shows and the guest was a surprise until they came on stage and stupidly this is the caliber of guest I thought I was getting but I got Nate Bergatze.  (derogatory).",
            "score": 7
        },
        {
            "depth": 0,
            "author": "realMartianJesus",
            "body": "Getting clinton Benghazi vibes",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Adventurous_Ideal909",
            "body": "Hard to look bad with unlimited monies available",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Minute_Reporter5435",
            "body": "But what the fuck is going on with her mom's new husband and her sister because for the first time in my life she might not be someone I can support\n\nHahahah damn yall are scared she's a fake hoe lol",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "lilmugicha",
                    "body": "That's awkward to talk about, no? Especially since Trish and Noah aren't even famous (I know Noah kind of is, but she's pretty irrelevant) what exactly would you want Miley to do in this situation? Talk about it to the public?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Minute_Reporter5435",
                            "body": "Is she a good person who didn't know her moms new husband is a creep who fucked her step daughter or not???\n\nUh everything in celebrity life is awkward? That's the price you pay as a celebrity lmfao\n\nThis shit is too serious for harmless family drama that should stay between them. He could be a dangerous creep\n\nThe husband is famous, doesn't matter that Trish and noah aren't",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "borderlinehunkydory",
            "body": "I remember as a child, Disney was about to livestream one of her concerts which was in 3D and we had to purchase Maggi which would offer free 3D glasses for the concert and I bought Maggi just for the glasses and wore those plastic glasses and sat in front of the TV 😭😭😭❤️",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "PfizerBitch",
                    "body": "Omg same!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "borderlinehunkydory",
                            "body": "![gif](giphy|ZmuUzqOIEojjnd4tN8|downsized)",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BeanEireannach",
            "body": "She looks so great, really delighted for her that things seem to be so good with her!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Alternative_Tart120",
            "body": "Love the darker hair!!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Luna_Soma",
            "body": "She’s gorgeous. She’s always seemed very true to herself and real, even when indulging different aspects of her personality. She seems like a good human and she’s a talent and a half. I’m a huge fan and always will be.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "meowparade",
            "body": "I hated her during my NLOG days and fell absolutely in love with her when I outgrew that phase! I’m obsessed with her and how talented she is!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Hotdadlover1234",
            "body": "She’s always been beyond stunning",
            "score": 3
        },
        {
            "depth": 0,
            "author": "peepsinyourass",
            "body": "Does she still sound like a smoker?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "grower_thrower",
                    "body": "I love her voice. I’ve never really been a fan of her music, but her speaking voice is velvet smoke and it’s lovely.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "whoissteveharvey123",
            "body": "Stunning",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kitt95",
            "body": "She looks stunning but Letterman is a creep.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bristolfarms",
            "body": "i love her! gosh i wish i looked this good haha",
            "score": 1
        },
        {
            "depth": 0,
            "author": "MicIsOn",
            "body": "She looks stunning",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Global-Letter-4984",
            "body": "Ok she is stunning and I love the brunette on her",
            "score": 1
        },
        {
            "depth": 0,
            "author": "snails4speedy",
            "body": "She’s absolutely stunning and I love how her hair has been styled recently!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HonestCommercial9925",
            "body": "She looks like her mom.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PatriciaMorticia",
            "body": "She's done well for herself since her Hannah Montana days. Can't believe Disney made HER apologise for those topless Annie Leibovitz photos, girl was a MINOR and had no say in the photoshoot.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "De-Animator27",
            "body": "Did they digitally remove tattoos?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Missohwee",
            "body": "I love her",
            "score": 1
        },
        {
            "depth": 0,
            "author": "plofmoffel",
            "body": "GLOWING",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Imaginary-Party2567",
            "body": "Stuns is an understatement omg",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OptimusPrime365",
            "body": "The bump it is back!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "anonymousconcertgoer",
            "body": "Omg she’s so pretty",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Healthy_Monitor3847",
            "body": "YESSSSS",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CelibateHo",
            "body": "I almost thought she was Sydney Sweeney for a sec 🤔",
            "score": 1
        },
        {
            "depth": 0,
            "author": "arabicdialfan",
            "body": "Miley looks so good! She has such an energy ♥️♥️",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Quirky-Reporter-7654",
            "body": "Dude she is slowly morphing into Dolly in the best way possible",
            "score": -2
        },
        {
            "depth": 0,
            "author": "VirginiaUSA1964",
            "body": "I love her.  The darker hair really suits her too.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "January1171",
            "body": "She looks so chic. Fantastic!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InviteNecessary1032",
            "body": "I WILL be showing this image to my hairstylist! Super major mega slay.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tuttifruitti-4u",
            "body": "She looks gorgeous",
            "score": 1
        },
        {
            "depth": 0,
            "author": "freckleqr",
            "body": "Ugh, she is so hot",
            "score": 1
        },
        {
            "depth": 0,
            "author": "blackaubreyplaza",
            "body": "She looks so good",
            "score": 1
        },
        {
            "depth": 0,
            "author": "croquetedebacalhau",
            "body": "Holy hell, she's glowing! Anyone know of a lipstick close to the one she's wearing?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lumpy_Mortgage1744",
            "body": "She looks amazing!!!!! \n\nAbsolutely love her. One of the most unique voices in pop music",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Appropriate-Desk4268",
            "body": "Okay Miley Stewart is making a COMEBACK🥰",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Little_Challenge_160",
            "body": "No hate but what's with the chin?  Is that real?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Juror_no8",
            "body": "Beautiful, and *love* her voice",
            "score": 0
        },
        {
            "depth": 0,
            "author": "ModelSecurity",
            "body": "She is so beautiful",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InterestingParsley45",
            "body": "Y’all stun too easily.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PlantMother4",
            "body": "Women look so beautiful when there isn’t a man stressing them out.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "305rose",
            "body": "She looks Dolly-fied!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Own_Search4118",
            "body": "As the years go by, she gets more and more beautiful",
            "score": 1
        },
        {
            "depth": 0,
            "author": "littlemissscroller",
            "body": "This is like THE Miley Cyrus I grew up seeing but elevated and gracefully grown",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -6
        },
        {
            "depth": 0,
            "author": "LostInYesterday00",
            "body": "![gif](giphy|AgPt9udT567spxbSHf)",
            "score": -2
        },
        {
            "depth": 0,
            "author": "SlowHoneydew3287",
            "body": "I love her acting",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Active-Performer9813",
            "body": "Beautiful!",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Complex_Habit_1639",
            "body": "Back to BROWN hair\n\nI like it....",
            "score": 0
        },
        {
            "depth": 0,
            "author": "goldenbarks",
            "body": "Hell yeah she stuns! ✨",
            "score": 0
        },
        {
            "depth": 0,
            "author": "m00n-c4ke",
            "body": "wow she is absolutely stunning",
            "score": 0
        },
        {
            "depth": 0,
            "author": "irldani",
            "body": "she looks so fucking pretty I love that she has her brown hair again",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Corninmyteeth",
            "body": "Damn, she looks good here.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Whatchyamacaller",
            "body": "They could never make me hate her! ❤️",
            "score": -2
        },
        {
            "depth": 0,
            "author": "OrangeZig",
            "body": "Humuna humana",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Long_Anything9545",
            "body": "Welcome back Miley Stewart",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Cat_Toe_Beans_",
            "body": "Her hair looks great",
            "score": 0
        },
        {
            "depth": 0,
            "author": "DirectorFowler_87",
            "body": "She's looking better and better, every time I see her. Gorgeous!",
            "score": 0
        },
        {
            "depth": 0,
            "author": "dinosaurfolklore",
            "body": "![gif](giphy|AgPt9udT567spxbSHf)",
            "score": 0
        },
        {
            "depth": 0,
            "author": "AnxiousHighlight700",
            "body": "She looks great!!! I am loving this era for her",
            "score": 0
        },
        {
            "depth": 0,
            "author": "mr-english",
            "body": "\"Stuns\"",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Imaginaryami",
            "body": "I love her rebrand as the personification of an “Eat, pray, love” sign",
            "score": 0
        },
        {
            "depth": 0,
            "author": "One_Interview1724",
            "body": "I hope she keeps this look. Holy crap.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "tellyleuv",
            "body": "looove her hair lately!",
            "score": 0
        },
        {
            "depth": 0,
            "author": "blatcatshat",
            "body": "Stuns who",
            "score": 0
        },
        {
            "depth": 0,
            "author": "StickLumpy6064",
            "body": "That hair color looks so harmonious with her features. reminds me of her hair color in hannah montana forever.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Separate_Feeling4602",
            "body": "Miley is a cool chick .",
            "score": 0
        },
        {
            "depth": 0,
            "author": "0x7E7-02",
            "body": "Looks better than I have seen her look in a long time.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "SignificantOther88",
            "body": "Wow, she looks beautiful! Usually when these articles say someone “stuns” it’s not accurate, but in this case, she really does look incredible.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Pretend_Tea6261",
            "body": "Great voice,talent and hot to boot.",
            "score": -4
        },
        {
            "depth": 0,
            "author": "SuddenlyThirsty",
            "body": "I forgot how hot she was until I saw that",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Secure_Challenge_228",
            "body": "So happy for Miley but I genuinely wish that piece of shit Letterman didn't have a platform anymore",
            "score": 0
        },
        {
            "depth": 0,
            "author": "44035",
            "body": "Geez, someone grew up.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "hiddenetherealities",
            "body": "Oh my god. YASSS BROWN HAIR MILEY",
            "score": 0
        },
        {
            "depth": 0,
            "author": "icarlylover9",
            "body": "this is my God.",
            "score": -5
        },
        {
            "depth": 0,
            "author": "Efficient_Dingo_666",
            "body": "Omg mother",
            "score": -4
        },
        {
            "depth": 0,
            "author": "DizzyBr0ad_MISHAP",
            "body": "Yaaaas her best look",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Moist-Kiwis15",
            "body": "Her look forreal",
            "score": -1
        },
        {
            "depth": 0,
            "author": "vodkapolo",
            "body": "This is the best she's ever looked. The thing is, I say this every time I see her 😭💕",
            "score": -1
        },
        {
            "depth": 0,
            "author": "DaftPrettyLies",
            "body": "This hair color on her is just 🤌🤌🤌 so classic",
            "score": -1
        },
        {
            "depth": 0,
            "author": "FindingActive5407",
            "body": "MILEY STEWART IS BACK YALL",
            "score": -1
        },
        {
            "depth": 0,
            "author": "liminalisms",
            "body": "It’s crazy that one day there will be an 80 year old woman named Miley",
            "score": -1
        },
        {
            "depth": 0,
            "author": "makeitflashy",
            "body": "Sheesh. Something about Miley is just Hot Potatoes if you know what I mean",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Remarkable-Call-3302",
            "body": "I am so in love with her.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "GuappDogg",
            "body": "Looks like my first boo in the face. Shout out Kristen",
            "score": -1
        },
        {
            "depth": 0,
            "author": "mnblackgirl",
            "body": "This is Miley Stewart",
            "score": -1
        },
        {
            "depth": 0,
            "author": "ssaunders88",
            "body": "Miley Stewart is that you??",
            "score": -1
        },
        {
            "depth": 0,
            "author": "PKMNTrainerMark",
            "body": "That's a real classic Miley Cyrus look, no doubt.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "mycatisgrumpy",
            "body": "Well she cleaned up nice. ",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Weyland_c",
            "body": "Show stopper. 😍",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Blue_Cloud_2000",
            "body": "I'm glad her hair is back to normal.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "user28472284647219",
            "body": "I always wondered who tf told her to dye her hair blonde. She’s soooo much more stunning as a brunette.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "vivrant-thang",
            "body": "she looks like a grown hannah montana.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "vincedarling",
            "body": "Does she still talk like Dr. Girlfriend?",
            "score": -1
        },
        {
            "depth": 0,
            "author": "lilyoneill",
            "body": "This Gen’s Dolly",
            "score": -2
        },
        {
            "depth": 0,
            "author": "erikivy",
            "body": "In other news, pretty woman is pretty.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Historical-Gap-7084",
            "body": "She could play Jane Fonda in a biopic.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Nairo_bees",
            "body": "ugh this is such a classic miley look!! so beautiful and talented… only real ones remember vibing through her bangerz and dead pets era 😭✊🏾 but also bangerz was just soooo ahead of it’s time",
            "score": -3
        },
        {
            "depth": 0,
            "author": "Unkown400",
            "body": "![gif](giphy|Umx7zVTCpDaco)",
            "score": -4
        }
    ]
}