{
    "title": "Jesse Tyler Ferguson is in the Modern Family House 👀",
    "comments": [
        {
            "depth": 0,
            "author": "jonsnowme",
            "body": "![gif](giphy|122H5tXgm0WJ5C)",
            "score": 85
        },
        {
            "depth": 0,
            "author": "capn_corgi",
            "body": "They’ve kept it? I was under the impression sets get gutted and remade all the time.",
            "score": 52,
            "replies": [
                {
                    "depth": 1,
                    "author": "Picklepee-pumparum",
                    "body": "Sometimes. Sets and props can be quite expensive, and Hollywood is all about profit, so if they can reuse or sell a thing it's prone to happen rather than destroy it. ",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Appropriate-Desk4268",
                            "body": "honestly watching older sitcom shows back to now, you can tell some are likely the same set thats just been painted and redesigned. not a full gut, just more a renovation. \n\nDisney seemingly made newer sets for the mid-2000’s, but shows after seemed to be similar layout. Though, they did have that 100 episode and cancel thing, so it’s smarter to renovate vs demolish and rebuild completely.",
                            "score": 14
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AlongCamePollHe",
            "body": "warm take but a show that ended less than five years ago needs time to sit before the nostalgia wave warrants a reboot.",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "CosmicMiru",
                    "body": "Seriously lol. An 11 year show that just ended in 2020 getting a reboot just seems so weird. Especially considering it really kinda felt like they were running out of stories to tell the past few seasons.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "ZealousidealRope7429",
                    "body": "I agree, but Ed O'Neill is already 78 and hasn't really worked in recent years. I can't help but wonder if they're just trying to get in a limited run before running into the possibility that he's unable to film in the future.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Vajama77",
            "body": "One of my favorite shows I wonder what he was doing there.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "thetasteofmyfury",
            "body": "I’m rewatching for the nth time and this somehow still made me nostalgic",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "littesb23",
                    "body": "I feel like it never really gets old",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "borderlinehunkydory",
            "body": "![gif](giphy|E4Y0VjghOGxKE)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mialz1996",
            "body": "I was out for a walk the other day and ran into tons of modern family and fox trucks filming. I looked it up, and that street is apparently where Phil and Claire’s house is located 👀",
            "score": 1
        }
    ]
}