{
    "title": "Kelly Rowland Speaks Out About Viral Exchange With Security at Cannes: “I Stood My Ground”",
    "comments": [
        {
            "depth": 0,
            "author": "Traditional_Maybe_80",
            "body": "I understand a red carpet is a timed event and these security guys need to keep people moving, BUT that was a big ass space, it wasn't some narrow hallway where Kelly was blocking someone else. Plus, her dress had a train AND she was wearing stillettos while trying to walk up the steps.",
            "score": 67
        },
        {
            "depth": 0,
            "author": "Exciting_Potato_6717",
            "body": "https://preview.redd.it/qzgrrbx5t82d1.jpeg?width=1410&format=pjpg&auto=webp&s=debf8c1ccbb11fe50191c8686d13646133c57a7e\n\nCame across this post on social media I thought I’d share as the pictures were telling.",
            "score": 166,
            "replies": [
                {
                    "depth": 1,
                    "author": "Thorbertthesniveler",
                    "body": "That is just sick and disappointing 😔",
                    "score": 24
                }
            ]
        },
        {
            "depth": 0,
            "author": "Financial-Painter689",
            "body": "The hurt in her eyes you can tell she’s been crying hard over this shit. I feel so bad for her.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "N_Ywasneverthesame",
            "body": "Looking at her eyes you can tell she was hurt by what happened 🥲",
            "score": 244,
            "replies": [
                {
                    "depth": 1,
                    "author": "rayybloodypurchase",
                    "body": "Kelly’s had to defend herself so much this year. She must be so tired. I’m sure she didn’t expect to show up to this glamorous event and be treated like cattle at this stage in her life and career.",
                    "score": 104
                },
                {
                    "depth": 1,
                    "author": "Vajama77",
                    "body": "Of course she was. This makes me so sad.",
                    "score": 43
                },
                {
                    "depth": 1,
                    "author": "Tran_Queenlity",
                    "body": "Saw the same and came to say the same. There is hurt and sadness in her eyes even through her perseverance. Just because someone is strong doesn't mean they are not hurting.",
                    "score": 20
                }
            ]
        },
        {
            "depth": 0,
            "author": "porkchop_2020",
            "body": "The original post’s comments were so wild with people saying that Kelly was at fault when my first thought was that those guards were WAY too close and WAY too touchy with her. Yes French people are “direct” and “rude” or whatever but even without seeing their treatment of other guests it felt extremely inappropriate and specific to Kelly. Now seeing that photo of Heidi it’s clear that their own prejudice informed how they treated Kelly.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "DulceEtBanana",
            "body": "Clap for this QUEEN.",
            "score": 29
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jodies-9-inch-leg",
                    "body": "She did though, not in so many words but now it makes sense….\n\nshe was on the red carpet, she stopped, for photo ops and the lady told her to keep it moving…. \n\nWhich she took offense to, because in her view, other less pigmented ladies also stopped and were not shooed away….\n\nShe could say “exactly” what was said, but is not about  what was said, it’s about how the lady made her feel, and that’s subjective…. But it’s pretty clear she felt disrespected\n\nMaybe it’s a POC thing…. You know when you’re being treated differently… IYKYK \n\nthat’s my read on her response anyway….",
                    "score": 108,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "meepmarpalarp",
                            "body": "Even worse- the incident occurred when Kelly was already heading up the stairs. It looks like she paused for a minute and bent down to adjust her train (so she wouldn’t trip? Totally reasonable) and that’s when the security guard said or did whatever it was.",
                            "score": 44
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Exciting_Potato_6717",
                    "body": "She makes it clear. She was scolded and told to get off the carpet when attendees who don’t look like her were not treated the same way.",
                    "score": 72
                },
                {
                    "depth": 1,
                    "author": "jenrising",
                    "body": "you think Kelly should waste even more time during an important event for her to explain the details of a situation that never should have happened to justify her reaction for you?   \n\n\nshe answered the question she was asked in the way she was comfortable doing. she \"should explain\" however the hell she wants.",
                    "score": 28
                }
            ]
        }
    ]
}