{
    "title": "Spencer Connelly was five when he was set on fire by his dad in an unforgivable act of revenge. He survived and now he's realised his dream after being cast in Furiosa: A Mad Max Saga",
    "comments": [
        {
            "depth": 0,
            "author": "Sufficient_Motor_458",
            "body": "This is the type of evil I can’t even comprehend. So glad Spencer and his brother survived \n\n>Spencer's father Paul Brian Edward Connelly set him on fire aged five alongside his  older brother Fletcher, then an eight-year-old, inside a car in Burnie, west of Devonport, on December 5, 2012. \n\n>The siblings survived however they suffered serious burns in the horror incident. Their father had tried to kill them and himself to prevent their mother from getting custody of them.\n\n>Connelly had placed two gas cylinders in the back of his car when he picked the siblings up from day care 12 years ago. \n\n>Around 5pm that day, he lit the gas cylinders with a cigarette, causing them to explore. \n\n>Spencer suffered burns to nearly half his body while Fletcher suffered burns to more than 20 per cent of his body.  \n\n>Connelly was sentenced to 20 years behind bars with a 15-year non parole period for attempted murder in 2013.\n\n>Spencer, who recovered from his severe injuries but still bears the scars, was offered the opportunity to audition for a role in the film by its director George Miller, who was moved by Spencer's story.\n\n>**’I've always said that I've wanted to make my burns, my scars worthwhile and I believe I've done that now,' he said.**",
            "score": 877,
            "replies": [
                {
                    "depth": 1,
                    "author": "alltheprettynovas",
                    "body": "15-20 years? that’s it??",
                    "score": 674,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ModernZombies",
                            "body": "I will never understand why attempted murder gets sentenced differently than murder…. The intended outcome was the same, why should you get off with a lighter (no pun intended) sentence for not being successful.",
                            "score": 41,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Leviathansarecool",
                                    "body": "I heard it's because a lot of people would finish a failed attempt if the sentence was the same",
                                    "score": 43,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WeirdAlbertWandN",
                                            "body": "This is exactly the reason why it is differentiated",
                                            "score": 12
                                        },
                                        {
                                            "depth": 4,
                                            "author": "ModernZombies",
                                            "body": "I honestly doubt that the sentence has much play in decision making when most “attempts” that reach the action stage just seem like dumb luck… even if it did, someone that attempts to murder someone and is of otherwise sound mind as an adult shouldn’t re-enter society afterwards. you can’t tell me that this dad even attempted to “stop” they just happened to survive. FFS there was a guy that cut off a woman’s arms after r*ping her and left her for dead in a ditch that got a lesser sentence for attempted murder, like cmon, he wasn’t thinking about the time, he just assumed (incorrectly) that she would bleed out and die. I’d argue that most people are assuming they would be less likely to get caught if the victim actually dies than thinking about a lesser sentence if they don’t..",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "empathy_sometimes",
                            "body": "welcome to australia",
                            "score": 215
                        },
                        {
                            "depth": 2,
                            "author": "LilyLils15",
                            "body": "Insanity.",
                            "score": 79,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Such-Equivalent280",
                                    "body": "Understand that different countries have different maximum sentences for different crimes. Wild.",
                                    "score": -125,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "LilyLils15",
                                            "body": "No way dude you’re blowing my miiiiiind! Yeah of course that’s how different justice systems work. That doesn’t mean someone like this should ever be let out. Also I’m Australian so it’s not like I’m confused about different sentences in different countries. This is where I’m from and we have issues with low sentences for heinous crimes.",
                                            "score": 54
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TheybieTeeth",
                                            "body": "I mean 100%, I live in a country with some of the most lax sentencing for criminals, including reduced sentences for reoffenders to the point that the FBI keeps bothering us to actually put our serial killers behind bars because they keep getting out and killing more people.\n\nbut I think that finding this a short sentence for burning children alive with the intent of killing them is completely unrelated to \"hurr durr other country has different rules\". it is objectively insane to think this guy will get out and live a normal life.",
                                            "score": 83
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Right_Way_4258",
                                            "body": "Right???? I’m all about abolishing prisons but if we’re going to have a prison system someone like this needs to be there in life! I’m sorry! That’s a deeply disturbed individual.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Secrets0fSilent3arth",
                                                    "body": "So in your world what happens to this dude if you abolish prisons?",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "lemonparticle",
                                                            "body": "Instead of asking a stranger to explain prison abolition to you, you could always just google it.",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "bent_eye",
                            "body": "You can literally get away with murder down here. Our justice system is terrible.",
                            "score": 75,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "shame-the-devil",
                                    "body": "Well maybe we can find out more about that when the father is released",
                                    "score": 35
                                },
                                {
                                    "depth": 3,
                                    "author": "Deathcapsforcuties",
                                    "body": "I wonder how it compares to US. Ours is pretty terrible as well. ",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Typhoon_terri2",
                                            "body": "They’re peas in a pod :) that’s why pine gap exists, and why David McBride is in jail now",
                                            "score": 4
                                        },
                                        {
                                            "depth": 4,
                                            "author": "WeirdAlbertWandN",
                                            "body": "Ours is terrible in the opposite way\n\nOver incarceration and overly harsh punishments\n\nIt means that the really bad people here get harsher sentences than the really bad people in somewhere with a system like Australia or Canada. \n\nBut that also means that people who deserve a chance at rehabilitation don’t get it in the US, and do in those countries.",
                                            "score": 8
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "HistorianOk9952",
                                    "body": "Like that lady that made a curtain out of her fiance",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AgentKnitter",
                            "body": "The maximum sentence for any offence in the Tasmanian Criminal Code is 21 years. \n\nThe only person to get a term of their natural life sentence since the Code was enacted in 1924 is, as far as I know, Martin Bryant, the Port Arthur gunman who murdered 35 people in a mass shooting. It was considered less crushing and more sensible to give him life than 35x 21 years. \n\n(I'm a lawyer in Tasmania)",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "repladynancydrew",
                            "body": "Slightly out of topic - As someone living in EU it always surprises me when people (mostly Americans I’m guessing) display much umbrage over “short” prison sentences. Many countries, thankfully IMO, have a rehabilitative approach to prison, instead of a retaliatory approach. People IMO wrongly equate revenge via life sentences with justice. Research has shown that rehabilitative measures are far more cost-effective AND lowers chances of crime reperpetration AND improves chances of convicts  reintegrating into society. No wonder countries like the US has so many problems with its prison system and high incarceration rates of reconvicted released convicts, when barely proper measures are taken to ease convicts back into society and the general public seemingly prefers looking people up forever instead of finding ways to rehab them in some form.",
                            "score": -39,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CairoRama",
                                    "body": "I mean, This sounds logical economically and maybe ethically, But To set two innocent children on fire, A horrible and painful way to die, I can't be convinced that you deserve rehabilitation. I just can't wrap my head around the evil.",
                                    "score": 19
                                },
                                {
                                    "depth": 3,
                                    "author": "Happy_Independent_25",
                                    "body": "I don’t think someone who sets fire to children can be rehabilitated.",
                                    "score": 93
                                },
                                {
                                    "depth": 3,
                                    "author": "hkj369",
                                    "body": "what type of rehab is there for a guy who set his children on fire?",
                                    "score": 20
                                },
                                {
                                    "depth": 3,
                                    "author": "OverrunSun-98",
                                    "body": "Look, I agree with this in general and I’m ALL for abolition (like insanely so). But while prisons still exist, I think someone who set his children on fire should be getting a longer sentence than a weed dealer.",
                                    "score": 13
                                },
                                {
                                    "depth": 3,
                                    "author": "otonarashii",
                                    "body": "You're right, but at the same time I'm not sure I want a guy who tried to kill his kids back in society. He'd have to do an absolute shit-ton of rehab.",
                                    "score": 7
                                },
                                {
                                    "depth": 3,
                                    "author": "i_love_doggy_chow",
                                    "body": "I totally agree that rehabilitative systems are the way to go. The US prison system is straight-up evil. I think the downvotes are coming from the context of this specific case, because it's hard to imagine a reality in which a sane man who tried to burn his two kids to death could be rehabilitated.",
                                    "score": 6
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "EMU_Emus",
                    "body": "That last quoted sentence is amazing. For a teenager to have that kind of maturity after suffering such extreme trauma is super impressive. \n\nAnd it's really true - a teenager with long-healed burn scars from childhood fits *perfectly* in the mad Max universe, and he can offer the film a kind of realism that will always be better than scar makeup and CGI. It's a no-brainer if the kid really wants to play that role. Hopefully he's getting paid handsomely and can continue finding work in the industry if he wants it.",
                    "score": 56
                },
                {
                    "depth": 1,
                    "author": "Nolwennie",
                    "body": "The number of times I’ve heard variations of stories like this fully convinced me that SHIT LOADS of fathers don’t not love their children. They love the status that fatherhood and marriage gives them but they don’t like those kids as people. \n\nNobody who actually cares about a child either abandons them after a divorce or when they get remarried, or hurt said child to get back at their partner. You RARELY hear this from women in comparison. In such a context why even have children with these people? They’ll consider it’s your responsibility to do all the work and they’ll try to hurt them and take them away from you just to hurt you. \n\nSociety as a whole has a tendency to treat children as objects more than people but the majority of those who treats them the most as objects to cause suffering are their fathers. And they get away with so much of it, it’s insane. They even manage to flip the script and make it sound like they actually want those kids but the evil courts side with women, when kids overwhelmingly end up with their moms cause the dads CHOSE that arrangement and barely pay child support. \n\nHaving kids with a loser is one of the worse things that can happen to you and those very kids.",
                    "score": 193,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "theunkindpanda",
                            "body": "I just read a story yesterday about a father who committed murder-suicide with his two small children (in Ohio I think). It’s eerie how similar the stories are: he took them out of school early so the mom wouldn’t know. She got worried when the school told her they had been taken out early by their dad. She went to his place and called the cops when there was no answer. Police broke in and discovered he shot both of them and then himself. \n\nShe was in the process of divorcing him and it seems like he killed the children out of spite. So heartbreaking. As you said, it’s unfathomable how many times stories like this play out. I agree with everything you said.",
                            "score": 54,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "cookiebad",
                                    "body": "something scarily similar happened decades ago to a family friend :-( it’s just so horrible",
                                    "score": 12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "OccasionMobile389",
                                            "body": "Reminds me of the guy who blew up his house with himself and his three small sons to get back at his ex wife (early 2000s, I think also Ohio)",
                                            "score": 8
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "binhvinhmai",
                            "body": "Unfortunately we’re seeing a small uptick in domestic abuse (with a spike during COVID), primarily with fathers. Something revolving around repeating a cycle of abuse, and having power over someone who can’t fight back. \n\nNot so fun, and also not surprising fact: the vast majority of family annihilators (people who murder their whole family and then usually themselves in one act) are men. \n\nThe usual type is men who are middle aged men, elementary school aged children, a history of domestic violence, and suicidal thoughts. The usual thought process for these family annihilators is that they want to kill themselves, but they don’t want their wife and kids to live without them. It’s an entirely selfish mindset that I can’t wrap my head around.\n\nSource: https://youtu.be/5iTZ_jZ63_Q?si=zKMeafpZOmwjllnp",
                            "score": 46
                        },
                        {
                            "depth": 2,
                            "author": "throw20190820202020",
                            "body": "Well yet another crappy part is that these guys are great at being manipulative liars and posing as humans with functioning consciences and boundaries when in the “dating and early marriage” stages. A lot of abusers start their abuse when the woman is pregnant or once kids come, so right when the woman is physically dependent and vulnerable. Then when she tries to leave it’s “why did you get with him in the first place”, as if the victim is responsible for being lied to and abused.",
                            "score": 34
                        },
                        {
                            "depth": 2,
                            "author": "germanbreakfasttoast",
                            "body": "I don't disagree that there is a problem amongst men that contributes to this, but you're taking big swings here without backing them up. The data does not necessarily support your statements.\n\n>You RARELY hear this from women in comparison.\n\n[This study](https://www.aic.gov.au/sites/default/files/2020-05/ti_filicide_offenders_050219.pdf) measures rates of filicide (killing your own child) across Australia (relevant to article from OP) in the period 2000-2012 and found that the offenders were 52% male and 48% female. The sample includes 238 incidents of filicide committed by 260 offenders.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AgentKnitter",
                                    "body": "But that bare statistic overlooks a crucial detail: most women who kill their partner do so in self defence, responding to domestic abuse by grabbing anything in reach to help them as a weapon.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Church_of_Cheri",
                            "body": "I don’t think this is just the fathers, there’s plenty of stories of women doing it to. You have [Susan Smith](https://en.wikipedia.org/wiki/Susan_Smith) who tried to blame it on a black man, [Jen and Sarah Hart](https://www.yahoo.com/entertainment/horrifying-true-story-hart-family-100000604.html), [Casey Anthony](https://en.wikipedia.org/wiki/Death_of_Caylee_Anthony) who of course “didn’t” kill her daughter, and the horrible case of [Andrea Yates](https://en.wikipedia.org/wiki/Andrea_Yates) who drowned her 5 children after suffering from severe postpartum depression and a husband who refused to allow her to be treated or stop having kids. These are just the few I can think of off the top of my head.",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cupcakesandcanes",
                    "body": "Reading Burnie described like that in relation to Devonport in an international publication, as a Tasmanian, is wild!",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "InquisitiveGoldfish",
                            "body": "Especially given how many non-Tasmanian Australians have no idea where Devonport is either 🫠",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "KrakenGirlCAP",
                    "body": "💜",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "harknation",
            "body": "This and Miller casting the boy who was bullied for his dwarfism is pretty cool.",
            "score": 130,
            "replies": [
                {
                    "depth": 1,
                    "author": "party4diamondz",
                    "body": "Is that boy also in this film, or another one? :)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Financial-Painter689",
            "body": "It will always infuriate me the lengths some parents go to hurt each other over custody battles and it usually slays involved the kids suffering. But this is horrific. \n\nI hope that man worries every second in prison that someone is going to kill him, even in protected custody you’re not completely safe",
            "score": 401,
            "replies": [
                {
                    "depth": 1,
                    "author": "LilyLils15",
                    "body": "I feel really comfortable saying that these people are abusive to begin with, so it’s just not that big of a step for them to do this. They don’t see their children as individual people, they see them as property or extensions of themselves so they can justify these horrible things because it’s their “right” to do whatever they want. It’s incredibly disturbing.",
                    "score": 89
                },
                {
                    "depth": 1,
                    "author": "bits_of_paper",
                    "body": "Dear Zachary..",
                    "score": 26
                }
            ]
        },
        {
            "depth": 0,
            "author": "willgrahamluvr",
            "body": "> Spencer said he was grateful for the opportunity to be cast in the film and said he never wanted to let his trauma get in the way of achieving his goals.   \n'I've always said that I've wanted to make my burns, my scars worthwhile and I believe I've done that now,'\n\nHis attitude is so admirable. I hope this opportunity is everything he's wished for. Being in a big movie is a such a cool accomplishment - especially for a teenager! He should be really proud of himself. I'm so happy for him 🩷🩷\n\nBut jesus christ my heart is broke reading that article. Those poor wee boys 😭 That's a horrible thing for anyone to go through but little kids and at the hands of a parent?? What an evil, evil bastard. I hope he rots in jail for the rest of his life.",
            "score": 94,
            "replies": [
                {
                    "depth": 1,
                    "author": "apprehensive_trotter",
                    "body": "i don’t know if you saw but he only got twenty years :(",
                    "score": 14
                }
            ]
        },
        {
            "depth": 0,
            "author": "Zoe_Hamm",
            "body": "Horrifying! It reminded me of Josh Powell, the monster that blew up his house with his two kids inside after a judge ruled against him in a custody hearing",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "Maleficent_Golf9765",
                    "body": "And Paul and jack Sykes from Barnsley",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "sadgirlcaity",
            "body": "Dudeeeee I'm from the town where this happened what the actual fuck this hits waay too close to home",
            "score": 37
        },
        {
            "depth": 0,
            "author": "Just-Plankton-8553",
            "body": "Humans are so disgusting sometimes. I can’t comprehend bringing children into this world then trying to annihilate them in such a brutal and cruel way. 15 years in jail for that  despicable father is a travesty of justice.",
            "score": 27
        },
        {
            "depth": 0,
            "author": "moronicattempt",
            "body": "When I was youn I was in an orphanage until I was 7. I had a lot of roommates but the one that stood out was a young black kid who was burned on 90% of his body. Apparently he had not doen so.etbing right so to punish him his dad threw boiling hot cooking oil at him. I still remember the smell. I still remember the nurse that came everyday to change his bandages and take care of him. I still remember how positive he was despite all of that. I was adopted shortly after but I hope he survived.",
            "score": 22
        },
        {
            "depth": 0,
            "author": "SeaF04mGr33n",
            "body": "I love how in the last 2 Mad Max films, George has cast people with disabilities who have wanted to be in films. It's a start. Now, let's cast some actors with visible disabilities, George!",
            "score": 4
        },
        {
            "depth": 0,
            "author": "BalanceGreedy4681",
            "body": "Bear",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Awareness_Logical",
            "body": "You're an inspiration, Spencer",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KrakenGirlCAP",
            "body": "This is why I’m never having children. I want to make an impact and differences n peoples lives too. I’m also a victim of family domestic violence and them trying to kill and abuse me to hurt the other.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -57
        }
    ]
}