{
    "title": "\"No harm meant\" - Mystery lender who tried to auction off Elvis Presley's Memphis home gives up legal battle after Riley Keough's court victory",
    "comments": [
        {
            "depth": 0,
            "author": "trendingtattler",
            "body": "This post has hit r/all or r/popular and thus may not be as strictly moderated as most posts on this subreddit. Please keep this in mind when browsing the comments and please report any rulebreaking comments that you see.\n\n*This is a bot. If you require further assistance, please message the moderators via modmail.*\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AbsolutelyIris",
            "body": "Shortly after a Memphis judge ruled in favor of Riley Keough blocking a foreclosure auction of Graceland and calling for an investigation into Riley's claims of fraud, Naussany Investments has backed off.\n\n\n**A representative for the company, Naussany Investments & Private Lending, said in an email statement that it would withdraw all of its claims over Graceland.**\n\n\n**Naussany Investments had claimed that Elvis Presley’s daughter, Lisa Marie Presley - who died last year at age 54 - had used Graceland as collateral when borrowing $3.8 million** that was never repaid, according to a public notice of the intended sale.\n\n\nPresley's granddaughter, actress Riley Keough – who inherited the home after her mother's death – sued Naussany, asserting that her mother never took out the loan and that Naussany was engaged in fraud, including forging her mother's signature on multiple documents.\n\n\n**In a sworn affidavit attached to the lawsuit, the notary public listed on Naussany's documents said she never met Lisa Marie Presley or notarized her signature.**\n\n\nIn a statement, **Gregory Naussany, whose role in the company is not clear, said it would \"be withdrawing all claims\" and proceeded to blame Riley's mother, Lisa Marie Presley. He did not directly address Keough's allegations of fraud**.\n\n\n\"Due to the Deed of Trust not being recorded and the loan being obtained in different state, legal action would have to be filed in multiple states and NAUSSANY Investments & Private Lending will not acquire to proceed. That comes from consultation of the lawyers for the company. **There was no harm meant on Ms. Keough for her mothers LMP mis habits and mis managing of money**. The company will be withdrawing all claims with prejudice\"\n\n\n**In a statement, Elvis Presley Enterprises, which operates Graceland, said, \"As the court has now made clear, there was no validity to the claims. There will be no foreclosure.\"**",
            "score": 927,
            "replies": [
                {
                    "depth": 1,
                    "author": "pickle_cat_",
                    "body": "As a lender who works in the foreclosure world, there’s no fucking way they’d back off if they were truly owed $3.8 million. They should be pursued for damages, this is so clearly fraudulent. ",
                    "score": 1217,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "brokedownpalaceguard",
                            "body": "I have some familiarity with business loans and they will go after people for $10K debt.",
                            "score": 288
                        },
                        {
                            "depth": 2,
                            "author": "meatbeater558",
                            "body": "That's the first thing I thought. Their excuse was that they didn't want to go through the hassle of filing cases in three different states. Which I mean sure if they'd be getting peanuts but a $3.8 million mansion formerly owned by Elvis? ",
                            "score": 50
                        },
                        {
                            "depth": 2,
                            "author": "AbsolutelyIris",
                            "body": "Since this is your expertise, as a lender, wouldn't you have all of your documentation- especially from multiple states- ready to show the estate and the law when you are actively demanding payment and trying to auction *a landmark*? \n\n\nIt's so obviously criminal and I'm astonished Memphis let this go this far.",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pickle_cat_",
                                    "body": "Yes I absolutely would have all of that. The comment about the deed not being recorded and the loan being obtained in another state really makes no sense. You record the deed in the county where the property is located, no matter where the loan was obtained. I’d have copies of the promissory note, application, deed, payment history, etc. readily available. ",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "standdownplease",
                            "body": "This sounds like the classic squatter quitclaim scam but they fucking tried it with Elvis^((' inheritors)) lol.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PerfectZeong",
                    "body": "\"My loan lives in a different state you probably haven't met her.\"",
                    "score": 316,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DrCheeseToast",
                            "body": "Hahahaha! This is perfect 👍🏻",
                            "score": 36
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MonkeyPrinciple",
                    "body": "Lmao as a lawyer (and former litigator), this is the most hilarious answer. These guys are ass-backwards. State AG and possibly the feds are going to be poking around in no time.",
                    "score": 145,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AbsolutelyIris",
                            "body": "You are correct, Riley contacted the FBI lol",
                            "score": 82
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Unhappypotamus",
                    "body": "![gif](giphy|yRQYBNHaNH7k4tqEEY)",
                    "score": 227
                },
                {
                    "depth": 1,
                    "author": "HathorOfWindAndMagic",
                    "body": "I would be STEAMING at this “mis habits and mis managing of money” line",
                    "score": 71,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AbsolutelyIris",
                            "body": "At that point I'm suing them and taking everything and hopefully that's what Riley is going to do. ",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Civil-Attempt-3602",
                                    "body": "Find who the guy is and cockdrop him",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "robintweets",
                    "body": "Yeah withdrawing all claims not because it’s “complicated”, but because those documents were all forged.  He should be in jail.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "gunsof",
            "body": "It's absolutely insane how many grifters will try and feed off people when they're weak.",
            "score": 2332,
            "replies": [
                {
                    "depth": 1,
                    "author": "RampantNRoaring",
                    "body": "The audacity to try your luck with Graceland, too? Level 1000 boldness and level 2 intelligence there",
                    "score": 740,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thesaddestpanda",
                            "body": "We built an entire society off sociopathic capitalist values, the rat race, and dog eat dog, temporary embarrassed billionaire ethos, and we're surprised...people act this way?",
                            "score": 173,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RampantNRoaring",
                                    "body": "Yeah, I’ve realized that the key to “success” in this society is not intelligence, or ability, or hard work, or being a good person. It’s literally just…audacity. Seeing what you can get away with, and not caring what happens to anyone else. That’s why it feels like so many stupid people are in charge, they were literally too stupid to doubt themselves.\n\nI put success in quotes because I don’t want to imply that these people are succeeding in the regular sense of the word. But rather, they’re making money over people who are trying to do it the right, honest way.",
                                    "score": 94,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "butinthewhat",
                                            "body": "I’ve come to that conclusion as well. This is how the dumbest and worst people get to the top.",
                                            "score": 7
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Disastrous-Ad-2458",
                                            "body": "this is brilliantly put.\n\nlots of outlier success is just trying something the rest of society isn't for one reason or another. that means a lot of activity is independent of morals, ethics or value to humanity. it's just a bunch of greedy people trying to beat  a system.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "thesaddestpanda",
                                            "body": "A lot of people refuse to believe this but capitalism builds societies that are essentially run by and controlled by the worst and least competent people. Liberals will call Russia a kakocracy but somehow don’t think that applies to the US and EU as well as",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "missanthropocenex",
                    "body": "Thank fuck. What a dark thing to almost happen.\n\nThere’s literally nothing worse than faceless shell LLC holding companies which are certainly international handling business on things like this.\n\nThis is how office buildings and condos get left to rot, how money gets laundered and the actual humans have to suffer it as a consequence.",
                    "score": 73,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "UndaDaSea",
                            "body": "I've got bad news about the Titanic artifacts for you then :(",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bookwormaesthetic",
            "body": "Aka \"please don't pursue criminal charges.\"",
            "score": 1657,
            "replies": [
                {
                    "depth": 1,
                    "author": "Book-Piranha",
                    "body": "I hope she sues them into oblivion! Get their asses, Riley!",
                    "score": 1081,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AbsolutelyIris",
                            "body": "She NEEDS to sue or else this is going to keep happening. Considering her lawyer said this was traumatizing for her, I'm hoping she sues for damages. ",
                            "score": 1000,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "No_Berry2976",
                                    "body": "My guess is she can’t really sue. Suing for emotional damages is difficult, and rightly so. This is fraud and should be prosecuted as such. It’s a criminal offence. Normally I would use the word ‘allegedly’ but this is so obviously criminal that I left it out.",
                                    "score": 32,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Githyerazi",
                                            "body": "Whole emotional damage may be difficult to sue for, there is certainly financial damage due to the cost of defending from this fraud that she can sue for.",
                                            "score": 27
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Schneetmacher",
                            "body": "I wouldn't be surprised if this ends up leading to Scientology, to be honest. They're probably still sore Lisa Marie and Riley left.",
                            "score": 134,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AbsolutelyIris",
                                    "body": "Riley seems to sometimes be sending messages with her more obvious paparazzi photos- during the Priscilla estate drama, she made sure to be photographed wearing a Graceland t-shirt. She did it again right before the auction bullshit broke, and she was also sure to be photographed with her rather press-shy dad (whom was rumored to have left with Lisa and Riley, was living with Lisa when she died, even former scientology members have said his standing is very unclear, Keough family members said he and Riley were out). So I'm wondering if Riley is sending a message to scientology, like, is more going to come out as the fbi investigates?\n\n\nScientology could maybe not be involved at all, but I was rather alarmed by how many former members suggested this is maybe their work.",
                                    "score": 33
                                },
                                {
                                    "depth": 3,
                                    "author": "TwistyBunny",
                                    "body": "That is a good point.",
                                    "score": 24
                                },
                                {
                                    "depth": 3,
                                    "author": "gadhalund",
                                    "body": "Very very good point. Very in fact.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "NYC_Star",
                    "body": "![gif](giphy|LwyaORSd9liNZ6MyuX|downsized)",
                    "score": 25
                }
            ]
        },
        {
            "depth": 0,
            "author": "Curiosities",
            "body": "\" **There was no harm meant on Ms. Keough for her mothers LMP mis habits and mis managing of money**. \"\n\nThey couldn't just take the L, they had to add in a dig at Lisa Marie. Disgusting. Particularly if they are looking to avoid criminal/civil proceedings.\n\nNow Riley can do whatever she feels is best here, even if that's simply moving on.",
            "score": 399
        },
        {
            "depth": 0,
            "author": "heartshapedroblox",
            "body": "Riley must be exhausted. It would be deeply satisfying to see a grifter be dragged through the courts for fraud, but I’d completely support her right to just let it go and refocus her energy.",
            "score": 539,
            "replies": [
                {
                    "depth": 1,
                    "author": "Right_Way_4258",
                    "body": "And she lost her brother to suicide a few years ago. It’s sad",
                    "score": 71
                },
                {
                    "depth": 1,
                    "author": "cassanthrax",
                    "body": "She's already has to defend the estate from her grandmother.  There are vultures everywhere.",
                    "score": 119
                },
                {
                    "depth": 1,
                    "author": "AbsolutelyIris",
                    "body": "And she surely hasn't had time to even grieve her mother what with all the estate shit, work, her sisters, lawsuits, her baby...",
                    "score": 26
                },
                {
                    "depth": 1,
                    "author": "thatgirl239",
                    "body": "Yeah it’s sad. I can’t imagine all the emotions she’s feeling. I’m sure she hasn’t been able to deal with her grief at all",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Book-Piranha",
            "body": "‘No harm meant on Ms Keough for her mother’s mis habits and mis managing of money’ - UGH. What a gross statement. Very reminiscent of ‘well I don’t want to date you anyways you’re a fat ugly whore’",
            "score": 829,
            "replies": [
                {
                    "depth": 1,
                    "author": "waltzthrees",
                    "body": "Yeah they tried to steal her family home and then insulted her late mother on the way out. Evil!",
                    "score": 210
                }
            ]
        },
        {
            "depth": 0,
            "author": "gaijin91",
            "body": "it's shocking to me that this grift got so far and they almost went to auction without providing proof of the debt! if the heir wasn't Riley and was someone with less mental capacity they may have succeeded at a bogus auction of Graceland! simply breathtaking",
            "score": 345,
            "replies": [
                {
                    "depth": 1,
                    "author": "AbsolutelyIris",
                    "body": "Riley honestly needs to demand answers from not only the City of Memphis but Duval County over the notary fraud. ",
                    "score": 283,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "yogacowgirlspdx",
                            "body": "and even her lawyers for letting it get this far",
                            "score": 67
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Mysterious_Luck7122",
                    "body": "It sounds like they forged LMP’s signature on fraudulent loan documents? But I agree, I didn’t realize one could just assert a debt and start moving to foreclose!",
                    "score": 69,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LurkerOnTheInternet",
                            "body": "They forged the notary's signature/stamp too.",
                            "score": 46
                        },
                        {
                            "depth": 2,
                            "author": "viviolay",
                            "body": "Don’t they need a notary for this type of stuff for this reason? Cause if so, that person is in on it too",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BestBeBelievin",
                                    "body": "The notary the fraudsters named swore in an affidavit that they’d never notarized any documents for LMP, and went on to say that they had never even met Lisa Marie. Sounds like the fraudsters forged the notary’s signature and stamp.",
                                    "score": 52,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "viviolay",
                                            "body": "Wow. Sounds like the notary also has a case then. People be bold",
                                            "score": 29
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Suchafatfatcat",
                                            "body": "Which really makes you wonder how often these fraudsters have done this to other people and gotten away with it. 😧",
                                            "score": 10,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AbsolutelyIris",
                                                    "body": "Duval County is definitely going to be audited and investigated. ",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "eescorpius",
                    "body": "“Luckily\" this happened to a rich and famous person. If it happened to a regular person, how the fuck are they going to be able to afford all the money, time and effort spent on litigation. WTF.",
                    "score": 35,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "dmmeurpotatoes",
                            "body": "Lucky that everyone involved is famous - one of the major pieces of evidence is the notary saying they'd never met or notarised anything for Lisa Marie Presley.\n\nHow the hell are you going to get the notary to testify to that if your mom was Joyce Smith and not memorable because she wasn't famous.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FirstName123456789",
                                    "body": "I’m not sure about Tennessee, but at least where I live, notaries keep a record of every time they notarize a document and the records are pretty detailed.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "brokedownpalaceguard",
                                            "body": "100% this and online notaries (I am one) have to very stringent about this.",
                                            "score": 4
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "smootex",
                    "body": "> without providing proof of the debt!\n\nThey did provide proof it was just, apparently, fake. The system is extremely vulnerable to mildly savvy people forging paper documents. This is a pretty egregious example because of the nature of the property but a common grift is faking property transfers. It's happened in my town where scammers find empty property (usually the owner lives somewhere else) and file to get the deed in their name. If you know how to do it there are basically zero checks and balances.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "meatbeater558",
                            "body": "as always the real ULPT is in the comments",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jackay",
                    "body": "How many people with lesser means have gotten caught up in a scam like this?? It makes you sick. I hate it here.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "chadwickxlane",
                    "body": "This. I work in real estate and the amount of fraud today is RAMPANT. They do nothing for the average person. You’re on your own. Very sad!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "anythingfourselenas",
            "body": "I do wonder if this is somehow related to Scientology. I know Riley publicly left the cult a while ago and they’ve been known to do more outlandish things as punishment for leaving. In any case, what a predatory grifter swooping in like a vulture after the deaths of family members.",
            "score": 167,
            "replies": [
                {
                    "depth": 1,
                    "author": "Curiosities",
                    "body": ">In any case, what a predatory grifter swooping in like a vulture after the deaths of family members.\n\nEspecially with her mom and brother (and granddad of course) buried there, but the first two still fresh enough losses. Getting this to move so fast does kind of scream Scientology string pulling.",
                    "score": 83,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Right_Way_4258",
                            "body": "Oh I didn’t realize they were buried there!!! Omg! This is even more disgusting",
                            "score": 17
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AbsolutelyIris",
                    "body": "I've seen several former members say this stinks of scientology. The forged notary being in Florida gave me pause.",
                    "score": 144
                },
                {
                    "depth": 1,
                    "author": "battleofflowers",
                    "body": "Even the name Gregory Naussany seems made up.  I can't find literally anyone else with that last name and there is no record of this guy on ancestry (or anyone else with this last name).  The closest I can come is \"Nassany\" which appears to just be the attempted English spelling of a Syrian name.",
                    "score": 25,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AbsolutelyIris",
                            "body": "Nbc news said there is no proof Gregory or Kurt Naussany, nor Naussany Investments, exist in any form. It's incredibly creepy and bizarre. ",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "MyUsername2459",
                            "body": "I've seen several news articles that have said they can find no proof of anyone named Gregory or Kurt Naussany anywhere in the US, or any proof that this \"Naussany Investments & Private Lending\" existed in any fashion including registration of incorporation in any state or any business listings, webpage/website, social media etc.\n\nThe fact that at this hearing \"Naussany Investments & Private Lending\" didn't even show up and their side was \"argued\" by a fax received by the court signed by \"Gregory Naussany\" doesn't help.  \n\nI think the Daily Mail is the only media source claiming any kind of evidence any of these people exist, in that they say they reached out to the Naussany's at an e-mail address in the court filings and they got back an e-mail saying that after yesterday's ruling were dropping their legal complaints.\n\n. . .which doesn't make a lot of sense.  If they actually were owed millions of dollars you'd think they'd try to recoup it, but the explanation that the Daily Mail said they gave in their e-mail didn't make a lot of sense\n\nThey claimed that since they lived in one state, and Graceland is in another, they'd have to file the suit in multiple states and how that would be so time consuming and difficult. . .except that's not how civil litigation works in the US.  In a case like that, it would become a matter for Federal court under what's called \"diversity jurisdiction\" (specifically to prevent that sort of situation)\n\nIf they ACTUALLY were an investment firm that was making multi-million dollar loans, you'd THINK they'd have access to legal advice (since they weren't represented in court, since \"Gregory Naussany\" is not listed as being admitted to the Bar in any state) and even a first-year law student would know what I just said about diversity jurisdiction.  \n\nSo, that's yet another reason this is looking like a scam by some forger to steal Graceland, that they're having to run from because someone fought it.\n\nFrom what the Judge said yesterday, he seemed to think this was all a scam too.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "marigoldbutter",
                    "body": "Absolutely, it is.",
                    "score": 27
                },
                {
                    "depth": 1,
                    "author": "sarahegg",
                    "body": "i think there are rumours she went back to scientology so idk…",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "rishcast",
            "body": "so, basically, they were caught out being con artists and ran away before a judge could force them to face consequences for being con artists",
            "score": 118
        },
        {
            "depth": 0,
            "author": "EraseRewindPlay",
            "body": "Poor Riley, dealing with the tragic deaths of her brother and mother. The whole legal battle with her grandmother and uncle. And now this.",
            "score": 227,
            "replies": [
                {
                    "depth": 1,
                    "author": "rzenni",
                    "body": "I really want to know who the mystery lender was who tried to steal Graceland from Elvis’ granddaughter.",
                    "score": 48
                }
            ]
        },
        {
            "depth": 0,
            "author": "BrandonBollingers",
            "body": "Opp this grifter went for the jackpot and didn't realize that he was outsmarted by some of the best. Grifters gonna grift. I look forward to seeing where this goes. \n\nAll I can say is, no way this is his first rodeo. He's probably made a pretty penny swooping in on estates.",
            "score": 81,
            "replies": [
                {
                    "depth": 1,
                    "author": "MrYellowFancyPants",
                    "body": "EXACTLY. I hope he either gets sued by Riley for this or a criminal investigation is opened to figure out who he truly is and find his other victims. He flew too close to the sun with this one.",
                    "score": 39
                }
            ]
        },
        {
            "depth": 0,
            "author": "PuttyDance",
            "body": "Someone should steal from this guy and then say \"no harm meant\". What amazing logic",
            "score": 71
        },
        {
            "depth": 0,
            "author": "taurist",
            "body": "I’d be ready to let it go for my own peace of mind up until the dig at my mom, then it’s on",
            "score": 57,
            "replies": [
                {
                    "depth": 1,
                    "author": "AbsolutelyIris",
                    "body": "Exactly, that should be her motivation to destroy them.",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "Curiosities",
                    "body": "Same.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "NeonWarcry",
            "body": "Sue them to hell and back. Make an example out of them. Because that is predatory to a t.",
            "score": 47
        },
        {
            "depth": 0,
            "author": "nagging_nagger",
            "body": "Did these people actually hold a debt or not, because from all the evidence it sounds like they made up the debt (or at least made up the documents for the debt which is functionally equivalent) but still managed to get 1 day away from a foreclosure auction? I wonder if this kind of thing has been happening to other people on a smaller scale.",
            "score": 90,
            "replies": [
                {
                    "depth": 1,
                    "author": "AbsolutelyIris",
                    "body": "There's no way there was a debt, you're not going to abandon a nearly four million dollar debt because you lost an injunction hearing. ",
                    "score": 123,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nagging_nagger",
                            "body": "That's a big part of why it's so bizarre. Reading the email \"Gregory\" sent, they sound completely, 2024 Congo coup attempt-level inept. Yet they somehow got 1 day away from legally auctioning off fucking _Graceland_. No one knows who the people running it actually are, from the column I read in a Memphis local paper earlier.\n\n\n\nhttps://www.commercialappeal.com/story/entertainment/2024/05/21/who-is-naussany-investments-and-private-lending/73785298007/",
                            "score": 79,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RampantNRoaring",
                                    "body": "Yeah, the email is bizarre\n\n>Due to the Deed of Trust not being recorded and **the loan being obtained in different state**, legal action would have to be filed in multiple states and NAUSSANY Investments & Private Lending will not **acquire** to proceed...**mothers LMP mis habits and mis managing of money**\n\nIt genuinely reads like a foreign scam targeting seniors, not a reputable financial institution with a legal team. I selfishly want her to pursue legal action against this just so I can find out what the fuck happened.",
                                    "score": 74,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Yonderthepale",
                                            "body": "Yeah also, I'm not her lawyer but I am a lawyer, and the idea that filing in multiple states would stop them absolutely absurd",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PuuublicityCuuunt",
                                                    "body": "Exactly! Like they know exactly whats required. So shady.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "PuuublicityCuuunt",
                                            "body": "Right like a team of lawyers already knows they’re going to have to file in multiple places and is prepared to do that. ",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "AbsolutelyIris",
                                    "body": "That's exactly why I think Riley needs to demand answers because was this an inside job? Who approved this auction to almost happen? ",
                                    "score": 58
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "gracecee",
                            "body": "There would be a receipt of the wire transfer or something that shows it going from\nOne account to another account.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AbsolutelyIris",
                                    "body": "Iirc they only provided cashier checks, but didn't show the backs of the checks or whatever that it was cashed.",
                                    "score": 15
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "313378008135",
            "body": "\"File in three states just to recover 3.8million? Too much hard work. \"\n\nThe BS detector is well over 3.6 Roentgen",
            "score": 43
        },
        {
            "depth": 0,
            "author": "ExtensionFalse1320",
            "body": "my family is going thru this right now with a house we’ve owned since 1989. bold of them to go after graceland, i hope she sues them for everything they have.",
            "score": 30
        },
        {
            "depth": 0,
            "author": "AhsokaBolena",
            "body": "It's wild that they seem to have hoped they could pull a fast one and auction off such a famous estate without ANY scrutiny. This whole fraud collapsed so swiftly.",
            "score": 26
        },
        {
            "depth": 0,
            "author": "OhMorgoth",
            "body": "I LOVE HER, and I never knew she is the King’s granddaughter. Happy that she won in court. Incredibly deserving!\n\n![gif](giphy|AgPt9udT567spxbSHf)",
            "score": 26
        },
        {
            "depth": 0,
            "author": "heybart",
            "body": "Shouldn't Elvis's descendants be swimming in money and lawyers? How did this even get this far? \n\nI wouldn't be surprised if the people running the Elvis estate have been robbing the family blind",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "AbsolutelyIris",
                    "body": "If I understand correctly, the claim was submitted in 2023. Riley/estate lawyers tried to contact the entity to get more information about the claim and reached out via letter, phone and email and we're \"ghosted.\" Then they started receiving emails demanding payment, then ???? Then the auction. So it appears the lawyers were trying to resolve it but weren't getting answers/documents, started digging, entity tried to pull a desperate hail Mary and now the FBI is involved. ",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "Worldten",
                    "body": "Elvis, although the best selling solo artist of all time.\n\nGave away half his earnings to his manager and spent/“donated” most of his fortune away in his life time as is common with people who start of poor and get very rich very quick",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Novel-Suggestion-515",
            "body": "Ohhh these fucking assholes. Sue the bastards",
            "score": 37
        },
        {
            "depth": 0,
            "author": "Scared_Service9164",
            "body": "God, Riley has been fucking through it.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "leopardskin_pillbox",
                    "body": "Fr. I hope the best for her. She seems to have her head on surprisingly well given the environments she’s been surrounded by her whole life.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AbsolutelyIris",
                            "body": "Sadly, I think it might be a result of parentification or trying to be a fixer in the family since everyone else was a mess or fighting. ",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Psychological-Row880",
            "body": "Who was the attorney that filed for the plaintiff? They deserve a smack.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Intelligent_Buyer516",
            "body": "Glad it all worked out. ",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Roadgoddess",
            "body": "I didn’t realize Lisa Marie had sold off 85% of the business around Graceland. That seems unfortunate because that thing is a moneymaker. I’m kind of wondering now how much money is actually left in her estate",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "AbsolutelyIris",
                    "body": "I think the reason she kicked out Priscilla and the other guy from the estate was because they were stealing from her, and coerced her into selling 85% even though they knew it was a bad business decision? When she passed away, she had been openly inquiring about buying back some, iirc",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Roadgoddess",
                            "body": "Man, that’s even sadder",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "a-clueless-squid",
            "body": "There are scammers and fraudsters everywhere but the ones who get away with it do so because they keep their crimes under the radar and target people without the knowledge or means to fight back.\n\nTargeting GRACELAND is like full on Carmen Sandiego shit.  Like the scammer wants to get famous more than they want to be successful.  Bizarre!",
            "score": 13
        },
        {
            "depth": 0,
            "author": "makoshark281",
            "body": "I wasn't really invested in this, but that was anticlimatic. Good for her though.",
            "score": 35
        },
        {
            "depth": 0,
            "author": "somethingfunnynice",
            "body": "Mystery Lender\n\n![gif](giphy|bn0zlGb4LOyo8)",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "fuzzzybutts",
                    "body": "Hilarious 😂",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Equivalent_Night720",
            "body": "There is no way in hell that Lisa Marie would have put Graceland up as collateral for anything. More than it just being a cash cow, that  property had sentimental value to her and her plan was always to keep it in the family. F**k all these con artists.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "battleofflowers",
                    "body": "Even if she did, wouldn't these lenders have merely filed a claim with the estate when she died?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Equivalent_Night720",
                            "body": "Absolutely! That would have been the correct way to go about it if you are on the up and up. This seemed to come out of nowhere. I hope this guy goes out of business because that is some criminal activity right there.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "chicagoredditer1",
            "body": "These \"investment companies\" must attempt and get away with this kind of shit all the time if they were brazen enough to try it with Graceland.\n\nWhich makes me fucking sad for all the others who don't have Riley Keough's/Preseley's family level of fame/wealth to fight back and win.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Offandonandoffagain",
            "body": "They might as well have named their company Narwhal.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Ladyofshadows1",
            "body": "Go, Riley!\n\n![gif](giphy|lnlAifQdenMxW)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "okayfineyah",
            "body": "Says the guy after he did something harmful",
            "score": 3
        },
        {
            "depth": 0,
            "author": "blueknightgirl75",
            "body": "Unpopular opinion but does anyone else think this reeks of Priscilla trying to steal Riley’s inheritance",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "tired-bookdragon",
                    "body": "Her or the Church of Scientology. The forged notary public signature was from Florida, despite the “company” supposedly being based in Missouri. It wouldn’t be surprising at all if the Church wanted control over the Presley family once again.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "tecate_papi",
            "body": "It's not really giving up after you lost",
            "score": 5
        },
        {
            "depth": 0,
            "author": "EnchiladaTaco",
            "body": "This sounds to me, if you strip away the Graceland aspect, like regular old deed theft and mortgage fraud. Only these total idiots did it to a family with a hundred lawyers on speed dial. \n\nI’ve foreclosed on properties in a different state (as in, I’m the poor sucker who has to go stand on the courthouse steps and shout a bunch of mandated language into a crowd that is ignoring me) and it’s one of those areas that is both highly regulated and statutorily controlled but also has hundred foot wide loopholes that can be exploited.  \n\nStuff like this happens on a much smaller scale all the time and ruins lives.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "indemnne",
            "body": "welp that's not how fbi investigations work. too late.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "galaxystars1",
            "body": "Wait Elvis’ home doesn’t have landmark status?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "inmagazines",
            "body": "what did they mean then?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "watersnakebro",
            "body": "This is terrible, the last minute \"win\" sounds like an episode of Leverage!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "First_Hour7804",
            "body": "Where's Pleasant Green when you need him?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jeff_Boldglum",
            "body": "Off topic, but her last name is one letter away from being Kenough",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gadhalund",
            "body": "Very happy the scammer Naussany was stopped in his/their tracks. Absolutely unbelievable.  Dude tries to fraudulently take your families prized asset and when caught says \"no harm meant\"\nSure bro, we cool, DW about it, better luck next time?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Negotiation-Current",
            "body": "So happy for Riley. This was the last thing she needed but she handled it so well.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Steffi80",
            "body": "It’s possible she did take the loan and Riley paid it off. Glad to see what a responsible and capable leader Riley has shown she is.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PlasticInflation602",
            "body": "I simply do not care what happens to nepo babies and their stuff. Rich people in general, actually",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ConnectionOne5222",
            "body": "They thought that they could steal a national treasure! It should be listed as a historical landmark given it's long history!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "angelcat00",
            "body": "\"No harm meant, we just thought it would be cool to steal her family home while she's distracted with all of her family tragedy.\"\n\nThe balls to try to paint Lisa Marie as irresponsible with money when you can't produce any meaningful documentation to indicate that the debt even existed in the first place.\n\nRiley fought her own grandmother in court to protect the estate when Pricilla came for it, did they really think she was just going to put her hands up and say \"well I guess it's yours now\" to these schmucks?",
            "score": 1
        }
    ]
}