{
    "title": "Cassie breaks silence after Diddy assault video and reveals aftermath of domestic violence",
    "comments": [
        {
            "depth": 0,
            "author": "Plantysweater",
            "body": "https://preview.redd.it/yj6c1s3an62d1.png?width=1242&format=png&auto=webp&s=cb17a4ea6770b8ed02a90056908ace208a96eeeb",
            "score": 1572,
            "replies": [
                {
                    "depth": 1,
                    "author": "Plantysweater",
                    "body": ">> I will always be recovering from this\n\nI can only imagine, she survived a lot",
                    "score": 1128,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Right_Way_4258",
                            "body": "What we know is probably the light stuff sadly. I just want Diddy to rot in hell",
                            "score": 452,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "icestormsea",
                                    "body": "That’s what I was thinking. That’s what he was willing to do with the likelihood there were cameras there. Makes me sick to think of what she likely went through.",
                                    "score": 184,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Right_Way_4258",
                                            "body": "The freak offs and what was briefly described in the lawsuit gives me chills anytime I think about and we know they barely went into graphic detail. It literally tortured and trafficked her. I’m so glad she’s alive and has a good support system around",
                                            "score": 140
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PrincessCG",
                    "body": "The fact she addresses her younger self feeling safe and settled. My heart aches. I’m so happy she’s safe and loved - she deserves to dance a lifetime on his grave",
                    "score": 220
                },
                {
                    "depth": 1,
                    "author": "Right_Way_4258",
                    "body": "I’m sending her so much love. She truly put everything on the line with that lawsuit",
                    "score": 106
                }
            ]
        },
        {
            "depth": 0,
            "author": "Pink_Blacksmith",
            "body": "The fact that it took a heartbreaking video for her to be believed is so sad. And ALSO because it was CNN a reputable news station that released it. If it had been just leaked online, some people would have still made excuses about the validity of the video. And that’s the disappointing part because people will not believe victims the first time. And unfortunately, not everyone has the means to have their abuse recorded or caught on tape.",
            "score": 624
        },
        {
            "depth": 0,
            "author": "Due-Secret-3091",
            "body": "Gosh, sending her so much love. For what she went through and then the aftermath of people denying her claims when she broke her silence.. She’s always deserved better.\n\nIt’s also still so wild to me that Diddy issued an apology via an Instagram story. Like this wasn’t backlash for a past tweet or similar wrongdoing. This is a domestic violence case that he should’ve been jailed for. He’s a monster.",
            "score": 189
        },
        {
            "depth": 0,
            "author": "TinyLaughingLamp",
            "body": ">**To contact the National Domestic Violence Hotline, call 1-800-799-7233, text \"START\" to 88788, or visit** [**their website.**](https://www.thehotline.org/)\n\n>**Anyone affected by abuse and in need of support can contact the National Domestic Violence Hotline (1-800-799-7233). Advocates are available 24/7 and can also be reached via live chat on** [**thehotline.org**](https://www.thehotline.org/) **or by texting \"START\" to 88788 or \"**[**LOVEIS**](https://www.loveisrespect.org/get-relationship-help/)**\" to 22522.**",
            "score": 662
        },
        {
            "depth": 0,
            "author": "icestormsea",
            "body": "The fact that it took a video for some to believe her is shameful. Just a small drop in the bucket of those in the same situation but without the video to vindicate them. I hope Cassie is able to heal her younger self and is continued to be surrounded by love. ❤️",
            "score": 96
        },
        {
            "depth": 0,
            "author": "1LofaLady",
            "body": "Her statement per the article:\n\n\"Thank you for all of the love and support from my family, friends, strangers, and those I have yet to meet,\" she began.\n\n\"The outpouring of love has created a place for my younger self to settle and feel safe now. But this is only the beginning.\n\n\"Domestic violence is THE issue. It broke me down to someone I never thought I would become. With a lot of hard work, I am better today, but I will always be recovering from my past.\n\n\"Thank you to everyone who has taken the time to take this matter seriously. My only ask is that EVERYONE open your heart to believing victims the first time, it takes a lot of heart to tell the truth out of a situation that you were powerless in.\"\n\nShe added: \"I offer my hand to those who are still living in fear. Reach out to your people, don't cut them off, no one should carry this weight alone.\n\n\"This healing journey is never-ending, but this support means everything to me. Thank you. Love always, Cassie.\"",
            "score": 209
        },
        {
            "depth": 0,
            "author": "Glowy-Dewdrop",
            "body": "Her request for victims to not cut off their people is so real. I was abused for five years and towards the end, I felt like I had no friends left because he was SO good at getting me to isolate myself from others and I didn’t realize it happened until there was no one I could turn to. I stayed cause I thought I’d die if I left, and left because I knew I’d die if I stayed. I was fortunate to forge a connection with an old friend to help get me out. You need people, period. \n\nAnd she’s right that the journey never ends. Happily married now and I couldn’t watch the video nor can I consume any content that even hints towards domestic violence (sorry to Blake lively and Justin baldoni, I guess). \n\nSending love to anyone this story has been hard for.",
            "score": 90
        },
        {
            "depth": 0,
            "author": "Wild_Nectarine666",
            "body": "I got chills reading her statement. No words to describe that trauma. As a stranger I’m grateful she’s able to bask in love, SAFETY, comfort, and find healing surrounded by her loved ones. Our duty is to not let only “sensational” stories be the motivation to seek justice- there’s countless victims in our everyday lives who need our help, our love, our encouragement, our strength, our hand. It’s a lifestyle change that will hopefully lead to a societal shift, and I love seeing so many other compassionate souls moved to take action 🩷",
            "score": 30
        },
        {
            "depth": 0,
            "author": "SadMaryJane",
            "body": "Some of the reposts on ig have the most vile comments saying she didn't mind getting her payday and she still stayed with him. These people are unhinged.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "kingjavik",
            "body": "I am glad she got justice. Most people don't.",
            "score": 13
        }
    ]
}