{
    "title": "Congress Just Made It Basically Impossible to Track Taylor Swift’s Private Jet",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "**This post is currently restricted so that only approved members can comment or post. Please note that your comment may be approved if the moderators feel it adds to the discussion.** \n\nTo be added as an approved member, please message the mods via modmail by clicking [here](https://www.reddit.com/message/compose?to=/r/Fauxmoi). We are currently only approving users who have a recent comment history on this sub and do not have a history of rule violations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "alltheprettynovas",
            "body": "congress, i think you have more important things to focus on…",
            "score": 5565,
            "replies": [
                {
                    "depth": 1,
                    "author": "etchuchoter",
                    "body": "We all know their priority is billionaires",
                    "score": 262
                },
                {
                    "depth": 1,
                    "author": "MeeranQureshi",
                    "body": "Agreed.",
                    "score": 242
                },
                {
                    "depth": 1,
                    "author": "ellastory",
                    "body": "Like banning TikTok?",
                    "score": 39
                },
                {
                    "depth": 1,
                    "author": "Amar_Akbar_Anthony20",
                    "body": "Forreal. What the actual fuck.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "myfriendtoldmetojoin",
            "body": "![gif](giphy|xt98N1EXdEIzC)\n\nDon’t they have better things to do?",
            "score": 1372,
            "replies": [
                {
                    "depth": 1,
                    "author": "ellastory",
                    "body": "Clearly not. Children have been dying in school shootings for decades and there still are no meaningful gun laws to push back on that. Their priority seems to be Taylor Swift and TikTok atm",
                    "score": 65
                }
            ]
        },
        {
            "depth": 0,
            "author": "BestBeBelievin",
            "body": "Different set of rules for the rich. Her plane info was not being put out there in real time, so her screaming, “bUT My saFeTY!” was bullshit, and it didn’t require the intervention of Congress. But, sure, they can keep pretending that we have no right to call out climate criminals, and that we poors are all to blame for climate change, because we don’t recycle enough.",
            "score": 4882,
            "replies": [
                {
                    "depth": 1,
                    "author": "boxybrown84",
                    "body": "It makes me so fucking mad. Plenty of people who really are being threatened need all the protection congress can offer, but, no, they aren’t rich/famous/straight/white enough to matter.\n\n![gif](giphy|EtB1yylKGGAUg)",
                    "score": 1501
                },
                {
                    "depth": 1,
                    "author": "kenscrack",
                    "body": "and the “safety” shit is so stupid to me because all of this is ALREADY public information that anyone can find. these people (elon, taylor, etc) aren’t worried about safety they’re just mad that they’re being called out for their climate crimes.🙃",
                    "score": 825
                },
                {
                    "depth": 1,
                    "author": "MeeranQureshi",
                    "body": "Agreed.Double standards.",
                    "score": 123
                }
            ]
        },
        {
            "depth": 0,
            "author": "icestormsea",
            "body": "Thank goodness they are tackling these important issues right away!! /s",
            "score": 110
        },
        {
            "depth": 0,
            "author": "VegetableBeneficial",
            "body": "Miami just had 2 days of a 112 degree heat index in May but ok sure we can keep protecting climate criminals\n\nJesus, the wealthy and powerful aren’t even pretending that they’re not trying to screw the rest of us over and let us suffer anymore",
            "score": 1076,
            "replies": [
                {
                    "depth": 1,
                    "author": "OverrunSun-98",
                    "body": "I live in Cairo and for the past 10 years, we’ve gotten record-breaking heat every year. This year especially has been horrible, with temps reaching 50°C during Spring. “Heat waves” are now 75% of the time. Fuck billionaires, fuck her private jets and her need for “security” aka ease and exclusivity, and fuck corporations emitting tons of carbon and other pollutants.",
                    "score": 64,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "VegetableBeneficial",
                            "body": "God I’m so sorry. That’s horrible",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "BestDamnT",
                    "body": "between her overexposure, bullshit charting behavior (releasing variants when other popstars drop their albums), and this bs, blondie's fall is going to be HARD - hopefully she was kind to others on her way up (we know she wasn't lolololol)",
                    "score": 234,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "spacestarcutie",
                            "body": "White supremacy remains strong. She will be fine no matter what. While Taylor is the face she has a whole army of white men managing her career/business. They manage her like a Forbes 500 corporation. She is one of them.",
                            "score": 50
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Now_Wait-4-Last_Year",
            "body": "“Basically impossible”\n\nInternet - challenge ~~excepted~~ accepted.",
            "score": 679
        },
        {
            "depth": 0,
            "author": "Normal-Basis-291",
            "body": "Billionaires control a lot.",
            "score": 515
        },
        {
            "depth": 0,
            "author": "ItsBrutalinHere",
            "body": "“A popular conspiracy theory has postulated that the pop star has intentionally seeded news stories—such as her attendance of a New York Jets game involving her beau Travis Kelce—purely in an effort to bury the keywords “Taylor Swift” and “jets” in Google’s search index.….”\n\nCalling it a conspiracy theory is pretty lame lmao that’s literally how she’s always behaved about every piece of even slightly bad press tho. She immediately does shit to distract. How you gonna acknowledge her “tightly protected and controlled” public image and then soften on that 😂. Can’t be too hard on her I guess!!!\n\nAnyway, fuck billionaires. They will literally always get what they want.",
            "score": 2081,
            "replies": [
                {
                    "depth": 1,
                    "author": "invaderpixel",
                    "body": "The most obvious was during the Travis Kelce old tweets scandal. All the fatphobic tweets hidden by “he spelled squirrel wrong!” fluff pieces and “he posted about what restaurants he was going to and ordinary things he was doing just like the vast majority of social media users in the early 2010s”",
                    "score": 69,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GroundbreakingBite96",
                            "body": "All the swifties posting all of his ‘cute’ tweets because they don’t care how much he sucks. At the same time, as soon as they break up they’re going to use those tweets against him.",
                            "score": 14
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fine-Tank9849",
            "body": "Not even american but it’s wild how normalized is to pollute the world to that degree and still expect people to believe you’re not killing us. \nTax her more idk, find a way to make it harder for rich people because her usage of private jets is nuts",
            "score": 347
        },
        {
            "depth": 0,
            "author": "Kidgorgeoushere",
            "body": "‘Phew, now nobody can call me the sky landlord anymore 😇’",
            "score": 323
        },
        {
            "depth": 0,
            "author": "jonsnowme",
            "body": "![gif](giphy|IL1sMUfQVRNFC)",
            "score": 388
        },
        {
            "depth": 0,
            "author": "penderies",
            "body": "Her entire brand is exhausting.",
            "score": 232
        },
        {
            "depth": 0,
            "author": "Icy-Trust-6274",
            "body": "Flying commercial could also protect her safety (and our planet)",
            "score": 93
        },
        {
            "depth": 0,
            "author": "mc-tarheel",
            "body": "![gif](giphy|xUA7biThNaTvj5GiZi)",
            "score": 21
        },
        {
            "depth": 0,
            "author": "B33fboy",
            "body": "At this point I wish her the worst.",
            "score": 119
        },
        {
            "depth": 0,
            "author": "blodreina11",
            "body": "Ew, this goes way beyond Taylor Swift. Any private jet owñer can anonymize their flights now...",
            "score": 19
        },
        {
            "depth": 0,
            "author": "Strict-Sprinkles",
            "body": "The fact that she has this kind of political influence, and that THIS is what she uses it for in this day and age, just speaks volumes. Taylor is for herself and herself only. ",
            "score": 38
        },
        {
            "depth": 0,
            "author": "meatbeater558",
            "body": "now trump just needs to call biden a swiftie and it's gg",
            "score": 151
        },
        {
            "depth": 0,
            "author": "novostained",
            "body": "So glad they’re on top of the important shit like [criminalizing the acknowledgment of Palestinian humanity](https://apnews.com/article/df4ba95dae844b3a8559b4b3ad7e058a) and giving [socialized healthcare (among other financial and legal benefits not afforded to US civilians) to Americans who join the IOF](https://truthout.org/articles/new-bill-would-extend-us-military-benefits-to-americans-serving-in-the-idf/) and [threatening the ICC, including members’ *families*](https://www.cair.com/press_releases/cair-condemns-sec-blinkens-implicit-threat-to-help-senate-republicans-target-icc-over-israel-arrest-warrants/) for the audacity to recognize things like the forced starvation of millions being a fucking war crime (and just one among fuck knows how many.. and counting).\n\nAnd fuck Taylor’s Fern Gully demon ass.",
            "score": 17
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": -66
        }
    ]
}