{
    "title": "Dexter Prequel Series Reveals Cast — Patrick Gibson will play a young Dexter Morgan",
    "comments": [
        {
            "depth": 0,
            "author": "Efficient-Outcome-23",
            "body": "But how could they possibly improve on OG young Dexter!?\n\nhttps://preview.redd.it/jqg0tol0s72d1.jpeg?width=828&format=pjpg&auto=webp&s=04556fe8540beb4173c83cc9ea1e63c71d942c20",
            "score": 234,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wise-Bet6814",
                    "body": "Omg. It's giving \"How do you do, fellow kids?\" ",
                    "score": 66
                },
                {
                    "depth": 1,
                    "author": "Comprehensive-Win-24",
                    "body": "Hahahahah",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "patpitpout",
            "body": "How to ruin this show for a 3rd time...",
            "score": 132,
            "replies": [
                {
                    "depth": 1,
                    "author": "Geraldinho--",
                    "body": "I couldn’t even finish the sequel. I couldn’t believe what I was watching",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Geosaurusrex",
                            "body": "It was good until the last episode, where they shat all over it.",
                            "score": 16
                        },
                        {
                            "depth": 2,
                            "author": "Mindless_Cucumber526",
                            "body": "I actually loved the sequel! Beats the hurricane and the Debra kiss...",
                            "score": 7
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Intelligent-Salt-926",
            "body": "Stop. Enough. Just let Dexter die.",
            "score": 67
        },
        {
            "depth": 0,
            "author": "GeetarEnthusiast85",
            "body": "People like to talk about how Game Of Thrones has been \"forgotten\" because the final season was so bad.\n\nBut what about Dexter?  It was a huge deal when it was airing and then ended with a wet fart.  The sequel that was supposed to \"fix\" things didn't make a lot of waves and now it's all an afterthought.",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "skyisscary",
                    "body": "The sequel has great ratings though.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Thmsthms_",
                    "body": "Sequel was good until the last episode. I didn't feel like it was fixing anything because of the ending.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Tonedeafmusical",
            "body": "Gibson is only 6 years younger than Hall when he started playing Dexter (29 to 35)....\n\n\nLike I get it's still technically a young version of the character but the age difference is so small between them already.\n\n\n\n\nAlso why? Why?",
            "score": 49,
            "replies": [
                {
                    "depth": 1,
                    "author": "QweenFiona",
                    "body": "My thoughts exactly. The reboot was disappointing enough. I don’t have a hope that this one will be better 🙄",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "PhoenixDowntown",
                    "body": "Michael C Hall has a more mature looking face (is there a nice way to say this? ugh) than Patrick does, perhaps.  Definitely not saying he looked old or anything.  Patrick Gibson wouldn't be my first choice for this, either way.  I also didn't like the son in New Blood.  It's just hard to replicate whatever it is that MCH has, I think, for Dexter 🤷‍♀️",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "GuaranteeGlum4950",
            "body": "https://i.redd.it/3hdhyo76x72d1.gif",
            "score": 24
        },
        {
            "depth": 0,
            "author": "DarkFlame122418",
            "body": "![gif](giphy|yHh4B7IIATaTAcru8Z|downsized)",
            "score": 41
        },
        {
            "depth": 0,
            "author": "ey3s0up",
            "body": "I wish they would just let this show rest. I haven’t even seen the latest season because people said it was bad.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "howmuchcant",
                    "body": "I don’t think it was that bad as a standalone season of Dexter, however we were expecting it to undo all the bullshit from the finale and tie up loose ends and it did none of that. If you go in knowing that then it’s whatever.",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ey3s0up",
                            "body": "That makes me so upset because the ending of the original series was just…bad. I might try it eventually, but it’s definitely a low priority compared to other shows and movies that have come out",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AmbiensCouch",
                    "body": "It was so bad 😭 what REALLY gets me is there was definitely potential for it to be an okay last season, some episodes had me absolutely hooked. Clancy Brown?? He was fantastic in this role!! It's a real shame it fell apart. The parts I liked made the let downs so much worse tbh",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ey3s0up",
                            "body": "Another user said if I went into it not thinking it’s supposed to tie up loose ends I’ll be okay. And if it means seeing Clancy Brown in anything I’ll check it out. I’ll just have to keep an open mind. Hopefully I won’t get too upset",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "morbidlonging",
            "body": "Can we just let Dexter finally go? The first four seasons were perfect but everything, literally everything, after that was so hard to get through! Im not going to watch this. ",
            "score": 9
        },
        {
            "depth": 0,
            "author": "mizzymichie",
            "body": "Let it die",
            "score": 6
        },
        {
            "depth": 0,
            "author": "R12B12",
            "body": "I normally hate the phrase “Who asked for this?” but it was literally the first thought that popped into my head when I saw this.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "kwitzachhaderac",
            "body": "I am one of the biggest Dexter (the show, not the serial killer) apologists out there. I think the original show is one of the greatest of all time. Season 8 sucked but I've always liked and defended the season 8 finale.\n\nAll that said, New Blood was fucking insulting to the original and a prequel would be even worse. Fuck this.\n\nThere are no unanswered questions. Season 1 thoroughly covered his backstory. Seasons 1-8 were a really solid character development arc. Nobody in the world could play this character except MCH.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "arabicdialfan",
                    "body": "I love Dexter! It's a classic. I don't care if the sequel or prequel is terrible, I want it!!",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "bigblackkittie",
            "body": "i guess i'm the only one excited for this.  i love that show.  even the bad episodes.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "PhoenixDowntown",
                    "body": "I was mad at the ending of:  \nthe books  \nthe og show  \nthe continuation  \n  \nbut, I will be sat.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bigblackkittie",
                            "body": "are the books good?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PhoenixDowntown",
                                    "body": "I think I like all of them but two.  I even think the last book was good until near the end.  It's been forever since I've read them, but the one I really didn't care for was Dexter's Final Cut.  I also thought the kids (Astor and Cody) were so annoying in the books and could have done without them entirely.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "angel_kink",
            "body": "Please just let it die. I gave the revival a chance hoping it’d help from the original finale and it didn’t. I’m not going to put myself through this a third time.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "SolidusTengu",
            "body": "![gif](giphy|wYyTHMm50f4Dm|downsized)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Comprehensive_Main",
            "body": "Who will be young deb ?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Eighthfloormeeting",
            "body": "Idk if anyone can do Dexter like he did though. Even if it is the younger version.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "skyisscary",
            "body": "That Dexter opening is iconic though, how do you even compete with that. It and Monk had great opening. I wouldn't even fast forward when it started.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hatefromandie",
            "body": "Part of me desperately doesn’t want them to ruin this but I’m such a sucker for a prequel.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DireBaboon",
            "body": "Just like a twisted serial killer they keep killing it and reviving it for their sick sexual (monetary) satisfaction",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CindyshuttsLibrarian",
            "body": "As a shadow and bone fan I am happy for Patrick Gibson",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Thmsthms_",
            "body": "I wish Patrick Gibson would get a better project. Also, this cast doesn't even look like the OG one.",
            "score": 1
        }
    ]
}