{
    "title": "Bella Hadid Makes A Statement With A Palestine-Inspired Keffiyeh Dress In Cannes",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "**This post is currently restricted so that only approved members can comment or post. Please note that your comment may be approved if the moderators feel it adds to the discussion.** \n\nTo be added as an approved member, please message the mods via modmail by clicking [here](https://www.reddit.com/message/compose?to=/r/Fauxmoi). We are currently only approving users who have a recent comment history on this sub and do not have a history of rule violations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Gayfetus",
            "body": "https://preview.redd.it/6xpm84zk672d1.jpeg?width=1537&format=pjpg&auto=webp&s=95888a933c503180b55a32d5200b0536df16b02d\n\nFull body shot of the dress!\n\nThe ongoing attempts to ban and censor the keffiyeh is disturbing. People aren't just committed to genocide in Palestine, they want to eliminate all traces of Palestinian people and culture from around the world.",
            "score": 2211,
            "replies": [
                {
                    "depth": 1,
                    "author": "doubleshortdepresso",
                    "body": "An MPP in my province was censured for wearing a keffiyeh 🥴",
                    "score": 130,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "historyhoneybee",
                            "body": "Hello fellow Ontarian. I hate it here.",
                            "score": 40,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "doubleshortdepresso",
                                    "body": "We are in the trenches fr",
                                    "score": 37
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "xpgx",
                    "body": "Yes, absolutely, and I will add on: the silencing and erasure of Arab voices entirely by vilifying and demonizing our language. When we say “Intifada” it only means “to shake off” something by rising — not violence. When we say “martyrs” we mean all untimely deaths — we call people who drown martyrs, too, or people who die of cancer. But Western media has decided that it means “dying while fighting” and are using that as a “gotcha” against us. We can’t even mourn the martyred children, whose only crime was to be born on the wrong side of an arbitrary border, without having to go on immediate defense about our language. The way that our entire language and culture are so quickly and easily demonized and policed is so wild to me. An Arab cannot speak without being called barbaric and violent by Western media. The growing anti-Arab sentiments in the West are so shocking and its even more shocking that its just quietly being normalized.",
                    "score": 463,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "The_Bravinator",
                            "body": "The martyr one seems particularly malicious given that martyrdom is a really important concept in (at least) Catholicism and people don't seem to take issue with that. It's not a new or unfamiliar word.",
                            "score": 138
                        },
                        {
                            "depth": 2,
                            "author": "grossepatatebleue",
                            "body": "I feel this. Like our entire language is just villainized.\n\nEven just basic words—like our word for God, “Allah” is turned into this weird “barbaric Muslim god” in the Western imagination. For non-Arabs reading this…Allah literally just means God. If you want to say Jesus is God as a Christian in Arabic, you would say “Yasou3 Allah”.",
                            "score": 13
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jenryalee",
                    "body": "Thank you. It's cultural erasure to act like the keffiyeh is a symbol of Hamas support or something borderline racist like that, which only further shows how this is a straight up genocide. ",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "ProdigalPancake",
                    "body": "The IDF monsters burned books in a university on Gaza recently but its not a genocide right? Its not ethnic cleansing right?",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Shelala85",
                    "body": "After the Nakba didn’t Zionists want the expelled Palestinians to be absorbed into the neighbouring Arab populations? The more you deep dive the more you can see why Raphael Lemkin considered cultural genocide to be integral to the concept of genocide.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "lld287",
            "body": "I don’t know a ton about her, but I know enough to know she genuinely loves fashion for much more than how she looks in clothing. She seems like the real deal as far as people in the industry doing it for a love of the art",
            "score": 719
        },
        {
            "depth": 0,
            "author": "mcgillhufflepuff",
            "body": "I hate that she's going to get harassment and probably even death threats over this.",
            "score": 633,
            "replies": [
                {
                    "depth": 1,
                    "author": "MoonriseTurtle",
                    "body": "She already does",
                    "score": 339,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mcgillhufflepuff",
                            "body": "Oh I know she does but talking about from wearing this dress",
                            "score": 91
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "loulou-v",
            "body": "She never misses at Cannes. I'll never forget that Schiaparelli lungs dress but this one is definitely my favorite now. ♥️",
            "score": 97,
            "replies": [
                {
                    "depth": 1,
                    "author": "glaminsttropez",
                    "body": "That lung dress is my Roman Empire",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "OverrunSun-98",
            "body": "What a serve!\n\n![gif](giphy|l0ErOKzQcir2IRFYY)",
            "score": 158
        },
        {
            "depth": 0,
            "author": "_iheartmo",
            "body": "Queen!",
            "score": 179
        },
        {
            "depth": 0,
            "author": "BeanEireannach",
            "body": "Our principled Queen!! Saoirse don Phalaistín ❤️🇵🇸✊",
            "score": 335,
            "replies": [
                {
                    "depth": 1,
                    "author": "Just-Plankton-8553",
                    "body": "I have seen this phrase a few times. I know Saoirse means freedom because I went to school with two twins named Saoirse and Siobhan. So does it mean ‘freedom to Palestine’ in Irish?  I’m not super familiar with the different dialects so I hope my question is not coming across as rude. ",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "xxyourbestbetxx",
            "body": "This is a cute dress even without knowing the message but I admire her for speaking out in every way she can.",
            "score": 82
        },
        {
            "depth": 0,
            "author": "97355",
            "body": "Once again and forever\n\n![gif](giphy|r9zAl4fMw6OefW8wwp|downsized)",
            "score": 168
        },
        {
            "depth": 0,
            "author": "Traditional_Maybe_80",
            "body": "And that's a beautiful dress, too!\n\n(I can already imagine deranged Zionists accusing her of this being a nod to Abu Obaida or something.)",
            "score": 136
        },
        {
            "depth": 0,
            "author": "Financial-Painter689",
            "body": "It boils my piss so much that in order to show your support for Palestine you have to pull little tricks like this and Cate and will still get mass amounts of hate. \n\nYet people can wave the Israel flag and nobody bats an eyelid. \n\nThe false narrative going around yesterday about those IDF women getting captured by Hamas made me sick to my stomach. Basic translations disproved what the Zionists claimed and they still just run with the propaganda \n\nNot to mention also yesterday them saying Ireland, Norway and Spain were neutral on WW2 and remain nazi supporters 🙄",
            "score": 265
        },
        {
            "depth": 0,
            "author": "fuckityfuckfuckf_ck",
            "body": "Yaaaaa habibti 🙌❤️",
            "score": 52
        },
        {
            "depth": 0,
            "author": "Wild_Nectarine666",
            "body": "For a long time I just assumed she was like the other nepo baby models- but good god this woman keeps proving that she’s a genuinely good hearted real ass person with integrity! The talent and beauty and money she has could literally isolate her from so much, but she goes out of her way to be a strong voice and inspiration. I’m a certified Bella Hadid fangirl in the biggest way now",
            "score": 57
        },
        {
            "depth": 0,
            "author": "ceci_mcgrane",
            "body": "![gif](giphy|AgPt9udT567spxbSHf)",
            "score": 45
        },
        {
            "depth": 0,
            "author": "otraera",
            "body": "Princess of Nazareth ❤️",
            "score": 43
        },
        {
            "depth": 0,
            "author": "eveningsuns",
            "body": "love it. free palestine!! 🇵🇸❤️",
            "score": 53
        },
        {
            "depth": 0,
            "author": "nightkween",
            "body": "Love the dress!!!!",
            "score": 27
        },
        {
            "depth": 0,
            "author": "_cornflake",
            "body": "🇵🇸🇵🇸🇵🇸",
            "score": 26
        },
        {
            "depth": 0,
            "author": "Negative-Flan-7155",
            "body": "Palestinian girl here - just in desperate need of this dress immediately 😭",
            "score": 5
        },
        {
            "depth": 0,
            "author": "altdultosaurs",
            "body": "Stunning. Love.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "zecira",
            "body": "I admire her integrity so much. Unfortunately, that shitty song about attacking her or whatever is going to hit the top of the Israeli charts again over this :/",
            "score": 5
        },
        {
            "depth": 0,
            "author": "wanttowatchbees",
            "body": "beloved princess of nazareth <33",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Celebrating_socks",
            "body": "She’s really grown on me over time. Respect her so much for continuing to voice support for Palestine even through all of the abuse she’s gotten for it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ginger_ryn",
            "body": "ok yeah i need that dress",
            "score": 1
        },
        {
            "depth": 0,
            "author": "capoulousse",
            "body": "Good for her! I like more and more All the time.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ladyculture",
            "body": "A simply flawless look.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "pineappleqqqq",
            "body": "Does anyone know where to get a similar dress?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "_Lorgee",
            "body": "![gif](giphy|AgPt9udT567spxbSHf)\n\n👏🏼👏🏼👏🏼",
            "score": 1
        },
        {
            "depth": 0,
            "author": "shades0fcool",
            "body": "I want one 🥹",
            "score": 2
        }
    ]
}