{
    "title": "Quinta Brunson reveals her career dream is to write a Hallmark movie: \"I hope they let me, but it's going to be under a fake pen name. It won't be me so you guys don't know\"",
    "comments": [
        {
            "depth": 0,
            "author": "Redshirt2386",
            "body": "“… or NOT enjoy it, just like you do the other ones”\n\nI feel seen lmao",
            "score": 209
        },
        {
            "depth": 0,
            "author": "bookwormaesthetic",
            "body": "What is y'all's favorite Hallmark movie?\n\nI'll go first, The Most Wonderful Time of the Year (2008) is my fav, I even have it on DVD so I can watch it every other year. Fun Uncle Henry Winkler and Warren Christie trying to get corporate analyst single mom to relax for the holiday.\n\nhttps://preview.redd.it/sq1gcmmeg82d1.png?width=1080&format=pjpg&auto=webp&s=5c904ec0e81f74d34ce812eca70f151a4ac934de",
            "score": 52,
            "replies": [
                {
                    "depth": 1,
                    "author": "Throwaway68024",
                    "body": "Mine is “The Spirit of Christmas.” The male character takes the form of a human for 12 days in the year during the Christmas season. Obviously, a romantic relationship develops between him and the female character who is in charge of selling the Inn that his spirit is tied to.\n\nhttps://preview.redd.it/4khna7m1i82d1.jpeg?width=873&format=pjpg&auto=webp&s=a6a2442ed563d3b96f668e644940799070214cb4",
                    "score": 29,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pelipperr",
                            "body": "I watched this because of How Did This Get Made, what a film lol",
                            "score": 10
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AhsokaBolena",
            "body": "Speaking as a person who also watches a worrying amount of Hallmark around Christmas... I would like to see it!",
            "score": 100
        },
        {
            "depth": 0,
            "author": "sammybnz",
            "body": "Drew is always giving soooo much",
            "score": 31
        },
        {
            "depth": 0,
            "author": "Question4theppl5",
            "body": "Relatable Queen",
            "score": 17
        },
        {
            "depth": 0,
            "author": "nabilabila",
            "body": "I want this to happen so so so so so bad. I know she has the pull to get the best actors to star in it, too.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "party4diamondz",
            "body": "I might watch a Hallmark movie if she writes it!",
            "score": 6
        },
        {
            "depth": 0,
            "author": "ReasonablVoice",
            "body": "We’ll still be able to tell because it’ll be the only Hallmark movie not starring a bunch of white people.",
            "score": 19
        },
        {
            "depth": 0,
            "author": "bloodredyouth",
            "body": "She could pull a will Ferrel and star in one too!",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Vajama77",
            "body": "Christmas after my parents died, I was so depressed,  what got me through the next Christmas season were these Hallmark movies. Corny as they can be, they made me feel better. My three favorites are The Christmas Card (an oldie but goodie) Christmas in Angel Falls & A Christmas to Remember w/Mira Sorvino. I watch them every year.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "LiterallyLearn",
            "body": "Hallmark get her on the phone now! ",
            "score": 1
        }
    ]
}