{
    "title": "Ticketmaster and Live Nation Should Be Broken Up, DOJ Will Say in New Lawsuit",
    "comments": [
        {
            "depth": 0,
            "author": "MasterK999",
            "body": "Wait a second. Letting one company control venues, promotion and ticketing is not good for customers? I am shocked. /s",
            "score": 394,
            "replies": [
                {
                    "depth": 1,
                    "author": "StonyOwl",
                    "body": "After they pinky promised not to do exactly that when their merger was approved",
                    "score": 106
                }
            ]
        },
        {
            "depth": 0,
            "author": "mangoesandsweetness",
            "body": "fingers crossed this will cause a domino effect and take down other monopolies 🤞🤞🤞🤞🤞",
            "score": 95,
            "replies": [
                {
                    "depth": 1,
                    "author": "demonsrunwhen",
                    "body": "it won't, but this is why you should keep voting. the biden DOJ has been fighting many anti trust cases and they've stopped a lot of mergers in the interest of consumers",
                    "score": 84
                },
                {
                    "depth": 1,
                    "author": "clownpunchindracula",
                    "body": "Albertsons and Kroger are attempting to merge, which will create de facto grocery monopolies in Alaska and large parts of Washington state (other areas too, I think, but those are the ones I'm familiar with). We gotta fight this shit, they never stop trying",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "roxy031",
            "body": "![gif](giphy|J8FZIm9VoBU6Q)",
            "score": 136
        },
        {
            "depth": 0,
            "author": "hearmymotoredheart",
            "body": "![gif](giphy|huqZyE0FDGpfEmp0Ng|downsized)",
            "score": 33
        },
        {
            "depth": 0,
            "author": "asphodel-",
            "body": "https://covertactionmagazine.com/2024/05/14/mca-shining-the-spotlight-on-the-octopuss-hollywood-tentacle/\n\nTicketmaster and Live Nation literally got big because of their mob and CIA connections through their former CEO Irving Azoff. And yeah, I don't like the \"tentacle\" framing of this article but it's a reference to The Octopus mini-series.",
            "score": 108
        },
        {
            "depth": 0,
            "author": "15k_bastard_ducks",
            "body": "Oh, yes. I'd very much like for the job that Pearl Jam started to be finished. Please and thank you. It's been a long time coming.",
            "score": 23
        },
        {
            "depth": 0,
            "author": "earlyviolet",
            "body": "Ooh! Ooh! Let's do United HealthCare next!!",
            "score": 20
        },
        {
            "depth": 0,
            "author": "impeccabletim",
            "body": "**[Mirror link in case you hit a paywall.](https://archive.ph/XNcGZ)**\n\n---\nAbout damn time they do something about this monopoly.🔨",
            "score": 18
        },
        {
            "depth": 0,
            "author": "BowieCleo",
            "body": "We should also implement a law where you can’t charge so aggressively for resale tickets like they do in some parts of Europe.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "PeaceDry1649",
            "body": "Ok why do we keep getting updates on the production of this like it’s a film. Do it already instead of telling us what you’re going to do!",
            "score": 10
        },
        {
            "depth": 0,
            "author": "superr_rad",
            "body": "They should’ve never been allowed to merge in the first place",
            "score": 7
        },
        {
            "depth": 0,
            "author": "streetsahead483",
            "body": "It’s about time. I’m not the biggest Taylor fan, but I’m glad that her fans and the insane market for her tickets led to this.",
            "score": 50,
            "replies": [
                {
                    "depth": 1,
                    "author": "Comprehensive-Fun47",
                    "body": "Aren't her fans willing to pay the insane prices? They haven't boycotted Ticketmaster. How did they lead to this?",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "streetsahead483",
                            "body": "It has less to do with the prices and more to do with the entire system. You can read about it [here](https://www.rollingstone.com/music/music-news/doj-live-nation-ticketmaster-antitrust-suit-1235012538/).",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Comprehensive-Fun47",
                                    "body": "I understand the whole system is rotten. What did Taylor Swift fans do that led to this lawsuit?\n\nThe tour itself brought the Ticketmaster issue into the spotlight again, I'll give you that. To say her fans led to this is giving them credit for something that didn't happen.\n\nLiterally everyone has been complaining about Ticketmaster for decades.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AppearanceDry6039",
                    "body": "lol what",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Venezia9",
                            "body": "These people will give that woman credit for literally anything and everything. And never ask her to responsibility for her actual actions. ",
                            "score": 14
                        },
                        {
                            "depth": 2,
                            "author": "streetsahead483",
                            "body": "You can read about the outrage [here](https://www.rollingstone.com/music/music-news/doj-live-nation-ticketmaster-antitrust-suit-1235012538/). Whatever you think about Taylor, her fans are absolutely correct that Ticketmaster is a shitty monopoly.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "taydraisabot",
            "body": "ELI5 the effects if the two companies are split up? Will tickets be more affordable?",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "mindenginee",
                    "body": "Possibly. But I don’t know tbh if this will lead to anything crazy. If they break up, they will still be the two biggest ticketing companies and still have exclusive contracts with many of the biggest venues, meaning many artists are forced to work with them to be able to tour. \nIt could help smaller venues compete, and not have to pay to use Ticketmaster. But Ticketmaster and live nation would still possibly have the biggest share of the industry. \n\nBur this could possibly lead to more legislation or regulations in the industry, I hope. One big thing would be regulating that resale tickets can’t be more than a certain % of the ticket, or more than the OG ticket value. That would help so much with the insane price gouging we see..",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "justanothersong",
                            "body": "If only they could address the mass-purchase bots that clean out online ticket sales before actual consumers can get a ticket!",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mindenginee",
                                    "body": "Yes this too. Obviously the verified pre sale for “fans” doesn’t work when bots and resellers can sign up for it too. They could give out to exclusive top listeners partnered with like Spotify, but that sounds very convoluted.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Schneetmacher",
            "body": "![gif](giphy|uTuLngvL9p0Xe|downsized)",
            "score": 9
        },
        {
            "depth": 0,
            "author": "BeneficialReporter46",
            "body": "Do it!!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "JayeJJimenez",
            "body": "So should all these other big Conglomerates like Disney...",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Pristine_Example3726",
            "body": "Like I love that this is being taken care of, but the fact that the government let it get this bad….",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ahambone",
            "body": "Hurry up and do this before Trump comes back and makes any lawsuit disappear",
            "score": 1
        }
    ]
}