{
    "title": "Justice Department says illegal monopoly by Ticketmaster and Live Nation drives up prices for fans",
    "comments": [
        {
            "depth": 0,
            "author": "InviteNecessary1032",
            "body": "Nosebleeds for under $100 again please ☝️🙏",
            "score": 99,
            "replies": [
                {
                    "depth": 1,
                    "author": "YouAintFreshAsImIs",
                    "body": "Bruh I paid $300 for 100 section seats for Beyonce and Jay z OTR. It felt absolutely insane. Like I was embarrassed to tell my mom how much I paid.\n\n\n10yrs later I wonder how much those same seats would be to see them. Or Beyonce alone hell. ",
                    "score": 39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Winter-Leadership376",
                            "body": "Literally same and I was able to get FOUR! Can’t imagine how much or how hard those tickets would have been to get at her latest tour. I used to get pit tickets for huge bands for like 150 a decade ago. Now it’s like 1k ",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "YouAintFreshAsImIs",
                                    "body": "I've had floor seats twice to see Kanye (pre him losing his mind) and I, now an adult with a nice job, cannot imagine buying floor seats to someone that big again. This was peak Kanye too.\n\n\nDamnI just realized there's prob a generation of adults who only know Kanye as crazy Kanye. That was a wave. 😭",
                                    "score": 8
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "AstrudsSecretLover",
                            "body": "Bro i just paid $350 to get floor seats for Gambino. I remember when i was 16 in 2011, floor seats for a kid cudi show was $65. \n\nFuck ticket master. Fuck live nation. I hope every one of their executives dies broke",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "UhmmmNope",
                            "body": "I paid like $900cad each for club renaissance. I was lucky enough to get a presale code. They were upwards $3k when it opened to gen pop. I would never spend this $900 on another artist. This price is for Beyonce only. I hope the US lawsuit is successful and Canada follows suit. Our monopolies are getting just as bad.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "orangeinbloom",
                    "body": "I went to a whole 3 day music festival just to see My Chemical Romance because there’s no justifiable reason why obstructed nosebleed seats should EVER be that expensive. Paid only $150 more and got a much better experience.",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "cloudydays2021",
            "body": "https://preview.redd.it/sy720zkpd72d1.jpeg?width=258&format=pjpg&auto=webp&s=7c408d32932b80f7465dccb7d0cf6609bf3ec14a\n\nI remember when Pearl Jam filed a complaint against Ticketmaster with the DOJ in 1994, alleging that Ticketmaster had a monopoly over ticket distribution due to connections with venues and that the service fees charged were unfair.\n\nIt’s about fuckin time some shit gets done about this",
            "score": 76,
            "replies": [
                {
                    "depth": 1,
                    "author": "AnE1Home",
                    "body": "This has been an issue for that long? Wow.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GroundbreakingBite96",
                            "body": "Yeah I feel like no one took any action until it involved Taylor Swift which sucks but they’ve been ignoring artists for years on this issue",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "woahoutrageous_",
            "body": "Whattttt monopolies are baddddd???? I never knew that. I’m shocked I tell you\n\n![gif](giphy|tfUW8mhiFk8NlJhgEh|downsized)",
            "score": 127,
            "replies": [
                {
                    "depth": 1,
                    "author": "littleliongirless",
                    "body": "I'm actually old enough to remember when monopolies weren't allowed...and how that legislation died, one pillar at a time 😭",
                    "score": 59
                }
            ]
        },
        {
            "depth": 0,
            "author": "YouAintFreshAsImIs",
            "body": "As a Xennial, I went to sooo many concerts. I started going in middle school being dropped off with friends. And like, we were using allowance money saved up and going to large arenas. Yeah, we had our share of nosebleeds but it was just a given that any artists you loved coming to your area you were going if you could grab tickets before it sold out.\n\n\nLet the kids go see the Wretched again and have big fun! ",
            "score": 38,
            "replies": [
                {
                    "depth": 1,
                    "author": "reallyintothistho",
                    "body": "This is what oisses me off the most about this issue. Like, ok, as an adult I can decide whether or not I want to dish out for my fav, but kids these days are completely priced out. My fam lived below the fpl for all my youth, but I still managed to scrounge up 25-45  bucks to see my fav. Access to these experiences in your formative years feels really special. It’s kinda heartbreaking that money is an obstacle to that.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "impeccabletim",
            "body": "**[Full lawsuit via The New York Times](https://www.nytimes.com/interactive/2024/05/23/us/23livenation-lawsuit.html?unlocked_article_code=1.uE0.zhTB.uwuks7TKwPd9&smid=url-share)** (no paywall)",
            "score": 18
        },
        {
            "depth": 0,
            "author": "overwhelmed_robin",
            "body": "![gif](giphy|4IXWdc8uo74ic)\n\nTake 'em down.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "swanfaerie88",
            "body": "This is great, but this is only one of the major issues that makes TM so awful. Bots and resellers need to be cracked down on, reselling prices should be regulated, and dynamic pricing should be done away with. These are the things preventing tickets from getting into the hands of people who actually want them!",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "TK_TK_",
                    "body": "Yes, thank you! Definitely a “yes, and” situation.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "swanfaerie88",
                            "body": "Dynamic pricing never fails to enrage me. It's crazy that someone can pay $600 more for a ticket than someone else just because they were 2 minutes behind them in the queue.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Luna_Soma",
            "body": "![gif](giphy|LhmPgbR4iLIw3LoCsl|downsized)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "jonsnowme",
            "body": "![gif](giphy|3oKIPuBx0SDOhdISAw|downsized)",
            "score": 10
        },
        {
            "depth": 0,
            "author": "best-commenter-ever",
            "body": "https://preview.redd.it/cq40fac7p72d1.jpeg?width=640&format=pjpg&auto=webp&s=5d30675efa293392d91f246cd050f9f3c4776033",
            "score": 7
        },
        {
            "depth": 0,
            "author": "tells_eternity",
            "body": "But the original merger in 2010 was approved by the DOJ?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ZealousidealSea2737",
            "body": "Duh",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Thick-Definition7416",
            "body": "Finally",
            "score": 1
        },
        {
            "depth": 0,
            "author": "canarinoir",
            "body": "Finally!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sixtus_clegane119",
            "body": "Ticketmaster and live nation often get more money than the artist. I’m what logic is that anywhere close to being just and fair?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sovtherngothicvvitch",
            "body": "![gif](giphy|6Tl18958jFdxC)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "One_Ad1822",
            "body": "![gif](giphy|xT5LMwICyWFYmNg6n6)",
            "score": 1
        }
    ]
}