{
    "title": "Billie’s manager reposts and likes thread detailing how Taylor Swift prevents other artists from shining, like Sza Olivia and Billie",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "**This post is currently restricted so that only approved members can comment or post. Please note that your comment may be approved if the moderators feel it adds to the discussion.** \n\nTo be added as an approved member, please message the mods via modmail by clicking [here](https://www.reddit.com/message/compose?to=/r/Fauxmoi). We are currently only approving users who have a recent comment history on this sub and do not have a history of rule violations.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Fauxmoi) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "HolyPoppersBatman",
            "body": "I definitely think Taylor and her team are extremely greedy and want every achievement they can get at whatever cost, but ultimately I think the only way to fix this is if the charts actually change the way they take their data. These extra remixes, versions, vinyls etc all counting towards the same sale is just SCREAMING for fraudulent shit to happen.",
            "score": 2137,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wit-wat-4",
                    "body": "It’s very “rules don’t say a dog can’t play basketball”, as much as that reference gives my age away",
                    "score": 353,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "baby_betty_davis",
                            "body": "not airbud 😭😭",
                            "score": 77
                        },
                        {
                            "depth": 2,
                            "author": "ApathicSaint",
                            "body": "AirBud is that you?",
                            "score": 36
                        },
                        {
                            "depth": 2,
                            "author": "nevalja",
                            "body": "a perfect film",
                            "score": 56
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Fun-Loss-4094",
                    "body": "Billboard changes rules for kpop artists but they never do for taykor. ",
                    "score": 706,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jonsnowme",
                            "body": "Cause she historically pays a lot of money for privileges and awards and special treatment.",
                            "score": 168,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SoGenuineAndRealMadi",
                                    "body": "She is also white and American. Kpop artists are not",
                                    "score": 118
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "HiThereImNewHere",
                            "body": "Which means they'll probably change it after BTS gets no.1 with their post-enlistment reunion album.",
                            "score": 28
                        },
                        {
                            "depth": 2,
                            "author": "Miserable-Ad-1581",
                            "body": "Billboard will delete millions of views/streams etc for BTS on REGULAR",
                            "score": 13
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Professional_Cod_776",
                    "body": "Yes and it’s really important to her to win everything and be the top at everything.  She’s is just childish.",
                    "score": 41
                },
                {
                    "depth": 1,
                    "author": "Precarious314159",
                    "body": "On the flipside, if they counted as individual sale, then it's possible that someone like Swift would take multiple slots on the top 10 sales. Either she's ahead by a large margin or overshadows others on the list. It's something they need to figure out.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "mittonkitten",
            "body": "is it unprofessional? yes. it is hilarious? also yes.",
            "score": 4068,
            "replies": [
                {
                    "depth": 1,
                    "author": "Illustrious_Fix2933",
                    "body": "Lmao he wants ALL the smoke from the rabid swifties",
                    "score": 519,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sometimesomwhere",
                            "body": "He's going to get it. They found old Tweets.\n\nhttps://preview.redd.it/o0fziu0h382d1.jpeg?width=1179&format=pjpg&auto=webp&s=45a5dbc6506c03047ded2fd8a478f35a7dd535f0",
                            "score": 618,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jonsnowme",
                                    "body": "Everyone should like this one",
                                    "score": 279
                                },
                                {
                                    "depth": 3,
                                    "author": "catshatecapitalism",
                                    "body": "Incredible tweet tbh",
                                    "score": 152
                                },
                                {
                                    "depth": 3,
                                    "author": "OhMorgoth",
                                    "body": "I mean, he is not wrong. \nJust today there was something somewhere that they are printing a shit ton of stickers to turn the night sky “amber” or whatever with phone flashlights for her Lyon show.\n\nDo they think of that environmental impact? We’re talking about single use plastics that become microplastics which are now posing a health risk because they are being found in female breastmilk or even testicles. \n\nNot even kidding you.\nSo, if her fans want to talk bs about her traveling less, that means absolutely nothing when she’s still polluting the planet left and right just so that a certain light color can make her seem fab during a one night show. Not even going to get into the details of the sourced materials. \n\nCan be paper, plastic coatings, harmful toxic chemicals that wind up in landfills or cannot be incinerated and if they are, those particles become microplastics, unless she is having them print eco-friendly biodegradable stickers that are made of recyclable materials.\n\nAnything other than is belligerent, reckless and negligent behavior not to mention exploitative.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Sometimesomwhere",
                                    "body": "https://preview.redd.it/k2m83onh382d1.jpeg?width=1163&format=pjpg&auto=webp&s=407950070a6e5cebd76d67dd352b58adb0834c27\n\nExample:\n\nThis was from an award show where Taylor didn't win. Even though I dislike Taylor, I don't get why he's pressed.",
                                    "score": 39
                                },
                                {
                                    "depth": 3,
                                    "author": "syrub",
                                    "body": "Not the Carbon Emissions Department I’m DYING",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheHiddenFox",
                            "body": "I don't understand why they get so mad about it. If they wanted to continue to worship her, they could be like, \"She's a ruthless business woman! She's so smart with her business moves and good at capitalism!\" Instead, they try to act like she doesn't do these things?\n\nNewsflash: you don't become a billionaire by being a good person. Billions aren't made, they are stolen.",
                            "score": 261,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "spiritriser",
                                    "body": "Tbf content creators, celebrities and artists are some of the few professions where it makes sense to me to get rich.\n\nI had to Google Taylor's net worth (1.1b). That's wild. You for sure do not get 1.1 billion without other people giving up their hard earned money for you. There just isn't a way to provide that much value to the world as a single person. I wonder how much of that is in stocks",
                                    "score": 29
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hokagesarada",
                    "body": "is it true? also yes.",
                    "score": 1864
                },
                {
                    "depth": 1,
                    "author": "Groot746",
                    "body": "I'm not sure how \"unprofessional\" it is: it's a valid criticism from a manager looking after their client's interests, really ",
                    "score": 315,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mittonkitten",
                            "body": "unprofessional might be too strong a word, but it kind of reminds me of when someone would “whisper” except they’d talk loud enough because they clearly wanted to be overheard. maybe passive aggressive was a better word choice",
                            "score": 123,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "seitanapologist",
                                    "body": "It's brazen. Most people in this position have a lot to benefit by keeping these sorts of opinions quiet, but not so much to benefit by putting it out there for everyone.",
                                    "score": 32
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jonsnowme",
                    "body": "I don't think it's unprofessional- it's time the industry started calling her bullying out.",
                    "score": 238,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CloneUnruhe",
                            "body": "Unprofessional? Her manager doesn’t work with or for Taylor Swift.z",
                            "score": 38
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GrayEidolon",
                    "body": "Does it matter if the people who make largely disposable music are a little rude to each other? People like TS rely on being polite to peoples’ face to get away with garbage behavior.",
                    "score": 89
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 26
                },
                {
                    "depth": 1,
                    "author": "Fine-Tank9849",
                    "body": "I agree but i think that making swifties mad isn’t helping billie in any way.",
                    "score": 62,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "luxenoire",
                            "body": "Billie’s already got her second Oscar, she’ll be fine.",
                            "score": 16
                        },
                        {
                            "depth": 2,
                            "author": "Pinkglosse",
                            "body": "Her music is incredible and people WILL listen so who cares what the swiftie cult thinks?",
                            "score": 155,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "swaglessnseattle",
                                    "body": "And she is two oscars ahead of Taylor 🤷🏻‍♀️",
                                    "score": 35
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "fitzstreet",
                            "body": "Who cares if the swifties are mad lmao",
                            "score": 33
                        },
                        {
                            "depth": 2,
                            "author": "tmqueen",
                            "body": "That’s fine. swifties have no taste.",
                            "score": 68
                        },
                        {
                            "depth": 2,
                            "author": "Mindless_Cucumber526",
                            "body": "Yeah let's just eternally let the bully bully so you don't upset their sidekicks. Sometimes you just have to draw the line",
                            "score": 15
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MeeranQureshi",
                    "body": "Agreed.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Odd-Picture5321",
            "body": "TS a capitalist girl boss feMEnist that loves to put other women down or only use them when convenient.",
            "score": 2538,
            "replies": [
                {
                    "depth": 1,
                    "author": "at145degrees",
                    "body": "I keep thinking of TS as Sophie Lennon from Mrs. Maisel. Beloved and seem infallible at first. The upcoming stars just take the bullying quietly or behind the scenes.",
                    "score": 312
                },
                {
                    "depth": 1,
                    "author": "Cathymorgan-foreman",
                    "body": "Girlboss, gaslight, gatekeep.",
                    "score": 31
                },
                {
                    "depth": 1,
                    "author": "rTGaMAtenT",
                    "body": "I'm not a fan of Taylor, Stan, or anything else, but isn't this the cutthroat rivalry in the business?",
                    "score": -10
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 967,
            "replies": [
                {
                    "depth": 1,
                    "author": "rzenni",
                    "body": "They might, but Taylor has a lot of power, a lot of money, a wide range of friends, and a vindictive streak.  It’d be pretty dangerous for someone like SZA to start a fight with Taylor because Taylor is very likely to win that fight. \n\nOn the other hand, Billie Eilish has a lot going on for her and she seems like she wants to make this an issue, so we’ll see where this goes!",
                    "score": 488,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NYC_Star",
                            "body": "Billie has a number of Grammys, two Academy Awards, and access to the film world (which Taylor is DESPERATE to infiltrate but has only been as successful as her turn in Cats). Most importantly Billie has time. She’s 22 to Taylor’s 34. \n\nThat’s not old (Taylor’s bday is the month after mine and I’m but a new born babe) but it’s a lifetime in our your focused culture. Taylor will eventually lose to time and become a legendary but less influential act on a day to day like Madonna, Cher, or Xtina. Unlike Gaga (and Cher and Streisand before her), who has the talent to transition to film or stage or both Taylor doesn’t have the range for Hollywood despite her power. Billie and Olivia and SZA (despite being the same age but much more talented) have decades ahead of them while Taylor’s stuck at 17 self has been wearing thin since the Rep era. ",
                            "score": 300,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Traditional_Owl_601",
                                    "body": "Don’t forget Taylor’s riveting and key role in the 2010 romcom Valentine’s Day! /s",
                                    "score": 23
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Time_Basket9125",
                            "body": "Taylor should be careful of all of them. There's only so many enemies you can make. Picking the most influential/up and coming playmakers in music is a dumb move (for someone so \"strategic\" and businessminded). Not to mention the blatant plagiarism of Olivia's get him back when Taylor literally took her to court for the same thing.",
                            "score": 26
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AbsolutelyIris",
            "body": "He unliked it, link the thread!\n\n\nI hope more artists are vocal about her bullshit, tbh ",
            "score": 528,
            "replies": [
                {
                    "depth": 1,
                    "author": "kenscrack",
                    "body": "[here it is, 122k likes 🙃](https://x.com/jdkaknak/status/1791573465230668060?s=46)",
                    "score": 251,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AbsolutelyIris",
                            "body": "Thanks, babes!",
                            "score": 58
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sudden_Clementine872",
            "body": "![gif](giphy|dAWLHu5CuJSvMhpRqi|downsized)",
            "score": 48
        },
        {
            "depth": 0,
            "author": "Simmibrina00",
            "body": "Oh it’s going to get messy … but I’m here for it 🍿\n\n![gif](giphy|FusPIfrg3sid2)",
            "score": 43
        },
        {
            "depth": 0,
            "author": "factor_supa",
            "body": "The pop girlies are fighting 🍿",
            "score": 63
        },
        {
            "depth": 0,
            "author": "Right_Way_4258",
            "body": "Oh it’s getting real! The girls are truly fighting! I swear Katt Williams did not lie. We just got over the Kendrick beef and now the pop girlies are publicly feuding passive aggressively. I’m living lol",
            "score": 74
        },
        {
            "depth": 0,
            "author": "borderlinehunkydory",
            "body": "I’m definitely not a Taylor fan or Stan or whatever but isn’t this the brutal competition in the industry? All artists trying their best to secure the number one position? Definitely it’s a little weird that Taylor is very calculative about her moves but can’t exactly blame an artist to release new music or different versions of it? Also, Billie has been super professional about her stance against Taylor and not taken her name which is the best strategy but her manager is ruining it for her by being just petty lol. I definitely get why Billie is feeling what she is and she has every right to but the manager needs to learn from her lol.",
            "score": 350,
            "replies": [
                {
                    "depth": 1,
                    "author": "meepmarpalarp",
                    "body": "I feel bad for Billie because from everything I’ve seen, she seems low-drama. I really do believe that her comments about album variants were more introspective; she regrets the environmental impact of making multiple variants, but feels like she has to to play the game. \n\n> I wasn’t singling anyone out, these are industry-wide systemic issues. And when it comes to variants, so many artists release them — including ME! which i clearly state in the article. The climate crisis is now and it’s about all of us being the problem and trying to do better. Sheesh.\n\nPeople took it and ran with it, and now everybody’s talking about how she has a beef with Taylor. Has Billie ever had a public beef with anyone? They’re competing for top spots on the chart, but that’s not personal; it’s just business.\n\nI’m side eyeing her manager for adding fuel to the fire. Maybe he thinks the controversy will boost sales, but it seems like it could majorly backfire.",
                    "score": 77,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "frannyzooey1",
                            "body": "This whole thing reminds me of beefs in the 90s that were stirred up to sell newspapers. The artists rarely disliked each other but people talked about it non stop. I’d be surprised if Billie and Taylor are even in a feud over this. Billie’s manager seems messy though!",
                            "score": 19
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "frannyzooey1",
                    "body": "Also three times in seven years doesn’t feel like a pattern. Maybe she’s just putting the remixes out when they’re ready/when they were scheduled. I feel like hastily creating remixes just to mess with the competition is a bit of a stretch. Like you said, most artists seem to be putting out remixes and special editions. It doesn’t always need to be calculated.",
                    "score": 180
                },
                {
                    "depth": 1,
                    "author": "Sometimesomwhere",
                    "body": "To a degree, it's hypocritical of Billy and co to be going after Taylor for variants. Billy also has variants and thereby contributes to the same problem she is criticizing Taylor for. While Billy has less of an impact than Taylor, she is still engaging in similar behavior.\n\nThis will be a stan war. It's not a case where throwing stones from glass houses is a good idea. Here's to hoping Billie and those tied to her don't have anything that Swifities can dig up to use.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 27
                }
            ]
        },
        {
            "depth": 0,
            "author": "Traditional_Maybe_80",
            "body": "I mean, sure, in general all this competition over getting into that Billboard chart getting 87 remixes out, etc. seems unnecessary, but also I feel like managers (or people who work directly with artists) shouldn't be doing this online? You aren't a stan?",
            "score": 263,
            "replies": [
                {
                    "depth": 1,
                    "author": "Shenanigans80h",
                    "body": "Yeah especially when this ultimately comes down on Billie. And sure maybe that’s what she wants or this is not extension of her opinion, but at the same time it seems like a weird thing for a manager to do in general",
                    "score": 24
                }
            ]
        },
        {
            "depth": 0,
            "author": "clubpenguinMLG",
            "body": "her managers are zionists before people start getting too excited\n\n[danny rukasin](https://x.com/zionistsinmusic/status/1778469711610851490)\n\n[brandon goodman](https://x.com/zionistsinmusic/status/1778122115419611520)",
            "score": 614,
            "replies": [
                {
                    "depth": 1,
                    "author": "Right_Way_4258",
                    "body": "WHAT?!? Not surprising",
                    "score": 151
                },
                {
                    "depth": 1,
                    "author": "BeanEireannach",
                    "body": "Ewwww. I guess it kinda explains why they’re so comfortable being publicly bitchy & messy - no real consequences before for pushing gross zionist propaganda 😬",
                    "score": 143
                }
            ]
        },
        {
            "depth": 0,
            "author": "glittertherave",
            "body": "The internet is forever. I’m not sure if this is 100% (I’m leaning towards it being real as there are various different screenshots of this before it was deleted)\n\nWhile I’m seated for this, I do think this was a huge misstep on his part. He obviously realized once it gained Swiftie traction, which resulted in it getting deleted. I do believe that Billie feels a certain type of way (as she should) but him doing this is just going to cause more issues and take away from the important conversation to be had, by turning it into a stan war. It also just doesn’t look good professionally.\n\nI agree with him and it’s a pattern that needs to be discussed. Just maybe not like this.\n\nAnywho\n\n![gif](giphy|tyqcJoNjNv0Fq|downsized)",
            "score": 135,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ittybitty995",
                    "body": "I just don’t understand why everyone is expected to act professional and ‘do the right thing’ when Taylor is manipulating the charts and playing dirty. Why does everyone have to be so the right thing when she never does. It’s so refreshing to see someone sink down to her level, maybe if more people spoke up she wouldn’t feel so comfortable continuing her shitty business practices. The only reason she keeps doing it is because she gets away with it.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "vainthestral",
            "body": "🍿",
            "score": 66
        },
        {
            "depth": 0,
            "author": "doomsdaysock01",
            "body": "They’re not wrong",
            "score": 148
        },
        {
            "depth": 0,
            "author": "CynicalXennial",
            "body": "Billionaires doing Billionaire predatory shit? No way.",
            "score": 22
        },
        {
            "depth": 0,
            "author": "Fun-Loss-4094",
            "body": "Loving the direct shade honestly everyone acts like Taylor is some God and u cant say anything to her. Billie talked about vinyl variants and climate change there was no direct link to taylor but somewhat u can't say it's wrong to things which taykor is doing. Like where 8s freedom of speech ",
            "score": 76
        },
        {
            "depth": 0,
            "author": "kenscrack",
            "body": "[link to the twitter thread since he unliked](https://x.com/jdkaknak/status/1791573465230668060?s=46)",
            "score": 26
        },
        {
            "depth": 0,
            "author": "ImaginaryBig1705",
            "body": "As you can see there are no good billionaires. \n\nBut I'm preaching to the choir here.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "Windermere15",
            "body": "Capitalism strikes again. Sighhh",
            "score": 22
        },
        {
            "depth": 0,
            "author": "NYC_Star",
            "body": "Tell the truth and shame the devil. ",
            "score": 30
        },
        {
            "depth": 0,
            "author": "apbmarch",
            "body": "good, it’s about time she got called out on being super petty! maybe now other people in the industry will stop living in fear of taylor swift",
            "score": 104,
            "replies": [
                {
                    "depth": 1,
                    "author": "Right_Way_4258",
                    "body": "Billie is only new pop girlie with the pull and security to pull this off and hopefully we start having a serious conversation about changing the charts system. She’s clearly over the BS even though she still has to play the game. I bet so many artists hate it and are pissed behind the scenes. I don’t care if this is unprofessional. Her team did this intentionally and that’s why he also unliked. He didn’t have to keep it up long bc he knew everyone would see it. I bet it’s super messy BTS right now.",
                    "score": 107
                },
                {
                    "depth": 1,
                    "author": "Consistent-Dog-73",
                    "body": "I literally also hate her announcing her albums in the grammys like pls let the attention for once be on the people who won the awards. Its tacky as hell.",
                    "score": 49
                }
            ]
        },
        {
            "depth": 0,
            "author": "Small_Ad255",
            "body": "My god no amount of success is enough for Taylor, and to think I remember when she tried to dethrone SOS last year and failed and got backlash from fans because she wanted them to buy exclusive digital covers and old audio clips to increase her sales.",
            "score": 108,
            "replies": [
                {
                    "depth": 1,
                    "author": "venusrevived",
                    "body": "Love how that backfired on her. Unfortunately she got her way this time, but the fact that Billie has 2 Oscars to her name, as well as more industry respect than she'll ever get probably makes her fume endlessly. Which is quite pleasing to me ngl.",
                    "score": 40
                }
            ]
        },
        {
            "depth": 0,
            "author": "genescheesesthatplz",
            "body": "Im super glad people are finally starting to call pur how toxic she is. Its looooong overdue.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "OUtSEL",
            "body": "ngl if Billie doesn't get her flowers for this album I might go insane and I'm not even a stan",
            "score": 17
        },
        {
            "depth": 0,
            "author": "proshittalker17",
            "body": "first taylor came for olivia rodrigo and now she’s sabotaging billie eilish like this woman is terrified of being replaced and/or becoming irrelevant.",
            "score": 22
        },
        {
            "depth": 0,
            "author": "fluffycat16",
            "body": "Well, the statement ain't wrong. Taylor IS NOT a feminist.",
            "score": 57
        },
        {
            "depth": 0,
            "author": "RAV3NH0LM",
            "body": "she sucks and they’re right lmao.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "at145degrees",
            "body": "Is it just other women she and her team do this to?",
            "score": 20
        },
        {
            "depth": 0,
            "author": "tmqueen",
            "body": "Billionaire Taylor Swift picks herself up by her bootstraps so that she can step on other artist’s necks.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "littleb3anpole",
            "body": "I remember when Swifties freaked out en masse because Lover got knocked off the top chart spot by Tool’s Fear Inoculum. Old mate and her team planned to take down other female artists but didn’t anticipate the power of the Tool fan base and their rabid desire for a new Tool album",
            "score": 8
        },
        {
            "depth": 0,
            "author": "ImaginaryFondant7345",
            "body": "This is super unprofessional",
            "score": 132,
            "replies": [
                {
                    "depth": 1,
                    "author": "DawnDishsoap_Duck",
                    "body": "Why is it that certain types of people use “respect” and “professional” to mean “I can do whatever I want and if you call me out it means you’re the aggressor”",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "sharksarentsobad",
                    "body": "So is what Taylor is doing.",
                    "score": 178,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "myersjw",
                            "body": "Her PR person engages in weird unprofessional shit all the time too",
                            "score": 63
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jenryalee",
                    "body": "Nope; she should get called out for shady business practices. Timing releases solely to screw over other artists is unprofessional.",
                    "score": 31
                },
                {
                    "depth": 1,
                    "author": "baby_barbiez",
                    "body": "What? To be honest?",
                    "score": 38
                }
            ]
        },
        {
            "depth": 0,
            "author": "ams3000",
            "body": "The carbon emissions department is INSPIRED!!!!!!!",
            "score": 5
        },
        {
            "depth": 0,
            "author": "fashioncoat",
            "body": "Well they’re not wrong",
            "score": 6
        },
        {
            "depth": 0,
            "author": "anitasdoodles",
            "body": "How many versions of every album does she have? I'd be interested to know how much money a swiftie drops on all that crap.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Nice-Web583",
            "body": "Well, there was no lie told.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "baby_barbiez",
            "body": "Tbh she can’t outshine Billie’s album with her pathetic attempt at another era. Billie’s music is being praised by multiple people from various genres and people who do not even listen to her music in general",
            "score": 27
        },
        {
            "depth": 0,
            "author": "meepmarpalarp",
            "body": "The Katy Perry one was definitely calculated, but does the SZA one seem like a stretch to anyone? Why could Taylor care whether SZA got a fourth week on the chart? That seems like such a random number; why would she specifically try to prevent a fourth week? It seems just as likely that she was waiting until after the holidays so she wouldn’t be overshadowed by Christmas Queen Mariah.\n\nIt also didn’t block SZA, who dominated the charts until Morgan Wallen’s album in March.",
            "score": 1
        }
    ]
}