{
    "title": "Does Anyone Have Tea On... Weekly Discussion Thread",
    "comments": [
        {
            "depth": 0,
            "author": "wheniwasolder",
            "body": "Just started watching Derry Girls (obviously because of Nicola). Any tea about the cast/show??",
            "score": 134,
            "replies": [
                {
                    "depth": 1,
                    "author": "Joyfulmovement86",
                    "body": "The creator is in the process of making a new show about a group of female friends in their 30s",
                    "score": 263,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "miseryandregrets",
                            "body": "Amazing news!",
                            "score": 57,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Joyfulmovement86",
                                    "body": "I know, I’m so excited. Apparently it’s going to be called How to Get to Heaven from Belfast",
                                    "score": 96,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "miseryandregrets",
                                            "body": "OMG I want it NOW",
                                            "score": 25
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "oldfilmjanitor",
                            "body": "She had a show before Derry girls called London Irish about 20 somethings living in London. Only had one series",
                            "score": 30,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "chhrihanna",
                                    "body": "iirc Sister Michael & the priest were also in it ",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "StorkyTheBigStork",
                                    "body": "She had another show staring Paul Mescal called The Decived. Unfortunatly, it was not very good.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "party4diamondz",
                            "body": "Does this mean she can cast the same actresses again? /hj",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Meka3256",
                    "body": "Best. Show. Ever.    \n  \nNot sure what country you are in, but if you have access to Great British Bake Off (Channel 4 in UK/Ireland, Netflix in other countries), watch the Christmas special with the Derry Girls cast.  It's the funniest Christmas special ever.  Really funny.\n\nIf you have twitter, Siobhán McSweeney (Sister Michael) is worth following.  She is funny and normal.  She also presents The Great Pottery Throw Down, where she is also funny.\n\nSaoirse-Monica Jackson (Erin) is engaged to DJ Denis Sulta.",
                    "score": 105,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MrYellowFancyPants",
                            "body": "Omg I watched the bake off episode before I saw Derry Girls. I was howling with laughter and immediately binged DG. It's so, so great.",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "DevoutandHeretical",
                            "body": "Siobhan is also hilarious as the mom in Extraordinary.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PatsysStone",
                                    "body": "I live Extraordinary almost as much as Derry Girls. Hope it gets more wildly popular!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GosmeisterGeneral",
                    "body": "Not exactly tea but wish only the best for sweet man Dylan Llewellyn - if you haven’t seen Big Boys, it’s brilliant and he’s amazing in it.",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HappyOrca2020",
                            "body": ">sweet man Dylan Llewellyn\n\nI get the fuzzies every time I see him onscreen. He deserves the best.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "p_turbo",
                                    "body": ">Dylan ***Llewellyn***\n\nHa!\n\nI just realized that the *wee Irish lad* who was raised to be a *wee English fella* is actually played by a *sweet Welsh boyo*.\n\nHe is quite literally the 🇬🇧U.K.🇬🇧 personified 😂",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "dccomicsthrowaway",
                            "body": "> Dylan Llewellyn\n\nWAIT. How have I not realised that's him?! I loved Derry Girls AND Big Boys and really didn't notice Jack was played by James!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GiraffeOk2570",
                    "body": "Nicola was filming a show called Big Mood during the first few weeks of Bridgerton season 3. It's a comedy and Nicola does an amazing job in the role. Also another actor(plays Lord Samadini) in Bridgerton season 3 also is in the show Big Mood.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "berardibreezerbb",
                    "body": "I read that, by the end of the show, the girls who played Erin/Michelle were very close and the other 3 were also close, but there was a divide between the two groups. \n\nCan't remember why. But they were just co-workers after all.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "HazelTheHappyHippo",
                            "body": "I think people read too much into it honestly. Saiorse and Jamie went to the same school (6 years apart tho) and were the only ones living in Derry during their youth",
                            "score": 7
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jellyrat24",
                    "body": "no, but if you want to get a bit more sense of their personalities, I recommend watching the Derry Girls special episode of The Great British Bake Off!",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Lanky_Asparagus_8534",
                    "body": "One of my top shows! So good!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Revolutionary_Onesy",
            "body": "Richard Madden?? He has disappeared once again",
            "score": 86,
            "replies": [
                {
                    "depth": 1,
                    "author": "GosmeisterGeneral",
                    "body": "He’s very private about his personal life (for fairly obvious reasons) so it really limits his PR pushes. \n\nAnd career wise, he’s stuck on that awful Amazon show Citadel, which takes forever to shoot and costs a fortune, so he’s getting paid but not really doing much else.",
                    "score": 103,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Suspicious_Gazelle18",
                            "body": "I know the ended the first season by already saying the second season was coming… but then the show had awful reviews. Are they still continuing the show then? \n\nI might be one of the few people who liked the show lol, so I’m hoping it continues",
                            "score": 18,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "StorkyTheBigStork",
                                    "body": "I belive Amazon have thrown a literal mountain of money at this show. The first season cost a reported 250 million. \n\nIt also has two spin offs due for release this year. I guess they are moving forward with it. Sunk cost fallacy and all athat.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hopefulmango1365",
                    "body": "Flew into the sun 🥲 no but yeah that man is fine as hell….",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "Redshirt2386",
                    "body": "That man is so fine",
                    "score": 49
                }
            ]
        },
        {
            "depth": 0,
            "author": "11brooke11",
            "body": "Hugh Laurie? Miss seeing him as House. He seems like a good dude IRL.",
            "score": 60,
            "replies": [
                {
                    "depth": 1,
                    "author": "chaiskeleton",
                    "body": "i heard a while ago the night manager was getting a second season and hugh laurie is an executive producer on it!",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "hedgehogwart",
                    "body": "I think there was a strong rumor that he had cheated on his wife in the past.",
                    "score": 27,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ivenan2022",
                            "body": "He publicly admitted to it. He cheated on his wife with the director of a movie shot in Africa if I remember correctly",
                            "score": 64
                        },
                        {
                            "depth": 2,
                            "author": "AdeptnessElegant1760",
                            "body": "There are many rumors that he cheated.  Also with Geena Davis while filming \"Stuart Little\"\n\nBut maybe he has an open marriage.   It's not uncommon",
                            "score": 28,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "AdeptnessElegant1760",
                                    "body": "Meant to add: I hope so.  It's preferable to being a skink",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ivenan2022",
                                            "body": "Maybe they're in an open marriage now but they weren't when he cheated. There was an interview where he talked about admitting to it to his wife, how hurt she was, etc.",
                                            "score": 28,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "AdeptnessElegant1760",
                                                    "body": "Oh that's sad",
                                                    "score": 6
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "mandatorypanda9317",
                    "body": "Lin Manuel Miranda said that You'll be Back from Hamilton was inspired by a conversation he had with Laurie in a bar once.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "eatingclass",
                    "body": "I once saw him in a Highland Park bar. He gave chill vibes.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "chromaticsoup",
                    "body": "You should check out A Bit of Fry",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SonjasInternNumber3",
            "body": "Anneliese Van Der Pol aka Chelsea from That’s So Raven. She’s been making cryptic reels for awhile now about her experience on Disney. Never expands on it. Christy Carlson Romano asked her about it on a podcast ep, like if she was just messing with people or what, but there was no grand revelation. Now she’s just made another reel about being happy that Ravens Home was canceled. (Ravens getting a new spin off). I’m pretty sure she’s friendly with Raven still, she talks about it occasionally on the podcast and she has a post with her from April 5th. She also said a few months back that she wants to be known for something other than Chelsea yet she keeps posting this stuff-but whatever. \n\nAnyways. Anyone know anything else lol",
            "score": 56,
            "replies": [
                {
                    "depth": 1,
                    "author": "sailor-moonie-",
                    "body": "No idea, but I always thought she and Raven seemed like genuine friends to me! Which I always thought was sweet",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "psy-ducks",
                    "body": "I think she said she relapsed once in adulthood early on in the shooting of Raven's Home. I don't know if she'll ever share the dirt while there's still a possibility for her to get guest star gigs on the new Raven spinoff though. ",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ghoulina0",
                            "body": "Relapsed?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CaroylOldersee",
                    "body": "I don’t have tea, but want to know as well; not sure if she will eventually tell all or what. Part of me feels she’s just content with bating us/knowing it’ll keep people interested enough in her…",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "ghoulina0",
                    "body": "Tbh she feels unhinged on that podcast with CCR",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ivenan2022",
            "body": "This is for people who are either very old or very Canadian. 😅The show La Femme Nikita (1997-2001). The old one, not the one with Maggie Q. Any of the actors: Peta Wilson, Roy Dupuis, Alberta Watson, etc. I'm feeling childhood nostalgia...",
            "score": 97,
            "replies": [
                {
                    "depth": 1,
                    "author": "Commercial-Spinach93",
                    "body": "Lol Nikita was very popular in Spain when I was a preeteen too!",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ivenan2022",
                            "body": "That's awesome haha, I'm from Poland and it was big here too. I was a kid and  wanted to catch terrorists while wearing fancy leather outfits so badly 🤣",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Unlikely-Elephant331",
                                    "body": "It was super popular in Italy too at the time, even my parents were into it lol",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Morialkar",
                    "body": "Roy Dupuis was at the Cannes festival and in the credits of *Rumours* by Guy Maddin, Evan Johnson and Galen Johnson in which he plays the Canadian Prime Minister. He's mostly been playing in local drama TV series for the last decade in Quebec in French. He's got quite the beard and is very friendly when spotted in public from personal experience, look like a great guy.",
                    "score": 15
                },
                {
                    "depth": 1,
                    "author": "misstheatregeek",
                    "body": "Seconded on Peta Wilson, she was so 🔥 in The League of Extraordinary Gentlemen.",
                    "score": 21,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ivenan2022",
                            "body": "I know, and her career kind of went nowhere after that...",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thelastcanadiangoose",
                    "body": " I forgot about that show! I used to watch this with my grandparents!",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "turtledove93",
                    "body": "Oh man, my dad and sister were obsessed!",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ceruveal_brooks",
                    "body": "OMG!  I was just last week looking to see what Roy and Peta were up to these days.  Alberta died about 10 years ago, and Don Franks.  The rest of the cast are alive but I think the actor who played Birkhoff no longer acts.  Peta is on Instagram.  Roy is as private as ever but still works fairly steadily.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Deathscua",
                    "body": "Haha I just rewatched this and now I’m on alias",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "djanispeartree",
                    "body": "Roy Dupuis is still an actor and has a very successful career but I don’t know if he played in English now",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "janicebingaling",
            "body": "Mayim Bialik, I've watched big bang theory and have listened to a few of her podcasts when she has interesting guests. Something feels off about her, and it's not just the vaccine controversy a few years back.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "heatherstopit",
                    "body": "She seems pretty socially conservative. She wrote an op-Ed in the NYT when Me Too was on the rise, implying that she had never been the victim of harassment or assault because she “dressed modestly.” 🤮\n\nThe vaccine comments were especially confounding because one, she has a PhD in neuroscience, and two, she was in the running to take over as the host of Jeopardy! and one would assume it’s a bad idea to court controversy when you’re in line for one of the most visible jobs on TV. (Edit: peeking at her wiki, it looks like she has received COVID and flu vaccines and that her children have “received a delayed vaccination schedule.” Hm.)\n\nAlso, she’s a hardcore Zionist.",
                    "score": 101,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "janicebingaling",
                            "body": "Not surprised she's a Zionist honestly. The Me Too take is disgusting and is part of the issue. She isn't better than other women for how she dresses, the outfit isn't the problem. Thank you for this information, there was just something about her I knew I didn't like",
                            "score": 51
                        },
                        {
                            "depth": 2,
                            "author": "ohslapmesillysidney",
                            "body": "I find her spouting anti-vax misinformation especially troubling because 1) she is obviously a public figure and 2) people will take her opinion seriously because “she’s a scientist.” Obviously neuroscience and immunology/virology are different fields, but it’s still shocking that someone with a PhD is either that scientifically illiterate or willfully ignorant. \n\nA lot of people also think that “a scientist is a scientist is a scientist” when science is very specialized - being an expert in one area doesn’t make your opinion in another legitimate (although this honestly applies across academia. I’ve heard some garbage takes by STEM people on arts/humanities and vice versa). For example, my specialties are in biochemistry, organic chemistry, and genetics, so I don’t consider myself an expert on vaccine development even though I have more relevant general education in biology to pull from than a total layperson. Likewise, Mayim might be a fine neuroscientist but that doesn’t mean that her takes on vaccines, MeToo, or Palestine aren’t complete garbage.",
                            "score": 16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "heatherstopit",
                                    "body": "I think you’re exactly right about the public perception that “a scientist is a scientist is a scientist.” Even though neuroscience is a completely different field, laypeople might give more weight to her thoughts on vaccination because they perceive her as a “smart” or science-oriented person, as you said. It’s just disappointing to see someone who you think would know better spout that kind of nonsense.\n\nSomething I see reinforced over and over: being educated does not equal being wise.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sea-dragons",
            "body": "Sam Reid, Jacob Anderson? Catching up with the new IWTV and it's so good",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "future-lover-",
                    "body": "Isn't it AMAZING\n\nGod I love that show \n\nThis isn't tea at all but I randomly spent a night out with Assad Zaman due to mutual friends. He was super nice, earnest, fun to chat with and even more beautiful in person.",
                    "score": 50,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "eldritchonline",
                            "body": "So glad to hear about Assad, I love him. Crazy he's even more beautiful irl because he's soooo pretty. \n\n\nI once creeped years back on his twitter and he's truly just green flags, there was stuff from way back with him like being vocally opposed to slut shaming and homophobia. ",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "sea-dragons",
                            "body": "That's lovely! And yes, imo it's the best show on tv right now.",
                            "score": 10
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "party4diamondz",
                    "body": "Not really tea but those two are BESTIES. They both auditioned and did a million chemistry reads through ZOOM because it was during the pandemic - thank the stars that they saw something special with them both because it was perfect casting. They talk a lot about how much time they spend together and how much they love each other 😭 It's incredibly sweet.\n\nP.S seconding the recommendation about The Newsreader. Incredible show. I also just finished Lambs of God last night, another Australian programme with Sam Reid - was weird but interesting, and he was amazing in it.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "swangos",
                    "body": "It’s such a good show! I rolled my eyes when they first announced the show as it was yet another reboot/prequel/readaptation but I had to admit I was entirely wrong on that one.\n\nNot tea by any means, however Sam Reid is also the lead in a fantastic Australian show called The Newsreader. The second season is currently airing/fully out now, I’m planning on binging it as soon as it’s out in my country.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "chhrihanna",
            "body": "Bill Skarsgard bc that man is not about the interview life\n\nalso Willem Dafoe😭",
            "score": 64,
            "replies": [
                {
                    "depth": 1,
                    "author": "sofar510",
                    "body": "No tea but I really wish his career takes more of a character actor turn a la Willem Dafoe or Steve Buscemi— seems like Bill is getting stuck in all of these horror movie roles that are turning a bit corny (aka The Crow)",
                    "score": 43,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chhrihanna",
                            "body": "He's basically their Millennial counterpart so I'm sure he'll get more roles like that when he ages into it lol. It's a shame he's almost being typecast into the horror/action lane for English movies tho because his Swedish filmography spans more genres. I really enjoyed him in Klark (the criminal who inspired the term Stockholm Syndrome)",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Happy_Independent_25",
                    "body": "Confusingly large penis",
                    "score": 30,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CategorySad6121",
                            "body": "How so? Isn’t he like 6’4? 😂",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Happy_Independent_25",
                                    "body": "Dafoe, not Skarsgaard",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "CategorySad6121",
                                            "body": "oooh that makes more sense! 😂",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "cherry_1268",
            "body": "Christian Bale?",
            "score": 51
        },
        {
            "depth": 0,
            "author": "Cata5090",
            "body": "josh o’connor",
            "score": 31
        },
        {
            "depth": 0,
            "author": "phillip_the_plant",
            "body": "I had a dream in which I met Chris Pine and he was very nice so I would like tea on either: what Chris Pine is up to *or* tea that came to you in a dream",
            "score": 72,
            "replies": [
                {
                    "depth": 1,
                    "author": "andalusiandoge",
                    "body": "For a while, I wanted to believe the conspiracy theory that Chris Pine was Chuck Tingle.\n\nThen I read the reviews for Poolman and realized he can't be Chuck Tingle, a Tingle-written movie would be funny.\n\nThen I read Pine's completely chill response to people hating Poolman and thought, hmm, this sounds like how Chuck Tingle would respond to this situation...",
                    "score": 88,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "This is amazing thank you for sharing - I chose to believe this because it’s bonkers just like Chuck Tingle",
                            "score": 25
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "_cornflake",
                    "body": "Last night I dreamed that Angela Bassett was my mum and she took me skiing.",
                    "score": 33,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "borderlineginger",
                            "body": "I would be sad to wake up and find that Angela Bassett wasn't my mom and that I wasn't skiing.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "gizmodriver",
                    "body": "I don’t have any news about him, but I have met Chris Pine and I can confirm that he is genuinely very nice.",
                    "score": 49,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "Glad to hear it but I’m so jealous rn",
                            "score": 13
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Sure_Feedback_965",
                    "body": "i recently had a very vivid dream about pedro pascal being exceptionally mean to me at an airport for no particular reason. i’ve had a similar dream before and now I’m worried he’s not as sweet as everybody thinks 😆",
                    "score": 38,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "perrinbroods",
                            "body": "I had a dream that Jake Gyllenhaal tried to drown me in a cave :(",
                            "score": 39,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "figGreenTea",
                                    "body": "https://preview.redd.it/bgpybw90782d1.jpeg?width=600&format=pjpg&auto=webp&s=5d45d4e7f0218e24e3c9b8f2c91a76d175428673",
                                    "score": 43,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "dazedbarnowl",
                                            "body": "Reading this and looking at the photo in bed before sleeping, now I will have a nightmare about Jake Gyllenhaal drowns me in a cave",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "annamdue",
                                                    "body": "OP sharing their very specific The Ring-esque curse",
                                                    "score": 3
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "CzernaZlata",
                                            "body": "Dear frickin lawd",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Sure_Feedback_965",
                                    "body": "omg, that is horrifying ",
                                    "score": 6
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "Oh no!! Thankfully Chris was nice in my dream so I woke up sad it was over instead of sad it happened",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "DevoutandHeretical",
                            "body": "I have thin evidence but have been told by some who have encountered him in the wild that he is nice!",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OrdinaryExample9618",
                    "body": "I went to an early screening of Poolman and he did an intro and Q&A before. He’s so chill about the bad reviews and basically said I know everyone hates this movie but I wrote it during Covid when I was going a little crazy and made it for my friends and me and we like it and think it’s funny, so have fun. I actually liked it and found it absurd and hilarious. \n\nWhen he walked out, you could hear the entire audience do a collective breathe in at how beautiful he is. He walked by me on his way out the theatre and hands down one of the prettiest people I’ve ever seen.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "I love that chill mindset! \n\nHe is so pretty it hurts that was mostly my dream was just looking at his face (which is surpassing since I didn’t consume any Chris Pine content before bed)",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "silverpenelope",
                    "body": "My mom was just talking about how he was an English major and reads serious literature all the time which is attractive, imo.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "My favorite pictures of him are the ones where he is leaving a book store",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MundaneVillian",
                    "body": "I choose to believe he moonlights as Chuck Tingle and that his buckaroo ways are a way to go under the radar as himself on Tumblr lol",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "I’m so into that theory I’m adding into my mental Chris Pine lore",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "alpacayoursuitcase",
                    "body": "I had a dream that Jamie Campbell Bower had a sex dungeon. Which doesn't seem too far fetched rly.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "Oh no I hope this isn’t a prophetic dream",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "alpacayoursuitcase",
                                    "body": "It was a consensual sex dungeon",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "phillip_the_plant",
                                            "body": "In that case I hope it’s prophetic in a good way",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "party4diamondz",
                    "body": "A few years ago (like, when Juice was at its peak popularity) I had a dream that I met Lizzo at a party and we hooked up but then she suddenly left me, Paul Mescal-style.\n\nFor WEEKS I couldn't look at photos of her without feeling like a scorned ex omfg",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "sorry you went through that but A+ dream tea",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RosemaryRoseville",
                    "body": "When Paul Walker died, I was so upset. He was in my dream, we were at the movies and he was consoling me and telling me everything would be ok.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "ItsAllProblematic",
                    "body": "He did a nice interview with Marc Maron recently. He came across as a cool, thoughtful guy, bar his brief praise for Gal Gadot",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "overthoughtamus",
                    "body": "My dream was that I body-swapped with Annabelle Wallis (back when they were still together) after I downed a particularly strong drink at the downstairs bar. Then I went upstairs and turned the only key I had into the lock of the penthouse apartment and stumbled onto the couch.\n\n\nSuddenly Chris Pine rushed out of the bedroom and bear-hugged me. \"I'm so glad you're home!\" \n\n\nAll I could see was the top of his head and feel the scratch of his hair on my chin. He was burning with fever. \"I think I'm sick.\"\n\n\nI caught my breath. \"You're Chris Pine,\" I whispered as flatly as my shock would let me.\n\n\nHe just shook his head. \"No I'm not. I think I have bronchitis.\" \n\n\nAnd then I laughed and woke myself up.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "Amazing. Love that being ill trumps any other identity for him. Jealous that your dream was vivid enough to feel his hair",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WoozyDegenerate",
                    "body": "not the most current tea, but he is a Zionist and at least had a fling recently with like a 20 something yr old, for Leo DiCaprio of him",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "phillip_the_plant",
                            "body": "Did hear the Zionist thing which is not great and forgot about the 20 year old this so those are important reminders",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "WoozyDegenerate",
                                    "body": "he’s always been my favorite of the Chrises so trust me, i was/am devastated",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "snakeinsheepclothes",
            "body": "Chiara Ferragni and Fedez? Any news on them or what going on",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fangirl0089",
                    "body": "Fedez recently shared he had a bad weekend, and the it was cause some fellow musician were talking bad about him.\n\nChiara is slowly going back to work and rebuild her image.\n\nHe has been following a lot of models on instagram so I guess things are quite the same or worse between them and divorce might still be the option",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vivianthecat",
                            "body": "Wait what happened between them?! I unfollowed her ages ago and didn’t realize shit hit the fan",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fangirl0089",
                                    "body": "A couple years ago he was diagnosed with pancreatic cancer, it was really bad. He was doing better and she was by his side. Then last year at San Remo, they had a huge fight with Chiara as a guest host and telling him he stole her moment. The fight was seen by everyone. They had a big crisis and made up. he had serious health issues again last year and made it through. but then Chiara had extremly serious problems by a promotion she said she was donating money to a kids hospital and never did. She went to trial, lost and had to pay a huge amount of money for her fraud. That made things bad for them again.\n\nThe justice investigated him and his companies too because of <chiara's fraud. And around Februar he left their home. They it was a common agreement and all their care aout is their kids. They also decided to stop posting about their children.\n\nFedez has been seen with different girls and some people claimed that he has been cheating Chiara for a long time. I don't really kno if that is true.\n\nBoth gave interviews saying their parts, and Chiara is coming back to restore her image after her fraud.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "vivianthecat",
                                            "body": "Oh wow I was very out of the loop. Thank you for providing this info that’s wild",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SokkaHaikuBot",
                    "body": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^snakeinsheepclothes:\n\n*Chiara Ferragni*\n\n*And Fedez? Any news on*\n\n*Them or what going on*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Miserable_Fan_1277",
            "body": "Gillian Jacobs?",
            "score": 40
        },
        {
            "depth": 0,
            "author": "w00lal00",
            "body": "Iwan Rheon? Aneurin Barnard? Max Irons? Sam Claflin?",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fearless_Remove74",
                    "body": "Maybe I'm reading into it too much but Sam Claflin seemed to be just a little too into Oswald Mosley in Peaky Blinders press.",
                    "score": -13
                }
            ]
        },
        {
            "depth": 0,
            "author": "MundaneVillian",
            "body": "I want to know that Nicola Coughlan is genuinely as cool and awesome as she seems",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "RaggySparra",
                    "body": "In the midst of getting a lot of (positive) attention with the new Bridgerton, she's spoken up about and posted for Palestine repeatedly, which I think speaks well of her - it *is* something that's a risk to people's careers and while she's famous, she's certainly not established enough to just shrug off all consequences.\n\n(No, I know, that *shouldn't* be something where we have to give people a gold star for it, but this is where we are at the moment.)",
                    "score": 23
                },
                {
                    "depth": 1,
                    "author": "namewithak",
                    "body": "I hope she gets her wish to be on a regular season of Taskmaster because she was fantastic in the New Year special she appeared in. She was so much fun. Her interview on the Taskmaster podcast was also excellent. ",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "everydayisstorytime",
            "body": "Emma D'Arcy \n\nOlivia Cooke \n\nMeryl Streep\n\nEmily Carey \n\nKatie Gavin",
            "score": 34,
            "replies": [
                {
                    "depth": 1,
                    "author": "WoozyDegenerate",
                    "body": "not tea but the fact that Olivia Cooke has such a vile hatred for the “negroni sbagliato” meme is still hilarious to me",
                    "score": 78,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "raezura",
                            "body": "I worked as a bartender when that meme was popular so I now share her hatred.",
                            "score": 33,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "No-Raspberry7840",
                                    "body": "What did people do? Like did they say the lines from the meme? It was funny seeing people order them who would never drink a bitter drink.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "everydayisstorytime",
                            "body": "I mean to be fair she can bear it now but I do understand why she'd hate it. :)))",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "woahoutrageous_",
                    "body": "Not tea but I had the weirdest dream that I was filming a Victorian gothic horror with Olivia Cooke and  Dev Patel. I honestly need it so bad now",
                    "score": 39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "K_smit123",
                            "body": "Take ALL my money and make this happen!",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "eatingclass",
                            "body": "YES PLEASE --",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Bierre_Pourdieu",
                    "body": "Emily Carey has a new show coming out on Netflix where she is the lead and she has a girlfriend who also is an actress (forgot her name)",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "haroldsbanjo",
                    "body": "I respect your commitment to trying to get Katie Gavin tea. Besides the fact that she’s now single, I can’t think of anything else lol.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "WoozyDegenerate",
                    "body": "not tea but the fact that Olivia Cooke has such a vile hatred for the “negroni sbagliato” meme is still hilarious to me",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Miele-Man",
            "body": "The \"Bye Sister scandal\" people? That event might be my roman empire but I don't follow drama channels anymore so I have no idea what happened to them.\n\nBen Platt: Live at the Palace? Is it true that Lady Gaga was supposed to be the artist to (re)open the theater?",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "GroundbreakingBite96",
                    "body": "James over the past couple years has been messaging minors. Not only that, he has a history of going only for straight men because he’s convinced he can turn them.",
                    "score": 33,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Miele-Man",
                            "body": "I still remember him saying that he likes younger guys because he's too \"adult\" for his peers or older men. ??? He made no sense 😭 I can't believe he keeps making the same \"errors\". He really learned nothing from the scandal.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ohslapmesillysidney",
                    "body": "I genuinely can’t believe that this happened five years ago. It feels like it was yesterday and a lifetime ago at the same time.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "trulyremarkablegirl",
                    "body": "There were a bunch of different people rumored to reopen the Palace so idk if any of them got close to actually happening, but the Ben Platt dates are not selling well and as far as I know there haven’t been any discounts.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Miele-Man",
                            "body": "Yes and, from what I've read, it's not the first time he struggles to sell tickets for his concerts/live performances. I really wonder why they went with him. If you don't mind me asking, who else was rumored?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "trulyremarkablegirl",
                                    "body": "I’ve heard everything from Adele to Gaga to Barbra Streisand to Bette Midler to Celine Dion to basically anyone who’s ever done a Vegas residency lol. I don’t know how true any of it was, I think it was mostly speculation, but doing 2 weeks of concerts for Ben Platt was definitely a mistake.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "releasethe_mccracken",
                    "body": "This isn’t tea I don’t think since it’s all posted to her YouTube, but Tati and her husband moved to Texas. They’re trying to have a baby (for a while now), and she got kind of Jesus-y. They’re embroiled in a lawsuit with a former business partner over her hair gummies that started the whole drama. She “lost” her wedding/engagement ring by accidentally including it in a goodwill donation a few years ago when she and husband were in a rough patch. And sadly their dog died recently. She still makes chatty makeup content. She reminds me a lot of my aunt so I will always have a soft spot for her.",
                    "score": 13
                }
            ]
        },
        {
            "depth": 0,
            "author": "lorilori97",
            "body": "Christopher Abbott\n\nTom Burke\n\nAugust Diehl",
            "score": 87,
            "replies": [
                {
                    "depth": 1,
                    "author": "syrub",
                    "body": "I lose track of the days really easily, and I genuinely feel so comforted looking at your requests and realising it's a Thursday!",
                    "score": 68
                },
                {
                    "depth": 1,
                    "author": "AdhesivenessTop8659",
                    "body": "I am pretty sure this isn’t true at all, but Austrian Newspaper got some story about Angelina Jolie and August Diehl being a thing. https://www.kleinezeitung.at/leute/18474692/jolie-soll-mit-deutschem-schauspieler-liiert-sein",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "everydayisstorytime",
                    "body": "There it is!",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "fakesongs",
                    "body": "I always upvote, but I only just now realized I was confusing August Diehl and Daniel Bruhl",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheBulkyModel",
            "body": "This is way too niche but im a jeopardy girlie and want to know if theres any tea on Ken Jennings, like i truly hope he is an angel on earth. \n\n![gif](giphy|tW7VNl0RMRaKlrsaHZ|downsized)",
            "score": 9
        },
        {
            "depth": 0,
            "author": "really_bitch_",
            "body": "Julie Benz?",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "plethoratears",
                    "body": "i met her at a con in 2022 and she was an absolute sweetheart!",
                    "score": 13
                },
                {
                    "depth": 1,
                    "author": "SwissSwissBangBang",
                    "body": "Not tea, but she and Juliet Landau posed for a BTVS makeup line recently, and they both look so pretty",
                    "score": 10
                }
            ]
        },
        {
            "depth": 0,
            "author": "ancickaa",
            "body": "Does anyone remember when netflix announced a show about greek mythology called Kaos? What's up with that?",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "Flimsy-Grass3494",
                    "body": "They released the first teaser in March.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "GosmeisterGeneral",
                    "body": "Charlie Covell wrote it about 5 years ago. I think it took Netflix a really long time to commit to a budget - originally it was huge, seems like it was slimmed down a lot over the years.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hot_Emergency_4797",
            "body": "Will Sharpe?",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "woahoutrageous_",
                    "body": "Idk but he’s so talented holy shit. He’s a superb director and a brilliant actor",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "fearlessonesometimes",
                    "body": "Really talented and also private guy. Unfortunately he's deleted all his social media accounts years ago. Right now he's working on *Too Much* and *Amadeus* and at some point soon he should start working on *Crying in H Mart.* He also has *Emmanuelle* coming out later this year.\n\nHe's in a relationship with Sophia di Martino (she played Sylvie in *Loki*) and they have two adorable daughters together. They recently moved house.\n\nHe's really nice but also comes across as shy and introverted.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "littlelizu",
                            "body": "...will sharpe is that you?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "fearlessonesometimes",
                                    "body": "Ha, no! But I do know someone who personally knows him.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GosmeisterGeneral",
                    "body": "I know he missed a lot of the cast-cest on White Lotus because he’s married with a new-ish baby. \n\nHis wife is Sophia di Martino (Sylvie from Loki).",
                    "score": 26
                }
            ]
        },
        {
            "depth": 0,
            "author": "No-Sir1187",
            "body": "Oscar Isaac? :)",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "roxy031",
                    "body": "No tea from me but I just rewatched Dune to get ready for watching Dune 2 and gosh he’s beautiful.",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "No-Sir1187",
                            "body": "He’s very beautiful in that film!",
                            "score": 9
                        },
                        {
                            "depth": 2,
                            "author": "ohslapmesillysidney",
                            "body": "I just saw “Annihilation.” My god, he is just a dream come true.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OrdinaryExample9618",
                    "body": "I met him last fall and he is incredibly kind and holy moly, so handsome. Like wow, just wow.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "messymess444",
                    "body": "I saw a few discussions on here about his marriage - many people believe that him and Elvira have an open marriage. No idea if it’s even remotely true but a bunch of people seem to think that’s the case. \n\nSome people also said they think their marriage was a marriage of convenience because of citizenship (I think? Might be misremembering) and/or pregnancy. This was said by a fan/fans of both of them btw, it wasn’t said in a jealous or hateful way or anything",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "No-Sir1187",
                            "body": "How interesting! I have heard the open marriage rumours, I wonder how the fan found out about the citizenship/pregnancy lol",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "beaizi_",
            "body": "Will Poulter, Taylor Russell, Lucy Boynton or The Umbrella Academy cast",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "GosmeisterGeneral",
                    "body": "Will Poulter is very sweet and genuine from what I’ve heard. He started on a show called School of Comedy when he was a kid, and he’s still friends with all of his old co-stars. Has lots of normie friends. Is very down to earth in interviews. Rarely seems to surround himself with assholes.",
                    "score": 52,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "StorkyTheBigStork",
                            "body": "I remember him in Son of Rambo before School of Comedy. He was so good in it. He looks a lot like Damien Lewis now. Their American accents also sound alike. I wonder if they have the same voice coach.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "hyungwontual",
                    "body": "idk if you already heard about this but will poulter found out about ayo edebiri getting an emmy nomination before she did. they were hanging out in london when he checked his phone and saw she was nominated and then made her check her phone cause she was avoiding checking it.",
                    "score": 88
                },
                {
                    "depth": 1,
                    "author": "Sassynderella",
                    "body": "I kinda have tea on Will Poulter. I believe it was Sunday he attended the Arsenal game I think its the soccer team and he went with Gregg Sulkin and Charles Melton. They were all wearing the jerseys.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "Fangirl0089",
                    "body": "Lucy Boynton had recently the premiere for her latest project. Nothing new has been announced",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "CertainBanana",
                    "body": "Oh I want to know about The Umbrella Academy cast too. I read that Ritu & David (Lila & Diego) were a couple in real life but both of them seemed to have recently deleted photos of one another on their instagrams. ",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HDBNU",
                    "body": "Last I heard, Will Poulter was still posting 'both sides have a point' bullshit about Palestine/Isnotreal",
                    "score": -23
                }
            ]
        },
        {
            "depth": 0,
            "author": "lovelandian",
            "body": "Okay anything on Ryan Reynolds? Something about him just feels off to me",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "StorkyTheBigStork",
                    "body": "He is having a weird influence on Rob McElhinney. Rob is even starting to look like him.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Other_Yam_7538",
            "body": "Tori Amos?",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "betterlucknexttime81",
                    "body": "I’ve met her a few times and she’s exceptionally kind and generous with her time. The most recent was in 2017. I was in the front at a show last year and as she was walking off stage she stopped in front of me, pointed, blew me a kiss and did the Tori wave.\n\nI’d heard she’s somehow able to remember the people she meets but didn’t believe it until that moment.\n\nAlso her skin is flawless.",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Other_Yam_7538",
                            "body": "Exactly how I imagine meeting her would be!",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mrs_ouchi",
            "body": "Can someone tell me if Jenny Mollen is still posting the same BS on her Insta? I cant look - cause it makes me so angry, if so.\nAnd my question then is.. wouldnt Busy Philipp say something - unless she is one of them. I saw a while ago how she posted something bout Jenny and I was like \"girl read the room (posts)",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "AgreeableCake8529",
                    "body": "I was just thinking about Busy because Nicola Coughlin shared a photo of them together with Ilana Glazer so I was wondering how pro Palestine she is. I had to unfollow Jenny because she was driving me crazy but I'm sure they were in each other's stories a while back as friends.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fearless_Remove74",
            "body": "Any Boardwalk Empire tea (inspired by various cast members being viciously and randomly attacked by the NYC public for no reason as of late)?",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "undeaddeadbeat",
                    "body": "Stephen Graham is unfortunately going to star in the new movie Johnny Depp is directing which is… disappointing to say the least.",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fearless_Remove74",
                            "body": "Goddamn, he's so talented. Even from a practical actors pov you just know that that set is going to be a shitshow",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "syrub",
                            "body": "This pains me to read. I have such a crush on Stephen Graham!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "woahoutrageous_",
                    "body": "Michael Pitt (jimmy) is apparently horrible and awful to work with. He’s been kicked off numerous projects because of this",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "roxy031",
                            "body": "It’s a shame because he’s super talented but his addiction and mental health issues have derailed his career. But supposedly he’s gotten help and is doing better and hopefully overcome some of those demons that have made him awful to work with.",
                            "score": 15
                        },
                        {
                            "depth": 2,
                            "author": "Fearless_Remove74",
                            "body": "Rumour is he got into a physical fight with William Forsythe (Manny Horvitz) during the production of season 2",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "trulyremarkablegirl",
                            "body": "I remember John Cameron Mitchell alluding to him being difficult even as far back as Hedwig. He was super young back then too.",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bientheblue",
                    "body": "Not so much tea but if you wanna see Charlie Cox play another Irish man like he did in Boardwalk, I recommend his show Kin on Netflix which is a pretty good show",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fearless_Remove74",
                            "body": "Honestly, as someone with a Northern Irish mother I was really impressed by his accent",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "Stonecoldjanea",
                            "body": "He is v hot in Kin.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "duh_metrius",
                    "body": "I know two actors who did guest stars on that show and both said it was a terrible experience.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "littlelizu",
                    "body": "what's this random attacks on BE cast?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "taravon6",
                            "body": "Michael Stuhlbarg and Steve Buscemi both got punched while walking in NYC recently. \n\nNot related, people just be punching people lately.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AaronRodgersWife",
            "body": "Random recent obsession but Brandi Carlile ?",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "burr-0ak",
                    "body": "Rumor on the street is she has a project with Elton John that will be revealed sometime soon. Project in this case meaning album. Extent of involvement isn’t clear, but the current assumption is she produced it.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Redditing_aimlessly",
                    "body": "not tea, but she's on several episodes of the podcast \"we can do hard things \"",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Moo__shoo",
            "body": "Hozier?",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "future-lover-",
                    "body": "There have been countless rumours about Hozier over the years that he's just an amazing person. I have never once heard a bad story about him. The most \"tea\" thing I can think of is that he used to date a frequent collaborator named Sallay Garnett, who's an Irish singer-songwriter. And apparently many of his love songs (prior to his new album) are about her. She wrote \"Someone New\" with him",
                    "score": 57,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "theskymaybeblue",
                            "body": "Wow. She’s stunning, good for him. She also seems impossibly cool and interesting.",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "alpacayoursuitcase",
                    "body": "I saw him in Dublin once and told him I loved his album, he was Christmas shopping. He was very soft spoken and nice. ",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "HDBNU",
                    "body": "Ex crew members said he wasn't Pro-Palestine.",
                    "score": -39,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Beacon4Heathens",
                            "body": "Who are the ex crew members? He gives a Pro Palestine speech at every show this tour.",
                            "score": 59,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HDBNU",
                                    "body": "This was his last tour or the beginning of his current tour, around October or November of last year, he might have changed his stance.",
                                    "score": -12,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "alpacayoursuitcase",
                                            "body": "That is not true at all",
                                            "score": 5
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Beacon4Heathens",
                                            "body": "Again, who is the ex crew member? He's been pro Palestine since October. As an Irish citizen, I imagine he's been pro Palestine since before October. Ireland has been one of Palestines biggest supporters for a very, very long time.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "hugeorange123",
                                            "body": "Sort of curious to hear more because pro-Palestine would be very much the mainstream opinion in Ireland and has been for decades. If he was pro-Israel, that would be quite unusual for Ireland tbh, especially for his profile. His background is also Quaker which tends to support issues of social justice etc.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "annamdue",
                            "body": "Hasn't he been openly and vocally pro Palestine since before Oct. 7?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Sure_Feedback_965",
            "body": "Matthew gray gubler ",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "kamel0",
                    "body": "[this is nice](https://x.com/zachsilberberg/status/1792592882320261272)",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "OrdinaryExample9618",
                    "body": "I’ve met him 3 or 4 times in NYC and he is so nice. Talked to me for a bit, asked questions about me, was fine taking a picture. So nice and goofy and so so cute.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "WoozyDegenerate",
                    "body": "i dont think i’ve ever heard a mean thing about this man",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "disiradosti172",
                            "body": "[https://www.reddit.com/r/Fauxmoi/comments/11pvkc6/celebrity\\_scandals\\_that\\_get\\_intentionally\\_covered/](https://www.reddit.com/r/Fauxmoi/comments/11pvkc6/celebrity_scandals_that_get_intentionally_covered/)",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "WoozyDegenerate",
                                    "body": "THE WAY MY JAW DROPPED OH MY GOD??? thank you for sharing this, another day with a man disappointing me",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "disiradosti172",
                                            "body": "He is registered as a republican in Nevada but I’ve read that it’s because his mom used to be involved in politics. Apparently he's currently registered as an independent in NYC, but I can't access voter records, I'm geoblocked.  ",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Timely_Gain_6225",
                    "body": "There is a whole section about him on the Deux Moi podcast today",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "VigilMuck",
            "body": "This is more general but I want to know which celebrities do you think are the least like their public persona?  In particular, I'm looking for celebrities who seem nice in interviews and public appearances but are actually assholes.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "singledxout",
                    "body": "I'll get downvoted, but Rashida Jones immediately comes to mind. She tried to portray herself as a feminist and a girl's girl. She has a history of slut shaming women and telling them not to invest in their looks. She's a pick me. \n\nShe is also still with her longtime partner Ezra Koenig despite his sexual misconduct allegations. He was never publicly named, but Tavi Gevinson wrote about their relationship when she was 18 and he was 30. She wrote that her abuser groomed and r*ped her. I bring this up, because Rashida was one of the founding members of Time's Up.\n\nEDIT: Tavi and Rashida used to be friendly. Rashida contributed to the Rookie yearbooks and Tavi looked up to Rashida. Way to be a girl's girl.",
                    "score": 48
                },
                {
                    "depth": 1,
                    "author": "messymess444",
                    "body": "Very specific but Michael Bublé, Ryan Reynolds and Jennifer Garner",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "chezdor",
                            "body": "Can you elaborate?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "messymess444",
                                    "body": "I’m dead @ the downvotes lmao but yes. Michael Bublé has this very charming, happy and innocent personality on talk shows, but was caught on instagram live putting his hands on his wife Luisana in an aggressive way. There was a whole controversy about it; she had to release a video saying he’s not abusing her, while he stands and stares at her. You can just tell from the way he talks to her when he forgets he’s being filmed that he has a bad side and isn’t as goofy and pleasant as he tries to make it seem. \n\nRyan Reynolds: it’s the same formula but nothing has come out about him or anything. But I find his persona and social media verrrry manufactured and fake. Don’t trust him\n\nJennifer Garner has an unsettling fake charm, I thought it was innocent enough until that video where she asks Regina King “where are you REALLY from?” (paraphrasing, but the original is actually somehow worse)",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "singledxout",
                                            "body": "I worked at a venue where Michael Buble performed twice. His team was considered high maintenance. For instance, Michael did not allow any female employees to work backstage. My supervisor had to reassign people at the last minute. Michael was also late on stage because he was too busy watching a hockey game.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Joyfulmovement86",
            "body": "Matt Czuchry?",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "disiradosti172",
                    "body": "Seconded. Also, any info on what's the next project? I tried watching AHS, but I hate it.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Joyfulmovement86",
                            "body": "He was uncharacteristically bad in AHS. I don’t know what was up with him. You didn’t miss anything. Here’s hoping he’s back to his Cary Agos greatness in his next project!",
                            "score": 9
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "grandmasterfunk",
                    "body": "I'm guessing you saw in the Monday thread, but there was this weird twitter thread about him having a secret child that he was trying to keep hidden or something. The twitter account sounded pretty delusional though, so doubt there's merit to it.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Joyfulmovement86",
                            "body": "Yes, I’m the one who posted about it in the Monday thread, although someone wrote a much more detailed post about it before me in last Friday’s thread. The Twitter thread was so strange, but it’s just such a weird thing to lie about and make up details about then try to get TMZ to follow up on. I guess I shouldn’t be surprised though. I’m pretty sure the 1D fans tried to convince everyone one of them pushed a fake baby around in a stroller to trick everyone 😂😂😂",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "raptorclvb",
            "body": "The Great cast? Started to watch it for the first time",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "psy-ducks",
                    "body": "I know some people who met Nicholas Hoult when he was filming another project, was just at a coffee shop with his partner and was very low-key and lovely to staff.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "balloongirl0622",
            "body": "Cast of Bridgerton?",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fangirl0089",
                    "body": "Jonny in the new \"Jurassic Park\", Nicola to lead \"Love and War\", Luke Thompson in a Skakespeare event in July",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "selma90",
            "body": "Jon Bernthal",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "bientheblue",
                    "body": "There was a Twitter thread of him being a zionist, and getting Shia LaBeouf (a domestic abuser) on his podcast to tell his sob story. I was pretty disappointed already about how much of a cop lover he is, but learning all of the other things about him recently just gets worse and more gross.",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "prozacvacation",
            "body": "Gabbriette?",
            "score": 16
        },
        {
            "depth": 0,
            "author": "jnglebellz",
            "body": "Any tea on Justin Timberlake’s “alleged daughter” ? They have now accused him of some pretty heinous crimes",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "sailor-moonie-",
                    "body": "I just googled it and it seems like pretty obvious bullshit to me personally",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fearless_Remove74",
            "body": "Gayle Rankin?",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "OrdinaryExample9618",
                    "body": "No tea but just saw her last night as Sally Bowles in Cabaret and I was blown away. Her performance is incredible.",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "cloudydays2021",
            "body": "Anyone from the cast of My Name is Earl",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Ancient-Shape9086",
            "body": "Die Liebe meines Lebens, Damian Hardung? Or any other Maxton Hall cast tea?",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "filleauxyeuxverts",
                    "body": "I wonder if it's true that he studies medicine. Acting career and medicine - he must be so busy.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ancient-Shape9086",
                            "body": "He said in an interview that his entire family are doctors and that he’s currently studying medicine so I’m assuming it’s true",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "whatsanera",
            "body": "John Reynolds <3",
            "score": 12
        },
        {
            "depth": 0,
            "author": "zeke10",
            "body": "Does anyone know more about abigail breslins husband's alleged affair?",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Other_Yam_7538",
                    "body": "Abigail Breslin is old enough to be married?! What is time.",
                    "score": 48,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "zeke10",
                            "body": "Yup and her husband is a piece of work that's for sure.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "italktomyplantsdoyou",
            "body": "Julie Bowen",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "MyDesign630",
                    "body": "stg this was going to be my ask as well",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Stonecoldjanea",
            "body": "Charlie Cox\n\n\nJason Statham \n\n\nPatti Harrison ",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "party4diamondz",
                    "body": "No tea but Patti Harrison was just on the Off Menu podcast and it was unsurprisingly very weird and very funny. Note: best not to listen to while eating, especially if you're eating bolognese.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "bientheblue",
                    "body": "On a panel that Charlie did a month ago he said he has an upcoming project that involves him wearing Birkenstocks lol. Not really juicy tea but that's just something I remember watching that panel for Daredevil show deets",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Picklepee-pumparum",
                    "body": "Ohh exquisite ask. Hope something comes up.",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "ra2007",
            "body": "Henry Cavill?",
            "score": 7
        },
        {
            "depth": 0,
            "author": "petitsfilous",
            "body": "Kate Beckinsale posted an image of Diddy saying apologies aren't enough (basically), and added \"you can't get away with abuse either, you know who you are, sunshine, your time is up\". \n\nIdk, it feels like a weird thing to post - it's not *exactly* vaguebooking, but not exactly saying anything useful either. The only exes of Kate's I can think of are Michael Sheen and Pete Davidson. Her and Mike have Lily, and honestly idk if Pete's fuckboi'ness would have affected Kate the same way (she's older than his usual gfs).",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "hedgehogwart",
                    "body": "She was also with the Underworld director for over a decade. It could have been someone she wasn’t even with, someone she just worked with.",
                    "score": 37,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "petitsfilous",
                            "body": "Yes, sorry, I meant to add it could just be someone she's aware of, a friend of a friend type thing. It could be the owner of her mum's local corner shop. Tbf, if other abusers get outed, that can only be a good thing",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Unique-Impress5964",
                    "body": "Pete?? she defended him when he was with Kim.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "FireFlower-Bass-7716",
                    "body": "MGK.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BenjaminButtontheCat",
                            "body": "yes agree.\n\nwonder if Kate is referring to her own experience only or also Megan Fox. Perhaps they've been talking.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HDBNU",
                    "body": "She was also with the director she left Michael Sheen for and Matt Rife.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TwitterAIBot",
                            "body": "Matt Rife?!? Ew.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thankyoupapa",
                    "body": "I saw that post too. my first thought was Pete but probably because I read the chapter about him in cazzie david's book and never looked at him the same after that.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "heectic_vaabz",
            "body": "Jason Isbell? I have a hunch he's dating New York artist Anna Weyant? Anyone have any info?👀",
            "score": 12
        },
        {
            "depth": 0,
            "author": "shineeyegal",
            "body": "very random, but amanda de cadenet? i can't figure out if she's cool or not",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "singledxout",
                    "body": "I read somewhere that she is someone who tries to portray a girl boss image but is really a self-serving person and has made microaggressions towards POCs in private. White feminist is probably a better description. \n\nHer daughter Atlanta is a social media influencer. She's engaged to Dave 1 from Chromeo. I don't know much about her other than she has a clothing line with more inclusive sizing and also runs a modeling agency (?). She's also friends with Callie Wilson. She seems like a harmless nepo, but eh. Apples typically don't fall far from the tree.",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "GosmeisterGeneral",
                    "body": "I met her once when she was doing press for something. Literally nothing exciting about her at all - bit of a namedropper and very aware that her really weird, exotic past is the reason she has cultural value, but otherwise she’s just a polite, well-read presenter type. Haven’t heard any horror stories.\n\nWhen I was doing my research into her though I realised she’s not very well known at all. Especially here in the UK.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "SurvivingBigBrother",
            "body": "Leo Woodall",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fangirl0089",
                    "body": "He is filming Bridget Jones these days",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "whaleoogling",
            "body": "The Marvelous Mrs Maisel cast? Luke Kirby? Rachel Brosnahan?",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fearless_Remove74",
                    "body": "Amy Sherman-Palladino signed the 'Jewish creatives against Jonathan Glazer's Oscar speech' petition. 😔",
                    "score": 45,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "grandmasterfunk",
                            "body": "Yes, but at least Rachel Brosnahan has been vocal about supporting Palestine.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "NotBurnerAccount",
            "body": "Dua Lipa she’s like the one artist I support guilt free and I wanna make sure it’s reasonable 😭",
            "score": 15
        },
        {
            "depth": 0,
            "author": "Heart_Shaped_Face_",
            "body": "Joe Cole (Gangs of London)? Mark Rowley (Last Kingdom)?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "lucidproxy1",
            "body": "Kaley Cuoco?",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sassynderella",
                    "body": "She's currently filming season 2 of that Peacock show she does with Chris Messina.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "filleauxyeuxverts",
            "body": "Luke Thompson?",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Happy_Independent_25",
            "body": "Chappell Roan",
            "score": 5
        },
        {
            "depth": 0,
            "author": "averyxoxo1",
            "body": "Andrew Garfield?",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Many-Leek-2270",
            "body": "I am once again asking for anything on the NBA or WNBA 😭",
            "score": 6
        },
        {
            "depth": 0,
            "author": "SyntiumWasTaken",
            "body": "How's Mila and Ashton doing these days? ",
            "score": 5
        },
        {
            "depth": 0,
            "author": "patpitpout",
            "body": "Please tell me Jeffrey Dean Morgan is a nice guy :)",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Meka3256",
                    "body": "Hilarie Burton took their children to Pride last year and posted on social media.  When she got shitty comments she told them to fuck off (basically) and doubled down on her support for the LGBT+ community as an ally.  Obviously that's not Jeffery, but I tend to hope if one parent does something, the other is supportive.",
                    "score": 56
                },
                {
                    "depth": 1,
                    "author": "lizziebeedee",
                    "body": "My friend sat next to him on a plane once and said he was pleasant enough. Apparently he meditated for most of the flight",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ceruveal_brooks",
                            "body": "That’s a great excuse to get people to leave you alone, I love it",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Just4Questions9",
                    "body": "he believes in blue lives matter so idk about that lmao",
                    "score": 72,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "11brooke11",
                            "body": "I think he only wore that shirt at the request of a woman whose son died and was a fan?",
                            "score": 9
                        },
                        {
                            "depth": 2,
                            "author": "Intelligent-Sample44",
                            "body": "The police unions are the ones who shuffle the bad eggs around to other departments in the state/country, with virtually no punishments.  The unions are force behind keeping qualified immunity shielding bad cops.  Start in your local area.  \n\nThere are many dutiful, respectful police officers, and those are the ones JDM supports, as do I.\n\nIt's best to channel your frustration into something useful so you don't feel helpless, because you're not.",
                            "score": -71,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "themacaron",
                                    "body": "ACAB ❤️\n\n(Just curious who you think…makes up the police union? Civilians?)",
                                    "score": 30,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Intelligent-Sample44",
                                            "body": "I'm very sorry you think all cops are bastards.  I have seen and experienced otherwise.  We have much progress to make on that front, but we will.  It also depends on where you live, too.  Don't give into cynicism.  It's too easy, and ultimately self-destructive.",
                                            "score": -26
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Naughtybuttons",
                    "body": "He is the sweetest.  Met him at a meet and greet and I had my 3 year old and he was so nice to my little boy.",
                    "score": 15
                }
            ]
        },
        {
            "depth": 0,
            "author": "HDBNU",
            "body": "Any tea on Gage Golightly? Or why she deleted her Instagram?",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Revelistic",
            "body": "any interesting tea on eurovision artists? preferably from the pre-pandemic editions as after that i kinda stopped keeping up. i often wonder what those people are up to after the contest's over but unless they're worldwide famous or from my country, i never find any updates.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mr_Cohen",
                    "body": "A woman has come forward with accusations against Alexander Rybak and he's claiming she's a stalker. I don't know the full story, but genevasecretsociety on TikTok seems to have a full series with all the info",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "impeccabletim",
            "body": "Does anyone have any tea on any current EDM DJs?\n\nMy current faves are: SG Lewis, Dom Dolla & John Summit, if that helps.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "babyblinkie",
            "body": "Liam Payne from 1d? I just read his ex fiancées book. Crazy stuff.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Significant-Row7154",
                    "body": "Ooh please tell me how the book was. Anything interesting?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "babyblinkie",
                            "body": "It went from sweet to sad real quick. Maya talks about Liam’s substance abuse, going through an abortion and its complications alone and so much more.. he seems awful",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "jlrigby",
            "body": "Do these JAW and Ayo Edebiri dating rumors hold any weight to it, or is it just based on that one video at the baseball game where he's clearly trying to calm her down? Now I'm getting news articles on my phone about them dating. I ain't clicking because I don't want to support sleazy news writing, but I am curious if there's any other \"proof\". \n\nI even dreamt I met JAW in purgatory last night, and the first thing I asked about was the rumors, so I guess it's been weighing on my mind? Of course, dream JAW said it didn't matter because we were dead and in purgatory, and it's none of my business, so fair play on dream him.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "StorkyTheBigStork",
            "body": "Gates McFadden?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "eatingclass",
            "body": "MCU directors and writers?",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "syrub",
                    "body": "It's been announced in the last couple days that Michael Lesslie (who penned Ballad of Songbirds & Snakes) is writing MCU X-Men: [https://deadline.com/2024/05/x-men-movie-marvel-studios-momentum-as-michael-lesslie-writer-1235924562/](https://deadline.com/2024/05/x-men-movie-marvel-studios-momentum-as-michael-lesslie-writer-1235924562/)",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "BossBichePoesia",
            "body": "100% serious does anyone have gossip on or is close to Neil Cicierega I need to know how he goes about his life",
            "score": 4
        },
        {
            "depth": 0,
            "author": "syrub",
            "body": "What's Brandy up to RN? Her last (non-Christmas) album was so good. \n\nI've seen a LOT of random Faye Dunaway content recently (think it was her birthday recently?). Would love some lesser known tea on the chaos that is Miss Faye.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "CategorySad6121",
                    "body": "Re: Faye Dunaway….I saw a tweet last week or the week before of someone saying she was on the same flight to Cannes as they were. She had a huge box of Cheez-Its with her.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "syrub",
                            "body": "oh my GOD",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "everydayisstorytime",
                    "body": "She's doing an installment of Disney's Descendants series reprising her role as Cinderella.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "oswaldcobblepot99",
            "body": "In light of her deserved \"a star is born\" moment at Cannes, any tea on Mikey Madison?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "ResponsibleEbb1586",
            "body": "Jon Bon Jovi?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "whatsnewpussykat",
            "body": "I’m on a Macklemore kick lately. Positive tea?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ThrowItIntoFire",
            "body": "David Wenham?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Youpi_Yeah",
                    "body": "His nickname is Daisy, and according to an Austrian actor who worked with him he is nice and laidback.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bird_person18",
            "body": "Robbie Amell?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "disiradosti172",
            "body": "F1? Haven't been following in the recent months. Who's dating who? Who broke up? Who allegedly/ or not allegedly cheated? Any drama?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "brushmushroom",
            "body": "I've recently fallen down the rabbit hole of watching all the Chris Fleming content I can get my hands on and I need an ~~intervention~~ vibe check. Seems sweet, anyone got any insight?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RaggySparra",
            "body": "Anyone know what happened to the actor/singer Michael Willett,from GBF and Faking It? His IG/Twitter dropped off September/October 2022, and nothing popped up since.\n\n(The answer is probably \"trailed off and got a regular job\", but I had a friend who was super into him and I'm nosy.)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FantasyGirl17",
            "body": "Any tea on Ryan Lochte's marriage? His wife Kayla Rae Reid has been posting a lot of quotes, about struggling and hard times and he's been absent from her social media for months.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hi_iamprincesss",
            "body": "Any tea on Eddie Benjamin?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "iamseddie",
            "body": "Michelle Rodriguez? Recently became obsessed with her after rewatching the Fast series",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lazy_Bat_431",
            "body": "Any tea on Hailee Steinfield? I’m so confused about what her career is. She’s released several singles that were honestly quite good’ and performed well, but she now seems to be more of a run of the mill influencer? I’m so confused!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Elle_Joy4",
            "body": "Pia Mia!!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Drink-tha-tea",
            "body": "After seeing the Beatlejuice trailer, does anyone have any tea on the women that kept teenage me having very vivid dreams, Monica Bellucci or Winona Ryder?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "laalpari1511",
            "body": "Anybody has tea on Lee min ho ?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "coolio4564",
            "body": "Lukas Gage? I recently became obsessed with Dead Boy Detectives and have been watching through some of his past projects",
            "score": 1
        },
        {
            "depth": 0,
            "author": "anne_004",
            "body": "Anything broadway ??",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dahakes69",
            "body": "In honor of the NBA playoffs, any tea on NBA players?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "NeetStreet_2",
            "body": "Rufus Sewell?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Thick-Definition7416",
                    "body": "Newly (ish) engaged to a 27 year old",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "OilySteeplechase",
                            "body": "I was absolutely shocked for a second that he’s not gay, then realized I was confusing him with Rupert Everett.\n\nCarry on.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Thick-Definition7416",
                                    "body": "Oh yeah no :-)",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Entire-Ad-5943",
                    "body": "He's getting married in July it appears, according to instagram stories his fiancee uploaded a couple of weeks ago. She was also on a podcast recently where she speaks a little about their relationship.  [https://open.spotify.com/episode/272d5AgC97TlBhkCFyxoB9?si=afe84e8185344040](https://open.spotify.com/episode/272d5AgC97TlBhkCFyxoB9?si=afe84e8185344040)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Arcadiadiv",
            "body": "Any good science fiction & fantasy author tea.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "disiradosti172",
                    "body": "Just the other day I saw the ACOTAR author on a zionist list... So I crossed it off of the \"to buy and read\" list.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AgreeableCake8529",
                            "body": "What list was this? I've not seen anything on any of the Maas reddits about it",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "disiradosti172",
                                    "body": "As far as I've seen, Maas subreddit also doesn't really care either way. \n\nAnd you'll have to forgive me, I don't follow the account and can't seem to find it now.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AgreeableCake8529",
                                            "body": "I'm not for a second saying it isn't true, I just am surprised she's said anything either way as she seems very quiet on a lot.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "disiradosti172",
                                                    "body": "I get it. With a quick search I found this: The basis through which many state that Maas is a zionist is from a 2016 article in which she spoke of her connection to Israel and expressed admiration for her grandmother’s ongoing volunteer efforts for the IOF. Maas has also taken part in Birthright and described the trip as leaving her “overflowing with pride.”  \n\n\nhttps://www.patreon.com/posts/whats-deal-with-97556349",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "usuyukisou",
            "body": "*Andor* cast. Stellan, Denise, Fiona, Genevieve, everyone. I am (still) dying for S2!\n\nAlso, Messi the dog <3",
            "score": 1
        },
        {
            "depth": 0,
            "author": "dalewright1",
            "body": "Where Trista Sutter is!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Distinct-Comedian-48",
            "body": "Lily Donaldson? Did she indeed have a kid? UK followers, spill the tea! lol ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Moist_Goat_41",
            "body": "The maze runner / Divergent cast",
            "score": 1
        },
        {
            "depth": 0,
            "author": "twinkling__lights",
            "body": "zac clark and kaitlyn bristowe?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CozyTea6987",
            "body": "What do people know about Anthony Boyle? He pops up in so many of the TV shows I watch",
            "score": 1
        },
        {
            "depth": 0,
            "author": "i_love_ass33",
            "body": "Sacha Baron cohen and/or Isla Fisher?",
            "score": -1
        },
        {
            "depth": 0,
            "author": "InterpreterOfMelody",
            "body": "Odette Annable and Kimberly Van der Beek?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Fangirl0089",
            "body": "Anything about Ben Hardy",
            "score": 0
        },
        {
            "depth": 0,
            "author": "CaroylOldersee",
            "body": "Tea on any of the cast of Atonement?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Previous-Ratio",
            "body": "Anything new about Sebastian Stan?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "venuswrenhadley",
            "body": "Twin sisters tiktokers Danielle and Bridget? Bridget has a much bigger platform, does a lot of fashion stuff",
            "score": -2
        },
        {
            "depth": 0,
            "author": "GoodbyeToby7",
            "body": "Andrew Scott. I don’t know a whole lot about him beyond his career.",
            "score": 0
        }
    ]
}