{
    "title": "Study links higher consumption of ultraprocessed foods with increased risks of cognitive decline and stroke in older adults.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/Creative_soja  \nPermalink: https://www.neurology.org/doi/10.1212/WNL.0000000000209432\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "somewhat_difficult",
            "body": "Personally I believe this is accurate but these studies always raise questions for me. E.g. I am still working my way through all of it so I may need to retract this, but it seems like it really only accounts for diet and it seems like there is some level of correlation between people who eat poorly and the way they look after themselves in other ways (exercise, sleep, air quality, mental health, mental fitness/challenge, all sorts of things) and the reverse, people who look after themselves generally also eat better. That often isn’t explored, and what impact that has on the results.",
            "score": 50,
            "replies": [
                {
                    "depth": 1,
                    "author": "Apprehensive-Fee-459",
                    "body": "At least come of those studies are normalized for these factors",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "SwiftTayTay",
                    "body": "There's also no clear definition of what qualifies as an ultra processed food or any proof that all ultra processed foods are inherently bad for your health. Most likely they are pointing to foods that are very high in calories, fat, sugar, sodium, cholesterol, etc. but not all ultra processed foods have these qualities.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "TwistedBrother",
                    "body": "But that is explored, but it’s harder to measure. Nonetheless, correlational studies do provide signals to look further. \n\nFor example, to you your point, Huel is ultra processed but it’s also vegan, no trans fats and guided by a nutritionist. People drinking Huel and going to the gym might be included as noise in such a study (in theory). Yet they would probably not likely suffer the same causal effects depending on the mechanism. But these things advance through stages and steps. \n\nThis work can be used to motivate further work to zero in on better mechanisms. It’s not an indictment on those who published to not look at all contextual factors in the ultra model.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Ashamed-Simple-8303",
                    "body": "Or maybe the food makes you lazy as well. No this is not a joke. Think hinernation",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "martphon",
                            "body": "I'm thinking the hinest nation I know",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AllanfromWales1",
            "body": "> Associations between UPFs and both cognitive impairment and stroke were independent of adherence to the Mediterranean, DASH, and MIND diets.  \n  \nWorth remembering.  \n  \nMore generally, though, until someone disentangles the effects of processing techniques, chemicals added and longer shelf lives (i.e. products on the shelves at supermarkets for longer before being sold) I don't find studies like this too helpful.",
            "score": 41,
            "replies": [
                {
                    "depth": 1,
                    "author": "80088008135",
                    "body": "Yeah. Lumping in the the long term health implications between a Twinkie and some wheat bread or yogurt with fruit probably isn’t a practical guide on where to draw the line.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Im_eating_that",
                            "body": "I think the line is being drawn an inch away from a whole lotta toes. When all is said and done there's no room for a line at all without stepping on some of them. I would guess scientists are not being given the option of naming names.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "Lamacorn",
                            "body": "I always wonder this.\n\nWe eat a lot of fresh veg and fruits.\n\nWe also eat store bought whole wheat bread and humus and other things.\n\nI’ve made my own bread many times, it lasts a week tops before molding. Store bought, no problem.\n\nOr is it really only a problem when eating pop tarts and twinkies regularly?",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DonQui_Kong",
                    "body": "The most likely candidate right now is lack of dietary fibre in UPF.  \nThere is mounting evidence that the microbiome is involved in cognitive decline, but its notoriously hard to research.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AllanfromWales1",
                            "body": "Not all UPF is low in fiber, though. Supermarket-bought wholegrain sliced bread, for instance. Which illustrates my point that the term is unhelpful and it would be better to look at what actually causes the problem case by case.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DonQui_Kong",
                                    "body": "Individual data points dont matter for those large scale correlations (in that context borad categories such as UPF are still useful).  \n  \nWhat matters is that UPF on average have very low fibre content compared to less processed foods.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AllanfromWales1",
                                            "body": "Disagree. If it is the case - as it may well be - that one of the reasons why UPFs are bad for your health is because they are - on average - low in fibre, then we should be demonising low fibre foods as a class rather than a type of food which in many cases happens to be low in fibre. That's like saying blue foods are bad because many blue foods have food coloring additives. You end up persuading people not to eat UPFs which happen to be high in fibre. That's surely not the right way to go.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Ashamed-Simple-8303",
                                            "body": "Meat and diary have 0 fiber and i dont see the carnivores getting fat and dying left and right.\nIf you look more and open your mind you will even find the studies that show a reduction in fiber is far more helpful for gut issues like IBS.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HardlyDecent",
                    "body": "Also, amount of UPF is a meaning less number entirely.  It *could* be useful if taken in proportion to \"healthy\" or more whole foods.   But that's still a lot of hazy lines to draw on a single graph.  A little trash food is fine occasionally.  The problem is mostly when it prevents one from eating well otherwise, or exercising, when eating UPFs is strongly associated with poverty and drug abuse, and so on.  Never mind that athletes often require the simplest of sugars as a fuel source sometimes (think of double-bouts of soccer in a day or ultramarathons--they're drinking liquid sugar (the literal Devil!) to refuel, and yet they are \"healthy.\"",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Creative_soja",
            "body": ">**Background and Objectives**\n\n>Ultra-processed foods (UPFs) are linked to cardiometabolic diseases and neurologic outcomes, such as cognitive decline and stroke. However, it is unclear whether food processing confers neurologic risk independent of dietary pattern information. We aimed to (1) investigate associations between UPFs and incident cognitive impairment and stroke and (2) compare these associations with other commonly recommended dietary patterns in the REasons for Geographic and Racial Differences in Stroke study. This prospective, observational cohort study enrolled Black and White adults in the United States from 2003 to 2007.\n\n>**Methods**\n\n>The NOVA system was used to categorize items from a baseline food frequency questionnaire according to the level of processing. Participants with incomplete or implausible self-reported dietary data were excluded. Consumption for each category (grams) was normalized to total grams consumed. Scores quantifying adherence to a Mediterranean, Dietary Approaches to Stop Hypertension (DASH), and Mediterranean-DASH Intervention for Neurodegenerative Delay (MIND) diet were also calculated. Incident cognitive impairment was defined using performance relative to a normative sample on memory and fluency assessments. Incident stroke was identified through adjudicated review of medical records.\n\n>**Results**\n\n>The cognitive impairment cohort (n = 14,175) included participants without evidence of impairment at baseline who underwent follow-up testing. The stroke cohort (n = 20,243) included participants without a history of stroke. In multivariable Cox proportional hazards models, a 10% increase in relative intake of UPFs was associated with higher risk of cognitive impairment (hazard ratio \\[HR\\] = 1.16, 95% CI 1.09–1.24, p = 1.01 × 10−5) and intake of unprocessed or minimally processed foods with lower risk of cognitive impairment (HR = 0.88, 95% CI 0.83–0.94, p = 1.83 × 10−4). Greater intake of UPFs (HR = 1.08, 95% CI 1.02–1.14, p = 1.12 × 10−2) and unprocessed or minimally processed foods (HR = 0.91, 95% CI 0.86–0.95, p = 2.13 × 10−4) were also associated with risk of stroke in multivariable Cox models. The effect of UPFs on stroke risk was greater among Black than White participants (UPF-by-race interaction HR = 1.15, 95% CI 1.03–1.29, p = 1.50 × 10−2). Associations between UPFs and both cognitive impairment and stroke were independent of adherence to the Mediterranean, DASH, and MIND diets.\n\n>**Discussion**\n\n>Food processing may be important to brain health in older adults independent of known risk factors and adherence to recommended dietary patterns.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "Ok-Resource-5292",
            "body": "is this before or after the last one that showed emulsifiers and other things that are being referred to as ultraprocessed do not significantly correlate to anything in a big data crunch?",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "Several_Puffins",
                    "body": "Best to share a citation link.",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "DonQui_Kong",
                    "body": "Its important to note that this is \"just\" a correlation.  \nThat doesn't mean something in the UPF causes cognitive decline.  \nIt could mean that something is lacking in UPF that prevents cognitive decline, but it could even be more removed and that higher UPF consumption is simply associated with other behaviors that increase the risk for cognitive decline.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "mkmlls743",
            "body": "You mean the giants invested in food and medicine are creating a revolving door of human cattle through suffering and destruction to capitalize on a frail ecosystem for profit? You don’t say..",
            "score": 47,
            "replies": [
                {
                    "depth": 1,
                    "author": "SethikTollin7",
                    "body": "Right? System was in place to increase cognitive decline, ruin us young and throw enough people toward your deep end to up your profits. Creating all sorts of stuck people so they have little to no choice...",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mkmlls743",
                            "body": "Third leading cause of death by their own accounting. 1st leading cause if you know how to count correctly.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "frunf1",
            "body": "Too bad ultra processed food is not really defined...",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "Human_Name_9953",
                    "body": "They used the NOVA system. Some of the categorisations in NOVA are, in my opinion, based on cultural perception rather than evidence, and some categories could be broken down further, but it's very thorough and is worth looking into.\n\n\nhttps://en.m.wikipedia.org/wiki/Nova_classification",
                    "score": 19
                }
            ]
        },
        {
            "depth": 0,
            "author": "Polishing_My_Grapple",
            "body": "So...Taco Bell makes you stupid?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Malforus",
            "body": "Is there correction for income?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Zvenigora",
            "body": "Studies such as this might possibly be on to something, but the problem is that \"processed\" is not a food ingredient that can be objectively quantified, nor even a consistent single property. To the extent that these results are real, they need to be traced to actual, quantifiable ingredients or specific properties.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Deesnuts77",
            "body": "So now that we know that, when does our “government”, who is so concerned with people’s well being that they shut everything a few years ago, start penalizing the companies that are making this ultra processed food?  I don’t understand the disconnect there. Like it’s some mystery and unknowable source where a food that is sold and produced to be ingested comes from.  How is that not Step 2? This world is bananas",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "oojacoboo",
                    "body": "I vote for you to be the guy that tells Americans they can’t have their chicken nuggets.",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "medioxcore",
                            "body": "*from my cold, dead, hands*",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Deesnuts77",
                            "body": "Well everyone had to listen when they told us we couldn’t go to work. This seems like an easier sell.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "HardlyDecent",
                    "body": "Bananas are fine--unless you're diabetic.  We don't really want the government to immediately penalize private entities--even if they're *evil* big bad corporations--on shaky ass science though.  Companies make trash, but no one is requiring anyone else to buy that trash--that's a personal choice.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Deesnuts77",
                            "body": "Well then they can start packaging it like Tobacco products. A lot less people would buy chicken nuggets if there was a picture of a stroke victim on the packaging saying “this product may cause strokes” or something to that effect.  You’re also incorrect. We want big corporations to get penalized as much and as often as possible so that they think twice before they decide profits are more important than killing people with their horrible products. Or just keep being smug and acting like it’s insane to try and stop any of this. Up to you.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1
        },
        {
            "depth": 0,
            "author": "fallguy19",
            "body": "IDK, old people love fast food  like my parents and my in-laws who are all north of 85 yrs old. Anecdotal but there you go.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Ashamed-Simple-8303",
            "body": "And the main components of UPF are seed oils, sugar incl hfcs and wheat flour, usually at least 2 of them. \n\n\nWheat we have been eating for 10k years. It is not great but can therefore be excluded as main cause for modern disease. Sugar consumption has been going down last 2 decades. And it never increased all that much compared to say 60s.  That leaves seed oils which have been streadily increasing in sync with the health crisis and it can be biochemically explained why they are bad and why it affects people differently, obesity is a protection mechsnism!",
            "score": 0
        },
        {
            "depth": 0,
            "author": "anothermaninyourlife",
            "body": "This is one of those articles that you don't even have to read to agree with.\n\nYou don't even feel good after eating ultra-processed food over and over again.\n\nSo I don't imagine that it's gonna be good for our bodies, long-term.",
            "score": -3
        }
    ]
}