{
    "title": " Study on mouse models with Alzheimer’s Disease have found that urolithin A, a substance naturally occurring in i.a. pomegranates, strawberries and walnuts can improve memory and treatment of Alzheimer’s Disease",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/giuliomagnifico  \nPermalink: https://news.ku.dk/all_news/2024/05/naturally-occurring-substance-in-pomegranates-can-improve-treatment-of-alzheimers-disease/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ParticularSmell5285",
            "body": "ChromaDex is a dietary supplement and food ingredient company based in Los Angeles, California founded in 1999 that is publicly traded on the NASDAQ.",
            "score": 48,
            "replies": [
                {
                    "depth": 1,
                    "author": "Consistent_Bread_V2",
                    "body": "To clarify, are they the funders of the study?",
                    "score": 28,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Sculptasquad",
                            "body": "\"E.F.F. has a CRADA arrangement with ChromaDex (USA) and is a consultant to Aladdin Healthcare Technologies (UK and Germany), the Vancouver Dementia Prevention Centre (Canada), Intellectual Labs (Norway), and MindRank AI (China). V.A.B. has a relationship with and previously had a CRADA arrangement with ChromaDex (USA).\"",
                            "score": 19
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "NegativeBee",
            "body": "Don’t go out buying walnuts and pomegranates for your grandparents. They supplemented urolithin A at 200mg/kg/day. That means a human would have to take a minimum of 12 **grams** of UA per day to see the same effects. You’d have to eat 29.7 kg of strawberries or 16.9 kg of raspberries per day to get the same dosage (Häkkinen et al 2000).",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "Rhoomba",
                    "body": "Also, depending on your gut bacteria you may not produce it: https://www.nature.com/articles/s41430-021-00950-1",
                    "score": 11
                }
            ]
        },
        {
            "depth": 0,
            "author": "giuliomagnifico",
            "body": ">The researchers previously discovered that a specific molecule, nicotinamide riboside (NAD supplement), plays a key role in neurodegenerative diseases such as Alzheimer’s and Parkinson’s, as it actively helps remove damaged mitochondria from the brain.\n>\n>“Many patients with neurodegenerative diseases experience mitochondrial dysfunction, also known as mitophagy. This means that the brain has difficulties removing weak mitochondria, which thus accumulate and affect brain function. If you are able to stimulate the mitophagy process, removing weak mitochondria, you will see some very positive results,” Vilhelm Bohr explains.\n>\n>The results of the new study show that a substance found in pomegranates, urolithin A, removes weak mitochondria from the brain just as effectively as NAD supplement.\n\nPaper: [Urolithin A improves Alzheimer's disease cognition and restores mitophagy and lysosomal functions - Hou - Alzheimer's & Dementia - Wiley Online Library](https://alz-journals.onlinelibrary.wiley.com/doi/10.1002/alz.13847)",
            "score": 9
        },
        {
            "depth": 0,
            "author": "HaikuForCats",
            "body": "Big Walnut has come to play.",
            "score": 0
        }
    ]
}