{
    "title": "While the majority of the public trusts climate scientists worldwide, the minority that do distrust climate scientists are politically influential when it comes to stalling progress on climate change. Additionally, in many regions, confidence in climate science has increased in recent years. ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/MistWeaver80  \nPermalink: https://www.scimex.org/newsfeed/distrust-in-climate-scientists-comes-from-a-minority-but-their-skepticism-is-powerful\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "esc8pe8rtist",
            "body": "It is difficult to convince a man of something when his livelihood depends on his not being convinced of it",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "PoconoBobobobo",
                    "body": "Bingo. They don't distrust science, they just don't care about it, and so it doesn't matter if they act like they're luddites. \n\nNo one \"distrusts\" the material and computer science that makes their iPhone work. But when people with just as much authority tell them the temperature is rising, suddenly they get incredulous.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "i_am_the_likker",
                    "body": "As a family member of people who aren't dependent on fossil fuels, but are adamant about \"Big Science\" corruption, I can tell you that it's more about towing the tribal lines than anything.",
                    "score": 1
                }
            ]
        }
    ]
}