{
    "title": "Male authors of psychology papers were less likely to respond to a request for a copy of their recent work if the requester used they/them pronouns; female authors responded at equal rates to all requesters, regardless of the requester's pronouns.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/fotogneric  \nPermalink: https://psycnet.apa.org/doiLanding?doi=10.1037%2Fsgd0000737\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AugustWest67",
            "body": "How/why would you need your pronouns to request a paper?  Who refers to themselves in the third person in a request?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "AnOddOtter",
                    "body": ">The content of the emails was identical except the email signature was randomly assigned to include she/her, he/him, they/them, or no pronouns.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rdog333",
                    "body": "It’s become more common for people to put their pronouns in their email signature, especially in academics.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Lvxurie",
                    "body": "We have put Mr /Mrs/miss/ms for ages as identifiers how is this any different?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "stem_factually",
            "body": "I'd love to know a few things but it's behind a paywall. Anyone able to read it and willing to answer for me: Were different professors emailed 2x, one form pronouns included one from no pronouns included? Or were a bunch of professors emailed and data pooled?\n\n\n  If the latter, then the data isn't very meaningful as it could just be randomly men are less likely to reply overall \n\n\n If the former, then professors may have gotten annoyed by 2 emails requesting in a short period of time and the data would be biased favoring the first email. So if that, which email was sent first?\n\n\nEdit: also curious about age and demographic. Locations of the faculty chosen. Tiers of school..\n\n\nThere's just too many variables.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "poply",
            "body": "Interesting.\n\n\nI wish I could access the full study. Charitably, I might consider that male authors may see the request to be antagonistic in nature, e.g. someone who is only interested in making you or your study look bad.\n\n\nI also dislike how the synopsis we have available characterizes this trend as gender bias. Using they/them obscures gender. According to their own study neither men nor women are receiving lower response rates, so what gender are they alleging to be the victim of discrimination?\n\n\nI would really like to see how significant the bias is.",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "gnoani",
                    "body": "> so what gender are they alleging to be the victim of discrimination?\n\nThis is just \"they/them, fine, but which one are you really\" a different way.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "cryyptorchid",
                    "body": ">Using they/them obscures gender.\n\nNot necessarily. Very few people are choosing to specifically add they/them pronouns to their email signature to \"obscure gender.\" Even if it were, the assumption that someone owes you that disclosure is its own form of bias.\n\n>According to their own study neither men nor women are receiving lower response rates, so what gender are they alleging to be the victim of discrimination?\n\nNonbinary people? Gender-nonconforming people? Who also don't deserve to face gendered bias? \n\nThere also isn't a rate supplied for people who have no pronouns in their email signature, but I wouldn't be surprised to see that group get more responses than any of the others.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "grifxdonut",
                            "body": "They didn't say people are identifying with they/them pronouns to obscure gender on purpose, they said by people using they/them gender is being obscured.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "gallimaufrys",
                    "body": "Gender diverse people, or anyone who uses they/ them pronouns...\n\nI have no idea why using they/them pronouns would indicate you want to make a study look bad, that's absurd.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KawaiiCoupon",
                            "body": "I’m honestly trying to understand what that means? So a student or faculty members who uses they/them pronouns requests access to a full-text of a paper on new microbiome research and the commenter’s idea is that the male writer of the paper feels threatened?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "plaudite_cives",
                                    "body": "Well, if you're white male who has seen what happens around casinos these days, will you feel more threatened by the normal people or by the people who say you are the source of all evil in the current world?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AirLow5629",
                                            "body": "Wait-- what happens around casinos these days?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "FickleRegular1718",
                            "body": "They may perceive them to be difficult people? \n\n​I have no experience with this and no opinion. I'll call you whatever you want but I might maybe get it wrong a couple times at first. I have yet to run into this in my life.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Kind_Gate_4577",
                                    "body": "Yes I think you are correct. I saw a different study that people who put they/them on job resumes are less likely to get the job. ",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "gallimaufrys",
                                    "body": "Well yes it's obviously transphobia or at the very least cisnormativity, that's why the authors have said it indicates gender bias. \n\nWhat you shared doesn't suggest that they are worried nonbinary folk are out to damage their research by being nefarious, which is what the person I replied to was suggesting.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "HappyDeadCat",
                            "body": "Is it not obvious? You balk societal norms and basic grammar. I'm far more understanding with xe/zim/ze then \"they\". \n\n\nThey is a plural, you are not a host of demons.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Chillbrosaurus_Rex",
                                    "body": "\"Hey excuse me, someone left their umbrella in my bus seat.\" This has been completely normal parlance for decades.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "RickyBongHands",
                                    "body": "\"Is “they” singular or plural? They is traditionally a third-person plural pronoun, used to refer to groups of two or more people or things. However, it's also widely used nowadays as a singular pronoun, to refer to an individual person of unknown or nonbinary gender. This usage is referred to as the singular “they.” \" \n\nIt takes 30 seconds to not look like an idiot. Google is your friend.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "duncandun",
                                            "body": "It’s historically also been singular, it is not a new thing.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "fluvicola_nengeta",
                                    "body": "\"They\" has been used in singular form for centuries now, and even if it weren't, one defining characteristic of languages is how quickly they change and evolve. Grammar doesn't dictate the rules, it observes the rules and is then taught as a guideline to orientate a cohesion of the language within a territory, primarily in the written form. Grammar changes constantly in response to how people speak. Grammar is not above people. Using this argument reveals your abysmal ignorance on the subject.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "The_Captain1228",
                                    "body": "They has never been solely plural. If I were to refer to the person you just replied to, I'd say \"They didn't really balk anything.\" because their gender is unknown and unimportant to the comment. (also notice the their, rather than his or her, for the same reason. Yet no one pretends their is only for something belonging to a group.)",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "KawaiiCoupon",
                                    "body": "They has been used as a singular pronoun in English for centuries. Some languages don’t even have pronouns separated by gender.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Mrfish31",
                                    "body": ">They is a plural, you are not a host of demons.\n\n\"Somebody left *their* coat on the bus\". A perfectly natural thing to say, singular they has been in use for centuries.\n\nIn fact, singular they has been in use longer than singular \"you\" has (it used to be \"thou\")",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Extinction-Entity",
                                    "body": "“Who left their umbrella on the bus?” It’s really not hard to understand, and if you balk at singular “they” (which has been used for literal centuries) at this point, you’re being willfully obtuse and disingenuous.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "stem_factually",
                    "body": "I am a former STEM professor. Female.\n\n\nI think one of the things I'd be interested in finding out is the status of the faculty etc, as busier faculty will be less likely to respond to emails period. Or age could have played a role. Are the men all over 60? Females all under 40?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "cincystudent",
                    "body": "Hi, new to science?  Noone with any credibility worries that their study might be challenged, all good scientific findings SHOULD be challenged.  That's the guiding principle of scientific research.  You're either not terribly bright, or you're intentionally misunderstanding the study, the study is not demonstrating who the victim of discrimination is, it's exploring the gender of the perpetuator of that discrimination.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Avery_Lillius",
                    "body": "You realize that gender is a bit more diverse than men and women, right? \n\nAnd how would someone's pronoun choice make them seem antagonist? Unless the study findings were \"they/them pronouns is dumb,\" I don't see the correlation",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Kind_Gate_4577",
                            "body": "This is why they/them get less responses ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Avery_Lillius",
                                    "body": "This? You mean me? Because I must be one of them! Gasp!!!\n\nSorry, I use she/her.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "fotogneric",
                    "body": "OP looked in vain for a PDF or preprint but so far no luck.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Immortan2",
                            "body": "Did you just refer to yourself in the 3rd person?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ragnar_Bonesman",
            "body": "The male authors probably reasoned there’s no advantage to entertaining lunacy and had no problem being disagreeable, whereas females are, in general, more agreeable.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Phemto_B",
            "body": "Not shocked. This is the profession that invented the word \"homosexual\" to describe a disorder, then took 100 years to figure out that it wasn't a disorder after all.",
            "score": -37,
            "replies": [
                {
                    "depth": 1,
                    "author": "poply",
                    "body": "That's a fair criticism but I feel it is being unfairly extrapolated. Science should be a self correcting process.\n\n\nAlso homosexuality was removed from the DSM as a disorder in the 70s. I could be mistaken, but I don't think there was a formal diagnosis of mental disorder for homosexuality in the 1870s. The DSM and ICD certainly didn't exist.",
                    "score": 36,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Seffaf",
                            "body": "Dr. Emil Kraeplin, the psychiatrist who is considered as the doyen of German psychiatry, which is one of the best if not the best at that time, included the diagnosis under the \"contrary sexual instincts\" name. His books were essentially DSM of the time. He died in 1926.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Phemto_B",
                            "body": "The \"disorder\" of homosexuality was described in 1868.\n\nIt's true that science **should** be self correcting. I don't see much evidence that psychology is, as evidenced by the ongoing replication crisis. I've also read enough psychology papers that are little more than glorified surveys with questions designed to reinforce the researcher's preconceived notions, or see conclusions drawn that aren't really supported by the results of the study.\n\nThis is an ongoing issue.",
                            "score": -11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "finicky88",
                                    "body": "\"a man who lies with another man shall be stoned\"\n\nWe've been classing homosexuality as a disease since pretty much ever.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MasterOfNap",
                                            "body": "Now let’s be fair - the Bible didn’t say homosexuality is a disease, it said it’s an _abomination_…which is honestly a lot worse.\n\nWe’ve gone a long way from saying it’s an abomination that should get you killed (then tortured in hell forever), to saying it’s a disease or mental illness, to saying it’s a “lifestyle”, to now finally considering it (mostly) socially acceptable.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Skeptix_907",
                    "body": "Not quite. Psychiatrists were the primary authors of the early DSMs, not psychologists.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "smarabri",
                            "body": "Usually racist, misogynistic white males.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "RyukHunter",
                            "body": "Wasn't psychiatry one domain of psychology back then? One of the 3 main approaches? Therapy, drugs and surgery.\n\nIt was only later that it became a field of its own.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DoctorLinguarum",
                    "body": "Would you mind elaborating on your last point? How does receiving a request from someone using neutral pronouns threaten a man…?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RyukHunter",
                            "body": "Oops my bad. I thought the pronouns being referred to were the authors pronouns.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "RatQueenHolly",
                            "body": "They feel threatened by people who are different from them, and assume everyone else is the same.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ReallyTeenyPeeny",
            "body": "They/them is very confusing to me and gives me such tired head, so I can relate to someone being turned off seeing that in a signature",
            "score": 1
        }
    ]
}