{
    "title": "Synthetic diamonds grow in liquid metal at ambient pressure | While high temperatures are still a prerequisite, it is possible to make polycrystalline diamond film at standard pressures",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/Hrmbee  \nPermalink: https://physicsworld.com/a/synthetic-diamonds-grow-in-liquid-metal-at-ambient-pressure/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hrmbee",
            "body": "From the article:\n\n>The usual way of manufacturing synthetic diamonds involves applying huge pressures to carbon at high temperatures. Now, however, researchers at the Institute for Basic Science (IBS) in Korea have shown that while high temperatures are still a prerequisite, it is possible to make polycrystalline diamond film at standard pressures. The new technique could revolutionize diamond manufacturing, they say.\n>\n>Natural diamonds form over billions of years in the Earth’s upper mantle at temperatures of between 900 and 1400 °C and pressures of 5–6 gigapascals (GPa). For the most part, the manufacturing processes used to make most synthetic diamonds mimic these conditions. In the 1950s, for example, scientists at General Electric in the US developed a way to synthesize diamonds in the laboratory using molten iron sulphide at around 7 GPa and 1600 °C. Although other researchers have since refined this technique (and developed an alternative known as chemical vapour deposition for making high-quality diamonds), diamond manufacturing largely still depends on liquid metals at high pressures and temperatures (HPHT).\n>\n>A team led by Rodney Ruoff has now turned this convention on its head by making a polycrystalline diamond film using liquid metal at just 1 atmosphere of pressure and 1025 °C. When Ruoff and colleagues exposed a liquid alloy of gallium, iron, silicon and nickel to a mix of methane and hydrogen, they observed diamond growing in the subsurface of the liquid metal. The team attribute this effect to the catalytic activation of methane and the diffusion of carbons atoms in the subsurface region.\n\n---\n\nThe original journal link:\n\n[Growth of diamond in liquid metal at 1 atm pressure](https://www.nature.com/articles/s41586-024-07339-7)\n\nAbstract:\n\n>Natural diamonds were (and are) formed (thousands of million years ago) in the upper mantle of Earth in metallic melts at temperatures of 900–1,400 °C and at pressures of 5–6 GPa. Diamond is thermodynamically stable under high-pressure and high-temperature conditions as per the phase diagram of carbon. Scientists at General Electric invented and used a high-pressure and high-temperature apparatus in 1955 to synthesize diamonds by using molten iron sulfide at about 7 GPa and 1,600 °C. There is an existing model that diamond can be grown using liquid metals only at both high pressure and high temperature. Here we describe the growth of diamond crystals and polycrystalline diamond films with no seed particles using liquid metal but at 1 atm pressure and at 1,025 °C, breaking this pattern. Diamond grew in the subsurface of liquid metal composed of gallium, iron, nickel and silicon, by catalytic activation of methane and diffusion of carbon atoms into and within the subsurface regions. We found that the supersaturation of carbon in the liquid metal subsurface leads to the nucleation and growth of diamonds, with Si playing an important part in stabilizing tetravalently bonded carbon clusters that play a part in nucleation. Growth of (metastable) diamond in liquid metal at moderate temperature and 1 atm pressure opens many possibilities for further basic science studies and for the scaling of this type of growth.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "chasebewakoof",
            "body": "so-called diamonds which can only be seen by SEM or TEM...",
            "score": -1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 0
        }
    ]
}