{
    "title": "Daily and near-daily marijuana use is now more common than similar levels of drinking in the U.S., according to an analysis of national survey data over four decades.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/nbcnews  \nPermalink: https://www.nbcnews.com/health/health-news/daily-marijuana-use-outpaces-daily-drinking-us-new-study-says-rcna153510\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "newpsyaccount32",
            "body": "damn, it's almost like alcohol and cannabis are very different substances.  i wonder if there was some sort of law that would have prevented people from being honest about their cannabis use in previous years?\n\nkudos to the authors though, as they actually acknowledge that in the paper:\n\n>Of particular note, willingness to self-report may have increased as cannabis became normalized, so changes in actual use may be less pronounced than changes in reported use. On the other hand, cannabis product variety exploded after state-legalization. Vapes, dabs, edibles, tinctures, Δ-8-tetrahydrocannabinol and other intoxicating products derived from industrial hemp create the possibility that some cannabis users might answer ‘no’ to questions asking only about traditional ‘marijuana and hashish’ \\[11\\]. Therefore, measurement error in an indeterminate direction is possible.",
            "score": 1412,
            "replies": [
                {
                    "depth": 1,
                    "author": "lordpuddingcup",
                    "body": "I’d also rather meet 10 guys that’s smoked weed today than one belligerent asshole who got drunk",
                    "score": 940,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Yasirbare",
                            "body": "That has allways been my argument you just know that some kind of levelness is expected, unless alcohol is also involved.",
                            "score": 260,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "biffmangram",
                                    "body": "I had this conversation with my 2 older kids when they were 13 and will have it with my youngest in a year or so. I’m not naive enough to think they’ll get all the way through high school and college without coming across either of these, but I told them straight up you’re much less likely to find yourself or someone you know in bad situations around pot smokers than you would around a bunch of drunks. The worst thing about cannabis is its legal status.",
                                    "score": 222,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ThatGuyJeb",
                                            "body": "Weed didn't make me paranoid, cops did.",
                                            "score": 185,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TheLightningL0rd",
                                                    "body": "I recognized signs of paranoia when I first started smoking back in college (nearly 20 years ago now) like an urge to look over my shoulder when walking home alone in the dark. BUT it never got to me until I was arrested for possession. After that I would freak out at the thought of cops being around, or if I saw a cop car drive by when they realistically had no idea that I existed or was smoking.",
                                                    "score": 76,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "HumanWithComputer",
                                                            "body": "Still enough to be concerned about, paranoid or not.\n\n[Cannabis Addiction and the Brain: a Review](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6223748/)\n\n[Lifetime marijuana use and epigenetic age acceleration: A 17-year\nprospective examination](https://www.dalgarnoinstitute.org.au/images/resources/pdf/cannabis-conundrum/Lifetime_marijuana_use_and_epigenetic_age_acceleration_-_A_17-year_prospective_examination22.pdf)",
                                                            "score": 42,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "dandrevee",
                                                                    "body": "So, unless I am breezing over the conclusions of the second study, we should make weed cheaper so we can all cook with it because smoking it which is currently cheaper is more detrimental?",
                                                                    "score": 28,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "HisNameWasBoner411",
                                                                            "body": "Buy a dry herb vaporizer and you'll use less and be healthier than smoking.",
                                                                            "score": 33,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "jurassic_pork",
                                                                                    "body": "You can also make cannabutter with the ABV vape leftovers from the dry herb vape. I have friends that save up a Ziploc bag in the freezer from their Volcano leftovers and then make butter for cookies or brownies. It's not as strong as flower but it's free and you can just use more ABV to make the butter.",
                                                                                    "score": 5
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "jonas_ost",
                                                                            "body": "High thc content and low cbd is whats bad. It made my anxiety worse. Now i mix cbd buds and street weed but if i could buy legal weed i would buy a 1:1 ratio cbd/thc",
                                                                            "score": 9,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "verminal-tenacity",
                                                                                    "body": "agreed i have a 9%thc 11%cbd flower prescribed as my main and even that's almost too strong some mornings. like you i've started mixing my own, putting a tiny pinch of 22% thc flower into a couple of grams of high grade cbd flower gets me nice and chill until well into the afternoon.",
                                                                                    "score": 2
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Dogsnamewasfrank",
                                                                            "body": "And the recent ability to experiment with strains and reducing side effects like paranoia.  There are even strains that don;t give you the munchies.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "LysanderOfSparta",
                                                                    "body": "We should certainly research anything we are consuming heavily! Alcohol, marijuana, medicine, food. I agree with the sentiment - my take is that it's a vice like many others, ie it's probably not good for you in some ways, and it's probably good in certain applications, but ideally we would want to run plenty of studies so we can be well informed about what we're putting into our bodies.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "fearhs",
                                                    "body": "It's not paranoia if they really are out to get you, which they are if you use illegal drugs.",
                                                    "score": 0
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "tytbalt",
                                            "body": "Soooo there is evidence that the earlier someone starts using cannabis, the likelier it is for them to develop THC-induced psychosis. It happened to my boyfriend and he has to take medication for life now. So I would highly encourage them to abstain from cannabis until adulthood. My boyfriend can't consume any THC anymore.",
                                            "score": 60,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Ohmannothankyou",
                                                    "body": "Has he had his potassium levels checked multiple times? Hypokalemic psychosis tried to end me. ",
                                                    "score": 15,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tytbalt",
                                                            "body": "He went through multiple psychotic episodes in his 20s before accepting it was the weed because he didn't want to give up smoking. Things have been going much better for him now that he's abstaining from THC and on daily mood stabilizers. He ingests high CBD instead.",
                                                            "score": 6
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Wannacomesitonmydeck",
                                                    "body": "Totally agree. As someone who just quit a month ago my quality of life has increased 10 fold. I was smoking an ounce every 10-14 days.",
                                                    "score": 16,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "derprondo",
                                                            "body": "Man that's insane.  I hit a dynavap a couple of times a night and it takes me a year to go through that much.",
                                                            "score": 6
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "lazypieceofcrap",
                                                            "body": "I've been smoking a bit more than 2 ounces a week for five years and I've never been more productive in my life. Doing better at my hobbies than ever, too.\n\n\nPot to me is like what coffee is to coffee addicts who drink it all day/night.",
                                                            "score": 21,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Bradddtheimpaler",
                                                                    "body": "We appear to be the lucky ones.  I’ve been at it daily for about 12 years now and my life has improved like, exponentially since I started.  I definitely get it’s not for everyone, but I’m convinced this is better for me than stimulant ADHD medication, so I’m going to keep maintaining my careful THC/caffeine ratio as long as it’s working.",
                                                                    "score": 11,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lazypieceofcrap",
                                                                            "body": ">but I’m convinced this is better for me than stimulant ADHD medication\n\nNo question! Enjoy the green!",
                                                                            "score": 5
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Wannacomesitonmydeck",
                                                                    "body": "Totally get it. Everyone is different. If you don’t mind me asking, how old are you? 56 grams a week is definitely on the high end for usage.",
                                                                    "score": 12,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lazypieceofcrap",
                                                                            "body": "I am 34. Didn't touch thc/pot once until I was 28 and moved to a legal state.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "akp55",
                                                                                    "body": "How are you consuming it?  I used to be pretty close in consumption, but managed to drop it by switching to a dry herb vape",
                                                                                    "score": 3,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "lazypieceofcrap",
                                                                                            "body": "I've done like every method under the sun but prefer joints. Take ~10 minutes and throw an audiobook on or some music.\n\n\n\nI have a dry herb vape somewhere. Always made the flavor really strong and nice.\n\n\nMy sister, on the other hand, prefers to dab with only occasional joints.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "ZZ9ZA",
                                                                                                    "body": "Joints are basically the least efficient method",
                                                                                                    "score": 2,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "gmoreschi",
                                                                                                            "body": "Yet the most enjoyable and analog way to partake. Worth it.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        },
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "muffinass",
                                                                                            "body": "I exclusively boof it.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Pineydude",
                                                                                    "body": "That is an insane amount. It also beats up your lungs. I often do drink a little with it and that increases effects some.  Are you in a legal state? If so, can you get high percentage thc flower? Like 30% plus",
                                                                                    "score": 4,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "lazypieceofcrap",
                                                                                            "body": "It's fun once in a great while to have a few drinks with some joints for sure but I don't like next day impacts of drinking. Not fun.\n\n\nI'm in a legal state pretty much all flower here is in that 25-32% range or so but I'm like Alex in Grandma's Boy where a bag of weed is a bag of weed. I don't really look at the %.",
                                                                                            "score": 2,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Pineydude",
                                                                                                    "body": "Mellow on the drinking doesn’t hurt. I don’t smoke every day, some days I do edibles, actually more days with edibles than flower.",
                                                                                                    "score": 2
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Wannacomesitonmydeck",
                                                                                    "body": "Awesome! I’m in Canada so having it be legal is definitely a big plus, I think where I messed up was smoking daily as a heavy user from 20-25.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "lazypieceofcrap",
                                                                                            "body": "I could see that. Certainly wouldn't have been good for me to have access when I was younger, I know that much.\n\n\nI wouldn't even smoke it daily if it made me blasted all day like people with low tolerances. The thing I get from it that I like is that little background brain buzz which helps slow my overactive adhd mind down because otherwise it's easy for me to think too much.\n\n\nOne day I'll probably get bored of it and stop but until then I'm just enjoying the current chapter of my life.",
                                                                                            "score": 3
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        },
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "jonas_ost",
                                                                            "body": "Ye thats insane. I smoke like 1g a week and i smoke every day",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "death_by_napkin",
                                                                    "body": "Dear god brother please tell me you are vaping it. Lots of amazing dry herb vapes out there that will be so much easier on your body",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lazypieceofcrap",
                                                                            "body": "I have a dry herb vape (Arizer Solo 2 if I recall) that I've used many times but vastly prefer joints.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "death_by_napkin",
                                                                                    "body": "Fair enough I get it, it is different. I was a big fan of Arizer extreme q",
                                                                                    "score": 2
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Swineservant",
                                                                    "body": "Where do you find the TIME to smoke that much?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "lazypieceofcrap",
                                                                            "body": "Working from home surely doesn't hurt.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Preeng",
                                                                    "body": "Same with me. And ounce a week. I have mental health problems. I already go to therapy and am on meds. The biggest problems I have are ruminations, constantly going over my flaws and failures in life. It's debilitating. Smoking weed slows down my brain. I can't think of more than 1 thing at a time. I am able to focus on the task at hand.\n\nI don't get blitzed out of my mind, I puff joints throughout the day. If I do overdo it I definitely get too high to function. I know I need to put the joint down when I start daydreaming.\n\nWeird thing is I am 37 and didn't start smoking until I was 27 and it became legal in my state. Are we soul mates?",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Swineservant",
                                                            "body": "Where do you find the TIME to smoke that much?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Wannacomesitonmydeck",
                                                                    "body": "Smoke before work and smoke after work. Would smoke 3-6 joints a night. Honestly the last 2 years I didn’t even feel high.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "RichardCity",
                                                    "body": "I've always been glad I waited until I was an adult before I started smoking weed. I have epilepsy, and it goes a long way toward reducing my seizures.",
                                                    "score": 2
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Divtos",
                                                    "body": "This is very difficult to say. Mental illness usually becomes apparent between 18-29 with no known cause other than genetics. How could you tell if marijuana was the cause or not?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tytbalt",
                                                            "body": "He would develop psychosis after consuming THC (multiple times). He didn't want to believe it was the weed because he didn't want to give it up. But once he eventually did, he hasn't had any psychotic episodes going on 10 years (although he does take mood stabilizers and has had hypomania at times). My understanding is that THC interacts with a genetic predisposition that people may not be aware of. A 15 year old probably wouldn't know if they are genetically predisposed to schizophrenia/bipolar/etc.",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "ballsohaahd",
                                                    "body": "What evidence?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tytbalt",
                                                            "body": "https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3927252/ \n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC2424288/",
                                                            "score": 12
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Imaballofstress",
                                                    "body": "With that said, I’d still rather an episode of psychosis and meds than a cirrhosis diagnosis. It is unfortunate though. I have a friend whom in high school swears he got “laced” and “set up” by another acquaintance of ours and then got diagnosed with schizophrenia. To be fair, I wouldn’t put it past the acquaintance, but I don’t think it was the case. And I’m not positive the weed caused what happened to my friend, though it’s possible as I know this does happen I just don’t know all the details with his situation. What I do know is that he became very different after that, and still is to this day. We’re still friends, but if I’m being honest, 75% of the time that I hang out with him nowadays, he makes me quite anxious/uneasy.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tytbalt",
                                                            "body": "Yeah, obviously alcohol has a lot of health risks, but we're not talking about one isolated psychotic episode unfortunately. It can be a chronic condition even without continuing to ingest THC. The risks are much lower if people wait until they are older to start using THC. Might have been what happened to your friend if it happened in high school. We don't fully understand all the mechanisms yet. Schizophrenia can certainly be life threatening, just in a different way.",
                                                            "score": 3
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Ohmannothankyou",
                                            "body": "Drinks swing on you, stoners nap on your couch.",
                                            "score": 8
                                        },
                                        {
                                            "depth": 4,
                                            "author": "neuromonkey",
                                            "body": "tl;dr- I feel it should be legal, though carefully administered, just as most medications are. It has helped me significantly. (sorry for wall of text) \n\nWow, really? I think I understand the sentiment, but my observations have been than the decriminalization of marijuana has had positive effects. In some states that have legalized it, use among teens has declined. Its legalization has led to more scientific research into it, and normalization of discourse around it. I do support its legal status, but that doesn't mean that I'd recommend it for everyone. Like anything intoxicating, it's use should be approached carefully and intelligently.\n\nI've seen that people seem to be having more adult conversations about the consequences of regular and occasional marijuana use. What I've seen is that the people I know who used it prior to legalization still do, and those who didn't use it prior to legalization still don't. I have several friends with kids in high school and college, and none of them use it with any regularity--most, not at all. \n\nI'm 57 now, and smoked occasionally in my 20s. In my late 20s, its effect on need changed markedly, and I stopped using it. I live in Maine, a state where it's legal, and its legal status hasn't affected consumption in  anyone I know. Thinking about it, a few of my friends have stopped completely.\n\nI've suffered from anxiety disorders since early childhood. Several years ago my gf encouraged me to try cannabis for it, and I said no way--it can make anxiety much worse. After a couple years of reading about its medicinal efficacy, I started experimenting with very low, controlled dosages--less than the amount necessary to feel high. I was incredibly surprised that it's been very effective at helping me with anxiety and depression. After being very skeptical about the reality of \"medical\" marijuana use, I've learned that it has been incredibly, amazingly helpful for me and a few others I know. I wouldn't eat or smoke a \"recreational\" dose any more than I'd take a handful of Tylenol.\n\nCarefully dosed THC edibles have helped me more than 35+ years of antidepressants & anxiety meds ever did, and with fewer unpleasant side effects. I have constant pain from spinal stenosis, gout, and arthritis. THC has been the only thing I've found that helps me sleep through the night.\n\nI do feel that it should be legal, and I also feel that it should be regulated and controlled rationally, just like the other five medications I take. It does lend itself to abuse in some people. I don't think it's a magical cure for anything, but it has made my life a lot easier and less unpleasant. Its efficacy in people with severe seizure disorders is just astounding.",
                                            "score": 13,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DriftMantis",
                                                    "body": "Your thoughts seem to reflect the vast majority of people who are dosing this stuff correctly for their body chemistry and using responsibly. \n\nJust be careful, its easy to get used to functional/medicinal use and it can become a crutch or a dependency. Its really hard to stop using especially if it helps your anxiety. \n\nI just cant use it regularly without becoming dependent so I really had to cut back. Higher doses for me are more like a mushroom trip than a fun experience usually. But I know a lot of people that can use very often every day and pick it up or put it down at will. I also know people who can consume lots all at once and are barely impaired. Its a very individual thing.",
                                                    "score": 12,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[deleted]",
                                                            "score": -1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "DriftMantis",
                                                                    "body": "Low doses are not miserable for me. Like a 5mg edible or  .1gr of buds vaped i can be very functional on, especially if im used to the effect.\n\nHowever, something like 30+ mg edible makes me trip out, but not in a good way. Massive uncomfortable body load, extreme anxiety, inability to move properly or speak, inability to understand what people are telling me. Hearing voices, strong synethesia. Inability to recognize familiar objects. Time dilation, tinnitus, massive confusion, etc. It's not fun or recreational. I'd rather do like an 8th of shrooms than do that to myself, like you said, although mushrooms are also intense for me as well. \n\nMaybe we are just like each other neurochemically.",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Icaruspherae",
                                                    "body": "Howdy neighbor, thanks for sharing your story. Out of curiosity, if you don’t mind sharing, what dosage would you say you typically take?",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "neuromonkey",
                                                            "body": "A simple, approximate answer would be 5-10mg, though providing an accurate answer is tricky. I grow my own plants, make a concentrated oil, and then make the edibles. (cookies, gummies, and the latest, toffee.) I don't use a lab to test concentration (it's just for my gf & me,)  so I test each batch for potency by eating a very small piece to begin with. It's laborious, but it's been fun to learn how to do.\n\nThe strain I've found that works best for me is called *[Aurora Indica](https://www.alibongocannabisseeds.co.uk/en/nirvana-aurora-indica-feminised-cannabis-seeds.html),* bred by Nirvana Seeds.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Icaruspherae",
                                                                    "body": "I appreciate the follow up, in a similar situation but kinda new to the whole thing so I was gauging roughly. Obviously a lot of variability at play but still good to have a ballpark",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Nylear",
                                            "body": "Except when they do both at the same time.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "uberjam",
                            "body": "In the late 90s I was in the parking lot at a Widespread Panic concert and the cops were confiscating beer but didn’t seem to notice or care about all the weed people were smoking. I got bold and asked one of them about it and he said verbatim: “it’s because a bunch of drunk people will flip a car over and burn it while the worst a lot of stoned people can do is eat all the waffles at Waffle House.” \n\nI can see the logic in that.\n\nEdit: spelling",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lordpuddingcup",
                                    "body": "Sounds about right",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Franchise1109",
                            "body": "Yeah. I’ve never seen an angry stoner. Plus stoners usually wanna game, snack and watch a movie. Easy life for me. \n\nPlus hangovers suck",
                            "score": 67,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Faljin",
                                    "body": "I always want to play video games when I’m high.",
                                    "score": 18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "walterpeck1",
                                            "body": "It's a time honored tradition. Someone should do a study on what activities people have the urge to do when high. We all probably know the common knowledge answers, sure, but I'm curious.",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "tytbalt",
                                                    "body": "Yup, I usually get high and play League (ARAM).",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "WaWaW_Seattle",
                                    "body": "Never? Just give that a quick re-read, friend.",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Franchise1109",
                                            "body": "Ahhh I meant angry stoner!!",
                                            "score": 7
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "neuromonkey",
                                    "body": "I have seen someone have a psychotic break after smoking a lot. It was pretty scary.",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "inaliftw",
                                    "body": "Through time I've met quite a few angry stoners. This is a myth.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "mnilailt",
                                    "body": "Really? I've seen plenty of agro paranoid stoners who think people are laughing at them or some other anxious reaction.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "enwongeegeefor",
                            "body": "> I’d also rather meet 10 guys that’s smoked weed today\n\nYou do...probably everyday...and it's more than 10.\n\nYou just don't realize it because, dun dun dun, marijuana doesn't affect everyone the same...also tollerance.  If you're looking for the stereotype stoner, they're practically a minority today amongst cannabis users.\n\nAlthough the boomers that reek of roach wandering the grocery aisle do tend to stand out.",
                            "score": 19
                        },
                        {
                            "depth": 2,
                            "author": "Kind_Of_A_Dick",
                            "body": "Friend was telling me a story about having to deal with a belligerent drunk man at his store.  He works at a home furnishings store.  Why are you drunk there?",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "Attjack",
                            "body": "The vast majority of people I meet who have been drinking are friendly and happy. A drunk belligerent asshole is very likely an asshole while sober too.",
                            "score": 43,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lordpuddingcup",
                                    "body": "I don’t doubt that but guess who the ones are getting blasted drunk that we have to deal with, had he smoked instead assholeor not he’d probably be sleeping instead",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "labowsky",
                                            "body": "You can't take out assholes, weed isn't a miracle drug.\n\nI've met plenty of stoners that I simply do not want to be around cause they were assholes, not to the point of drunk people all said...only a couple of them. \n\nHim being in bed doesn't stop them from being an asshole, it just prevented you from interacting at that point.",
                                            "score": 19,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mnilailt",
                                                    "body": "Both drunks and stoners can be insufferable in their own ways.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ThrowbackPie",
                                    "body": "The mechanism of alcohol literally makes people angrier.",
                                    "score": -1
                                },
                                {
                                    "depth": 3,
                                    "author": "Shreedac",
                                    "body": "Still annoying though unless your drunk as well",
                                    "score": -1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "GeraldoDelRivio",
                            "body": "I mean yeah, your comparing an average to an extreme. I'd also prefer to hang with 10 tipsy guys than one guy with weed induced psychosis. Neither extreme is fun to be around whether its alcohol or weed.",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "clullanc",
                                    "body": "What about alcohol induced psychosis. Both exist but none are that common. \n\nLast I checked about 1-2 per 100.000 is expected to experience a suspected drug induced psychosis. That’s not that much considering how common the association between the two are.\n\nI’m pretty sure alcohol induced paranoia would be pretty common too if it was illegal. Being under suspicion when your under the influence of any drug would probably have that effect.\nIt’s certainly more common to be a danger to other people when drunk. People are just used to that. So they don’t fear it.",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "labowsky",
                                            "body": "As someone that never had to really hide it cause it didn't fully matter if you got caught where I'm at, this doesn't personally ring true and I would guess it wouldn't for others. \n\nI'm willing to bet it's much more common at baseline to have anxiety or paranoia from a mild hallucinogen than a depressant.\n\nI've never had anxiety or paranoia from drinking even in places where I could get kicked out for sneaking alcohol in but you better believe I've had anxiety attacks just chillin smoking weed.\n\nI think they mispoke when using psychosis when they meant someone with getting a panic attack but I could be wrong.",
                                            "score": 6
                                        },
                                        {
                                            "depth": 4,
                                            "author": "SnooPandas2964",
                                            "body": "Right, which is why I believe he said \"Neither extreme is fun to be around whether its alcohol or weed\"",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "awpti",
                                    "body": "Psychosis doesn't mean the person is going to harm you. Psychosis refers to a collection of symptoms that affect the mind, where there has been some loss of contact with reality. \n\nPeople suffering with psychosis are more likely to be the victims of violent crime than the perpetrator.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Sorryunowin",
                            "body": "Ask and you shall receive",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Fluxtration",
                            "body": "Well hello there",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Ruthrfurd-the-stoned",
                            "body": "I mean yeah it’s a belligerent asshole. What about the drunk that just wants to be held and cry?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DonutsMcKenzie",
                                    "body": "Also not that fun to be around, frankly...",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "fiddledik",
                            "body": "I would rather pass 100 stoned people on my drive somewhere than one drunk",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JBob250",
                    "body": "> Vapes, dabs, edibles, tinctures, Δ-8-tetrahydrocannabinol\n\n\nOne of these things sounds less fun than the others",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kiriyaaoi",
                            "body": "No lie, delta 8 is better than d9 for a lot of people, it's a more chill high with less anxiety.  Cough, not that I would know or anything.",
                            "score": 34,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SoYouveHeard",
                                    "body": "As someone who is prone to get mentally uncomfortably high, delta 8 is a awesome, and I enjoy its physical properties.",
                                    "score": 15
                                },
                                {
                                    "depth": 3,
                                    "author": "happytreetimez",
                                    "body": "Also legal in all states as hemp product.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Vallywog",
                                            "body": "For right now, alot of state AG's are going after it currently.",
                                            "score": 1
                                        },
                                        {
                                            "depth": 4,
                                            "author": "DohnJoggett",
                                            "body": "Uhhh no it's not. A bunch of states have banned it entirely.",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "LucasRuby",
                                    "body": "The same is said to HHC, plenty of people say it is better than THC.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "magistrate101",
                                    "body": "Unfortunately, store-bought edible doses are unreliable and vaping it is hella harsh for some reason. If you buy the concentrate in bulk and make your own edibles it can be pretty worth it.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "gitPittted",
                            "body": "Thc-a is where it's at.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "inaliftw",
                                    "body": "thcp, as a long time d9 user this cuts through my tolerance for some reason.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DeceiverX",
                    "body": "It's definitely up.\n\nNYC didn't used to smell like pot--it smelled like urine in a lot of places.  Doesn't matter where you are now; the only thing you can really smell now is pot.",
                    "score": 58,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oofnig",
                            "body": "NYC has absolutely smelled like pot for at least the past 20 years.",
                            "score": 95,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "youaintgotnomoney_12",
                                    "body": "Weed was always a fairly common smell but it’s definitely increased since legalization and you smell it places where u didn’t before. Hell, I was going through security at JFK and it absolutely reeked of bud.",
                                    "score": 19,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Indigo_Sunset",
                                            "body": "Next time through, look for the weed disposal bin somewhere nearby. It's quite likely that's what you were smelling.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "mob321",
                                                    "body": "Only cowards throw their weed away before security",
                                                    "score": 6
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Sipikay",
                                            "body": "Of course you smell it places you dont smell it before. That doesn't mean smoking is up, inherently. I used to only smoke in my house and car, now I smoke outdoors in places I didn't before. I don't smoke more, I am not a \"new\" smoker. But you'd notice it somewhere you didn't before, an effect of legalization for sure.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Eryomama",
                                    "body": "That’s what iv heard, and that’s why it being illegal was so bad any cop could just say they smelled weed as probable cause since every area has someone smoking weed.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Super-Contribution-1",
                                            "body": "Yes, that was Nixon and Kissinger’s idea originally. Criminalize many common things surrounding the poor and other undesirables, and you’ll always have the pretext to do whatever it is you need to do to them.",
                                            "score": 5
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "DeceiverX",
                                    "body": "I live just over the border in CT and have visited fairly often for my entire my life.  Recently went back for a show first time post-pandemic.  It absolutely did not smell like it does now.  There were tinged before, but it's absolutely dominating today.",
                                    "score": 22,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "thegeorgianwelshman",
                                            "body": "Agreed. I lived in the Village in the 90s. You’d smell it there, esp in the park, but on an average NYC street?\n\nNah. \n\nNot in the 90s. \n\n\nOr v early 2000s I guess.",
                                            "score": 6,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "N3uromanc3r_gibson",
                                                    "body": "I had weed delivery in nyc in 09. I saw ppl selling oz on the street in Manhattan (not openly, just I saw it being exchanged). . It was certainly around....",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "oofnig",
                                            "body": "Its has definitely increased but I have been smelling it daily in midtown for decades. It isn't as bad as Las Vegas is now but it's getting there.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "maqsarian",
                                    "body": "I wonder if you were to go back to 1955 how much it would smell like tobacco smoke. Probably a lot more than in the last 30 years",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "oced2001",
                            "body": "My wife and mother in-law took a weekend trip to NYC over Christmas break.  \n\nThey said it was very \"skunky\"",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DeceiverX",
                                    "body": "Was in London shortly before.  You got the occasional waft around Camden but that was about it.\n\nNYC was suffocating, and it lingered in my nostrils for a good two days after I got back.\n\nWe as a society should do better.",
                                    "score": -18,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Neuchacho",
                                            "body": "Weed is a marked improvement over what NYC typically smells like. Unless hot trash and piss just hits for you, I guess.",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Repulsive-Neat6776",
                            "body": "What? You mean people are smoking openly now that it's legal?!!! Holy suits!  \n\nSo you're telling me the vast majority of pot smokers in a legal state no longer smoke inside, away from the police? \n\nWow. Wow. Never would have guessed.",
                            "score": 14
                        },
                        {
                            "depth": 2,
                            "author": "odaeyss",
                            "body": "Of all the things a city might smell like, pot is a pretty good choice. Only a handful of things I'd say would be nicer and half of those are nature-type things that are seasonal.. the rest are food.",
                            "score": 39,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nylear",
                                    "body": "But it smells like skunk to me",
                                    "score": 4
                                },
                                {
                                    "depth": 3,
                                    "author": "oofnig",
                                    "body": "I agree except I was in Las Vegas recently and the smell was so strong and unavoidable everywhere I feel like it's going to get shut down eventually and I would not want that.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "erossthescienceboss",
                                            "body": "The thing with Las Vegas is the lack of second-hand smoke regulation.\n\nPortland doesn’t reek of pot like Vegas does. PORTLAND. A city where I rarely buy weed cos so many people just have extra from their own grows to give away for free.",
                                            "score": 33,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "RenagadeLotus",
                                                    "body": "Portland also has a metric fuckton of trees, rivers, wind that keep the air pretty nice. As far as city air goes Portland is pretty nice",
                                                    "score": 21
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "DrugChemistry",
                                            "body": "I only smelled weed one time when I went to Vegas earlier this year — aside from when I went into a weed shop. Made me nervous about public consumption so I stuck to edibles. ",
                                            "score": 3
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "N1ghtshade3",
                                    "body": "Maybe if you're a weed smoker. To me, it stinks like skunk to the point I almost wish they made it illegal again so I could walk more than two feet without having to smell it.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DonutsMcKenzie",
                                            "body": "Other nice things that don't always smell great: beer, cheese, dogs. \n\n\nYou'll get used to the smell. Hell, you might even grow to like it. Sure, It's a bit skunky funky depending on the terpenes, but as someone who has walked around Tokyo (a very clean city by all accounts) in the summer I can tell you that I wish I had been sniffing weed instead of hot sewage and garbage.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "flibbidygibbit",
                            "body": "I was in Vegas shortly after they legalized pot.\n\nEvery public walkway stunk like pot.",
                            "score": 7
                        },
                        {
                            "depth": 2,
                            "author": "varelse96",
                            "body": "That sounds like quite the improvement. I’ve walked the streets of both NYC and New Orleans in the summer. If I never have to smell that mix of urine and garbage juice baking in the summer sun again it will be too soon.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "LucasRuby",
                            "body": "Honestly an improvement.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "teeksquad",
                    "body": "I doubt there are many daily drinkers out there using it to manage symptoms.  Without marijuana, I honestly probably wouldn’t be alive, there are times where a bong hit is the only thing that keeps me functioning when my Ulcerative Colitis is flaring",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Independent-Box7915",
                    "body": "When I was a kid like 9 or 10 I once joked to the doctor that my mom smoked weed and my mom got mad and said she absolutely did not. I didn't know at the time but she did.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "warwick607",
                    "body": "Jonathan Caulkins' work on drug policy in general is great, he's been publishing it for decades. \n\nhttps://scholar.google.com/citations?user=Kwz6L2wAAAAJ&hl=en",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "caverunner17",
            "body": ">“A good 40% of current cannabis users are using it daily or near daily, a pattern that is more associated with tobacco use than typical alcohol use,” Caulkins said.\n\nI mean this makes sense. For the vast majority of people, Alcohol is a probably social thing - you might grab a beer when out to dinner, go to a brewery or at weekend BBQ. I'd gander most people aren't drinking every day",
            "score": 308,
            "replies": [
                {
                    "depth": 1,
                    "author": "TurtleMOOO",
                    "body": "Depends where you live. In the Midwest, daily drinking is much more common. Just check out Wisconsin’s stats.",
                    "score": 188,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AnotherPersonsReddit",
                            "body": "Yep. My Dad never drank (gave it up after he started a family) but most men I knew growing up came home from work and cracked a beer (from the fridge in the garage) before coming in and saying Hi to everyone.",
                            "score": 57
                        },
                        {
                            "depth": 2,
                            "author": "T-Rextion",
                            "body": "Checking in from Wisconsin.  Drinking is the culture, and people are regularly shocked at how much we drink.",
                            "score": 37
                        },
                        {
                            "depth": 2,
                            "author": "molesMOLESEVERYWHERE",
                            "body": "Just a bottle of wine during dinner, and maybe one after.\n\n Is it wine o' clock aleady?\n\n  Hurry up we are gonna be late for our family day trip to a brewery, winery, and then Budweiser sponsored event where every performer elicits cheers for being drunk and drinking on stage.",
                            "score": 13
                        },
                        {
                            "depth": 2,
                            "author": "fonetik",
                            "body": "Of the 50 drunkest counties in the entire US, all but 9 are in Wisconsin.",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "nixcamic",
                            "body": "Same with Western Canada. I'm out here visiting family and lots of people will have a fridge just stocked with beer. Not drinking used to be really stigmatized. It's acceptable to say you don't drink now but still a huge drinking culture.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "rumata_xyz",
                    "body": "> I'd gander most people aren't drinking every day\n\nA \"glass of wine with dinner\" drinking style is pretty common in lots of (southern) Europe I'd say.",
                    "score": 29
                },
                {
                    "depth": 1,
                    "author": "DohnJoggett",
                    "body": ">go to a brewery \n\nFun thing, in Minnesota the breweries are making THC drinks and you can buy them at bars, taprooms, liquor stores or anywhere that has a food license like a grocery store. Maximum is 10mg of THC per can but that's really not an issue unless you're already a heavy pot smoker. There are people that have given up drinking alcohol socially now that they can grab THC drinks when out at a taproom with friends. Some of them are seriously tasty!\n\nIf you haven't tried a modern seltzer, give'm a shot. They don't taste like oily weed like the old drinks did.",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "molesMOLESEVERYWHERE",
                            "body": "Yup, that was weird being in the South ordering legal THC beers at a BBQ joint.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "brrrrrrista",
                            "body": "It’s also not uncommon to see THC drinks and edibles in coffee shops which I feel is unique to MN",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "clullanc",
                    "body": "I don’t think that light drinking every day is that uncommon though.\nPeople like to unwind at the end of the day.\n\nI live in Sweden, so I’m not sure how we compare to the rest of the world. But when asked, apparently about half of the people shared that they think it’s ok to drink alcohol every day. Which tells me, at least half of the people in my country drinks every day. It’s just some poll, but I really don’t think it’s that uncommon.",
                    "score": 72,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MightyKrakyn",
                            "body": "> when asked, apparently about half of the people shared that they think it’s ok to drink alcohol every day. Which tells me, at least half of the people in my country drinks every day.\n\nThis is bad logic. You can think something is okay to do without actually doing it. I think it’s okay to have a beer everyday and I don’t drink.",
                            "score": 31,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ancientastronaut2",
                                    "body": "Yeah, I think the current rule of thumb doctors use is 7 per week is ok.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "yogopig",
                                            "body": "Even that seems a bit steep\n\nBut then of course really no amount of alcohol is okay so its sort of drawing a line of acceptable risk, which I’d still the risk people would accept is much lower than whats delivered by 7 drinks a week.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "corasyx",
                                                    "body": "depends how it’s broken down too. a beer each day is barely noticed by your body (especially if you do it a lot) compared to having those 7 beers one day a week",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "yogopig",
                                                            "body": "It depends on what you mean. A beer each day is still going to significantly increase your risk of developing cancer as you are still intaking the same amount of carcinogen, and it will still put the same tax on your liver.\n\nOf course 7 in one day is going to be worse, like 7 in a day will have a much more dramatic effect on your blood pressure, and I’d bet will probably result in more overall inflammation. But there are still risks that are the same or only slightly less bad whether you binge or spread out the same amount of alcohol.",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ancientastronaut2",
                    "body": "Sadly, I know so so many people who do. Bottles of wine nightly or whiskey cocktails. Just turn on tne tv and they make it seem normal as well. Yet you have to be watching a mature rated streaming show to see people smoking weed casually like that.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "onetwoskeedoo",
                    "body": "Yes they are, beer or wine after work is the norm in the Midwest",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "verminal-tenacity",
                    "body": "also, THC can be quite uncomfortable when you don't have a tolerance. \n\nfor me i have to smoke regularly or not smoke at all. i'm not here to have my reality torn apart every second weekend after a random puff on a joint - especially given I'm trying to treat my mental health issues with it - so i much prefer having a tolerance and a moderately responsible but hefty level of \"chronic\" cannabinoid saturation that provides a mild stone 24/7.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "icouldusemorecoffee",
                    "body": "It's anecdotal but I know far more drinkers amongst my (older GenX) and my kid's groups than I do smokers (and we're all in Oregon so it's been legal here for a long time).  Most of us do smoke but it's very much socially where as a drink or 2 in the evening is fairly standard.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "soulcaptain",
                    "body": "I like to drink, but my wife doesn't drink, so most days at home I don't even bother. When I go out, though, especially with others who drink, I like to hunker down and put in some quality drinking. Social is right.\n\nUnfortunately where I live, weed is out of the question. But if I could, I would probably partake more or less daily. (But part of me is glad I can't, because I had some mental addiction/dependency issues with weed and it's probably for the best that I *not* get high all the time.)",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "InclinationCompass",
                    "body": "It's pretty common for Americans to have a beer or a glass of wine after work. Maybe not everyday but close to it.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "thesixler",
            "body": "I don’t think weed is like bad and I smoke a lot but I do think the effect of weed on the population is probably something and i think it’s worse than a lot of stoners want to admit, but obviously not as bad as alcohol. Stuff like this makes me even more curious about how weed use might affect the populace in various ways",
            "score": 244,
            "replies": [
                {
                    "depth": 1,
                    "author": "OperationMobocracy",
                    "body": "I wish there was some way to answer this without getting lost in a maze of biases.",
                    "score": 130,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ThatOneAlreadyExists",
                            "body": "We just rescheduled it federally, so it'll be much easier to research.",
                            "score": 73,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Pahsghetti",
                                    "body": "To add to this...it will not only be easier to research in general, but also allow for a larger variety of research interests. Being Schedule I, no one who wasn't already researching controlled substances from an abuse perspective were going to jump through the hoops to get a Schedule I license. Now that it moves to III, labs studying heart disease, liver function etc etc will be more likely to start looking at the long term consequences.",
                                    "score": 42
                                },
                                {
                                    "depth": 3,
                                    "author": "Stingray88",
                                    "body": "It hasn’t been rescheduled yet, it’s only been proposed to be rescheduled. It most likely won’t be rescheduled until next year… and only if Biden wins the election.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "InclinationCompass",
                            "body": "Just peer-reviewed studies, which is what /r/science is based off of anyway. But without it being rescheduled, it's been very difficult. We could've had decades of studies by now.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "slothtolotopus",
                            "body": "The answer is moderation",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "BriscoCounty-Sr",
                            "body": "If only there was a place where weed had been legal for decades and decades we could look at. Like some Land of Nethers",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OperationMobocracy",
                                    "body": "It’s a limited comparison because it’s not really legal in the Netherlands and has a fair amount of negative externalities, like drug tourism.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BriscoCounty-Sr",
                                            "body": "Does that mean we gotta throw out all the data from say Colorado on account of all the Texans that come here for their weed?",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "kabooken",
                                            "body": "it's interesting to declare drug tourism as a \"negative externality\" when tourism and the associated tax revenues are typically seen as positive effects",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "OperationMobocracy",
                                                    "body": "It’s how a lot of the Dutch view it.  And since cannabis isn’t officially legal, its sale is not exactly a huge revenue source.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "gringledoom",
                    "body": "One hard-to-quantify danger is that it makes boredom feel ok. Which is kind of the point, and perfectly fine in small doses, but can be a big impediment for people to do things that would actually enhance their life in the long run.",
                    "score": 75,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Doogoon",
                            "body": "On the other hand, it makes learning significantly more fun. It really depends on who is using it.",
                            "score": 41,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fauken",
                                    "body": "You probably won’t be learning as quickly or retaining information as well though. Cannabis’ effect on REM sleep probably isn’t helping that either. \n\nWhen you’re high all the time it’s hard to know if there are actually any benefits. People should definitely take breaks more often to see how they feel without using daily (and they should realistically wait until mid-20s before smoking).",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Doogoon",
                                            "body": "Well if wasn't for cannabis I wouldn't have ever even developed an interest in natural histories and sciences, or human biology and psychologies. A lot of subjects that I didn't care to understand in highschool became unbelievably captivating under the cannabis influence.",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Fauken",
                                                    "body": "I would ask though, when you're not under the influence, do you still become disinterested in those subjects? Or do you think you just needed a push to see things from a different perspective to spark an interest in new topics? \n\nPersonally, I have zero problem with recreational use! I think it can be great to change up your thinking or make stuff more enjoyable on occasion. I'd just warn people to be careful because it is really easy to get addicted (especially now with ease of access and convenience devices like vape pens) and have that cause a lot negative effects that are really difficult to notice from a first person perspective.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Doogoon",
                                                            "body": "To your first question: No, I'm quite interested in those subjects while sober now. My biggest obstacle is the wide range of misconceptions I developed growing up, either from poorly taught lessons or from the wacky stuff my dad made up about the world. It's frustratingly difficult trying to learn about something when all the information you're learning is seemingly at odds with the version of the facts you know, and for me it was becoming more and more difficult to accept the new information. \n\nOnce I started learning while under the influence, I became much more interested in learning the subject matter in proper sequence and it was like all the new information became so obvious, which allowed me to let my misconceptions dissolve and fade. So not only was I learning but I was simultaneously having intense sessions of self reflection about why I was so attached to these ideas and facts that were so obviously incorrect. I'm not sure exactly what this experience can be categorized as, but the influence cannabis had on me truly allowed me to open up my mind and see the information as the truth about the world, rather than just information that I'm supposed to know. \n\nNowadays, that re-wiring of my mind stays with me even if I haven't consumed any cannabis in weeks, but I wouldn't have ever gotten myself here without a couple years of frequent indulgence. Learning is only a small aspect of its influence on me. Learning, love, life, self, humanity and its physical and societal evolution, empathy, stewardship, the embracing of everyone and everything around me regardless of the perception of fault- these are subjects that consume my mind when I am under the influence and it's a journey that's an absolute joy.",
                                                            "score": 3
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "meme_pizza",
                                                            "body": "It seems a bit reductive to discuss this as a binary high/not-high thing. There’s a pretty wide range of intoxication, and doesn’t even touch on whether someone’s sober mind is worthy of something like low-dose self medication. It assumes sober is some unproblematic, ideal baseline.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Fauken",
                                                                    "body": "I totally understand what you are saying, but it’s a pretty big assumption that as an individual you are able to self medicate properly. Even if someone could figure out what their “ideal dose” should be, it doesn’t mean that they would be able to follow that properly without supervision from a doctor. I’m excited about the research that has been opened up because of the rescheduling of cannabis so we can figure more stuff out about it and what it might look like as a treatment option for more ailments. \n\nAgain, I am mostly concerned with people accidentally falling into an addiction—not everyone will have that problem though!",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "FuccboiWasTaken",
                                    "body": "Hard facts. Useless people will stay useless. Useful people will use it to be more useful.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "krumble",
                                            "body": "This is a pretty harsh wording for your take.  I started smoking a lot more during the pandemic precisely to deal with the boredom, but as time dragged on I noticed that quickly reaching for it when I felt bored was keeping me from sitting with that boredom long enough to become motivated to do the things I liked to do. \n\nFor me being high prevents me from getting stuff done.  It's fun, but it trashes my productivity.  Since I've taken a break, a lot more gets done in my life.  That's how _my_ body and mind respond to it.",
                                            "score": 37
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TunaSpank",
                                            "body": "I think this is an oversimplification.",
                                            "score": 6
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Jolly_Yellow5354",
                            "body": "Thanks Randy",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "thesixler",
                            "body": "That’s the part I wish they taught me in school, although it’s nuanced so who knows if I would have got it. Especially these days, margins are too thin to survive if you’re wasting too much time doing nothing, it catches up to you",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Shreedac",
                            "body": "It’s different for everyone. I was lazy and unmotivated my whole life when I didn’t use weed. Now I do it daily and it lifts the fog and makes things that would normally suck fun. I’m more productive and successful then I ever was before. PTSD at a young age set me up to fail and when no other medications or therapy worked at all cannabis has helped me manage.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "MikeTheAmalgamator",
                            "body": "This is one of the best ways I've ever heard this particular downside described.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TunaSpank",
                    "body": "I agree, the problem isn’t the drug just the abundance of it.\n\nAny other time in human history where you would never would run out of weed? It’d be very rare.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "GeebusNZ",
                    "body": "What do you think knowing the effects of something in a population would lead to? Because I think knowing the results beforehand on the scale of something like a population should be treated really carefully. Like, emergency only. Otherwise, change wouldn't be allowed to happen, for fear of straying again into the unknown.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "thesixler",
                            "body": "Yeah I mean it’s a delicate balance, right? It also seems like so many of the world’s problems are created by people’s ability to make something harmful and spread it before regulators have time to react. It’s really tough. We’ve had cellphones and the internet for so long before realizing they can really do a lot of damage to your back, neck, wrists, and society",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FunAd6875",
                    "body": "That first sentence makes me want to go and smoke weed.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BroJobs88",
                    "body": "I think weed makes you totally ok with not progressing in your life at all. I am saying this as an ex stoner who smoked daily and has quit multiple times. Idk what your thoughts on that are",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "InclinationCompass",
                            "body": "Some people reach all types of milestones high though. I got through college and my career so far being high almost everyday. Not all of us just want to sit down and watch TV all the time.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "thesixler",
                                    "body": "Yeah and not everyone who smokes cigarettes gets cancer",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "InclinationCompass",
                                            "body": "And not everyone with lung cancer have smoked. My mom is one of those unfortunate ones.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Untowardopinions",
                    "body": "It causes bad anxiety in daily users, who then “self medicate” with the same substance that’s causing half their issue.  Worse in susceptible people.  Causes very recognisable patterns of thought that trend paranoid and fixated.  Lots of health anxiety, which is why I see them so much.\n\nOh and serious chronic nausea and vomiting in daily users: sometimes so bad they need to be admitted to hospital for a few days during bad episodes.  They won’t believe it’s the weed and they don’t stop smoking, by and large.",
                    "score": -20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SwampYankeeDan",
                            "body": "Cannabis helps my anxiety and calms my stomach. I have IBS-C. It doesn't cause me any nausea and I've never vomited from it. Ive used it daily for 3 years now.",
                            "score": 12,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Untowardopinions",
                                    "body": "Give it time.",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SwampYankeeDan",
                                            "body": "I smoked every day from 17 to almost 30.  I then quit for 10 years.\n\nMy doctor recommended it for anxiety and GI problems.\n\nJust because something gave you problems doesn't mean its anything more than an extremely rare problem.   Now if you smoke everyday you can get some withdrawal (or discontinuation syndrome if you use medically) which for some people can include anxiety and nausea but that's a totally different thing.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "axonxorz",
                            "body": "> It causes bad anxiety in daily users\n\n_Some_ daily users.\n\n> Oh and serious chronic nausea and vomiting in daily users:\n\n_Very few_ daily users. \n\nLet's not repeat the hyperbole of DARE by using absolutes.",
                            "score": 21,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Untowardopinions",
                                    "body": "Let’s not ignore the truth because some people we’ve agreed not to like or listen to, used to overstate it.\n\nOk- I work in front door medicine.  I see the worst of everything. But within that context I see a lot of what’s causing trouble out there, and cannabis is taking its place in my list of daily headaches.  I still see more alcoholics than potheads on a daily basis but that IS changing, and weed isn’t even legal here.",
                                    "score": -3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "axonxorz",
                                            "body": "> Let’s not ignore the truth because some people we’ve agreed not to like or listen to, used to overstate it.\n\nYes, we all hate dare because we've been socially conditioned to.\n\nWho said anything about ignoring it?",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Untowardopinions",
                                                    "body": "I mean, yes, you have.",
                                                    "score": 0
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "SwampYankeeDan",
                                            "body": "Gaming also causes problems for a lot of people but most don't go to the doctor because its not a drug, even though they have all the symptoms of an addiction.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Untowardopinions",
                                                    "body": "Engaging in an unhealthy behaviour and ingesting a harmful substance are quite different.  Gaming itself is not harmful, it’s what you’re not doing because of gaming that gets you.  Weed itself does harm.",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "SwampYankeeDan",
                                                            "body": "I have a prescription for my cannabis. Its a medicine I get from an actual pharmacist.\n\nSo don't call it unhealthy unless you want to cause the side effects of heart medicine unhealthy or the side effects of Benadryl unhealthy.\n\nIs weed 100% harmless? No but neither are most things.  Lock yourself in a secure room otherwise dont engage in anything because everything involves risk.\n\nBesides, Gaming addiction is a real thing and when it reaches the level of addiction it causes problems in peoples lives.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Untowardopinions",
                                                                    "body": "So was thalidomide.  \n\nCannabis prescriptions are equivalent to a doctor prescribing you vodka.  It exists because of the laws against cannabis consumption; there had to be a way for middle class users to get what they wanted to avoid prison.\n\nHopefully the medical system will stop validating its use now.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "InclinationCompass",
                            "body": "Take it from me - I'm a daily user for nearly 20 years with GAD. A small amount of weed helps my GAD but when I get too high in uncomfortable environments, it can become exacerbated.\n\nI can still smoke a joint at a crowded concert and still be okay though. \n\n\n>Oh and serious chronic nausea and vomiting in daily users: sometimes so bad they need to be admitted to hospital for a few days during bad episodes.\n\nI actually had this once and went to the ER almost exactly one year ago. The doctor said it was from too much weed (apparently it *can* happen, CHS is a real thing). But it happened only after I mixed alcohol with prozac. It's only happened twice to me in my life and each time it was because I was drinking while on anti-depressants.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SwampYankeeDan",
                                    "body": "So you have had no problems with weed. Your only problem was mixing alcohol with antidepressants.  Doctors will always blame an unprescribed substance first of you have used one. It doesn't matter how unlikely it is, they always go there first.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "InclinationCompass",
                                            "body": "Yea, I understand why the doctor said what he said. Cannabis is still looked down upon due to lack of studies.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Untowardopinions",
                                    "body": "You don’t know who you’d be without Weed.  How are you so sure your anxiety would be a permanent feature of your life, if you hadn’t taken an anxiety inducing substance for so long?\n\nAlcohol gives alcoholics temporary relief from the DTs, but it is still fundamentally the root of the problem.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "InclinationCompass",
                                            "body": "I didnt smoke for a year while I was on probation. It sucked.\n\n\nI've had GAD and OCD since I was like 5. I didn't smoke weed till I was in high school.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Untowardopinions",
                                                    "body": "Did it sick because you were more anxious?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "InclinationCompass",
                                                            "body": "I don’t understand your question",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Untowardopinions",
                                                                    "body": "Did it suck to give up cannabis because you were more anxious or did you just miss cannabis?",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dethb0y",
            "body": "Well thank goodness for that, considering the toll alcohol takes on the body, the family and on society.",
            "score": 346,
            "replies": [
                {
                    "depth": 1,
                    "author": "Bottle_Plastic",
                    "body": "I've had more than one doctor tell me that it's better to stick to weed and leave alcohol alone if a person wants any quality of life in their elder years",
                    "score": 183,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SimianSlacker",
                            "body": "I got the same message from my Cardiologist and Pulmonologist, their only request was that I switch to edibles (which I have). I started making my own MCT oil based tinctures, I can take an OZ of mid-shelf weed and turn it into 32 oz of oil which will probably last me about a year; I do the same with CBD hemp flower.",
                            "score": 70,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "vanillaseltzer",
                                    "body": "How difficult is this to do? The dispensaries in my state are so expensive and my disabled ass relies on weed for a few of my health issues.",
                                    "score": 25,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jjdubbs",
                                            "body": "It's shockingly easy.  Google will provide you with dozens of step by step how-to's.  Pro tip:  use coconut or MCT oil instead of butter and add few drops of sunflower lecithen for maximum bioavailability.  Also, using concentrates rather than flower makes it even easier.",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "death_by_napkin",
                                                    "body": "You know what you're talking about. Also a bit of tumeric helps bioavailability.\n\nAlso for everyone else trying to make their own **make sure you decarb or the whole thing is a waste**",
                                                    "score": 10,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Dogsnamewasfrank",
                                                            "body": ">make sure you decarb or the whole thing is a waste\n\nInstant Pot is a great way to do this, esp if you have neighbors, it keeps the smell to a minimum.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "totemo",
                                            "body": "You probably would do well to spend some money on a machine to infuse cannabis into oil or butter. They're really convenient and take most of the hassle out of the job.\n\nThere are a few devices on the market. I have one that decarboxylates the cannabis in a separate heating cycle that you run before infusion. Decarboxylation activates the dominant form of THC in the flower, breaking down THCA (tetrahydrocannabinolic acid) into THC that your body can absorb.\n\nThe machine itself will be a bit pricy, probably, but you will end up much healthier than if you smoked, and even a bit healthier than if you used a dry-herb vape. And you will recoup the cost slowly by using less flower. If you have a dry-herb vape, you can save up the already-vaped-bud (AVB) and make oil with that - it will have about 1/4 to 1/3 of the THC of the original flower.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Present-Still",
                                    "body": "How do you take 28 grams of flower and turn it into 32 grams of oil? You’re adding 4 grams of weight, usually flower extracts down into much less oil, not more\n\nEdit: meant to say extracts, not presses. Confused MCT oil with concentrate oil my bad",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DohnJoggett",
                                            "body": "Well, first off, that's not what they said. They're extracting the flower using a quart of MCT oil, not pressing flower. MCT is a highly refined coconut oil. OP is making \"pot butter\" with a fat that's liquid at room temp instead of butter.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Present-Still",
                                                    "body": "I meant to say extracting instead of press, the idea is still the same\n\nThe reason there was confusion is that concentrates are called “oil” so saying you turned weed into oil is 99% of the time referring to extracts. I’m just dumb and assumed MCT was another generic acronym for something altered slightly for legality purposes",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "LucasRuby",
                                            "body": "They mean MCT oil which is oil infused with THC, not concentrates like BHO which are high purity (60%+) THC.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "brandimariee6",
                            "body": "I love thinking of my great uncle, in his 70s, smoking weed for the last 40+ years and still actively healthy",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "Untowardopinions",
                            "body": "We have no data on that at all at the population level.  Particularly with the strengths of strains being smoked today.  Totally different ballgame, the risks are unknown at the moment.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Bottle_Plastic",
                                    "body": "I accept that. I choose the unknown over the known dangers of alcohol. Wet brain scares the hell out of me.",
                                    "score": 13,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TheBetaBridgeBandit",
                                            "body": "Well you're in luck, because wet brain is something that only happens to extremely heavy drinkers/alcoholics after years of dependence-level drinking and the malnutrition it causes.\n\nAs a cannabis researcher (who enjoys cannabis) I find this hyperbolic attitude surrounding alcohol's insidious harms and cannabis's absolute safety to be absurd. But I guess it's reddit and nuance has never been allowed here.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Untowardopinions",
                                            "body": "From what I’m seeing, the cannabinoid brain is labyrinthine and tightly wound and prone to paranoia for months and years after the person has quit daily usage.\n\n\nAnd then there’s the nausea.",
                                            "score": -4
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OneX32",
                    "body": "Weed saved my life. Was drinking half a liter of vodka every day. Tried to commit suicide twice while on all-day benders. I know had I not harm reduced via weed near the end, at some point I would have succeeded with a bottle in my hand. \n\nBeing able to put some space where my prefrontal cortex could operate allowed me to do the mental health and self-work I needed to get better. Weed may not be for everyone but it certainly put me back on a path where I could live a life I was not ashamed of.",
                    "score": 94,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "itsonlywhatsknown",
                            "body": "Wow, I’m not the only one. From one survivor to another, kudos.",
                            "score": 45,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OneX32",
                                    "body": "We're all in this together, so let's share this joint.",
                                    "score": 34
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheBobTodd",
                            "body": "\"Marijuana isn't a gateway drug. For some, it's an exit strategy.\" - some TED Talk I saw many many years ago and wish I could remember her name.",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CrazyHardFit",
                    "body": "Is marijuana better? I've seen a lot of this lately, giving up alcohol but smoking a few times a day.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "SSTX9",
                    "body": "Fun fact you can use GHB (sodium oxybste) for alcohol withdrawal syndrome.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "millennial_sentinel",
            "body": "I sometimes feel like the only person just white knuckling life. Everyone else is drunk or high all the time.",
            "score": 126,
            "replies": [
                {
                    "depth": 1,
                    "author": "HeftyAlienForce",
                    "body": "I've yet to meet anyone who didn't need some sort of crutch. It's not always chemical, reddit is a big one for a lot of people.",
                    "score": 53,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Flagyllate",
                            "body": "Some crutches are bigger than others",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CrazyHardFit",
                                    "body": "Just genetics i guess",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "thatbromatt",
                            "body": "Social media = dopamine driver, believe it or not, it’s all chemical",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "litlelotte",
                            "body": "I was the same way about weed until I met people who smoked it and realized it's not evil like I was always told. I don't know if you had DARE in your schools but they did a number on me, convincing me I would become stupid and lazy and useless if I ever smoked it even once. I'm not going to say weed didn't make me just a little stupider but I have gladly accepted being extra forgetful because it means I can sit in my own backyard without anxiety and sleep without nightmares",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GeraldoDelRivio",
                    "body": "On God. Like I do drink from time to time but very rarely get drunk, as well as some other things like weed and shrooms rarely... But getting high every single day? That's wild to me.",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kataklysm_revival",
                            "body": "I use weed for pain management (fibromyalgia). It’s far more effective for me than NSAIDs or opiates. It doesn’t kill the pain, but definitely makes it more tolerable",
                            "score": 25
                        },
                        {
                            "depth": 2,
                            "author": "PaulBlartFleshMall",
                            "body": "Meh, for me it's just daily ADHD medication. When I smoke I can actually focus and get work done instead of having 6 conversations going on in my head at the same time, leading to me just spacing out for ~20 minutes at a time. It's the difference between getting 8-10 things done/day instead of 1 or 2 because I keep getting stuck in imaginary conversations or memories. \n\nIn other words, weed turns my brain's music volume down to a nice background hum so that my primary thought voice can actually be heard. I much prefer this to stimulants like Adderall, and I think it's healthier in the long run.",
                            "score": 48
                        },
                        {
                            "depth": 2,
                            "author": "clullanc",
                            "body": "I think it depends on if you’re doing it for the high or just to unwind.\nOne is understandable to me, the other I would think would lose its appeal very quickly",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "Shreedac",
                            "body": "I’m sure you’ve gathered from the comments that a lot of us use it to replace medications, as it can be more effective and pretty much universally has lower toxicity and side effects. To us your statement is like saying “using Prozac every single day? That’s wild to me”",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Grandahl13",
                            "body": "I smoke weed every day after work after I have come home and done what I need to do for the day. I usually take 2-3 hits off my pen and then hit my flower once before bed. Not sure what’s so wild about that. Makes movies funnier, video games more enjoyable, and I sleep like a rock.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheRedGerund",
                    "body": "That's because ultimately everything is a substance and we consume it to affect our bodies. Do you drink coffee? Do you ever have dessert? Do you ever stay up extra late to finish a movie? Do you take any prescription drugs?",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "SnakeO1LER",
                    "body": "I was just talking to my mother about this. I was telling her how I really respect people who can just go through life with no addictions. I smoke weed and nicotine every day. I can imagine going through life without it, it doesn’t seem impossible, just very hard.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Shreedac",
                    "body": "I’m sure you’re running from things in your own way. We all do",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "krumble",
                    "body": "Did you have good parents?  A lot of the benefit of substances for some people is to avoid facing difficult emotions like anxiety, sadness, self-doubt, etc.  Maybe you grew up learning how to handle those better?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dogsnamewasfrank",
                            "body": "I am an optimist with a wonderful childhood, great spouse, and good job.  I just like a nice buzz when doing fun or creative things. \n\nGranted, it's not one of the daily for me, but several time a week on average.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "krumble",
                                    "body": "First: I am genuinely glad for you and that sounds awesome.\n\nSecond: I thought you meant going substance free when you said white knuckling through life.  I drink once or twice a week and used to smoke once a week.  But both vices have at times been a way for me to avoid my problems and I have to pay attention to why I'm actually doing it so it doesn't become a problem.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "sretep66",
                    "body": "Agree.  I might have 1 beer or glass of wine a week.  Never do weed.  I can't imagine having to smoke or drink daily just to cope with life.  Life is beautiful just as it is.",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "onetwoskeedoo",
                            "body": "Talking about weed here It’s not have to, it’s want to…  and not to cope, just to hang out doing the same things you would be doing sober",
                            "score": 10
                        },
                        {
                            "depth": 2,
                            "author": "TheRedGerund",
                            "body": "That's why I don't drink coffee, I think it's sad that people don't see the natural excitement in life",
                            "score": -8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "toxicity69",
                                    "body": "I drink coffee for the wonderful flavors you can get with different beans/brew methods. Life would be less exciting without it, so I'd say it's sad that you can't see the joy of good coffee.",
                                    "score": 11
                                },
                                {
                                    "depth": 3,
                                    "author": "labowsky",
                                    "body": "Coffee is significantly different to other psychoactive drugs, lets be reasonable people here and not lump everything together.",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "onetwoskeedoo",
                                            "body": "These guys are making some strong assumptions and generalizations here",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SLIZRD_WIZRD",
            "body": "Research is a good start. Dialogue based on no data is pointless.",
            "score": 104,
            "replies": [
                {
                    "depth": 1,
                    "author": "The_Bitter_Bear",
                    "body": "To add to the frustration, a lot of the data that we do have is based on older/weaker stuff. \n\n\nSome of these new strains are stupid strong with very different ratios of all the various compounds. \n\n\nSo there's a lot of catching up to do. ",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DohnJoggett",
                            "body": "Yeah I really don't care much for modern weed because of that, and it's too damn strong. Thankfully CBD hemp hasn't had all of the good stuff other than bred out of it, and CBD hemp is cheap as hell. I just eyeball 1:1 piles of ground weed and hemp and toss it around in a little stash container. It's a much more comfortable experience in my opinion. The THC percentage is lower and the CBD blocks some of the side effects of THC while the THC helps the CBD and other cannabinoids have a positive effect.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "The_Bitter_Bear",
                                    "body": "I've seen this advice a few times and keep meaning to give that a try. \n\n\nI was using to help with some medical issues and it was great at first. As you said though, stuffs so damn strong it started being unhelpful.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Dogsnamewasfrank",
                                            "body": "I've found edibles to be better for that reason - you can control your dosage to a known amount.  And smoking is bad for your lungs no matter what the substance.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "greensandgrains",
                    "body": "I disagree; there is data in the discussions (qualitative researcher bias, sorry not sorry).",
                    "score": -21
                }
            ]
        },
        {
            "depth": 0,
            "author": "the_red_scimitar",
            "body": "And if you are smoking frequently, take [this](https://med.stanford.edu/news/all-news/2022/04/marijuana-heart-disease.html) seriously. Note that the study links frequent use with heart disease, but also found that a supplement, genestein, completely addresses the related problems cannabis causes.\n\nI had a serious cardiac event last August, after about 10 years of more or less daily use. $120,000 later (can you tell this is the US?), there was no cause found (that is currently recognized by mainstream medicine). They ran down the full list, did all kinds of tests, and... nothing. Just a heart attack with no blockage of any kind, no obvious cause. This is why I say to take it seriously. Previously, studies indicated there were cardiac *benefits* from cannabis, and there probably are, but without the supplement, you may have problems like I did.\n\nAnd yes, I've been taking genestein since I read that study.",
            "score": 138,
            "replies": [
                {
                    "depth": 1,
                    "author": "roygbivasaur",
                    "body": "Also if you take any medications that already put stress on your heart like stimulants. You should probably pick one or the other or you’re much more likely to have a very bad time. I had to stop both for over a year because of really awful persistent tachycardia and still can’t tolerate amphetamine stimulants anymore even without THC use. Luckily methylphenidate seems to be fine now. THC makes me feel like crap for days anyway, so idk why I was using it in the first place.",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ChronicallyAnIdiot",
                            "body": "Hmm Im bipolar which puts similar levels of strain on my body as stimulants. Weed already gives me pretty bad episodes as is, im constantly starting and quitting repeatedly. Sucks but weed really is addictive for some of us",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WeCanDoIt17",
                    "body": "This is very interesting and thank you for sharing. The rise of cardiac conditions during the last few years impacting younger and more healthy generations is certainly alarming.\n\nUnfortunately, as a society we are exposed to so many toxic substances through food, air, water, clothing, pharma, beauty, etc. that it has become difficult for even the most conscious individual to account for and change behaviors in response to all of it.\n\nAnything we need to specifically know when supplementing genestein?",
                    "score": 49,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "coolaliasbro",
                            "body": "And don’t forget stress, it’s sky high for most people and a huge contributor to cardiovascular issues.",
                            "score": 40
                        },
                        {
                            "depth": 2,
                            "author": "ancientastronaut2",
                            "body": "I am seeing it's a type of estrogen so need to ask my doc if it's ok to take with my estrogen patch",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SimianSlacker",
                    "body": "I wonder how much the intake method affects this? I read the article and it focuses mainly on smoking (combustion) but doesn't indicate if this is an issue with edibles. They seem to imply that the connection is something to do with how THC activates the CB1 receptors in relation to the walls of the blood vessels.\n\nWe know smoking (combustion) anything is bad for the cardiovascular system. We also know that THC processed through the liver is different than THC inhaled. Smoking also contains more compounds than just THC. Ideally, I would like to see if they can reproduce the same results with pure THC ingested through the digestive system. I'm not saying the results would be different BUT it would go a long ways to ensuring it's actually THC and not some other compound activated through smoking.\n\nI ordered some genestein, couldn't hurt...",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "altered-cabron",
                            "body": "Yeah that’s what i wondered too",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "rard26",
                            "body": "It's ridiculous that Stanford didn't state in their own article if they controlled for combustion effects or not. Read the paper, they didn't. The focus was solely on delta 9 THC, ignoring the cumulative effects of almost 100 other cannabinoids found in cannabis that mediate the negative effects of THC, including inflammation.\n\nThis study is fine if patients are prescribed pure THC, useless otherwise.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "the_red_scimitar",
                            "body": "It actually did say the method of ingestion didn't cause any variation. It's in there. And it also made it clear this was *injected* THC - specifically to avoid the question of which substance is causative.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SimianSlacker",
                                    "body": "I totally missed that... I went back and looked and sure enough there it is. Thanks for highlighting this!",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "the_red_scimitar",
                                            "body": "Seems a couple other commenters also missed that this was injected THC specifically, so it won't matter if smoked, vaped, or eaten.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Forsaken-Pattern8533",
                    "body": "More recent studies show daily use results in a 200% higher chance of stroke. Heart disease risk increases by 50%. \n\n\nThere's no current recommendation for usage to keep risks low but current evidence has been pointing to no more then 2-3 days a week. \n\n\nGenestein is found in soy milk and is a phytoestrogen that counteracts the damaging affects of cannabis on the heart muscle cells. You can get the same equivalent amount of genestein with a cup of soymilk a day.",
                    "score": 43,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheGreatGildedDildo",
                            "body": "Idk if anyone has had horrible palpitations when high, but I’ve had to cut it out completely. Just raw dogging life now. Brutal.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GloriousBeardGuanYu",
                                    "body": "Come to think of it, I haven't had one since I switched from near daily to a tiny hit once or twice a year.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "litlelotte",
                            "body": "So i don't know much about how strokes are caused but I wonder if coughing fits from smoking contribute to that statistic? I've definitely gotten severe headrushes from coughing too hard, both from smoking and illness, and I would totally believe coughing hard enough could cause a stroke. I'm not educated on the physiology of it though so it's possible I'm pulling this out of my ass",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "the_red_scimitar",
                            "body": "There is recommendations, in the very paper that announced the problems. Genestein, and the authors stated it completely addressed the problems. Read. The. Paper. I did.",
                            "score": -13,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ThatGuyJeb",
                                    "body": ">There's no current recommendation for usage \n\nThe paper didn't have dosage or frequency recommendations for Genestein, nor did it attempt to establish a link between various levels of cannabis usage vs. risk. \n\nAlso don't type like that, it makes you look like an asshole.",
                                    "score": 36,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ancientastronaut2",
                                            "body": "Right?! Like you read it, here's your gold star.",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "the_red_scimitar",
                                            "body": "And telling people they're an asshole because of \"how they type\" - what does that make you? There's an answer for you question, btw, but as an asshole, you can go find out yourself. Or not. Don't care.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Co259",
                            "body": "But does this phytoestrogen change the estrogen levels in men?",
                            "score": -16,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BigDowntownRobot",
                                    "body": "They all weakly activate estrogen production. This effectively is irrelevant but people care about it largely out of ignorance. \n\nThe major issue most people have with this is not understanding the endocrine system or hormone requirements in humans.  The ignorant most often simplify this as testosterone is for men, and estrogen is for women which is entirely inaccurate.  Both are mandatory for both sexes and are required for a lot more than promoting sex characteristics. \n\nA man with no estrogen would be extremely unhealthy, have no sex drive, brittle bones, etc.  You need estrogen to live. And in males increases estrogen is usually followed by natural increases to testosterone to balance things. \n\nFairly large fluctuations in sex hormones are normal.  Testosterone for example can be several times it's base line at certain points, and can be several times less at other points in a day or month. Your body is designed to compensate for them, to the extent that the small effects from phytoestrogens have never been proven to have any measurable impact on sex characteristics, mood, testosterone, or estrogen levels.\n\nWeakling activating does not mean you end up with more over all because the system is more complex and more interacting than that. Lots of things activate hormone production. This is why people need to understand the science behind things before they confidently believe or repeat things like this.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "19VWGTI",
                    "body": "This is the first time I’ve read about genestein.\n\nI found this link [https://onlinelibrary.wiley.com/doi/10.1111/and.14511](https://onlinelibrary.wiley.com/doi/10.1111/and.14511).\n\nI didn’t read into this sufficiently, but what this article is referring to seems concerning. Smoking in general causes fertility issues irrespective of the fact that we’re speaking about cannabis. However, if someone is going to smoke daily AND take genestein supplements, I’m curious what the effects are on fertility in the aggregate.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Realistic-Weird-4259",
                    "body": "I've been using since a fairly young age, and regularly.. let's just say for over 10yrs. Dx'd with high BP at the beginning of this decade.\n\nI'd also really love to know if any similar studies have been done using participants from the Emerald Triangle and areas east in the Sierra Nevada.\n\nWhat's the dosing on the genistein to gain that positive effect?",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "fd6270",
                    "body": "Where do you get your genestein from? I'm partial to the Swanson brand but always open to alternatives. ",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "nope_nic_tesla",
                            "body": "I wonder if simply eating soybeans/soy products provides enough.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "spiciertuna",
                                    "body": "It may actually be better since the bioavailability of genistein is higher from soy than from pure powder.",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "the_red_scimitar",
                            "body": "At first I could only find it (at high prices) from import supplements, but now it's available more easily. It was literally about $60 for one month supply, but now it's a fraction of that, and available locally. \n\nThere are two very different sources for genestein, which has mostly been used to help women with hormonal balance. So many version -  both cheap and expensive - are soy-based, which is also known to have hormonal effects. The other is Japonica, and is considered a better source, particularly for men. Usually, the non-soy is VERY expensive (and so are some soy-based products), but Swansons is somehow both better ingredients (no soy) AND very low priced. I'd stick with it, unless you can find a non-soy cheaper, in the dosage you want.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "reallyokfinewhatever",
                                    "body": "I don't understand your soy distinction. Genistein is an estrogen receptor beta agonist no matter where it comes from...soy has nothing to do with it except that soy is also high in genistein.",
                                    "score": 10
                                },
                                {
                                    "depth": 3,
                                    "author": "dagobahh",
                                    "body": "> Genestein\nCould you point me to your source that's a fraction of $60?  Because it still looks pretty pricey on Amazon compared to the other supplements I take.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "the_red_scimitar",
                                            "body": "Look elsewhere, for the Swanson brand.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "adamdoesmusic",
                    "body": "Does the genestein offer any other noticeable effects aside from the not-dying part?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "the_red_scimitar",
                            "body": "Heh, you can find more with a search, but it was long used to balance female hormones.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Johnnyamaz",
                    "body": "The supplement is for something that's also in soy and Fava beans. I'm curious how much soy would be enough rather than the supplement. Would soy based protein powder work?",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "LucasRuby",
                    "body": "I am extremely skeptical of studies that present both a \"new danger\" and a \"cure\" at the same time like this one, there's a lot of money in the supplements industry and a lot of influencing happening in those cases.  \n\nBut secondly, this study examined smokers specifically and not all users of THC, and smoking is known to be linked with heart disease. The main cause of negative health effects is smoking cigarettes, is, **by far**, combustion, not nicotine.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "the_red_scimitar",
                            "body": "Except they covered this by injecting THC - so it doesn't matter how you get it, it was THC specifically and only. They discuss smoking, but the actual test (with mice) was by injection, specifically to minimize the other substances factor.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Untowardopinions",
                    "body": "I saw a same thing happen to a 23 year old kid.  He was working a night shift as a security guard and spent the whole night smoking weed and doing NOS.  Had a straight up widowmaker STEMI, the kind that 50 year old ad men used to get at their desks.\n\nHe lived but his heart will never fully recover.  Combination of vasospasm and thrombosis.  Cardiologists say they’ve seen a few cases like it lately.  No atherosclerosis, just drugs and a lot of dead myocardium.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "the_red_scimitar",
                            "body": "But no cannabis. The drug they check for, with cardiac, are all stimulants, like cocaine. They even knew I smoke cannabis, and it wasn't on their radar. And there are other factors, including Covid (twice), which is correlated EXACTLY to a \"no cause\"  myocardial infarction.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "nbcnews",
            "body": "Study found here: [https://onlinelibrary.wiley.com/doi/full/10.1111/add.16519](https://onlinelibrary.wiley.com/doi/full/10.1111/add.16519)",
            "score": 21
        },
        {
            "depth": 0,
            "author": "_redacteduser",
            "body": "As someone who is/was addicted to both, the actual disease is addiction.",
            "score": 52
        },
        {
            "depth": 0,
            "author": "v1brates",
            "body": "Be careful.\n\n\n\n> In contrast, the relationship between cannabis use and risk of developing symptoms of psychosis has been well established in many different review articles.\n\n> This research has found that early and frequent cannabis use is a component cause of psychosis, which interacts with other risk factors such as family history of psychosis, history of childhood abuse and expression of the COMT and AKT1 genes. These interactions make it difficult to determine the exact role of cannabis use in causing psychosis that may not have otherwise occurred.\n\n> Regardless, the connection between cannabis use and psychosis is not surprising. There is a strong resemblance between the acute and transient effects of cannabis use and symptoms of psychosis, including impaired memory, cognition and processing of external stimuli. This combines to make it hard for a person to learn and remember new things but can also extend to the experience of deluded thinking and hallucinations.\n\nhttps://ndarc.med.unsw.edu.au/blog/does-cannabis-cause-mental-illness",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "abelincoln3",
                    "body": "I very pro weed but agree with prohibiting it for people younger than 21.",
                    "score": 42,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "v1brates",
                            "body": "Same. Many seem to think weed is this harmless drug, but it has strong links to psychosis and other mental health problems. Like most things, moderation is key.",
                            "score": 24
                        },
                        {
                            "depth": 2,
                            "author": "Tagawat",
                            "body": "Don’t you have to be 21 already? I’d say 25 years old to be safe. Let that brain develop a little bit longer.",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PrivilegedPatriarchy",
                    "body": "I took relatively high doses of edibles for about a year, had two psychotic breakdowns during that time (my first and last times using edibles) and now have (minor) mental health issues likely caused by the THC usage. More people need to be aware of the possible risks.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "lornezubko",
            "body": "The penjamin button makes it easy",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Kineth",
            "body": "I have to assume it's because one's less taxing and debilitating on the body.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "lincolnhawk",
            "body": "Make the airport bar the airport cannabis lounge! Drunks on planes are miserable and cause problems. Stoned people on planes happily watch cartoons and may occasionally find themselves too high to get back out of the bathroom.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lyger101",
                    "body": "The smell of that on a plane for two hours... fml",
                    "score": 26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DeadWombats",
                            "body": "another reason why edibles are superior.",
                            "score": 22
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ctrlaltcreate",
            "body": "Or, it was always common and people refused to admit it because it was, y'know, illegal. jfc",
            "score": 8
        },
        {
            "depth": 0,
            "author": "DreaminginDarkness",
            "body": "Alcohol has incredible marketing because who wants to be stressed and sick every day",
            "score": 7
        },
        {
            "depth": 0,
            "author": "ManicMaenads",
            "body": "I would stop if I had a better solution to my chronic pain, I only started because I was developing liver and stomach issues from multi-daily use of ibuprofen and acetaminophen.\n\nYes, I exercise. Yes, I eat well. Yes, I do stretches and eat vitamins and do all the most basic preventative care.\n\nUnless I find a better alternative, I'm probably going to be dependent on weed for the rest of my life.\n\nI'm a lot healthier smoking weed than I was popping all those pain killers, I'll say that much.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Alarming-Tree-5662",
            "body": "Daily user. It fluctuates of course. I've definitely gone through all day every day fazes but life sucked when that was happening and it's the only way I could sleep. I normally smoke in the evenings or after work now and start around noon on weekends. Ive never missed work because of weed. I've never missed important obligations. Sometimes I'd neglect house work but Ive found a balance now. I used to drink a lot years ago now I might have two drinks a month but I've definitely missed work and obligations and am very fortunate I've had no run ins with the law when I was drinking heavily. It's no comparison as to which substance is the worse of the two for myself personally.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "parker1019",
            "body": "For the best. How often do you hear of some pot head instigating an physical altercation, killing people in a car accident, or being physically abusive to others as a result….",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "gdkmangosalsa",
                    "body": "As an inpatient psychiatrist, I hear about it a decent amount. Cannabis does not mix with psychiatric illness, we do not have any convincing evidence to suggest that it does. The same goes for alcohol.",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "lilbelleandsebastian",
                            "body": "i'm a hospitalist in the downtown of a major urban center - mental illness is present in a HUGE portion of the patients we admit - and i've never once seen someone violent solely due to cannabis\n\ni have no doubt that it can exacerbate mental illness but what you're saying really doesn't track with the last decade of my life i've spent caring for these patients",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "parker1019",
                            "body": "No substances other than prescribed medications are likely to benefit those with poor mental health or illness. Never claimed that was the case. It is the lesser of other evils considerably based on my exposure to those individuals who use substances recreationally and or medicinally…..",
                            "score": -9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Huggles9",
                                    "body": "I’m gonna take the inpatient psychiatrists word over you watching your friends",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheBetaBridgeBandit",
                    "body": "While alcohol definitely leads to significantly more traffic fatalities, drivers impaired by cannabis absolutely do kill people and themselves in car accidents. Similarly, cannabis-related psychotic episodes can lead people to physically harm others in altercations, it just doesn't happen as frequently as with alcohol (for many reasons).\n\nI research the pharmacology of cannabis and enjoy using it, but the narrative of cannabis being essentially harmless is factually incorrect and is starting to become harmful itself.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "October_13th",
            "body": "This makes sense. Weed smokers (even ones who think of themselves as casual users) tend to want to get high basically anytime they can, vs causal drinking is usually regulated to the weekend or even just holidays. \n\nA lot of my friends who smoke weed claim they aren’t addicted and it’s harmless, but they absolutely are addicted and it doesn’t always seem harmless. My aunt who has been a daily weed smoker for about 15-20 years has early onset dementia, intense paranoia, and occasionally suffers from psychosis. Not at all saying that everyone who smokes weed will experience mental decline, but she did very rapidly. It’s hard to watch.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Eastern89er",
                    "body": "The “weed is harmless” story is mostly copium. Occasional use is fine (of course, 3 glasses of wine a week are fine too) but whoever met a long-term daily weed smoker can attest that it does have quite an impact.",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WhiskeyT",
                            "body": "This study sounds like a whole lot of people have met daily weed smokers and not known it",
                            "score": 18
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Huggles9",
            "body": "“Marijuana has no downsides and is not addictive”\n\nMost of Reddit",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "greenghostburner",
                    "body": "Almost everything in life has downsides and lots of things with downsides are legally and socially acceptable to do/have daily.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Huggles9",
                            "body": "I wouldn’t say anyone would argue that it’s good or healthy to drink or smoke daily we shouldn’t treat them different",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "nbadman93",
            "body": "Yeah, how else am I going to mentally deal with all this?",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "kittyburger",
                    "body": "Healthy coping strategies that do not rely on hopping to one addiction and the next?",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Huggles9",
                            "body": "Hey man…enough of your logic",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "reidzen",
            "body": "Hope you're ready for the next episode!",
            "score": 2
        },
        {
            "depth": 0,
            "author": "DriftMantis",
            "body": "As expected, once legalization happened and retail opened literally nothing happened. No increase in accidents, health outcomes the same, no change in violence or crime etc. Cool. This drug effects people in different ways. Start small with doses and see how it effects you. If it doesn't feel right, then dont use it for a while. For me, I build dependency quick and need to use it sparingly. I know a lot of people that blaze constantly and can pick it up and put it down.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "JETandCrew",
            "body": "Weed doesn't destroy your liver or have significant negative health when using or trying to quit cold turkey. The worst thing that happens on weed is eating too much or puking if greening out",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Tye_die",
            "body": "The stuff gives me unpredictable panic attacks every once in a while. I'm in the drinkers camp unfortunately.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Cool-Sell-5310",
            "body": "Alcohol destroys families and relationships. \nWeed destroys snacks.",
            "score": 5
        },
        {
            "depth": 0,
            "author": "OwnProtection2",
            "body": "Cannabis >>>>> Alcohol!!!!!",
            "score": 9
        },
        {
            "depth": 0,
            "author": "AOEmishap",
            "body": "I never saw a completely stoned guy get into a vicious, blackout rage filled brawl with 3 cops, shrug off a Taser and have to be carried out in hand and leg cuffs, still screaming, covered in vomit and piss.  I DID SEE IT AT WORK ONE AFTERNOON IN THE TRUCK YARD!",
            "score": 4
        },
        {
            "depth": 0,
            "author": "chrundlethegreat303",
            "body": "Been that way in my family since late 60s / Early 70s",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Untowardopinions",
                    "body": "How’re the anxiety rates?",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Down_The_Rabbithole",
                            "body": "pretty high",
                            "score": -10
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TozTetsu",
            "body": "I smoke everyday, I am super happy it's legal in most places and is much better than alcohol using a number of metrics.\n\nHaving said that do you know what Soma is from 'Brave New World'?  I mean I'm on board, but I was gonna go to the protest but then I got high, then I got high, then I got hiiiighiii",
            "score": 3
        },
        {
            "depth": 0,
            "author": "spinjinn",
            "body": "When I advocate for legalization of drugs, people always ask me what will happen with heroin and fentanyl.  They always fear that these drugs will result in overwhelming drug problems in society.  I claim that there will be almost no effect.  Some of the 20-30 million hopeless alcoholics we already have in the country will become hopeless drug addicts.  Would you be able to tell the difference?",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "mfmeitbual",
                    "body": "The legal status of those drugs isn't the obstacle to people using them. The notion that everyone would start using heroin if it became legal is absurd. ",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "OperationMobocracy",
                            "body": "I think the risk with opiates isn’t a surge in IV heroin use, it’d be the use of low dose pills on a too regular basis to overcome low level aches and pains and a subset of people developing higher dose addictions. \n\nThough I think a fair number of people who develop addictions would probably end up at some kind of maintenance dose and not endless escalating doses. \n\nI read a fascinating book about the history of opiates and the author found good evidence that turn of the 19th century era addiction was usually like that — folks with chronic pain untreatable by contemporary medicine who wound up becoming regular opiate users but whose use stayed at steady doses for years.",
                            "score": 5
                        },
                        {
                            "depth": 2,
                            "author": "FrogTrainer",
                            "body": "Everyone?  No, but an increase?  Absolutely.  Black market Heroin is incredibly dangerous due to fentanyl.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Warrlock608",
                    "body": "I don't think there will be a noticeable change if heroin and fentanyl were legalized other than a marked drop in overdose deaths.\n\nThese drugs are widely available today and any one who wants to buy them can. To say that a huge swathe of the population will suddenly start doing them due to legalization is just ridiculous. Any net negatives from legalization are washed out by all the positives (lower overdose deaths, money diverted away from cartels, money diverted away from local black markets). \n\nWe don't live on some magical island where making things illegal makes them unavailable to us.",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CostAquahomeBarreler",
                            "body": "We kind of do. I would certainly buy opiates if I could legally but wouldn't illegaly?",
                            "score": 0
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Joatboy",
                    "body": "You don't think there's risk differences between fentanyl use and alcohol use?",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RunningNumbers",
                            "body": "I doubt they really think about the implications of their beliefs in general.",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "spinjinn",
                            "body": "Not if it was legal and regulated and part of our upbringing.  Even alcohol has 2200 “overdose” deaths per year, but that is legal and consumed fairly openly and part of our common knowledge. You might say that is small compared to the 50-100,000 per year for fentanyl, but there is a LOT of illegal fentanyl.  In 2023, the US seized 360 Million doses!  That’s a dose for every single US citizen. You can imagine how much got through.",
                            "score": -8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Joatboy",
                                    "body": "How many users of fentanyl do you reckon there are? Vs number of users of alcohol? I'd imagine it would be at least 2 orders of magnitude",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "clullanc",
                    "body": "Exactly. It doesn’t really say anything. Most people can use alcohol a few times a month, a week or even every day and still handle their everyday life. The fact that it’s legal won’t make everyone an addict. At least not in a destructive way",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "sitefo9362",
                    "body": "> Some of the 20-30 million hopeless alcoholics we already have in the country will become hopeless drug addicts.\n\nYou are assuming that those who are alcoholics will just switch to weed. In all likelihood, we will end up with 20-30 million Americans who are alcoholics and potheads, and maybe an additional couple of million teetotaler potheads. \n\nEven if weed is less harmful than alcohol (something that needs more studies given that we haven't really been researching weed as long as we have been doing for tobacco and alcohol), why will we want to **increase** the number of legal additive substances, instead of reducing them? \n\nRight now, we have already have  legal alcohol and legal tobacco. Why will moving to legal alcohol, legal tobacco, **and** legal weed, make things better?",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "hatchins",
                            "body": "Because people are already smoking weed, and they don't need to be going to prison for it? They don't need to have their children removed for it? They don't need to be denied jobs for it?",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "clullanc",
                            "body": "I think we can at least conclude that weed generally doesn’t harm the people around the addict. If I had to chose between that and the harm alcohol causes, both for the addict and whoever comes in their way, I would chose weed any day.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sitefo9362",
                                    "body": ">  If I had to chose between that and the harm alcohol causes, both for the addict and whoever comes in their way, I would chose weed any day.\n\nBut we are not substituting one for the other, i.e. we are not saying let's ban alcohol and legalize marijuana. We are legalizing **more** things that are harmful, when what we should be doing is to reduce the things that are harmful.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "adampsyreal",
            "body": "Weed is cheaper and safer",
            "score": 2
        },
        {
            "depth": 0,
            "author": "5H17SH0W",
            "body": "Always has been. *bang*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "inkstainedquill",
            "body": "It’s good that towards the end of the summery they mention that self reporting is probably up do to more current societal norms, but they fail to mention the same kind of pressure on alcohol. Alcoholics will often lie about their drinking, as will some who simply drink more often than they perceive others drinking, and therefore downplay their usage out of an internal shame.  And at no time does this suggest that any margin of error establishment was attempted since the surveys started. \n\nAlso I would need to see the exact question asked in regard to both. While probably not a common variance someone may report not drinking alcohol if all they had was a seltzer like a truly or white claw. In their minds alcohol might be more connotative with a mixed drink or straight shot of whiskey, vodka, tequila, and so on depending on the environment they grew up in. \n\nSelf reporting ultimately relies on honesty which  perspective, shame, and cultural norms can affect.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "knowledgeable_diablo",
            "body": "And yet the sky didn’t fall in like we were told would happen for decades.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "booyaabooshaw",
            "body": "*...I used to be an alcoholic, I still am, but I don't drink now*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "StewTrue",
            "body": "It’s not hard for me to believe that marijuana use is this high today, but I do find the rates of daily drinking a surprise.  Nearly every adult I know drinks at least somewhat frequently, and many of them daily.  I don’t know any real drunks, but a beet or two or a glass if wine a day is very, very common in my experience.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Celebrity292",
            "body": "Can't wait till it's finally at the minimum re-scheduled. Should take it off drug testing by doing that. According to what I read on the government site.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ChooseMercy",
            "body": "Imagine all the domestic violence that was prevented because of fewer drunken episodes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "crowcawer",
            "body": "Hell yeah!\n\nBring back cheap beer!\n\nMake Beer Cheap Again.      \nMake Beer Beer Again.   \nMake Beer Beer Beer.     \nBeer Beer Beer Beer!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Comprehensive-Ear283",
            "body": "I mean, I would smoke instead of drinking if I was able to as well. Way less calories and no hangover. (I’d probably be more of an edible guy)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dwindles_Sherpa",
            "body": "This is great news.\n\nIf we could transition even just 50% of heavy drinkers to heave THC users then would could drastically change the burden on our healthcare system in terms of both acute (short term) and chronic (long term) effects.  \n\nDrinkable versions of THC should be more broadly available in bars and restuarants.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Memphisrexjr",
            "body": "It's as if it's now legal to buy in most states.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "no_fooling",
            "body": "You can get proper stoned and still be ready for a normal day in the morning. Not the case for drinking, especially over 30 let me tell ya.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "J_lando92",
            "body": "Aww yeah, food, water, oxygen and cannabis. Life's essentials",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bad_Habit_Nun",
            "body": "Good. Drinking is magnitudes more destructive to people and society in general.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BooBeeAttack",
            "body": "Congratulations everyone, we did it!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LeastUnderstoodHater",
            "body": "Pssssst, it’s always been this way, people can (mostly) legally say they use it now.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "systembreaker",
            "body": "Meh these toes of users probably were less forthcoming about their use before.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cantora",
            "body": "I wound really like to know how cannabis affects gambling vs alcohol. I assume people would be less likely to gamble when stoned vs drunk ",
            "score": 1
        },
        {
            "depth": 0,
            "author": "andreasdagen",
            "body": "has there been any attempt at figuring out at what level it starts becoming a major issue? Maybe by looking at medical users? Though I guess it's a huge challenge with all the cofounders for medical users.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Huggles9",
                    "body": "The downsides of daily/habitual marijuana use are well documented",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Impeach-Individual-1",
            "body": "I am doing my part to help boost those cannabis numbers!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "captainboringpants",
            "body": "That's why Biden rescheduled it for Pharma Friends instead of legalizing it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Own-Tart-4131",
            "body": "As long as companies can still drug test and not hire you because of smoking I'm still incentivized to drink.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Rockfest2112",
            "body": "Well it’s a different scene and if not being smoked (or even if) it’s helluva lot safer health wise compared with drinking daily. Of course if your smoking all day you’re negating some of the less damaging points and possibly harming yourself as much or more, so levels of usage and how/what form its being used in matter greatly.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -10,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": -3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -1
                }
            ]
        },
        {
            "depth": 0,
            "author": "iamisandisnt",
            "body": "“Smoke weed every day” Sir, yes sir!",
            "score": -1
        },
        {
            "depth": 0,
            "author": "Cypher_Vorthos",
            "body": "The left took the position to make marijuana legal and available as much as possible to the detriment of public health. Years into the future don't be surprised when research uncovers the damaging effects of marijuana. Even now in New York City of all places I have seen Subway ads advertising to those seeking help to break free from their addiction to marijuana.",
            "score": 0
        }
    ]
}