{
    "title": "Although there is still some debate, it’s now generally accepted that Pluto has an ocean. Scientists now have estimated Pluto’s ocean is, at most, about 8% denser than seawater on Earth, or roughly the same as Utah’s Great Salt Lake.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/MistWeaver80  \nPermalink: https://www.sci.news/space/plutos-subsurface-ocean-12954.html\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "vasopressin334",
            "body": "To be clear, this is a subsurface ocean of what you might call “molten ice” similar to magma on Earth. It even erupts out of ice volcanoes.",
            "score": 139,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cr0n0x",
                    "body": "That’s sick",
                    "score": 50
                },
                {
                    "depth": 1,
                    "author": "Kale",
                    "body": "Water is melted ice. Do you mean low temp high pressure water that behaves like a viscoelastic material?",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vasopressin334",
                            "body": "I mean that Pluto is so cold that, relatively, liquid water is a super-hot substance that can serve a very similar role to Earth magma.",
                            "score": 47,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Starlight-Sniper",
                                    "body": "Awesome, from the hypothetical perspective of an alien living on Pluto, Earthlings are horrible monsters with molten magma for blood and skin so hot it can melt stone just by touching it.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "DeepSea_Dreamer",
                                    "body": "...So, it's just water.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Caelinus",
                                            "body": "Yes, but that strips it of the context that makes it interesting. On Pluto ice is essentially just like a type of stone, so in context this is like saying that \"magma is just rock.\" \n\nOur default states of matter for them are contextual to earth. So \"ice\" is considered to be the altered form of water because we have so much liquid water, and magma is altered stone because we have so much solid stone. On Pluto, ice is the default, and water is \"molten ice\" in the same way that magma is molten stone.",
                                            "score": 62,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DolphinPunkCyber",
                                                    "body": "Surface of Pluto is covered by rock (ice) and underground there is a sea of magma (water), volcanoes erupt magma (water) which solidifies into rock (ice).\n\nYeah, context really makes it interesting.",
                                                    "score": 40
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Kale",
                                                    "body": "Well, which type of ice? If ice-15 forms deep within Pluto (T<150C, P~1 GPa), does it look like a different rock from ice-11 (T<200C, P<100 MPa) that might have formed on the surface?\n\nIt's fascinating to think that there could be ice formations of various phases of ice formed by mixing ice that solidified under different pressures and temperatures. And could have different mechanical properties, just like we do with varying the amount of austenite and martensite in steel.",
                                                    "score": 7
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Top-Requirement-2102",
            "body": "So there are Mormons on pluto?",
            "score": 38,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dangerous_Bad4118",
                    "body": "Lots of sand fleas, probably.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "dizorkmage",
                    "body": "I mean they got magic underwear and golden submarines so why not.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Batetrick_Patman",
                    "body": "A Mormon but I'm from earth!",
                    "score": -5
                }
            ]
        },
        {
            "depth": 0,
            "author": "rbobby",
            "body": "Worst surfing in the system. Cold. Literally no waves. One star.",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "Locke2300",
                    "body": "And that star is so far away!",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Key-Cry-8570",
                    "body": "But great frozen lemonade.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "seriousnotshirley",
            "body": "I do t know how the oceans got there but they certainly didn’t plan it.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "KlM-J0NG-UN",
            "body": "What's so great about that lake in Utah anyway",
            "score": 1
        },
        {
            "depth": 0,
            "author": "rich1051414",
            "body": "On pluto, lava is made of water ice, and it has volcanos like earth, but they spit out molten ice(water).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "donquixote2000",
            "body": "I thought oceans were only called oceans if they were on planets. On Pluto wouldn't it be an exoocean?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "tennesseean_87",
            "body": "Sounds like a planet to me…",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "saanity",
                    "body": "If we classify Pluto as a planet then we have to add dozens of not hundreds of other objects as planets. Do you want to memorize dozens of new planets?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Key-Cry-8570",
                    "body": "So heard about Pluto? That’s messed up right?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "tvs117",
                    "body": "There are moons with oceans dipshit.",
                    "score": -2
                },
                {
                    "depth": 1,
                    "author": "Narf234",
                    "body": "That’s not how this works. It’s not how any of this works!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "i-hoatzin",
                    "body": "It is nonsense that it is not classified like that now. Sometimes astronomers and astrophysicists should go out and touch grass.\n\n\n¯⁠\\⁠\\_⁠(⁠ツ⁠)⁠_⁠/⁠¯^(I'm just saying. It's my unpopular opinion.)",
                    "score": -8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "neotericnewt",
                            "body": "It's really not. We started learning more about different types of celestial bodies and so our classifications became more specific. In this case, Pluto is considered a dwarf planet, because while it's big enough to have become round, it's not big enough to really control the area around it through gravity. That's what defines a planet.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "i-hoatzin",
                                    "body": "Thank you for your comment so I can improve, leaving my ignorance behind a little.\n\nWhat happens to its atmosphere? Now we know Pluto has it, right? Doesn't it depend on gravity to maintain it?",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Gunyardo",
                                    "body": "Is there a specific radius threshold as well? If the moon were proportionally the size and distance from Earth that Charon is from Pluto, would Earth no longer be a planet?",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "stu54",
                            "body": "Its an amusing debate because it really doesn't matter.    In my opinion, Triton is a planet.  Big space balls are either stars, exotic stuff like neutron stars, or planets.  Moons are all either asteroid or planetoid.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Narf234",
                                    "body": "We arbitrarily classify everything around us. Unless you want to get a degree and become highly regarded in the field, just fall in line. No one wants to hear about your feelings on the matter.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "stu54",
                                            "body": "\"Shut up\"\n\nUnderstood.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "The_Singularious",
            "body": "God it must be awesome to be an astronomer. You get to do all the hard math and calculations, but also just wildly postulate any theory that might fit what you’ve measured. And there is zero accountability for it 20 years later. \n\nHave been alive long enough to see so many of these get rewritten later in ways that are insanely different that first thought. \n\nAnd yes, I have an axe to grind with my old physics professor who shamed me in class about making “assumptions in science” and then went on to teach me numerous “truths” about black holes that are “no longer true” (not that anyone actually knows now either). \n\nAll that being said, would be uber cool to get a probe close enough one day…",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "cabbageconnor",
                    "body": ">just wildly postulate any theory that might fit what you’ve measured\n\nThat's literally just science, my dude. And then you test your ideas by taking more measurements. Sometimes we're wrong, so we correct it",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "The_Singularious",
                            "body": "I think my problem is with the language, which is the direction I went in. \n\nI see nothing in the article to back up what percentage of astronomers it takes to be able to state “general acceptance” of a theory. And here’s where I’m ignorant. Maybe there is one? Like is that a scientific definition somewhere?\n\nAnd what is the percentage of “likelihood” that it is true? What does “likely” mean, as a measurement?\n\nI also especially struggle with this kind of language around astronomy because I fail to see how there is any real empirical standard for statements like I read in the article. We can’t even figure out the reality of our fully observable surroundings, yet something is “likely” on Pluto.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "machiavelli33",
                                    "body": "This is a continuing issue with science reporting. Science journalists - especially ones tailored towards mass consumption - necessarily use less precise language than the scientists themselves use, and terms like \"general acceptance\" is always going to be a nebulous thing.  If you want more particular language to describe what's actually been found, I'd recommend delving into the studies and the actual papers where this stuff was released.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "The_Singularious",
                                            "body": "So I agree with half your statement. The journalist (or their editor) used the term “likely”. \n\nBut the *scientist* quoted used the phrase “generally accepted”. \n\nSo unless the journalist was just making up quotes, which I doubt, then all the blame cannot fall on the journalist here.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "cabbageconnor",
                                    "body": "Pop science articles like this one will always be lacking in depth of information, because they're targeted at a general audience. I'm sure the primary literature is out there somewhere, but I won't try to interpret it since I'm not an astronomer.\n\nI do think you're expecting more certainty from science than you're ever going to get, though. There's no beacon of truth that lights up when you hit the \"right\" answer. All we have are the results of our experiments and observations. Even on Earth, we're stumbling in the dark. The theories that stand up to repeated testing again and again are more likely to be true.\n\nGiven all that uncertainty, it's honestly pretty impressive we've gotten this far!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "The_Singularious",
                                            "body": "TBF, I expect the exact opposite from science. That is, a carefully calculated message with appropriate caveats. \n\nI get that it is a general interest article (even if in a specialty publication), but again, my problem was with the scientist’s language itself. \n\nI know that scientists are human too, but I’ll say that if I went on the record about something that I had partial data and limited evidence of at my place of work, and then spoke for a whole lot of other people in my field, and said something was “generally accepted”, then there would be some conversations.\n\nBut this goes back to MY theory that scientists (and most medical doctors) need an ongoing partnership with public policy and communications experts to supplement the strengths of one another. \n\nThey need to fact check these stories with experts. And scientists also need to be advised on their messaging. This was particularly ugly during COVID.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "321890",
                    "body": "Guys, stop science, we got it right when this guy was in school. Pack it up. Also, remove the feathers from the dinosaurs please.",
                    "score": 1
                }
            ]
        }
    ]
}