{
    "title": "The global clean water crisis looms large: 55% of the global population currently lives in areas that experience a lack of clean water in at least one month per year. By the end of the century, this may be as high as 66%",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/Wagamaga  \nPermalink: https://www.miragenews.com/global-clean-water-crisis-escalates-1241411/#:~:text=%22Climate%20change%20and%20socioeconomic%20developments,for%20evaluating%20future%20water%20scarcity.%22\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "KerSPLAK",
            "body": "Get ready for the water wars era.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "SethikTollin7",
                    "body": "The mention of all the water cleaning doesn't combat medications... \"Fish down river are over loaded with anti depressant etc...\" ah of course, no safe water was such an easy hidden goal huh.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wagamaga",
            "body": "Water scarcity will intensify with climate and socioeconomic change, disproportionately impacting populations located in the Global South. So concludes a new Utrecht University article published in Nature Climate Change on 23 May 2024, which used a state-of-the-art global water quantity and quality model to estimate clean water scarcity until the end of the century.\n\nHumans require clean water for drinking and sanitation purposes, but also for the production of food, energy and manufactured goods. As communities and policymakers grapple with water scarcity issues on the ground, researchers at Utrecht University aim to shed light on the escalating global clean water crisis.\n\nCurrent and future water scarcity\nUsing simulations from a state-of-the-art water quantity and quality model, the authors assess present-day and future global water scarcity. \"Climate change and socioeconomic developments have multi-faceted impacts on the availability and quality of, and demands for, water resources in the future,\" says lead author Dr. Edward Jones. \"Changes in these three aspects are crucial for evaluating future water scarcity.\"\n\nThe study estimates that 55% of the global population currently lives in areas that experience a lack of clean water in at least one month per year. \"By the end of the century, this may be as high as 66%,\" remarks Jones.\n\n  \n[https://www.nature.com/articles/s41558-024-02007-0](https://www.nature.com/articles/s41558-024-02007-0)",
            "score": 6
        },
        {
            "depth": 0,
            "author": "AzulMage2020",
            "body": "Why are they building new gated cities in California only for the rich again???",
            "score": 4
        },
        {
            "depth": 0,
            "author": "avanross",
            "body": "Every one of those countries has a high average humidity and dew point, as well as a lot of sunshine. \n\nIn those conditions, a dehumidifier can be run indefinitely, outdoors, powered by a self contained miniature solar-panel and battery setup, to scalabley produce ~infinite clean water.\n\nStill shocks me that there arent any charities simply buying and donating dehumidifiers, solar panels, and batteries to families in areas without reliable access to clean drinking water",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Dead_Bartlett",
            "body": "Desalination is cheap, supposedly. This seems like a crisis that doesn’t need to be.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Lanky_Flamingo_221",
            "body": "Very selfish question : how will it impact us rich countries ? (Europe, NorthMerica)",
            "score": -1
        }
    ]
}