{
    "title": "A new study finds regular use of fish oil supplements may increase, not reduce, the risk of first-time stroke and atrial fibrillation among people in good cardiovascular health.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/FloydFunk  \nPermalink: https://amp.cnn.com/cnn/2024/05/22/health/fish-oil-supplement-dangers-study-wellness\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 653,
            "replies": [
                {
                    "depth": 1,
                    "author": "blueditdotcom",
                    "body": "Spot on! \n\nAnother thought: This sub is filled with poor studies on fat related supplement and the diets now a days. Any one care to elaborate on why that is?",
                    "score": 233,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TabaccoSauce",
                            "body": "Health, nutrition, diet, and quick-fixes are popular among the population at large. It’s also a very profitable industry. My guess is that a higher number of studies (due to lots of funding) and more people without subject matter expertise taking interest leads to more subpar studies being posted.",
                            "score": 71,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "blueditdotcom",
                                    "body": "That could be, just feel like it’s a rather flooded subject. There was this other study a couple of days ago where the fed rats with Crisco and called it “keto”-\n\nhttps://www.science.org/content/article/keto-diet-may-cause-organ-damage-mouse-study-finds",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Melonary",
                                            "body": "That study didn't have anything to do with the non-medical \"keto\" diet, which is typically quite different from how keto for medical reasons is used.  Medical keto diets aren't just low-carb.  They were doing cancer research, not determining if the average person should eat x or y.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "MalignComedy",
                    "body": "Breaking: chemotherapy associated with high rates of cancer",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "CleverAlchemist",
                    "body": "I am a 25 year old male. I have tried fish oil multiple times throughout my years. Everytime I use them for any extended period of time I begin to experience heart arrhythmia and palpitations. Fish oil does not seem heart healthy. I have no issues consuming fish. I used a reputable brand as well and I've tried krill oil, fish oil high in EPA and high in DHA to see if a particular component could be responsible for the issue. Both DHA and EPA oils caused me to experience heart arrhythmia.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JabbaWockey13",
                            "body": "Fish oil is presumed heart healthy for many reasons but arrythmias are often (not always) a very different type of heart disease than your standard leaky valve or atherosclerosis and other common heart diseases most people think of.  The first article from 2022 I found on Dr. Google indicates there is an association between high dose omega 3s and atrial fibrillation though the mechanism is not understood.\nSaying fish oil \"isn't heart healthy\" though is an oversimplification that at worst is outright misinformation as some types of heart disease get fish oils routinely prescribed.  Your anecdote did teach me something though.",
                            "score": 61
                        },
                        {
                            "depth": 2,
                            "author": "tdavis250",
                            "body": "DHA and EPA are supposed to be really good to help with adhd symptoms. Not sure if it relates or not, just find that interesting",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Peto_Sapientia",
                                    "body": "As someone who uses many supplements for ADHD/ASD including my normal medicine. This is disappointing. \n\nMy current regiment: \nWELLBUTRIN\nNOW Brand:\nDHA EPA FISH OIL\nCreatine Monohydrate\nL-Tyrossine\nVit E mixed with Tocopherols\nNOW Adam Multivitamin\nCholine & Inositol\nFiber",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tdavis250",
                                            "body": "I too have tried supplemental treatment to my adhd as well as medication.\n\nWelbutrin made me feel sick unfortunately. I'm currently on   methylphenidate, however it hasn't been as successful as lisdexamphetamine. However vyvanse isn't currently available where I live or many other places due to shortages. \n\nI tried atomoxetine and it made my testicles hurt. Apparently one of the more rare side effects is that it can make your epididymis swell.\n\nQelbree did absolutely nothing.\n\nNon-stimulants didn't help or only made it worse.\n\nI've tried multiple dha and epa's as well. Supplements haven't really helped for me personally and only high high doses of stimulants have even remotely helped.",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Moldy_slug",
                                                    "body": "Stimulants are the only med/supplement I’ve found helpful. However, I have also found that exercise - specifically a shitload of moderate to high intensity cardio - is as important as Adderall for keeping my symptoms under control.\n\nUnfortunately, my ADHD makes it especially difficult to stick to a routine….",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "tdavis250",
                                                            "body": "Exercise has absolutely destroyed my joints. I was a swimmer in high school and now I have permanent shoulder injuries, I ran a lot for awhile but my bow shaped tibias made my mcl tear and between my two legs I had 26 stress fractures, one was 3/4 of the way through my femur. I have an aversion to exercise since. Now, my hobbies keep me very active, both a bee keeper and woodworker I lift heavy stuff a lot and my line of work has me walking several miles a day during the summer. I just can't do the high intensity training very easily.",
                                                            "score": 2
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Peto_Sapientia",
                                                    "body": "Personally, I have found that if you're not dosing yourself with fiber and I'm not talking about like pharmaceutical made fiber but like daily large amounts of fiber intake from normal food, then more than likely that would be my first step. \n\nI can only speak from my experience but fiber has absolutely made a huge difference. \n\nAnd I took these basically one by one. Testing them out before grouping them together. \n\nThe fish oil. I didn't really notice a big difference in anything really but it was supposed to be good for you so I take it. \n\nThe l- thyrosine allows me to be creative again. Just a 750 mg pill. Will absolutely kick my brain into overdrive. I also remember more details. My short-term memory isn't quite as bad. And I do more tasks. And this is effective even while off of Wellbutrin. \n\nThe creatine has helped my memory though I haven't been on it long enough to tell how big of a difference there is. I'm figuring it's pretty small.\n\nThe other one that does the brain stuff. I haven't really noticed a big difference. At least I don't think.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "NotTheMarmot",
                                                            "body": "Does the fiber help with gut health, which in turns helps your brain or something? I have adhd pretty bad and I've been in a permaslump. I work high hours and eat 90% garbage foods. I think I'm going to keep working on my diet and try l-thyrosine. Guitar/music is my main hobby/obsession but I never seem to be able to buckle down and practice/learn in any real concerted way for more than a day or two.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Peto_Sapientia",
                                                                    "body": "I don't think that we understand the mechanisms completely, but most or at least a very large portion of the neurotransmitters are produced in the gut is what we're finding. So when the gut is unhealthy, it cannot produce enough of whatever it's producing and therefore causes problems. \n\nPersonally get some like oats. Let me see, The ones that I use are from Aldi's and they are called millville granola, crunchy granola, whole grain, oats, almonds and honey. They have 4 g of fiber. But lots of other good stuff too. I then do the shredded wheat stuff. Broccoli cauliflower you can get pre-packaged things of ancient grain rice from Walmart. They have a few other options too for that. That's just a throwing the microwave kind of thing. Onions are good too. Peppers. Apples, oranges navels\n\n All of these things are very high in fiber. The whole grains you can eat like a cereal. You can just munch on it during the day. I personally prefer to eat mine with the keto yogurt that they sell at Walmart best yogurt that I've ever had, but I just put two spoonfuls of yogurt mix it on the grains. I measure my grains out so that I'm not getting too much as far as serving size. And it's like a little sweet treat. \n\nJust lots of little things is what I did.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "NotTheMarmot",
                                                                            "body": "How crunchy are we talking? My teeth are unfortunately kind of messed up. I can eat popcorn, and the soft style granola bars.  But hard nuts and the like are kind of hard for me to eat. I can always just make it normally, but I'm running around in the shop 10 hours a day, so something healthy and easy to eat without much prep would be really nice. I reckon I could do regular oatmeal in the morning, take some fruit to work, but I could still use something higher calories. I weigh 215(not shredded but not fat either, I have a reasonable amount of muscle) and it takes me about 3500-4k calories a day to maintain. Even if I eat more healthy, I'm still going to have to probably keep a couple of higher calories things in just to stop my weight from plummeting too fast. Too big a deficit and I'll probably wind up feeling even worse as active as I am.",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Bones_and_Tomes",
                                                                    "body": "Think of your gut as the chemical factory for your brain. If it isn't working well then your brain won't get the chemicals it needs to run adequately.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "NotTheMarmot",
                                                            "body": "Also do you mean l-tyrosine?",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "CleverAlchemist",
                                    "body": "That is why I bought the supplements. For the mental benefits. Krill oil was probably the best. I experienced significant clarity in my thoughts. My brain felt like melted butter. So smooth. Silky. But unfortunately the heart palpitations ruined a good thing.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "tdavis250",
                                            "body": "I wish I got the same effects. Somehow it doesn't seem to beast effective for me :( I'd death with heart palpitations than the constant adhd symptoms.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CleverAlchemist",
                                                    "body": "I can recommend some stuff. I'll DM you so I don't spam the post.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Heretosee123",
                            "body": "Arguably your personal experience isn't enough to say whether it is or isn't heart healthy. Only if it is or isn't for you (not that there aren't problems with bias this way either).",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CleverAlchemist",
                                    "body": "Fair enough. I've seen others online echo the same sentiment though which prompts me to share my experience. I believe the reason for me is because omega 3 lowers estrogen. I am a skinny individual with minimal fat so I lack estrogen. So the omega 3 caused my estrogen to drop even lower which contributed to my heart palpitations. I lost significant weight taking omega 3's as well. The main reason I couldn't justify using them.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "The_Orphanizer",
                            "body": "I had a similar issue with a krill (or shrimp maybe?) supplement. I bought it for joint health. At half the recommended dose it was giving me an elevated heart rate (didn't measure it, but I check my pulse periodically, and it wasn't normal for me), and severely elevated anxiety (not quite panic, but well above my run-of-the-mill \"constant low-grade stress\" level of anxiety). Tried them for a week before realizing what was going on. The day I stopped, they went away. Bottle in the trash.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ACoconutInLondon",
            "body": "Ok, there's obviously the issue with fact that they didn't actually track: dose, frequency or composition of the fish oil taken. \n  \n>Thirdly, information on dose and formulation of the fish oil supplements was not available in this study, so we could not evaluate potential dose dependent effects or differentiate between the effects of different fish oil formulations.\n   \nAnd of course that it was all self reported.  \n  \nBut THIS is what really caught my eye:\n   \n>Vegetable consumption* (times/week, %) <0.001\r  \n <2 6928 (8.1) 28365 (6.8)\r  \n2- 23090 (27.0) 119066 (28.7)\r  \n≥4 55402 (64.9) 267926 (64.5)\n  \n>\rFruit consumption* (times/week, %) <0.001\r  \n<2 23763 (27.8) 115111 (27.7)\r  \n2- 34019 (39.8) 169869 (40.9)\r  \n≥4 27669 (32.4) 130467 (31.4)\n  \nTimes/week. \n  \nIs it me? Is that really how people eat?\n  \nEdit: formatted data\n  \nVegetable consumption   \n<2 times per week 8.1% | 6.8%    \n2-3 times per week 27.0% | 28.7%   \n4 or more times per week 64.9% | 64.5%\n\nFruit consumption   \n<2 times per week 27.8% | 27.7%    \n2-3 times per week 39.8% | 40.9%   \n4 or more times per week 32.5% | 31.4%",
            "score": 205,
            "replies": [
                {
                    "depth": 1,
                    "author": "netroxreads",
                    "body": "I cannot interpret that consumption , it comes as a single line . How odpften do they eat a week?",
                    "score": 60
                },
                {
                    "depth": 1,
                    "author": "sabertoothRhinoonihR",
                    "body": "For people interested, the source is at [https://bmjmedicine.bmj.com/content/bmjmed/3/1/e000451/DC1/embed/inline-supplementary-material-1.pdf](https://bmjmedicine.bmj.com/content/bmjmed/3/1/e000451/DC1/embed/inline-supplementary-material-1.pdf) from pages 6-8. Those pages will also give you an idea of the health of the participants in this \"experiment.\"",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "retrosenescent",
                    "body": "weird they don't even have a category for 4 or more times PER DAY??? I would massively skew the data\n\nbut to answer your question, yes, that is how most Americans eat",
                    "score": 99,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NurmGurpler",
                            "body": "Wrong country… this a UK study. \n\nAs an American, I was amazed at how infrequent vegetables are in the British diet. I love the country, but that’s just not their strong suit. \n\nSarcasm, pubs, humor, tea, and fish & chips? Different story.",
                            "score": 39
                        },
                        {
                            "depth": 2,
                            "author": "ACoconutInLondon",
                            "body": "That's not at all what I'm used to. I'm from California.\n  \nAlso, this data is the UK.  \n  \nAs another person pointed out, most people I know are more than a day.\n  \nIn the US, it's normal for there to be a side of veg at a meal, even with fast food.  \n   \nIt's actually not a normal part of going out to eat here in the UK.",
                            "score": 41,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SeparateIron7994",
                                    "body": "Side of veg with fast food???????????",
                                    "score": 40,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "radred609",
                                            "body": "I mean, if you include potato...",
                                            "score": 23,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Immersi0nn",
                                                    "body": "Typically you would, unless you're in the camp of \"potatos should be considered a grain\" which certainly has a decent argument for it.",
                                                    "score": 5,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "valleyman86",
                                                            "body": "It really doesn't matter what you/we classify it as. \"Vegetable\" is a culinary term (not really scientific) to describe eating any part of a plant. You got fruits (has seeds), tubers (carrots), flowers, leaves... etc. \n\nLooking it up. Potatoes are low in cals, no fat, no cholesterol and no sodium but pretty high in vitamins. Note: This is obviously ignoring that most fast food potatoes are fried in oil and salted.",
                                                            "score": 3
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "ACoconutInLondon",
                                                            "body": "It's a starch.  \n  \nSame for beans which I'd possibly otherwise put in the veg category from a nutrition perspective.",
                                                            "score": 9,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Immersi0nn",
                                                                    "body": "Eh? Is starch a classification of plant? I thought it was like a modifier to vegetable, \"starchy vegetable/non-starchy vegetable\".",
                                                                    "score": 7,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "ACoconutInLondon",
                                                                            "body": "As I was reminded the other day, fruit has a proper definition - vegetable does not. \n     \nVegetable is apparently just \"a part of a plant used for food.\"\n  \nTechnically grains are fruits and seeds. We just call them grains to make it easier for us to differentiate what we mean.\n  \nPotatoes are considered starchy vegetables, like corn, beans, winter squash, etc.\n  \nIt just means they're higher in carbs and calories than non-starchy vegetables.\n   \nEdit:   \n  \nIt's like saying \"leafy greens\" which are the edible leaves of whatever plants, but generally means high in water and nutrients but low in calories.\n  \nBut also, the starchy and higher carb designation is important for people who have to watch their blood sugar, like diabetics.",
                                                                            "score": 10,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Iminurcomputer",
                                                                                    "body": "In that case, are fruits vegetables but vegetables aren't fruit? If it's not an animal product, is it a vegetable?",
                                                                                    "score": 3
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "flammablelemon",
                                            "body": "Yeah, fries (potatoes), onion rings (onions count), salads, chilis (beans and peas), etc.. Mains like pizzas, burgers, sandwiches, and wraps also often have vegetable toppings. It's odd to completely avoid fruits and vegetables on a regular basis even on a fast-food diet.",
                                            "score": 9
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "MyFiteSong",
                            "body": "Maybe in the southeast or extremely rural areas.  I don't think most Americans eat like that, almost completely leaving vegetables and fruits out of their diets.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "retrosenescent",
                                    "body": "They totally do. Something like 70% of Americans are overweight or obese. They are not eating vegetables unless they're deep fried and covered in cheese.",
                                    "score": -7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Moldy_slug",
                                            "body": "I’m overweight and I eat vegetables 2-4 times per day, usually fresh, steamed, in soups or roasted. Never fried.\n\nYou can easily be overweight while eating plenty of vegetables. It just means you eat lots of other crap too.",
                                            "score": 48,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "flammablelemon",
                                                    "body": "You can also gain weight when eating nothing but vegetables though, it's not like they have no calories. Starchy vegetables in particular.",
                                                    "score": 12
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "MyFiteSong",
                                            "body": "Plenty of obese people eat vegetables more than once or twice a week.",
                                            "score": 35
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Few-Stop-9417",
                                            "body": "They got cheese covered broccoli at this restaurant down the road , very popular",
                                            "score": 11
                                        },
                                        {
                                            "depth": 4,
                                            "author": "celticchrys",
                                            "body": "This just isn't true. Huge swathes of the rural South eat a ton of veggies. They just _also_ eat all the bad things. IDK where anyone gets the idea that any one type of food consumption makes you avoid other foods. And, have you see a Pittsburgh salad (topped with cheese and french fries)? Plenty of veggies being eaten _with plenty of junk_ all over America.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Nylear",
                                            "body": "You can be fat and eat vegetables, it's the desert and snacks that get you.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "PaulTheMerc",
                                                    "body": "it's the portion sizes too.  Arguably even more so.",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "stablegeniusss",
                                            "body": "70% is way over. I think it’s closer to 40% obesity rate.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "eukomos",
                                                    "body": "It’s 70% if you include overweight people.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "stablegeniusss",
                                                            "body": "I don’t go by that metric since someone who is 6”1 is overweight if they’re over 188",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "eukomos",
                                                                    "body": "…you accept BMI for obesity but not for overweight? Do you weigh more than 188lbs, pechance?",
                                                                    "score": 2
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Electrical-Theme-779",
                    "body": "That data is confusing. Is it 4 or more times as in 4 or more days of eating fruit a week or 4 or more portions of fruit a week. I eat about 5 different types of fruit a day.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ACoconutInLondon",
                            "body": "It's confusing because its hard to believe, but other than that - \"Times/week\" seems like it would be portions? \n   \nIt's be weird if it means meals at which veg is eaten. \n  \nAnd even then, it still seems low if translated as eaten at 2-3 meals per week.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Electrical-Theme-779",
                                    "body": "No wonder they had heart / CVD disease.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Raudskeggr",
                    "body": "Does the iceberg lettuce on your McChicken count?  :p\n\nOn a serious note, the formulation data is a no-go, because the companies keep that proprietary knowledge pretty close to their chests.\n\nAnd it's also not accounting for poor regulation, such as cases where the so-called \"fish oil\" contains almost no EPA or DHA, which are the Omega 3's people take these supplements for to begin with.   Trust me, the cheap stuff you buy from Walmart is cheap for a *reason*.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ACoconutInLondon",
                            "body": "Yeah, which makes it doubly a thing if you read the article and it talks about the existence of prescription fish oil - for cardiovascular patients.  \n  \nSo it's quite likely the diagnosed group was getting better stuff. \n  \nThen on top of that, because it's prescribed it's a known amount, with a set frequency and they're probably taking it much more regularly.",
                            "score": 8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DarnDagz",
                    "body": "It’s as bad as the Women’s Health Study.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ACoconutInLondon",
                            "body": "If that's the case, it's even weirder that they did it that way as they specifically say \n  \nBaseline dietary data were obtained from a dietary questionnaire completed by the patient or by an interviewer. **The questionnaire was established for each nation (ie, England, Scotland, and Wales) to assess an individual's usual food intake (oily fish, non-oily fish, vegetables, fruit, and red meat).**\n  \nSo you really think they'd have taken that into account.  \n    \nSo I'm not sure that's it, but who knows. The methodology of so much of this study is so unclear.  \n  \nIt's honestly not even a repeatable study I'd argue, which is pretty serious when it comes to research.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jellybeansean3648",
                    "body": "Not even one veggie/fruit per day?  I know it can be hard to get the five a day in, but I've always thought of one a day as the absolute bare minimum.\n\n  \nA full British breakfast has vegetables in it for god's sake.  It's not the only junk food to come with veggies as a garnish either.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "redmagor",
                            "body": "A half of a watery, tasteless tomato, a scoop of tinned, highly processed sugary beans, and a fistful of mushrooms (in some breakfasts) do not really constitute a vegetable portion. Moreover, nobody eats a fry-up every day.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CleverAlchemist",
                    "body": "I am a 25 year old male. Heart is healthy far as I know. I have tried fish oil multiple times throughout my years. Everytime I use them for any extended period of time I begin to experience heart arrhythmia and palpitations. Fish oil does not seem heart healthy. I have no issues consuming fish. I used a reputable brand as well and I've tried krill oil, fish oil high in EPA and high in DHA to see if a particular component could be responsible for the issue. Both DHA and EPA oils caused me to experience heart arrhythmia.",
                    "score": -17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ACoconutInLondon",
                            "body": ">Heart is healthy far as I know\n\nDid a doctor diagnose you with arrhythmia while you were taking fish oil?",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CleverAlchemist",
                                    "body": "Why would I go to the doctor? that is a waste of money. I am poor. I just stopped taking the fish oil and the heart palpitations stop.  it's not like it caused permanent heart damage. The arrhythmia only lasted as long as the fish oil was working through my system. I do go to the doctor every so often and I'm told my heart sounds very strong and healthy.",
                                    "score": -15,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CleverAlchemist",
                                                    "body": "Okay well isn't it possible I was experiencing both? arrhythmia from the supplement and palpitations from anxiety from the arrhythmia? A compounded effect? I'm just describing my experience. Y'all some haters for real.",
                                                    "score": -6
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "posttrumpzoomies",
                                            "body": "How do you know it was an arrythmia? Palpitations are not indicative of an arrythmia.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "CleverAlchemist",
                                                    "body": "Low estrogen levels can cause heart palpitations by overstimulating the heart, which can make it beat faster or irregularly\n\nOmega-3 fatty acids are a good source of lignans — compounds that may have a weak estrogen effect. When a weak estrogen-like substance takes the place of your body's natural strong estrogen in a breast cell's estrogen receptor, then the weak substance can act as a relative anti-estrogen\n\nHeart palpitations are a direct result of lower levels of the hormone estrogen, which leads to an overstimulation of the heart. Such a drop in hormone production can be linked to an increase in both heart rate and frequency in palpitations, and nonthreatening arrhythmias.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "posttrumpzoomies",
                                                            "body": "Ok but still not necessarily, probably not, an arrythmia without an ecg. Palpitations can be caused by lots of things. Dehydration for example.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Electrical-Theme-779",
            "body": "Cohort studies aren't the best. Did I see that the fruit and veg intake of the participants was really, really low? Also it doesn't measure the dose of supplement. Seems a bit.. erm... shaky.",
            "score": 264,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheOSU87",
                    "body": "Health science is extremely difficult because to do a true A/B study you need to lock hundreds of people away for decades and change only one variable in their lifestyle and keep everything else constant.\n\nSince you can't do that you have so many other variables which is why data is often time conflicting.",
                    "score": 63,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Electrical-Theme-779",
                            "body": "Health science, particularly nutrition science, is a minefield.",
                            "score": 20,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TimmyC",
                                    "body": "I mean we accept it for cigarettes..",
                                    "score": -4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "funkiestj",
                                            "body": "the epidemiological study signal for smoking tobacco was so huge you could safely draw inferences before learning mechanisms of action.  We have since learned many of the mechanisms of action.\n\nEven the case of tobacco, science **did not** say \"well, the signal to noise in the epidemiological studies was so high we don't have to ever bother learning the mechanisms of action\". \n\nEpidemiological studies point to the places we should study further.\n\n  \nLastly, the absolutely lowest quality data is \"self reported\" data.  Advances in wearables that can give more and more detailed accurate information is where future advances will come from because they will reduce the cost of collecting accurate data.  WHOOP, Apple Watch and other wearables are just the beginning.",
                                            "score": 12
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "nmaxfieldbruno",
                    "body": "You might say it seems a bit… fishy?",
                    "score": 138,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kellzone",
                            "body": "Depends on how it scales.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bisikletci",
                                    "body": "I sea what you did there",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "-UnicornFart",
                            "body": "HA. Well played.",
                            "score": 5
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Current_Finding_4066",
                    "body": "If it relies on self reported data, the data itself is far from reliable.",
                    "score": 34
                },
                {
                    "depth": 1,
                    "author": "motus_guanxi",
                    "body": "Or the quality of the oil..",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ItsCowboyHeyHey",
                    "body": "I suspect the problem is the oil itself. A massive, multi-decade study by Caldwell Esselstyn of the ClevelandClinic determined that all oils have a negative impact on cardiovascular health.",
                    "score": -12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Electrical-Theme-779",
                            "body": "I'm not so sure about that but I will read with interest later. Important to have an open mind.",
                            "score": 11
                        },
                        {
                            "depth": 2,
                            "author": "reddituser567853",
                            "body": "I don’t think zero fat worked too well in the 80s",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tom_swiss",
                                    "body": "No one has advocated a zero fat dlet. And while there was a marketing fad for \"low fat\" processed foods   starting in the 1980s, if you put a stick of butter in a pound of sugar that counts as \"low fat\",  that's how that worked. American fat consumption has been high since at  least the early twentieth century and remains high today.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "oh-propagandhi",
                                            "body": "According to the FDA, a food is considered low-fat if it has 3 grams or less of fat per 100 grams and no more than 30% of its calories come from fat. A food is also considered low-fat if it has 3 grams or less of fat per serving.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ItsCowboyHeyHey",
                                    "body": "Who is advocating zero fat? Do you think fat comes exclusively from processed oils?",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CleverAlchemist",
                    "body": "I am a 25 year old male. I have tried fish oil multiple times throughout my years. Everytime I use them for any extended period of time I begin to experience heart arrhythmia and palpitations. Fish oil does not seem heart healthy. I have no issues consuming fish. I used a reputable brand as well and I've tried krill oil, fish oil high in EPA and high in DHA to see if a particular component could be responsible for the issue. Both DHA and EPA oils caused me to experience heart arrhythmia.",
                    "score": -14
                }
            ]
        },
        {
            "depth": 0,
            "author": "Background-Piglet-11",
            "body": "I read the actual study, and they admit that their limitations were that they didn't know the doses of omega 3 and that the study included hospital patients that could have gotten afib from surgery, medication adverse reactions, etc that could cause afib.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "Hard-To_Read",
                    "body": "That last part completely invalidates the results.  Moving on.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Background-Piglet-11",
                            "body": "Exactly my point. The whole study is moot.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "UvaroviteKing",
            "body": "What a poorly conducted study. The methods are horrendous. This should honestly be removed from the sub, especially with such a leading title like that.",
            "score": 90,
            "replies": [
                {
                    "depth": 1,
                    "author": "kdostert",
                    "body": "I came here to find what Redditors were saying about this article after reading it on my own in the morning news, because I couldn’t believe it. I am beginning to really loathe opening and reading anything CNN these days.",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "CMK37",
                            "body": "I did the same thing. It was a shocking/click-baity title. Glad to hear some feedback from science Redditors. It’s a shame CNN is getting so unreliable.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Mewnicorns",
                    "body": "My personal experience has been that when major news outlets are reporting on study findings, odds are they are misrepresenting what the study actually says (usually by omitting lots of hedge words like “could” or “might,” or neglecting to mention a minuscule sample size or lack of controls). \n\nIt is very unbecoming of this sub’s mission to allow a CNN report on a study rather than linking to the study itself. A lot of these studies are only intended to be preliminary to see if there is anything worth following up on with additional rigor (and therefore cost). They’re not meant to be a definitive and final word on the subject.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "REGINALDmfBARCLAY",
                    "body": "I feel like someone says that about every single study posted on here",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "FloydFunk",
                    "body": "It’s from CNN.  To post here, you need to state a result from the study in the title.  The title is a result from the study .  If you don’t like the study, that’s fine, that’s why I posted it here to be discussed.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Material_Trash3930",
            "body": "Interesting. I'm pretty sure the body of evidence is still largely in favour of fish oil supplements, but I'll have to continue to pay attention.",
            "score": 75,
            "replies": [
                {
                    "depth": 1,
                    "author": "ACoconutInLondon",
                    "body": "This study was unable to control for fish oil - the thing it was supposed to be studying.  \n     \nI don't think it's really good for much.  \n  \nThe thing I find more interesting is a) the veg and fruit consumption of the people in the study and b) the reported \"physical activity\" levels vs the rest of the data like obesity and eating habits.\n  \nEdit: and also I learned of the existence of prescription fish oil. Which it's kind of important if the pre diagnosed people are taking a much better quality/regulated fish oil vs a standard \"supplement\" quality fish oil.",
                    "score": 78,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ACoconutInLondon",
                                    "body": "They used already available data for a group of people and excluded and accounted for things based on that.  \n  \nThey did, for example, look at BMI, drinking and smoking habits and those are also risk factors. \n   \nWe don't know whether migraine data wasn't available to them or they just didn't look at it if it was.",
                                    "score": 8,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ACoconutInLondon",
                                                    "body": "Good point, they really were all over the place.  \n  \nThey did the questionnaire for fish oil use and some other things. But then gender was registered from information in the UK bio bank for some reason and \n\n>Information on the use of drugs, including antihypertensive drugs, antidiabetic drug, and statins, was extracted from treatment and drug use records.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BlackAdam",
                                    "body": "Dude, you just blew my mind. I suffered from migraines as a kid and teen. I started taking fish oil as a supplement in my late teens (saw a documentary about how it might boost your ability to concentrate and perform cognitive tasks) and my migraines stopped right around that time in my life. I’ve taken fish oil supplements ever since (~20 years) and now I find out it might have contributed to preventing the migraines. Wild.",
                                    "score": 5
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "cssc201",
                            "body": "Also it doesn't seem it controlled for family history or other factors that could cause someone to take fish oil",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MyFiteSong",
                                    "body": "Yah, that's HUGE.  My family is very high risk for high cholesterol and heart disease. My dad died at 61 from it.  My heart is healthy but I've had an \"extra heartbeat\" since I was a kid.  It's not a health risk, doesn't affect the ability of the heart to function, and doctors don't really know why this happens in people, but it was enough to get on their radar.  So I've been prescribed a fish oil supplement since my late teens.",
                                    "score": 8
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "FineProfessional2997",
                    "body": "It kinda read to me as instead of taking Fish Oil supplements, take a prescription…emphasis on the push on prescription drugs…whenever I see that, it’s a red flag to me of Big Pharma being their usual pushy salesmen selves…",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "lolitsbigmic",
            "body": "But if you have a cardiac condition it is protective, like pre existing a fib reduce myocardial infraction.",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "ACoconutInLondon",
                    "body": "Given that they were unable to track the dose, frequency or source of fish oil, I don't think it says much about those who didn't already have heart problems.  \n  \nI wonder if it showing something for those already diagnosed with heart problems is that those people would have a prescription for medical grade fish oil - which is something the article brings up.  \n   \nSo a) it's a medication not a vitamin at that point so it would actually be regulated, b) there is likely a medically decided dose and c) they are probably actually taking it regularly since it's part of their medication regime.  So even though they weren't tracked, they are arguably more likely to be regular users and taking better stuff.",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "CleverAlchemist",
                    "body": "I am a 25 year old male. I have tried fish oil multiple times throughout my years. Everytime I use them for any extended period of time I begin to experience heart arrhythmia and palpitations. Fish oil does not seem heart healthy. I have no issues consuming fish. I used a reputable brand as well and I've tried krill oil, fish oil high in EPA and high in DHA to see if a particular component could be responsible for the issue. Both DHA and EPA oils caused me to experience heart arrhythmia.",
                    "score": -15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LuckyHedgehog",
                            "body": "Are you going to spam that on every comment in this post?",
                            "score": 10
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "dmlane",
            "body": "Here are some articles showing positive effects of fish oil.\n[1](https://www.bmj.com/content/368/bmj.m456)\n[2](https://www.frontiersin.org/journals/neuroscience/articles/10.3389/fnins.2022.910977/full)\n[3](https://lipidworld.biomedcentral.com/articles/10.1186/s12944-020-01214-w)\n[4](https://www.sciencedirect.com/science/article/abs/pii/S1056872719312218)\n\nalthough only the first has  to do with CVD.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "bw1985",
            "body": "The quality of the fish oil is everything.  polyunsaturated fat can oxidize relatively easily compared to other types of fat.  If you’re taking rancid fats that will certainly be detrimental to your health.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "KingofValen",
                    "body": "How can I tell if the fish oil i am taking is a polyunsaturated fat",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bw1985",
                            "body": "All fish oil contains polyunsaturated, that’s what omega 3 is.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KingofValen",
                                    "body": "How can you tell if the fish oil is rancid then?",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Siriot",
                                            "body": "1) If it smells particularly fishy (even as a perfectly intact tablet/ capsule).\n\n2) If it looks discoloured\n\n3) If you have reason to suspect it, take a bit and taste it. If it's fine, it'll be neutral or only slightly fishy. Otherwise, you should be able to tell.\n\n4) If you start getting stomach cramps or discomfort for no apparent reason and you've ruled out other causes, it's reason to suspect they may be rancid.\n\nIf they're stored in cool, dry conditions, they're almost certainly fine up to the use-by date. It's normally only if storage conditions are suspect or you're unable to verify the use-by date for whatever reason you might run into this issue.",
                                            "score": 5
                                        },
                                        {
                                            "depth": 4,
                                            "author": "crodensis",
                                            "body": "If you open the fish oil and it smells fishy and not neutral, it's probably rancid",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Liizam",
                                            "body": "If you get oily diarrhea, they expired",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Liizam",
                    "body": "Worst diarrhea of my life was after eating expired fish oil. The weird oily smell of it, just ahhhh. I couldn’t figure it out for a long time.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Omg_Itz_Winke",
            "body": "Next year: fish oil good! \nYear after: fish oil baaad\nYear after that: fish oil goo..",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "zalgorithmic",
                    "body": "Does it alternate with eggs?",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "The_Singularious",
            "body": "Wonder how this relates to non-fish Omega supplements like algae? Same stuff without the stank (ok, it’s a different kind of stank).",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Xbalanque_",
            "body": "That article has paragraphs that don't seem to be in the right order .\n\nWhat was the doctors conclusion? Don't take over the counter fish oil, but if you have heart disease, prescription fish oil might be useful? Is that it?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Both_Lychee_1708",
            "body": "Again, Newton's Law of Studies: For ever study there is an equal an opposite study",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SelarDorr",
            "body": "Not the first time such an association has been reported.\n\n  \n[The Potential Cardiometabolic Effects of Long-Chain ω-3 Polyunsaturated Fatty Acids: Recent Updates and Controversies](https://www.sciencedirect.com/science/article/pii/S2161831323002831#fig5)\n\n\"studies of both the EPA/DHA combination and EPA alone showed a significant increase in risk of new-onset atrial fibrillation\"\n\n\"The [number needed to harm](https://www.sciencedirect.com/topics/medicine-and-dentistry/number-needed-to-harm) was 153. Meta-regression analysis showed that a significant dose response was observed in new-onset atrial fibrillation with EPA plus DHA supplementation (*P* = 0.022) ([Figure 5](https://www.sciencedirect.com/science/article/pii/S2161831323002831#fig5)B). This result was consistent with a previous study finding of a dose-related increase in atrial fibrillation risk over an ω-3 PUFA supplementation range of 1 g/d to 4 g/d \\[[94](https://www.sciencedirect.com/science/article/pii/S2161831323002831#bib94)\\]. In people with established CVD or multiple CV risk factors, LC ω-3 PUFAs increased risk of atrial fibrillation \\[[5](https://www.sciencedirect.com/science/article/pii/S2161831323002831#bib5),[6](https://www.sciencedirect.com/science/article/pii/S2161831323002831#bib6),[95](https://www.sciencedirect.com/science/article/pii/S2161831323002831#bib95)\\].\"",
            "score": 2
        },
        {
            "depth": 0,
            "author": "FloydFunk",
            "body": "I had to repost this because I guess I got the title wrong.\n\nAnyway, I found this interesting and came here to see if it was being discussed and didn’t see it yet.  \n\nHere’s the link to the actual study:\n\nhttps://bmjmedicine.bmj.com/content/3/1/e000451",
            "score": 2
        },
        {
            "depth": 0,
            "author": "jobitobi",
            "body": "Make it make sense. According to the study taking fish oil is helpful when you have a heart disease but unhealthy when you don't?\n\n[https://bmjmedicine.bmj.com/content/3/1/e000451](https://bmjmedicine.bmj.com/content/3/1/e000451)\n\n>*Regular use of fish oil supplements might be a risk factor for atrial fibrillation and stroke among the general population but could be beneficial for progression of cardiovascular disease from atrial fibrillation to major adverse cardiovascular events, and from atrial fibrillation to death. Further studies are needed to determine the precise mechanisms for the development and prognosis of cardiovascular disease events with regular use of fish oil supplements.*",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "ACoconutInLondon",
                    "body": "There is a lot of questionable stuff going on in this study, and specifically stuff that wasn't accounted for even tracked. \n  \nThey didn't actually track how much fish oil people took, how often, or what kind/source.  \n  \nAnd fish oil is literally the subject of the study. \n  \nI wouldn't put too much stock into this study.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Critkip",
            "body": "This sub should be called r/anti-science",
            "score": 2
        },
        {
            "depth": 0,
            "author": "bayoubrandon",
            "body": "We also already know that the key in fish oil effectiveness is EPA and not really with DHA. OTC supplements are woefully under dosed in the EPA component.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Adamworks",
            "body": "A case of collider bias? (someone tell me if I'm right)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "keralaindia",
            "body": "Any blood thinner can increase risk of hemorrhagic stroke.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Emergency_Party2916",
            "body": "What if I eat salmon is that bad?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "JubalHarshaw23",
            "body": "Mistaking coincidence for causality.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "JuniorPomegranate9",
            "body": "Completely anecdotal but confirmed through multiple trials on myself: fish oil supplements give me heart palpitations",
            "score": 1
        },
        {
            "depth": 0,
            "author": "spookyjibe",
            "body": "We need a rule where a media summarized study must link to the study or not be allowed.\n\nThere are so many issues with study design with this article is written, without looking at the study itself, this article is essentially meaningless.\n\nIt doesn't even suggest age was taken into consideration when describing a result in number of 1st time incidents. Like, obviously 1st time heart incident or stroke is going to peek at some age between 40 and 65... \n\nThe issue with allowing \"media summary\" is it introduces any quality or truthfulness of reporting. You could have an article which directly lies about the results of a study and it still would be allowed on this sub.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kants_Paradigm",
            "body": "Adding to this that there is no such thing as unpolluted fish oil and any benefits gained will be negated by that. Fact for 2024 and many years before... there is not such thing as unpolluted fish and the junk they swim in will be concentrated in the oil we make from them.\n\nIf you want EPA/DHA benefits without pollution go for algea based made in a clean setting. At least you know that if there are benefits you will get them without microplastics , heavy metals or other junk found in fish products.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Humble-Roll-8997",
            "body": "Oh great! I’ve taken it for years on the advice of my doctor. Now what??",
            "score": -2,
            "replies": [
                {
                    "depth": 1,
                    "author": "moredencities",
                    "body": "Continue listening to your doctor, and don't let the findings from one study influence your opinion as strongly especially a cohort study based on self-reported data with results that diverge from the general consensus formed from the findings of multiple studies.",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "seztomabel",
                    "body": "Have a glass of scotch and smoke a cigar.",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PabloBablo",
                            "body": "I mean, that worked for that army vet who lived to 112",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "seztomabel",
                                    "body": "I don't know if it's funny or sad but most of the health and wellness folks won't live as long as him",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dnarag1m",
                    "body": "Eat fatty small fish (mackerel, sardines, herring). Fish oil can contain contaminants, can be heavily oxidised. ",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Humble-Roll-8997",
                            "body": "I already do that. I guess I’ll think about taking less fish oil supplements.",
                            "score": -3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "cubej333",
            "body": "Last year I switched from fish oil ( which I had used occasionally for a couple of years, before that I had been total vegetarian) to having fish once a week. This supports that decision.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "ACoconutInLondon",
                    "body": "Food source is always better if people can do it.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "retrosenescent",
                            "body": "Food source is DEFINITELY not always better. Fish is a great example. Fish can have parasites, heavy metals, plastic chemicals, dioxins, etc. Fish is a very dirty, unhealthy food in general.",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kooky-Information-40",
            "body": "What I take away from this report is that among folks who are healthy, with no risk factors, and have, an otherwise efficient heart, those who reported taking fish oil supplements experienced CV issues including stroke and afib compared to those who reported taking no fish oil. \n\nMakes sense to me. I mean, if heart is in good shape, does it need added oil?  \n\nPerhaps it challenges a social view that we cannot consume too much fish oil and other healthy fats.\n\nIt's a data to build upon.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "yuriydorogoy",
            "body": "Ray Peat was right (again)",
            "score": 0
        },
        {
            "depth": 0,
            "author": "veganhimbo",
            "body": "I mean fish oil bio accumulates a lot of not good for you stuff. Id be curious to see how the numbers compare to algae oil.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "DrVonSchlossen",
            "body": "In my experience, fish oil supplements weakened my immune system. I get my omega 3 from flax now.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Kooky-Information-40",
            "body": "It really makes sense when you think about it.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -10
        }
    ]
}