{
    "title": "New research finds that politicians who frequently change their policy stances are viewed less favorably by the public, regardless of gender.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/mvea  \nPermalink: https://www.psypost.org/no-gender-bias-in-voter-reactions-to-political-flip-flopping-study-finds/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mantene",
            "body": "Politicians who change their policy stance based scientific/academic data rather than polling data should be praised. :-(",
            "score": 309,
            "replies": [
                {
                    "depth": 1,
                    "author": "ctothel",
                    "body": "I think this is why it took so long to “invent” science. And why so many people struggle with it as a concept today.\n\nDuring the pandemic the sheer number of people complaining about the evolving advice astounded me.\n\nScientifically literate people don’t have trust issues because they know you converge on truth over time.",
                    "score": 175,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Hurtin93",
                            "body": "I have trust issues of politicians BECAUSE their jobs depend on being popular, not right. Not that they’re good at even that.",
                            "score": 58
                        },
                        {
                            "depth": 2,
                            "author": "parkingviolation212",
                            "body": "I know someone who explicitly states she doesn’t trust scientists because they always change their minds. This is to her proof that the Bible is the only truth.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "AccidentalBanEvader0",
                            "body": "You can still have trust issues and be scientifically literate. I'm scientifically literate (or I'd like to think so) but know multiple communities I'm a part of or adjacent to have been systemically underserved and mistreated by modern medical practitioners for decades. Scientifically literate people know that the current wisdom is not necessarily guaranteed to be accurate, safe, or hold up long term.\n\nThat said, I want to specify I'm not issuing anti-vax apologia here. That's more than settled in my book. But you can be informed and educated without blindly trusting public health authorities who may or may not have ulterior motives. Queer, Black, female, and neurodivergent communities can all speak to the intentional mistreatment of vulnerable people for ages by medical professionals.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "BigSkyFace",
                            "body": "I remember getting so frustrated during the pandemic at people who couldn’t seem to understand that scientists were sometimes advising plans in case of things that MIGHT happen and weren’t necessarily guaranteeing the worst case scenarios would be our reality",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Potential-Drama-7455",
                            "body": "That's because the evolving advice was based on politics rather than science in many cases.",
                            "score": -5
                        },
                        {
                            "depth": 2,
                            "author": "BenjaminHamnett",
                            "body": "Telling people not to wear masks at the Beginning of the pandemic “because they didn’t work” was one of the biggest credibility punts of all time at one of the worst times\n\nAlso, hardly any mention of encouraging people to do the basics to overcome comorbidity. Never mentioned how all the deaths were vitamin d deficient. People are critically deficient in easy to get minerals. People have worms and parasites, but then are belittled for reducing their comorbidity and to just stay in their home and get drunk and diabetic.",
                            "score": -6
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": -21
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "CompEng_101",
                    "body": "I don't think this experiment looked at that, it just looked at perceptions of a fictional politician who did change. Participants were given a description of a politician. The description mentioned that they have changed their positions on certain issues more or less than other politicians, but it didn't mention WHY they changed or even which direction they changed.",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mantene",
                            "body": "No, I get that. I just think we should normalize changing positions in the presence of new evidence.",
                            "score": 29,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BonJovicus",
                                    "body": "Yes but it actually might already be normalized. The data from the study can’t be extrapolated to the specific situation in which a politician has a specific reason for altering their position. \n\nI know it is intuitive that people don’t think that way, but this is r/science after all. I assume we are trying to avoid broad statements like that. ",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CaptainSebT",
                            "body": "I think this is a big factor. People don't trust random change. How can you vote for someone who hss changed their entire political agenda with no real reason.\n\nHowever I think voters would be fine with a politician who takes stance A but then says well I spoke with the people effected and it's clear to me based on evidence and this new changed outlook I actually support stance B. You might lose voters strongly apposed to stance B but you would gain probably a similar amount strongly support of stance B.\n\nLeaving out such critical details would render this study near meaningless. Even just who the individual is and the party they represent would change everything aswell as what the change is. If you built your platform saying anyone who support stance B is a monster then you flip to stance B then ya you're going to be in trouble.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CompEng_101",
                                    "body": "Yeah. I thought it was a rather odd study, because change without context is hard to assess.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DarkTreader",
                    "body": "This is a scientific catch 22.  Part of this is because Americans might view this as weak, but also because it could be seen as chasing votes or being bought by special interest.  Also Americans value going with your gut over “big data” even when the data might say this is a good decision for people. We can’t explain to our citizens why a scientific change of mind is good because they aren’t scientific enough to understand it.  You gotta pander to the least educated to get 50.1% of votes.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Cakeordeathimeancak3",
                    "body": "I always say this. People are like oh that person flipped on their stance so they can’t be trusted. I’m like hey if they changed it based on new information they previously did not have that’s a good thing, it shows the person is willing to be led not by stubbornness or refusal to see the truth but by information and logic, that’s a good thing.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "_CatLover_",
                    "body": "Unfortunately most politicians will just change to the popular opinion. After all, their job is to lead the masses, not represent part of the population they share beliefs with. Money and power sadly weighs heavier than principles and morals.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "skydiverjimi",
            "body": "Person 1: \" I don't get you anymore you changed man!\"\n Person 2:\" Yeah we're supposed to.\"",
            "score": 16
        },
        {
            "depth": 0,
            "author": "PirateSanta_1",
            "body": "Makes sense, I want my politicans to change their opinions based on new data but I also want one who has consistent principles. Anyone who changes their policy stances to frequently appears to not have any actual stances and just does whatever seems to be best at the time.",
            "score": 33
        },
        {
            "depth": 0,
            "author": "NegaJared",
            "body": "so basically, anti-scientific mentalities\n\nunable to change their view despite new, conflicting data",
            "score": 41,
            "replies": [
                {
                    "depth": 1,
                    "author": "BonJovicus",
                    "body": "Not necessarily. The study doesn’t seem to address how people react to why they changed their views.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Callec254",
            "body": "Well, yeah, if I voted for someone who says they are going to do X, and then they get in office and say \"I've changed my mind, I'm definitely NOT going to do X, that would be bad\" then I'd likely not vote for them again, as they are now going against the thing I specifically voted for.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "EatLard",
            "body": "Well that’s dumb. I’d rather have someone capable of processing new information and admitting what they believed before was incorrect.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "drewlitogot",
            "body": "Paging John Fetterman",
            "score": 9
        },
        {
            "depth": 0,
            "author": "mvea",
            "body": "I’ve linked to the news release in the post above. In this comment, for those interested, here’s the link to the peer reviewed journal article: \n\nhttps://www.cambridge.org/core/journals/journal-of-experimental-political-science/article/way-she-moves-political-repositioning-and-gender-stereotypes/D4A8F1403538830E0070D9AB68A8DBA8\n\nFrom the linked article: \n\nA recent study published in the Journal of Experimental Political Science investigates the impact of political repositioning on candidate evaluations, focusing on whether gender influences these perceptions. Conducted in Flanders, the research finds that politicians who frequently change their policy stances are viewed less favorably by the public, regardless of gender.\n\nThe motivation behind this study stems from the dual expectations placed on political parties. On one hand, parties are expected to maintain clear, stable policy positions, which fosters trust and ideological clarity. On the other hand, parties need to be responsive and adaptable to changing public opinions and circumstances.\n\nThe study revealed that candidates who frequently changed their policy positions were evaluated less positively than those who did so infrequently. This negative perception extended to trustworthiness and voting intentions. Candidates who frequently repositioned were viewed as less honest, decisive, and competent.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "mayorofdumb",
                    "body": "The outlier is Rick Scott...",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DGF73",
            "body": "Well, there is this common misunderstanding that a politician job is to push and form policies. While the politicians jobs is just to get elected. So whatever it takes, reality or evidence is irrelevant in front of the fanbase message you have to push to keep having a fanbase.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PrestigiousWish105",
            "body": "I bet no Indians in the research sample.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "obvnotagolfr",
            "body": "Takes science to figure that out",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RealBowsHaveRecurves",
            "body": "“Let’s see how people feel about politicians who change their stance”\n\n“Looks like people don’t like that”\n\n“Hmm, nobody is gonna read that, let’s split the results by gender”",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Myrddwn",
            "body": "I've never understood this. \n\nChanging your mind in the face of new evidence should be seen as a strength, not a weakness. \n\nClinging to your position and refusing up charge is not a strength!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sweetartums",
            "body": "One thing I learned from this article is that female politicians are viewed as more honest and male politicians are viewed as more decisive.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bucket_overlord",
            "body": "Cut to Donald Trump’s first campaign where he repeatedly flip-flopped on the issue of abortion, but won anyway.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "IssueEmbarrassed8103",
            "body": "Except if their name is Donald",
            "score": 0
        },
        {
            "depth": 0,
            "author": "JohnGreen60",
            "body": "I facepalm every time one of these stupid “studies” hits my feed. \n\n“People don’t want to vote for politicians who change stances” Is this not obvious? If you’re a person who votes on values, you’re not going to be able to trust a flip flopper. \n\n“Regardless of gender” what does that have to do with anything?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "ledow",
            "body": "People suspicious of liars, news at 11.\n\nAlso Pope faith shocker, and do you know where your bears are shitting?",
            "score": -1
        },
        {
            "depth": 0,
            "author": "SpezSucksSamAltman",
            "body": "No one paid for this research, right?",
            "score": -2
        }
    ]
}