{
    "title": "The Keys equation conflated natural saturated fat & industrial trans-fat into a single parameter & considered only linoleic acid as PUFA. This ignored widespread consumption of trans-fat & its effects on serum cholesterol & promoted an imbalance of omega-6 to -3 fatty acids",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/mightx  \nPermalink: https://www.mdpi.com/2072-6643/16/10/1447\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "vaiperu",
            "body": "Didn't he study more then 7 countries and only selected the 7 that fit his hypothesis ?",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "0L1V14H1CKSP4NT13S",
                    "body": "I remember hearing this but I have no source for it",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "vaiperu",
                            "body": "I think this might be a credible source [https://www.scientificamerican.com/article/records-found-in-dusty-basement-undermine-decades-of-dietary-advice/](https://www.scientificamerican.com/article/records-found-in-dusty-basement-undermine-decades-of-dietary-advice/)\n\n>One, the Seven Countries Study, originally included many more nations. But in only seven did populations consuming lots of saturated fats have high levels of heart disease, prompting recent accusations of cherry-picking data.",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}