{
    "title": "An innovative biodegradable paper that sticks to the brain’s surface like a Band-Aid and delivers electrical stimulation wirelessly could revolutionize the treatment of neurological diseases like Parkinson’s and Alzheimer’s, according to a new study.",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/chrisdh79  \nPermalink: https://newatlas.com/medical/bioelectric-paper-electric-stimulation-brain/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "chrisdh79",
            "body": "From the article: Therapies that deliver electrical stimulation to the brain to treat neurodegenerative diseases like Parkinson’s and Alzheimer’s have been found to be effective. To deliver this deep brain stimulation (DBS), electrodes are implanted in areas of the brain through small holes drilled in the skull. A pacemaker-like device is also inserted under the skin of the chest to power the electrodes.\n\nInserting electrodes into the brain has risks, one being that the leads carrying those electrodes can be misplaced, migrate, or break. Researchers from the Uhlan National Institute of Science and Technology (UNIST), South Korea, have developed a biodegradable, wirelessly activated ‘bio-paper’ implant that avoids these issues.\n\n“The developed material offers personalized treatment options tailored to individual needs and physical characteristics, simplifying treatment processes, enhancing flexibility, and versatility in electrical stimulation-based clinical applications,” said the [study’s](https://onlinelibrary.wiley.com/doi/10.1002/adma.202311154) lead author, Jun Kyu Choe, from UNIST’s Department of Materials Science and Engineering.",
            "score": 1
        }
    ]
}