{
    "title": "Ancient viruses embedded in human DNA millions of years ago may play a role in raising people’s risks of depression, schizophrenia and bipolar disorder. The viral genes have unusual activity levels in people who have a higher genetic risk of experiencing these mental health conditions",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/Wagamaga  \nPermalink: https://www.newscientist.com/article/2432668-ancient-viruses-in-the-human-genome-linked-to-mental-health-conditions/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Wagamaga",
            "body": "Ancient viruses embedded in human DNA millions of years ago may play a role in raising people’s risks of depression, schizophrenia and bipolar disorder. The viral genes have unusual activity levels in people who have a higher genetic risk of experiencing these mental health conditions, a study has found.\n\nRetroviruses are a large group of viruses whose life cycle involves inserting their genetic information into the DNA of their host. Remnants of such viral genes can be seen in the DNA of many animal species, and these sequences are called human endogenous retroviruses (HERVs) when found in the human genome.\n\nUntil recently, most HERVs were thought to remain dormant and were called “fossil viruses”. But previous studies have suggested that some of the viral genes may in fact be active – although not producing infectious viruses – and may even play a role in neurological conditions, such as multiple sclerosis\n\n  \nIn a new study, Timothy Powell at King’s College London and his colleagues investigated the possible role of these viral remnants in mental health conditions by looking at viral proteins in nearly 800 brains that had been donated for medical research.\n\nWhile the team didn’t record if any of the donors had been diagnosed with mental health conditions while alive, they found that some genetic variants that are known to raise the risks of depression, schizophrenia and bipolar disorder were associated with altered activity of genes from five different HERVs.\n\n  \n[https://www.nature.com/articles/s41467-024-48153-z](https://www.nature.com/articles/s41467-024-48153-z)",
            "score": 24
        },
        {
            "depth": 0,
            "author": "TheGnarWall",
            "body": "How High We Go in the Dark anyone?",
            "score": 3
        }
    ]
}