{
    "title": "A new study revealed that women are generally less likely to express interest in men whose profiles contain subtle cues of threat. These cues include both facial features and written content that suggest a higher likelihood of sexual aggression. ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Welcome to r/science! This is a heavily moderated subreddit in order to keep the discussion on science. However, we recognize that many people want to discuss how they feel the research relates to their own personal lives, so to give people a space to do that, **personal anecdotes are allowed as responses to this comment**. Any anecdotal comments elsewhere in the discussion will be removed and our [normal comment rules]( https://www.reddit.com/r/science/wiki/rules#wiki_comment_rules) apply to all other comments.\n\n**Do you have an academic degree?** We can verify your credentials in order to assign user flair indicating your area of expertise. [Click here to apply](https://www.reddit.com/r/science/wiki/flair/#wiki_science_verified_user_program).\n\n---\n\nUser: u/mvea  \nPermalink: https://www.psypost.org/threat-perception-in-online-dating-how-facial-features-and-biographies-impact-womens-choices/\n\n---\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/science) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "UnmixedGametes",
            "body": "So, in a nutshell, what Andrew Tate was doing was targeting single men with paid training that would keep them single for longer?",
            "score": 1532,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlueDotty",
                    "body": "Yep. Hilariously ironic",
                    "score": 574,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Saritiel",
                            "body": "It's not a bug, it's a feature.  Keeping them angry and frustrated pushes them deeper down the rabbit hole.",
                            "score": 583,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BlueDotty",
                                    "body": "Does Tate make money from that? \n\nI suppose he must. \n\nTate and Co. create the individuals' women identify as unappealing in these studies",
                                    "score": 139,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "k___k___",
                                            "body": "he did, yes. multiple ventures to squeeze money out of insecure men.",
                                            "score": 119
                                        },
                                        {
                                            "depth": 4,
                                            "author": "PaulRudin",
                                            "body": "You can monetize pretty much any social media following...",
                                            "score": 53
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "stargazzz_r",
                                    "body": "how does andrew tate keep men angry and frustrated?\nthe men have already been angry and frustrated before they learnt of andrew tate\nafter andrew tate their lives have been easier theyve been happier theyve been physically fit and actually catching all the girls",
                                    "score": -43,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Saritiel",
                                            "body": "Hahaha, no.  The things he teaches are pure woman repellent.  Women tend to hate guts who do what he says. And that's how they stay angry and frustrated, because when the success with women he promises doesn't come and they find themselves being actively avoided then they blame women and not themselves.",
                                            "score": 19
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Tyraniboah89",
                            "body": "That’s how they stay profitable. It’s not an accident. Grifters need their audiences to remain dependent.",
                            "score": 53
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheBirminghamBear",
                    "body": "Yes but if you paid for his Hustler class, he would teach you how to sex traffic. \n\nI'm not joking, he literally taught sex trafficking techniques in his online course.",
                    "score": 220,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SenorSplashdamage",
                            "body": "It’s still wild that people and news don’t frame it as taking advice from a literal pimp. It doesn’t help that that word became a favorable term for a guy that is surrounded by women, but it shows the idiocy of young men thinking a sex trafficker has a perspective that isn’t deeply tied to pimping out women as a profession and how slimy and dark that job is.",
                            "score": 106,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "KuriousKhemicals",
                                    "body": "The intro to this study describes how women who have experienced sexual aggression in the past often have a lower sensitivity to threat indicators like this (part of why they are at high risk to be revictimized). So what Tate is doing is training nasty men to pick the \"easy targets.\" It's like scam emails that are full of grammar errors, they actually want to screen out people with normal levels of skepticism so they can have a high success rate when they invest time into actually running the scam.",
                                    "score": 89
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SemaphoreKilo",
                    "body": "That's actually a great grift!",
                    "score": 28
                },
                {
                    "depth": 1,
                    "author": "anarchyhasnogods",
                    "body": "if you are to be successful under capitalism you can't actually solve problems after all, your profit base goes way down",
                    "score": 52
                },
                {
                    "depth": 1,
                    "author": "Candid-Sky-3709",
                    "body": "new Andre Tate course: making women like you at gun point. It teaches you about pistol form factors and cheap ammunition.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "jacobsbw",
                    "body": "I actually don’t think that’s what the article stated. It mentioned that once women were told the men had the appearance of threat, they rated these men higher in attractiveness than lower threats.",
                    "score": -26,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Cu_fola",
                            "body": "[Did you read the study?](https://www.sciencedirect.com/science/article/pii/S074756322400102X)\n\nI’m not sure where you’re getting this from.\n\nWomen were not told “this man is a threat”. They were given a variety of profiles with randomly matched facial expressions/postures and bio styles, then asked to rate them.\n\nYou can read through the tables to see samples of the bio word choices to evoke different personality types.\n\nThey found that the women rated those with higher perceived threat risk as less desirable to meet.\n\nThe deterrent effect was weaker in women who self reported proneness to boredom and risk/sensation seeking. But overall, they preferred less “threatening” men.\n\nSafety recommendations apparently had no significant effect on their choices:\n\n*In other words, women appeared sensitive/averse to (sexual) threat in online dating profiles such that their probability of expressing interest in men dropped by ∼81% when the biography text was more (vs less) threatening (23.4% vs 4.45%) and by ∼57% when the photographed individual appeared more (vs less) threatening (16.1% vs 6.9%) (probabilities determined using emmeans). Safety recommendations, however, neither boosted this sensitivity/aversion (i.e., the recommendation × threat interactions were non-significant) nor altered, more generally, women's interests (i.e., there was no main effect of recommendations) (all ps > 0.320, see Table 2).*",
                            "score": 14,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jacobsbw",
                                    "body": "“We were quite surprised to find that the type of general safety recommendations/tips sometimes used on online dating platforms had no effect on expressions of interest and did not increase sensitivity/aversion to threat,” Shuster and Geniole said. “If anything, women exposed to these recommendations seemed to find the men featured in the low- (rather than high-) threat profiles less attractive and desirable. In other words, the safety recommendations did not reduce women’s attraction to and interest in the high threat men.”\n\nI found it in the article. The author interviewed the study authors.",
                                    "score": -12
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "stargazzz_r",
                    "body": "most men after andrew tate have stopped watching porn and actually getting all the girls youd never catch",
                    "score": -14,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Extinction-Entity",
                            "body": "Run back to the teenagers sub",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Danimalomorph",
            "body": "Anybody else read this intrigued by how a facial threat looks and how a biographical threat sounds only to be disappointed? I feel like that's a very important part of the study - have I missed something?\n\nEDIT - Yes, I had missed something, something very obvious - a link to the study [https://www.sciencedirect.com/science/article/pii/S074756322400102X](https://www.sciencedirect.com/science/article/pii/S074756322400102X)",
            "score": 378,
            "replies": [
                {
                    "depth": 1,
                    "author": "installpackages",
                    "body": "There’s an example provided in the methods of a face and statement. The authors seemed to build on prior research about faces too, which are also discussed and cited in the methods, and those papers have examples as well, and how those faces are determined. I had a skim of a linked paper, pretty interesting.",
                    "score": 166
                },
                {
                    "depth": 1,
                    "author": "Summer_Thyme_",
                    "body": "I find it interesting that women generally smile in profile photos and sometimes do the “hot girl aloof over-it” face of disinterest. \n\nBut only some men smile. Lots look… stern, cold, even angry, as their attractive face. \n\nIt’s always been such a turnoff to me. I don’t know if that’s what they mean by threatening, but a lot of men don’t look friendly and approachable or happy. They look mean and intimidating.",
                    "score": 304,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SenorSplashdamage",
                            "body": "I think there’s a noticeable difference in men who know what non-smiling picture still looks warm and those that have stern looks that portray discomfort, insecurity, and even hostility. Not being able to see that in your own photo that you choose yourself and put out there for dating prospects says a lot about emotional awareness. \n\nI’m on the gay dating app side of this and there are guys who do a little bit of a dominant look for effect and get it, and then there are others that attempt it and feel less aware of themselves.\n\nI’m okay if someone looks a little shy or insecure. If someone looks unhappy, that’s something that gives me pause if they’re choosing that photo. The unhappy thing is real.",
                            "score": 113,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Porcupinetrenchcoat",
                                    "body": "My pet theory about this is that men who are \"less aware\" are maybe more insecure and/or more socially isolated. So they don't have friends to take pictures with or happy/safe times because they're constantly in some state of stress, and/or they don't have other humans modeling those things for them. \n\nPersonally that would speak volumes to me and I would very much avoid a man based on those cues alone.",
                                    "score": 28,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "i_am_the_likker",
                                            "body": "When I was online dating, every pic was a spectrum from me smiling contently to outright laughing with friends. I'm not particularly beautiful, but I did really well, and as my buddies likes to tell me was \"punching above my weight\".",
                                            "score": 9
                                        },
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[deleted]",
                                            "score": -6
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Alt_Daddy8",
                                    "body": "That is interesting. I've noticed the more aggressive and hostile my pic is, the more guys hit me up.",
                                    "score": 3
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EnderAtreides",
                            "body": "IIRC someone did some statistics on what was attractive in heterosexual dating profiles, and women smiling was attractive, men smiling was not.",
                            "score": 39,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SenorSplashdamage",
                                    "body": "The old OkCupid blog found this, but it seems people ran with that result into unscientific territory of thinking one result on one dating app at one point in time was now a rule. If I remember correctly, it wasn’t just that men weren’t smiling as much, but that they were looking away from the camera. And not smiling was more not having a giant grin, they could still have looked warm or approachable. The finding wasn’t that men who looked angry or stern directly into the camera got more dates. \n\nGiant grins might even have conveyed something else if the grin felt forced and now the guy looked less authentic. Or maybe it could be context where maybe he’s just somewhere being psyched about something more boyish and maybe more chill looks more mature and grown. There weren’t repeat checks to try and find out and the women involved weren’t asked.",
                                    "score": 66,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "EnderAtreides",
                                            "body": "Yes, that's the study I was thinking of. It wasn't robust enough to find a specific explanation. There are plenty of reasonable explanations. Perhaps it's because they smile at the camera, like you said.\n\nIt might be simpler to compare how often generic pictures of \"hot men\" vs \"hot women\" depict smiling or looking at the camera in media. As far as I can tell, women are smiling more often and more directly at the camera. Maybe other people find different results, though.\n\nThis is all just rough correlation, though. Smiling is something most people would want in a partner.",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "wrylark",
                                            "body": "cant look too happy thats a red flag ...",
                                            "score": 0
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "androgynousnobody",
                                    "body": "I’m bi, so maybe not the target demographic here, but there’s nothing more attractive in any gender than a genuine, happy smile.",
                                    "score": 75,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Emotional-Courage-26",
                                            "body": "You may also be well adjusted and seeking healthy qualities in a mate. A remarkable number of people are not, and so they seek out people exhibiting unhealthy behaviours.\n\nI think smiling is attractive if you are also happy, or want to be happy in mutually positive ways. It might be unattractive if you have low self esteem or have an innate belief that men or women who love you are unhappy people due to a difficult home life as a child. It seems unintuitive, but then you see people repeat these patterns for decades over.",
                                            "score": 33
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "The_Humble_Frank",
                                    "body": "Generally, you don't want to be with someone that doesn't like the look of you smiling.\n\nTake those studies with a grain of salt. In college I definitely read social science studies attributing results in group differences in based on one feature in a picture, but when you looked at the actual pictures a study used, their was clearly more factors involved (IE. Group X looks more threatening just because they're X... but pictures show X in realistic weary/guarded pose, Y is shown only in goofy/ridiculous poses.)",
                                    "score": 28
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "IceRepresentative906",
                            "body": "I cannot smile for pictures",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cowboywizzard",
                                    "body": "Is that something you want to change?",
                                    "score": 7
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PoetSeat2021",
                    "body": "Could you tell the difference between the high threat and low threat versions of the photos?\n\nI couldn’t. Thinner eyebrows = more threat, I guess?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GuitarRose",
            "body": "“A new study revealed that women don’t want to date men they think will rape them”",
            "score": 86
        },
        {
            "depth": 0,
            "author": "outofcontextsex",
            "body": "What's wild is anecdotally if you go onto any of these dating advice subreddits this advice is constantly given not only from men who are successful but from women themselves; however it does seem like a lot of people are very adverse to taking good advice, idk why.",
            "score": 62,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ok_Television_6821",
            "body": "Wow what a concept women don’t like threatening men.",
            "score": 58,
            "replies": [
                {
                    "depth": 1,
                    "author": "Porcupinetrenchcoat",
                    "body": "How many of these studies do you think we need until men as a whole understand this? The amount of sex they could be getting would go up proportionally to how safe women feel around them! \n\nThat's the trick. That's it. Don't be scary.",
                    "score": 44,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ok_Television_6821",
                            "body": "I’m a man and this is second nature I mean it’s the most fundamental biological mechanism. Although I have autism so…. But still I think thats ridiculous that we need to waste researchers time like this. I’ve always been confused about why men who are obviously obsessed with female attention don’t use their brains to get it stop watching porn and treat women like a human and wow she’s more likely to bang you if you are regard her as an equal species wow. Everyday I can’t believe we all still exist.",
                            "score": 18
                        },
                        {
                            "depth": 2,
                            "author": "Kalium",
                            "body": "A lot of this study is about the effects of details of facial features that make a man \"high threat\" or \"low threat\". This isn't about expressions or displayed emotions, it's about eyebrow, eye, mouth, and nose shape. There's a sample card provided with truly remarkably neutral expressions.\n\nI'm sure it's good advice, though. Just uh, don't have a scary-looking face and women are twice as likely to express interest. How hard can it be? Maybe the advice we give men should be \"Have a good make-up artist and photographer for your dating app photos\".\n\n----\n\n[The graphs on expression-of-interest rates](https://www.sciencedirect.com/science/article/pii/S074756322400102X#fig2) are definitely interesting. Having a high-threat face got twice as much interest as having a low-threat biography.",
                            "score": 8
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "mvea",
            "body": "I’ve linked to the news release in the post above. In this comment, for those interested, here’s the link to the peer reviewed journal article: \n\nhttps://www.sciencedirect.com/science/article/pii/S074756322400102X\n\nFrom the linked article:\n\nA new study published in Computers in Human Behavior sheds light on how women perceive potential threats in online dating profiles, revealing that women are generally less likely to express interest in men whose profiles contain subtle cues of threat. These cues include both facial features and written content that suggest a higher likelihood of sexual aggression. Interestingly, typical online dating safety recommendations appear to have little effect on enhancing women’s sensitivity to these threat-related cues.\n\nThe COVID-19 pandemic has exacerbated many social issues, including domestic and sexual violence against women. Reports of increased domestic violence and emergency shelter requests surged during lockdowns, and misogynistic behaviors also rose significantly. Online dating platforms, which saw increased usage during this period, present additional risks for women. These platforms can facilitate encounters with men prone to sexual aggression, making it crucial to understand how women identify and respond to threat cues in these contexts.",
            "score": 82,
            "replies": [
                {
                    "depth": 1,
                    "author": "Danimalomorph",
                    "body": "*Can* you shed a light on how a facial threat looks and how a biographical threat sounds? The whole study would be undermined if it's a pic of a grimacing man wielding a knife and a bio that says \"take the knee or else\"\n\nEDIT - I was an idiot, there's a link to exactly that - [https://www.sciencedirect.com/science/article/pii/S074756322400102X](https://www.sciencedirect.com/science/article/pii/S074756322400102X)",
                    "score": 36,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "aperdra",
                            "body": "The paper is free to download and there's a figure of the photos and the profile. But, for those who cba: \n\nLow-threat bio: \"It doesn't really matter what people think as long as you got a beautiful soul\" \n\nHigh-threat bio: \"It doesn't really matter what people think as long as you got a beautiful piece of a$$\" \n\nThe photos are the same guy, altered. The low-threat guy has more horizontal eyebrows, thicker lips and larger eyes. The high-threat guy has angled brows, smaller eyes and thinner lips. The changes they made are subtle but I knew which one was supposed to be the high-threat guy before reading the caption.",
                            "score": 113,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "installpackages",
                                    "body": "Also adding on to this, they used methods from prior research to create the faces which are also linked in the methods section. \n\nAnd here’s something super awesome - they’ve linked to their code and data through OSF!",
                                    "score": 50
                                },
                                {
                                    "depth": 3,
                                    "author": "Bulzeeb",
                                    "body": "Here's a direct link to the photo: https://ars.els-cdn.com/content/image/1-s2.0-S074756322400102X-gr1_lrg.jpg\n\n\n(edit:fixed link) \n\n\nIt's not hard to speculate why the high-threat presentation comes off that way. Angled brows and smaller eyes are associated with glaring. Likewise, thinly pressed lips are associated with coldness or displeasure. The overall effect combines to present a picture of contempt and displeasure, with a higher potential for aggression and unempathetic behavior. \n\n\nMoreover, these traits are not passive ones like eye color, they require a degree of active maintenance to uphold as they require the contraction of muscles to achieve, so they're seen as more reflective of the man's personality or at least his general emotional baseline. \n\n\nIt's not a perfect method of course, and some unfortunate individuals appear to be displeased when they aren't. I will say in a lot of pictures of people who supposedly have these facial features are still engaging their muscles such as furrowing their brows. So even if they don't think they're in a bad mood, for whatever reason they're still engaging muscles associated with aggression. ",
                                    "score": 50,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SenorSplashdamage",
                                            "body": "It feels like there are additional signals here of things like whether a guy asked friends or other women whether a photo was good. We don’t see ourselves the way others do, but then knowing to ask others and even having developed relationships with people to have them around to ask is a positive signal. Even good-natured men who don’t have women in life to get input from are going to be less aware of what feels safe and what doesn’t for women.",
                                            "score": 9
                                        },
                                        {
                                            "depth": 4,
                                            "author": "shepherdofthesheeple",
                                            "body": "Link doesn’t work",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Bulzeeb",
                                                    "body": "Hmm, weird. Try copying it into your address bar instead of clicking it directly. Seems like it works that way. ",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "hananobira",
                                                            "body": "I tried opening it in Chrome.\n\n“NOT FOUNDAttachment/Metadata missing”",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Bulzeeb",
                                                                    "body": "Okay, got it. I accidentally copied an extra space from the article. Try it now. ",
                                                                    "score": 10
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BlueDotty",
            "body": "Feels like an obvious result",
            "score": 82,
            "replies": [
                {
                    "depth": 1,
                    "author": "Smellmyupperlip",
                    "body": "It isn't for a lot of men on reddit, claiming women only go after hot assholes.\nEdit: There's literally at least one in this thread. ",
                    "score": 180,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FrontingTheTempest",
                            "body": "Reddit is filled with terminally online weirdoes. Whenever I’m speaking to people in real life and look at comments on Reddit shortly thereafter you are really reminded how much of a cesspool it is. ",
                            "score": 34
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TargetDroid",
                    "body": "Well, you have to keep in mind that women are virtually mythological creatures to 99% of Reddit.  That’s the only way to make sense out of a substantial portion of the posts on this sub.",
                    "score": 84,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BlueDotty",
                            "body": "Yeah. Fair enough. \n\nIt is bizarre how some men of reddit have an idea that their lack of success in relationships is the fault of women",
                            "score": 75,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TargetDroid",
                                    "body": "Maybe there should be a study on it!!",
                                    "score": 42
                                },
                                {
                                    "depth": 3,
                                    "author": "Leonardo040786",
                                    "body": "Why is this bizzare? Everybody protects themelves like that and looks past their own imperfections.  \nSome unsucessful women in dating also tend to say that all men are the same and care only for good looks.",
                                    "score": -17,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "spinbutton",
                                            "body": "Very true..women assholes exist just like men assholes",
                                            "score": 26,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Leonardo040786",
                                                    "body": "I wouldn't call either group assholes either. Just frustrated.   \nI would argue that many of them also have some disorders from the autistic spectrum.",
                                                    "score": -23
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "gandalftheorange11",
                                    "body": "It’s easy to think that way when a person has no opportunities to interact with womoen",
                                    "score": -28,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BlueDotty",
                                            "body": "Opportunities?",
                                            "score": 21,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "gandalftheorange11",
                                                    "body": "Plenty of men and boys don’t have opportunities to interact with women outside of brief work or school interactions. So as a result they form their opinions with little information. Then when they think about why they’re lonely, it’s easy to blame it on the people they want to interact with but can’t because they don’t know what they can do differently. It’s maladaptive and illogical but that’s common with all people. Logic is rather unnatural for humans when emotions are involved.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "curated_reddit",
                                                            "body": "\"brief work or school interactions\"? school is brief for you??\n\nyoure literally just saying words here but making no solid point whatsoever. school is where *everyone* learns how to socialize, and as far as im aware, most schools are not separated by gender. what other opportunities do you want? and why, if true, would this mainly pose a problem for men?\n\non top of that, women do actually often partake in those stereotypically male activities such as gaming, and i dont think i have to explain to you what that experience is often like for women.\n\n> it’s easy to blame it on the people they want to interact with but can’t because they don’t know what they can do differently\n\nwhat a pathetic excuse for misogyny.",
                                                            "score": 13
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Succulents_are_cool",
                    "body": "For real, they make it sound like it's shocking news worthy of an article that women don't want to be assaulted",
                    "score": 53,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Keji70gsm",
                            "body": "I have been told that women like to be mistreated by hot asssholes. Actively seek it out and stay with abusers. And since women have rape or domination fantasies, they like to be raped... Yeah... I choose the bear.",
                            "score": 63,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "spinbutton",
                                    "body": "Team Bear. Many people who choose bad boys or stay in abusive relationships had very poor role models and often abusive families. So it is no wonder they make poor choices",
                                    "score": 41,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "QuietPerformer160",
                                            "body": "Yes. And have you had a conversation with any of the men who witness a woman say they choose the bear? It reinforces the entire point of the hypothetical.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "No_Jelly_6990",
                                    "body": "Seeks it out? Inadvertently. Enjoy the abuse? What....?",
                                    "score": 5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "QuietPerformer160",
                                            "body": "I would imagine it’s a cycle of abuse. Like a woman being attracted to an abusive man after growing up in a house where her dad beat her mom etc.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "accordyceps",
                                                    "body": "Personality plays a role, too. I grew up around domestic violence, and stay far away from any man that had a hint of violence in their behavior. It completely repulses me as an adult.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "accordyceps",
                                    "body": "Many of those women have trauma in their backgrounds. It’s not a model for men to become more like abusers to be attractive to traumatized women…",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "CompEng_101",
                            "body": "That wasn’t really the purpose of the study. The authors already suspected that more aggressive profiles would be less attractive, and they cite literature that discusses this. Their more interesting findings (and the real goal of the study) were:\n\n* Common online dating safety recommendations do not enhance such threat sensitivity.\n\n* Women more susceptible to boredom showed reduced threat aversion/sensitivity.",
                            "score": 22
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[deleted]",
                            "score": -27,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "kvlt_ov_personality",
                                    "body": "Are you really a scientist? And if so, are you a good one? Because this study isn't just measuring whether \"women want to date men who seem rapey\". \n\nIt's specific to the effects of facial features and biographical blurbs, which have implications about psychology, facial recognition, etc.",
                                    "score": 26,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "the_real_dairy_queen",
                                            "body": "Please explain what the non-obvious breakthrough was.\n\nIf it’s that men looking angry and putting things in dating profiles indicating that they have misogynistic attitudes toward women is off-putting to women, well this is only news to men.",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Eric1491625",
                            "body": ">For real, they make it sound like it's shocking news worthy of an article that women don't want to be assaulted\n\nBut when the criteria includes *\"facial features\"*...\n\nAn inborn physical trait...\n\nThis is not better than prejudicing against a particular race for have threatening facial features\"",
                            "score": -36,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Bulzeeb",
                                    "body": "This is an awful comparison. The facial features demonstrating aggression are largely not tied to genetics. Rather, they are the result of the tensing of specific facial muscles resulting in the expression of emotions typically associated with aggression. Here's a photo of the models used by the study:\n\n\nhttps://ars.els-cdn.com/content/image/1-s2.0-S074756322400102X-gr1_lrg.jpg\n\n\n\nThese two faces are identical with the exception of three features. The model on the right has narrowed eyes, downward angled eyebrows, and pressed lips. These are all features humans use to convey contempt, displeasure and anger, and it is natural to feel uneasy around someone who presents themselves like this, regardless of your gender. ",
                                    "score": 33,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "artkill33",
                                            "body": "But their is some facial features that are tied with more perceived agression that are not volontere for exemple the ratio of width to height of the face (you cant control that). I'm sure the idea of judging people with their face would not be that pleasant once use in racial or gender profiling. That's why I'm not too please on this idea",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Bulzeeb",
                                                    "body": "That's fair, and I'm not wholly unsympathetic towards anyone unfortunate enough to naturally have facial features that make them look aggressive, I just think equating that with racism is unreasonable. We're comparing skin color to a universal human method of communication. ",
                                                    "score": 2
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Eric1491625",
                                            "body": "I know plenty of people who just *naturally* have this look. Now this is next-level victim blaming...",
                                            "score": -9
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "BlueDotty",
                                    "body": "Don't be ridiculous",
                                    "score": 17
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Mountain_Cat_cold",
                    "body": "Yeah, \"go figure\" was my initial response",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "panchoop",
            "body": "Since nobody yet brought this up, I'll do the classical drill:\n\n\"To explore how threat-related cues in online dating profiles affect women’s interest, researchers conducted an online dating simulation with 172 female participants aged around 19.72 years. These participants were recruited from introductory psychology courses at the researchers’ institution\"\n\nEverything here bias the results:  \n\\* online dating simulation  \n\\* 172 participants  \n\\* average age of ~20 years (likely without much standard deviation)  \n\\* everyone taking an introductory course of psychology.\n\nThis is a little bit more representative than asking my sisters what do they think about a tinder profile.",
            "score": 73,
            "replies": [
                {
                    "depth": 1,
                    "author": "SenorSplashdamage",
                    "body": "I think it’s a good piece of research based on previous research that could actually help men see themselves and start to think through ideas about safety and self-awareness in dating profiles. I am surprised by the number of men who have profiles where the pictures are off in the emotions their eyes and face are conveying.",
                    "score": 17,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "panchoop",
                            "body": "Definitely, this will help men looking in the 20 year old range, taking an introductory course in psychology in (I think) the University of the Fraser Valley.\n\nOutside that, we need a bit more sampling diversity to conclude that such aggressive profiles are not preferred by another segment of the population.",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Cu_fola",
                                    "body": "I’m always in favor of larger studies and testing results across demographics but “it’s only a little bit better than asking my sisters about their tinder opinions” is a bit dramatic.\n\nIt’s a starting point that’s several miles ahead of that or some podcast bro’s pontification about what women want.",
                                    "score": 10,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "panchoop",
                                            "body": "Not at all dramatic, the population is so egregiously oversampled that it is concerning that someone would think that this study lends itself to any generalization.\n\nImagine the same study done outside of a church on a sunday in the midwest. No idea what would come out of that, but concluding something about the general population out of this would be obviously laughable.\n\nDon't let your biases cloud your judgement, this should be a discussion about science and its methods, not a cultural fight against some idiotic podcast bro.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Cu_fola",
                                                    "body": "What do you think the phrases “starting point” “testing across demographics” and “larger studies” mean in my comment?\n\nThe demographics in this study are very limited but suggesting that they’re only as useful as asking what, one or two sisters raised in the same household? Or a church service which A. Is statistically less than 100 people on average and only around half these would be women and B. Arguably much more homogenous than a department within a university of average size.\n\nMy comments are about methods, not culture war. *Needs improvement in X Y Z* is an actionable and measured evaluation of a study. *Nearly useless* is dramatizing. There is something that can be built on and improved here.",
                                                    "score": 6,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "panchoop",
                                                            "body": ">What do you think the phrases “starting point” “testing across demographics” and “larger studies” mean in my comment?\n\nThese got completely overshadowed by the statement \"... several miles ahead of ... \". It is not, my sisters, this study and the anecdotes of some random bro idiot are, up to a significance value, insignificant. Not \"miles ahead\", neither \"a centimeter\" ahead. Just insignificant. I repeat the statement, *it is concerning that someone would think that this study lends itself to* ***any*** *generalization.*\n\n> Is statistically less than 100 people on average and only around half these would be women Arguably much more homogenous than a department within a university of average size.\n\nLet me rephrase it: same university in a 150k population town in Canada, with the same study interest, same age (+- 1 years?). I would agree that the sample could be racially much more diverse than some church in the midwest, but that's more or less it. Both cases are just insignificant.\n\nI used the church and my sisters as an example of how bad this sample is, arguing on the size of a church or its diversity is missing the forest for the trees.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "anonymousjeeper",
            "body": "Women want to be appreciated and feel safe and trust their partners. Why can men not understand this concept?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Minute-Ad8501",
            "body": "I can see this, have you seen some of the men's dating profiles. Talk about red flags",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Techygal9",
            "body": "“Facial threat was altered using validated techniques to adjust the structure and shape of facial features, making them appear more or less threatening. Biographical threat was manipulated by adjusting the wording of the profiles to suggest varying levels of traits associated with sexual aggression, such as narcissism, impulsiveness, and hostility towards women.” \n\nThis seems extremely circular in thinking. How do we know what threatening faces are?",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "picabo123",
                    "body": "They used a previous study for the faces so I would check that out",
                    "score": 62
                },
                {
                    "depth": 1,
                    "author": "spinbutton",
                    "body": "Human facial expressions cross cultures. There are multiple tests online, and a subreddit where you can post your score, so you can check your own ability.",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "Comprehensive-Bad219",
                    "body": "> This seems extremely circular in thinking. How do we know what threatening faces are? \n\n\nIf you look at the guy's face in the study, it's extremely obvious. You just know. In the first image he looks bored, in the \nsecond he looks unhappy and upset. \n\n\n[Here's a link to the image](https://ars.els-cdn.com/content/image/1-s2.0-S074756322400102X-gr1_lrg.jpg)",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Techygal9",
                            "body": "Thanks, this to me seems more like an expression change vs faces that are threatening in a way that shows some sort of inherent danger. Maybe I just am not understanding the study that well.",
                            "score": -3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Firejay112",
                    "body": "If you read the article, it’s based on previous studies which altered facial features to determine how people respond to them. The example they give is the same guy with a neutral expression except the low-threat one’s features are softer than the high threat one’s.",
                    "score": 29,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Techygal9",
                            "body": "Yeah, there were several linked studies, and I didn’t read them but basic research writing would further explain those features imo. In the paper they admit the studies on those features don’t show strong evidence of these features actually correlating to negative outcomes.",
                            "score": -10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Firejay112",
                                    "body": "I mean, as far as I can tell whether it correlates to a negative outcome is out of scope. This is a study about “perceived” threat, not “actual” threat.",
                                    "score": 4
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Current_Finding_4066",
                    "body": "Some people do look more aggressive than others to me. But hard to quantify.\n\nI suppose it is also highly unreliable way to assess people, your gut feeling:).",
                    "score": 31
                },
                {
                    "depth": 1,
                    "author": "BluCurry8",
                    "body": "Can you tell if someone is happy or sad?  This is just a more sophisticated approach to the chart you reviewed in kindergarten.",
                    "score": 14
                },
                {
                    "depth": 1,
                    "author": "Moistfruitcake",
                    "body": "Anyone unironically making that duck pout face is an obvious threat to every other human. \n\n\nI also consider anyone who mentions pineapple on pizza in any context a threat. ",
                    "score": -20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MajesticBread9147",
                            "body": "Duck faces were a big thing a decade ago, not so much today. \n\nI legitimately haven't seen a woman do a duck face in a photo since, maybe 2016?",
                            "score": 22,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PigeroniPepperoni",
                                    "body": "Some old people still do it.",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "maniac86",
                                    "body": "So it's a great indicator for the truly deranged",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "killerkadugen",
                            "body": "Question: when you hear \"pineapple on pizza\" -- how do you imagine that pizza looking?",
                            "score": 3
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Eric1491625",
                    "body": "\"You're born Black. You look threatening to me. IDK why. I stay away from you.\"\n\n\"RACIST!\"\n\n...\n\n\"You're born with that face. You look threatening to me. IDK why. I stay away from you\"",
                    "score": -32
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheReal8symbols",
            "body": "I always feel like this kind of information just helps predators hide better.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "doubtfulpickle",
                    "body": "Sadly that was my thought as well",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "teriaki",
            "body": "Woah. Who knew rapey vibes were bad before this study? Shocker. Eye opening.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "MissionCreeper",
            "body": "And what impact will this data have?  Is this going to help wonderful men to realize they are turning people off by appearing too aggressive, or is this going to help violent men who learn specifically how to hide their true nature?  ",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Porcupinetrenchcoat",
                    "body": "The assumption here is that violent men are obvious. If that were the case they would struggle to find victims. Men who are violent don't come with a label and it's very likely that if you have an average sized social circle you know someone who is violent (not necessarily physically) towards women. One of the biggest refrains that victims hear is \"Guy seemed so nice! I never saw him act that way\" or straight up victim blaming and gaslighting.",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "reverbiscrap",
            "body": ">Prison Bae has entered the chat",
            "score": 6
        },
        {
            "depth": 0,
            "author": "CokeDigler",
            "body": "Keep it dopey, get to pokey\n\nAct all tight, lonely night",
            "score": 5
        },
        {
            "depth": 0,
            "author": "tvs117",
            "body": "And even less likely if it's not there.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FactChecker25",
            "body": "I think studies like this are misleading because even studies about women show that what women say and what they do are two completely different things.\n\nIn other words they’ll end up choosing the more aggressive guy even if they say that they’re not interested in guys like that.",
            "score": -26
        },
        {
            "depth": 0,
            "author": "Epiccure93",
            "body": "The kind of high threat profiles they use is really questionable. They more sound like biographies from real dorks",
            "score": -22
        },
        {
            "depth": 0,
            "author": "IceCorrect",
            "body": "Profiles with male model who is child abuser get tons of likes prove this is bs. Or it's not the same, because in this profiles he doesn't hide about how much a threat he is, while in this study - women created this story about them to feel better",
            "score": -23
        },
        {
            "depth": 0,
            "author": "Ok_Television_6821",
            "body": "Not to discredit actual researchers but does anyone else feel like the media treats us like idiots like we don’t think about reality and like we can come to common sense conclusions ourselves. I mean yes some of us (probably most of us) are idiots but I feel like this was a waste of money.",
            "score": -2
        },
        {
            "depth": 0,
            "author": "Phemto_B",
            "body": "I'm always suspicious when the study depends heavily on self reporting; but then, that's most what passes for science in psychology: \"we did a survey.\"",
            "score": -49
        },
        {
            "depth": 0,
            "author": "Flat_News_2000",
            "body": "This sounds like the science of skull shapes being tied to criminality.",
            "score": -32,
            "replies": [
                {
                    "depth": 1,
                    "author": "spinbutton",
                    "body": "Not really. We all use facial expressions every day to judge people's moods. Facial expressions are cross cultural and very consistent. They are instinctive. That's why you can get the gist of what is good ng on in a foreign film even without subtitles.\n\nFacial expression interpretation is sometimes difficult if you have autism. But the facial expressions you make  are recognizable by other people.",
                    "score": 20
                }
            ]
        },
        {
            "depth": 0,
            "author": "don_Mugurel",
            "body": "“Women on birth control” tend to dislike men who possesive “aggressive traits”. But do prefer them when off it. \n\nThis is because hormonal birth control “tricks” the body to think it is pregnant. And pregnent women historically had a better survival infant rate by avoiding “aggressive” men.",
            "score": -15
        },
        {
            "depth": 0,
            "author": "KirillNek0",
            "body": "So... Black piller are vindicated and justified.\n\nWhat else is new?",
            "score": -17
        },
        {
            "depth": 0,
            "author": "0ldgrumP",
            "body": "Theres also a new study that reveals that men are not showing interest in most modern women especially when all they do is post their bodies online for the world to see and seek attention like narcissists",
            "score": -16
        },
        {
            "depth": 0,
            "author": "captainboringpants",
            "body": "Wow, another brain buster out of academia.  Who would've thought that malicious looking people would be less appealing on dating apps?  Glad people devoted time and energy to this totally unpredictable breakthrough.",
            "score": -16
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -35,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -59,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 24
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "grby1812",
            "body": "Yes, but the ones that do respond? They respond a lot harder",
            "score": -2
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": -33,
            "replies": [
                {
                    "depth": 1,
                    "author": "hananobira",
                    "body": "And every fan of Grand Theft Auto wants to quit their job to steal cars and shoot police. Anyone who watches Saving Private Ryan or Band of Brothers wants to live through WWII.\n\nOr maybe the entertainment you choose in your free time is just harmless fantasy and shouldn’t be used to make sweeping judgments about your personality.",
                    "score": 31
                },
                {
                    "depth": 1,
                    "author": "OddWilling",
                    "body": "Fantasy is different. There are some women who like dangerous men IRL, of course, but I would say the majority only like them in fantasy. \n\nI also want to note that in the fantasies they are not actually hurt by the dangerous men. They're protected by them.",
                    "score": 34,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "McFlyyouBojo",
                            "body": "Yeah I was gonna say, things we fantasize about, we are fantasizing in the most idealistic way. There are certain things that people are \"in to\" because they only consider it without any of the drawbacks because it is fantasy, but when they actually get to experience what they think they are in to, they are confronted with harsh realities of all the drawbacks.",
                            "score": 20
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "littlemamba321",
                    "body": "These tropes generally resonate with some or maybe even a lot of women precicely because fiction is a safe way to experience danger and thrills",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "IceCorrect",
                            "body": "While you won't date a vampire, you would definitely date guy who beat others for fun, take part in criminal activities. But yea, criminals are only seen in fantasy books",
                            "score": -11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sad_and_stupid",
                                    "body": ">you would definitely date guy who beat others for fun, take part in criminal activities\n\nwhat?",
                                    "score": 12
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}