{
    "title": "\"Sponsored\" games",
    "comments": [
        {
            "depth": 0,
            "author": "adotang",
            "body": "A big problem with the modern internet is that it's become a shared space for everyone, including kids. It feels like there are barely any child-oriented webzones anymore, which is why you have kids scrolling through adult-oriented social media and seeing ads for Sephora and stuff even though they shouldn't really be putting that stuff on. Roblox used to be quite child-oriented but has shifted more toward teenagers and adults in its games, ads, and presentation (usually out of its control, devs will make what they will, and advertisers care more about where they advertise than who they advertise to and how their ads are presented). It's a big discussion that I won't put down here.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wojakersonthe7th",
                    "body": "Yea, I think the reason most people are leaving Roblox is because they are making it more adult based, like allowing people to make 18+ experiences. I don't want to send Roblox my ID just to play a game I bought a game pass in, but I don't think they should have even done it in the first place. along with the fact roblox has gone from a fun place to a place where they shove advertisements everywhere.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EmuNew3698",
            "body": "They crossed the line for me with the Gucci events. (Also got an elf ad under this post lol)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wojakersonthe7th",
                    "body": "Yea, the clothing / item based bullying irl is enough, showing off gucci to kids isnt really a smart move.",
                    "score": 1
                }
            ]
        }
    ]
}