{
    "title": "Roblox The Classic event games are dissapointment",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "As a general reminder, if you are looking for new games to play or want to show underrated games, consider looking at and contributing to the subreddit list here: https://www.reddit.com/r/roblox/wiki/places\n\nAdditionally, we have a weekly post for users to share or ask for games. You can find some of these posts [here!](https://www.reddit.com/user/BloxBot/submitted/)\n\nAs this is a frequent question on the subreddit, it benefits everyone if there is a centralized spot to make it easier to look for games to play!\n\nThis is an automated comment. Your post has not been removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/roblox) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "that1persn",
            "body": "Yeah I don't want to play Adopt Me or Blade Ball lmao",
            "score": 49,
            "replies": [
                {
                    "depth": 1,
                    "author": "ScaredSaber",
                    "body": "must do it for the item I must trust me that’s the only reason why",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Sh4dow_Tiger",
                    "body": "The adopt me and bladeball events are so ass, 4 hours of my life I will never get back",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fireteal_",
            "body": "fr tho. toilet tower defense is like the opposite of what classic roblox stood for",
            "score": 52
        },
        {
            "depth": 0,
            "author": "TheUnwaveredOne",
            "body": "honestly bro, the event lobby is very awesome, sure the games might've not been picked out, but it's still a great event so far, remember, most of the player base is children, not people who've been playing since 2008, so they HAVE to add in some popular games to appeal to the younger audience",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "Kool93",
                    "body": "Im pretty sure some of the older games would appeal to kids aswell. I mean literally SFOTH was the stuff back then.",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "MasonJames136",
                    "body": "The platform has always appealed to younger audiences, so being able to choose from a selection for all audiences over the years would be possible",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EmilySuxAtUsernames",
            "body": "i mean like choosing classic roblox games would require those devs to make a update",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Colette_haha",
            "body": "The first I played is actually decent being tower defense simulator ",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Gammaboy45",
            "body": "Okay, genuine question. Every time people say “this event bad” they talk about it including TTD. Having not played it, I’m genuinely confused if this is about how bad the game is mechanically or if ya’ll are just trying really hard to project superiority to gen alpha brainrot. I’m certain TTD can’t be the worst thing about this event.",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "spaceforcestudios",
                    "body": "Idk why everyone fixates on it. The toilet tower event isn't even that bad. It's probably because of the brainrot element, but that isn't even present in the event",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Gammaboy45",
                            "body": "Well I still think fixating on “this is something for babies!” is quite annoying. You can criticize it for less shallow reasons than skibidi toilet, but they insist that that alone is enough evidence to discredit an entire event. If I’m going to agree with you, it better be for the right reasons.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "YawnMcie",
                                    "body": "It’s such a shame how that’s THE reason why everyone hates this entire event. It’s not even a real reason, like they just want something to hate on for the sake of it. “It’s for babies” is not a great reason, and it’s so weird how they fixate on this one game because of that, when there are so many others 😭\n\nLike, the TTD event isn’t even all that bad, they did a good job. Struggling to find any actual critique so far.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "inexistentbraincells",
                                            "body": "look, as someone who has not played ttd because I dont like the genre of tower defense except tower heroes, I entered the game and tried the event on easy mode and if the theme of the event is classic, than the devs did just nothing for the first map where it was just a map from the toilets to the city, there weren't any themes in the map either. The final enemy aka toilet magnet helicopter thing had 160k+ hp and the devs said we just needed to use the starter towers. I only used some big speakerman (or cameraman idk) due to having been gifted it by a stranger and even having spammed all of them max level i couldn't even do half of the second boss' hp but fortunately it wasn't necessary that i had to kill it. but all of that combined together did not give me a good first impression of the way the devs handled the event other than the main lobby (which wasn't good either)",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "YawnMcie",
                                                    "body": "I also despise tower defence games, and will be skipping TTD. But one game shouldn’t be a make or break for this many people ykykyk",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "nehuiloco",
                                                    "body": "I think you chose the wrong map for the event. The event map is Crossroads themed.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "inexistentbraincells",
                                                            "body": "why would they allow non event maps be part of the event (clocks were rewarded) ugh but thanks",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Random0415",
                                            "body": "They hate it because the game's aren't \"classic\". Which, while i see the logic, I don't really agree with because the event isn't quite about classic games, but a \"classic/old roblox\" theming. Most \"classic\" games are nonfunctional, not old enough, and/or dead.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "YawnMcie",
                                                    "body": "The theme is classic yeah, that’s what they were going for. But I’m talking more about how they hate on the entire event because of TTD specifically. It’s so weird, how can one game that’s also optional ruin an entire event 😭",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Random0415",
                                                            "body": "I'd blame that on the community acting like 5 year olds and constantly whining. TTD isn't an awful game but skibidi toilet doesn't have a great reputation because of the media ruining it, and then turning that into one of those gacha tower defense games is just not gonna be a liked combo.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "aperturesci_ence",
            "body": "This event is an horrible event. Imagine Roblox's face when they see this drama happening. I've quit this event already, expect hundreds of dislikes soon.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "Gammaboy45",
                    "body": "I don’t think this will change their minds? They built a platform angled towards the most gullible and easily captivated audience. Your voice means nothing to them, now.",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "MasonJames136",
                    "body": "I really don’t think they give a shit about a couple thousand of people voicing themselves lol",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bitter_Board2253",
            "body": "ttd is bad cus alot of cringe in it",
            "score": 5
        },
        {
            "depth": 0,
            "author": "Mingopoop",
            "body": "The only good games in the event imo are tower defence simulator and arsenal",
            "score": 9
        },
        {
            "depth": 0,
            "author": "BathIll530",
            "body": "Hate me, beat me, do anything, but when yall understand that roblox cares about new players who are playing these games. Cuz most of us 'oldgens' will leave roblox in next +- 5 years while the new gens will make them tons of cash. So first of all, roblox makes events not to play on nostalgia or smth . They make an event for money, smth like that, yeah its sad, but that's understandable. ☹️",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fralite",
                    "body": "But this event is about nostalgia...but dang Roblox really failed to understand the word classic.",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "Mackenzie_Collie",
                    "body": "If they're going to be greedy and use people's nostalgia for marketing, at least do it right so they actually do get money",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mojo_Mitts",
            "body": "The prizes aren’t worth the grind tbh, but then again none of the events ever really have prizes worth it.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "mirayukii",
            "body": "I imagine that it’s probably because a fair bit of those old games haven’t been updated in forever and wouldn’t work for this event in they same way these newer games do",
            "score": 2
        },
        {
            "depth": 0,
            "author": "mugcn",
            "body": "Old players are not the target demographic, especially now. Bringing back old school games to be featured in this event would be much harder to pull off, as they are largely outdated games which practically nobody plays anymore. Furthermore, the developers of those games most likely don’t play Roblox anymore and/or wont be willing to revive projects they made so many years ago, especially since they’d have to adjust to a new engine experience, which basically puts them back at the bottom of the learning curve. Not to mention, a good majority of Roblox users are young children; It’d be like forcing them to play with toys that their parents played with. It’d be a massive downgrade to them unlike their parents where that was all you could play with, or you simply did not. Now, compare that to the popular games of today, which are updated consistently, (typically) more action packed, the most popular among users which are primarily those young children from earlier, and generally just look and feel better. The developers of those games could just make one of their own classic themes instead, since they got the updated knowledge of the engine, and it would not entirely take away the luxuries, so to speak, that we can experience now, unlike the problems and limitations older games had back then.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Affectionate_Dot2334",
            "body": "and also, one of the few SOMEWHAT old games (bee swarm sim), the event is bugged and disables all bees",
            "score": 1
        },
        {
            "depth": 0,
            "author": "_Murd3r_",
            "body": "They also need to appeal to the newer player base too.. adding some more classic games would've been better, but I can't say I'm oppose to the newer games added. Even some of the games that are in the event, \"Blade Ball, Arsenal, etc\" did a really neat event and actually put in the effort.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "zsLL",
            "body": "i remember playing toilet tower defense in 2010",
            "score": 2
        },
        {
            "depth": 0,
            "author": "nerdyguylol",
            "body": "bro it just came out like 5 mins ago check it out before u judge",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "GamerBlock_official",
                    "body": "what the hell do u mean, theres nothing to analyse, its skibidi tower defence, adopt me, and other games that are not classic AT ALL",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Chis200",
                            "body": "Do you guys ONLY care about whether the games are authentic? Nothing about the actual quality of the games and how fun they are?",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "spaceforcestudios",
                                    "body": "Yes. They see toilet tower defense and ignore everything else about the event",
                                    "score": 9
                                },
                                {
                                    "depth": 3,
                                    "author": "Refuse-Fantastic",
                                    "body": "yes, I do care if the \"classic\" event has \"classic\" games or not, moron",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "nerdyguylol",
                            "body": "didnt adopt me come out in 2017?",
                            "score": -6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Fralite",
                                    "body": "Yeah but roblox classic theme is literally near 2010 or older. \nWe could say probably 2010-2015 or 2016.\n\nBut adopt me is not really that recognize as classic at all considering the population and the gameplay itself",
                                    "score": 11,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nerdyguylol",
                                            "body": "hm yeah i can agree on that but as a guy who joined in 2021 i wanna see what it was like back then but a lot of old games had been abandoned so roblox kinda needed to lean on the newer games",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Fralite",
                                                    "body": "Sad part is they could least made another set of portals to connect older games.",
                                                    "score": 4
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "GamerBlock_official",
                                    "body": "that isnt classic, why are you trying to defend this cashgrab event",
                                    "score": 14,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "nerdyguylol",
                                            "body": "u just do u ima just play the games lol",
                                            "score": -5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Clay_idv",
            "body": "I mean, “og” games probably would’ve been added if the creators of those games were willing to join the event, but they weren’t.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[removed]",
            "score": 1
        },
        {
            "depth": 0,
            "author": "scott123quartz",
            "body": "i have no clue what i'm supposed to do for blade ball, it tells me to collect tix but there's no tix to be found anywhere, and the arsenal event has difficulty spikes and it's broken as well so you can't even beat it",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ok-Presentation6599",
            "body": "the thing people miss a lot is that it isnt roblox picking the games, but rather people just applying to be in the event",
            "score": 1
        },
        {
            "depth": 0,
            "author": "spaceforcestudios",
            "body": "Bro. The game selection isnt the point. The point is the actual event. The actual event is pretty good. Have you seen the amount of stuff u can do just in the lobby? The events also ha e much more effort than the hunt.  This rivals 2018 egg hunt in terms of quality",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "inexistentbraincells",
                    "body": "my gripe is that they made a dev hunt as the main gameplay of the event, i can't just play the lobby to get everything they could reward me, if they felt like it. they couldve hired a team to make a classic-ish event game but I dont know what roblox, the corporation, can do.\n\nBUT the lobby is prob the best part imo as it has the most soul",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "hwithsomesugarcubes",
            "body": "im chill with it.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "Connect_Ad_7949",
            "body": "Y'all please don't waste your time on Arsenal for the event. Half baked at best and mundane especially if you only use the pistol",
            "score": 1
        }
    ]
}