{
    "title": "Classic Event is not classic at all.",
    "comments": [
        {
            "depth": 0,
            "author": "acidbb",
            "body": "I will say this again.\nThere are actually quite a few Older GENUINELY classic games that could have been added to this event. These games all still have present updates and fan bases as well.\n\n1. Survive The Disasters\n2. Survival The Natural Disasters\n3. Work at a Pizza Place\n4. Blox Hunt\n5. Death Run\n6. Murder Mystery\n7. Hell, even Bloxburg fits better in the classic category compared to the games they chose.\nI'm sure others could come up with additional games to these. \n\nThis was a chance they could have taken to advertise these older games and more to really give current day players a taste of what \"classic Roblox\" is. I feel like it was blown",
            "score": 53,
            "replies": [
                {
                    "depth": 1,
                    "author": "that1persn",
                    "body": "Work at a Pizza Place was a classic when I was younger. That the Disaster Survival games. Really crazy how none of them are in the classic event.",
                    "score": 19
                },
                {
                    "depth": 1,
                    "author": "Potato_Cellar",
                    "body": "How about Base Wars? That game is still rolling strong and has been an instant hit since 2008. Could work way better as a shooter presented than Arsenal, in terms of that classic feel.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "Realterin",
                    "body": "I dont think bloxburg would be in the classic because it's not f2p, but yeah bloxburg deserves to be in the event",
                    "score": 7
                }
            ]
        },
        {
            "depth": 0,
            "author": "stooie1",
            "body": "i love corporate nostalgiabait!!!",
            "score": 10
        },
        {
            "depth": 0,
            "author": "adotang",
            "body": "[Don't make me tap the sign.](https://www.reddit.com/r/roblox/comments/1cwxrie/comment/l51l15v/)",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fralite",
                    "body": "I mentioned it in the first part of my post but not really detailed like yours, most of the old classic games are impossible to get an event out of it due to reasons or obviously abandoned. With what I've said on the last part, they could have least added more portals that would connect to older roblox games. While keeping the ones that could monitize the event.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "AeroSniper4K",
                    "body": "That does the justify anything whatsoever.\n\n> I'll say it now and forevermore: the reason classic games aren't included in this event is because they don't make money or have very high playercounts.\n\nPlayer count shouldn’t even be a reason to not include anything, it makes no logical sense. And if Roblox really cared about making this event good, they wouldn’t care about the money.\n\n> The Iron Cafe has been dead for like a decade now and has zero monetization, while I believe The Plaza is a shell of what it used to be.\n\nThere are plenty of other classic games that could be included.\n\n> Ditto with NDS and WAAPP, which while still popular, don't really have much in the way of monetization and are very focused on what the player is supposed to do (survive disasters and complete work tasks).\n\n??? How is that bad?\n\n> Another factor is how their game design doesn't really permit being able to complete side quests; you can't really hop off a match of NDS to complete an obby, for instance.\n\nDidn’t stop the terrible hunt event from including lots of tasks like “Play this game for 5 minutes!” or “Play this game for 10 minutes!” or “Unlock this thing after playing for 5 minutes!”",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "HuskyTheGamerDog",
                    "body": "Yeah you shouldn't when you're not making sense, the entire event is all about the old Roblox games, there's nothing that could justify a complete lack of their inclusion when this event is everything those games are and they deserved to be part of it",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "that1persn",
            "body": "Yeah I joined the hub thing and tbh it really doesn't feel like a classic event at all. I mean the hub has some older looking things and has tix but that's about it. That's the only classic part of this event. The games don't remind me of classic roblox, but maybe Roblox thinks classic as later than I think it is. I think classic roblox being like 2006-2013 or 2014.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Vaxtez",
            "body": "The items are not overly bad (leagues better than what we got in the hunt) and the quantity needed is alot better (on paper), but the game selection ruins it badly.\n\n  \nOk edit: Dear gosh these tasks are actually painful. Driving empire feels P2W, TTD is painful if your new and playing solo and so on.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "DangerousBus7202",
                    "body": "I can agree, I joined arsenal, thinking it was gonna be simple... I spent nearly an hour trying to beat the event normally solo. By the time I was done with it, I basically didn't want to play Arsonal again, so thank Roblox.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Level_Sprinkles549",
            "body": "i know. i really can't get on rbx atp. how many games associated with the event if i may ask?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fralite",
                    "body": "13 portals? I've used this post as a reference: [this](https://www.reddit.com/r/roblox/s/NvBVgBm4DB)\n\nI've closed roblox since I just wanna peek at the event",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Senior-Tree6078",
            "body": "Adopt Me *could* be \"classic\" if you consider classic to be before 2019, but I'd rather have snow shoveling simulator because at least THAT game is old compared to a game that has more scammers than team fortress 2 has bots",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NearlyImpressive",
            "body": "The event doesn't feel like old Roblox or Classic at all.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "blobredditor",
            "body": "sbs, waapp, mm2... there are still active classic games",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lance3015",
            "body": "i only joined in 2021 (before that i always thought roblox is a cheap minecraft clone for little kids lol, i didnt know any better). i really liked the hunt event as it was my first event, and i got all 100 badges. but now im really struggling in the classic event. not only dont i know what to do to get the tokens, i mostly cant find the tix aswell, even when exploring the entire map haha. every time im rage quiting eventually\n\ni made myself a bloxy classic r6 avatar for the event tho haha",
            "score": 1
        },
        {
            "depth": 0,
            "author": "6VON",
            "body": "the fact they added TOILET TOWER DEFENSE to a CLASSIC ROBLOX event?? what about that is classic??",
            "score": 1
        },
        {
            "depth": 0,
            "author": "brick-jojo",
            "body": "I'm so confused, I thought the point of the event was to make MODERN roblox games into CLASSIC ones? I thought that was always the intent, rather than like.. actual classic games from both a business strategy from Roblox's POV and giving something 'new'",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aperturesci_ence",
            "body": "This event is bad. I just stopped playing it entirely. This event is so bad.",
            "score": 0
        }
    ]
}