{
    "title": "What a fucking disappointment ",
    "comments": [
        {
            "depth": 0,
            "author": "Toxictality",
            "body": "Fuck Roblox man I hope their company goes into decline",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Refuse-Fantastic",
                    "body": "spittin bro. devastated at how shit this event is",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "YawnMcie",
                    "body": "bro is going through it 😭🙏",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Toxictality",
            "body": "If you think I’m overreacting please hear me out, roblox from 2013-2017 was my childhood man, heard the news they bring back “classic” stuff rlly made my day, imagine not being able to revisit your child hood memories because is in the past. Hyping for 3-5 days only to be greeted to over priced shit, 0 games related to classic, and low reward. I’m so fucking stupid getting bait by Roblox using the word “classic” man I just got “scam” with my feelings and this really pissed me off",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Toxictality",
                    "body": "I swear lobby feels like one of those brainwashing tunnel making you think you enjoying it but really they just want your money .FUCK ROBLOX",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Alleycat2557",
            "body": "i mean hey, atleast they’re giving us something to do. sure its still enraging to see fucking toilet tower defense up there and not doomspire brickbattle but its better than not having an event like how it was for the past 4 goddamn years.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Toxictality",
                    "body": "It’s cool you have an attitude towards to good side first but idk man, hopes for the best, results in a disappointment is a feeling I hate the most",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Alleycat2557",
                            "body": "im hoping for it to be better too",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}