{
    "title": "Hey /r/Roblox! Want to share a cool game you made or found? Getting bored with the front page, or need something new to play? Post your suggestions here! (week of May 18, 2024)",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "As a general reminder, if you are looking for new games to play or want to show underrated games, consider looking at and contributing to the subreddit list here: https://www.reddit.com/r/roblox/wiki/places\n\nAdditionally, we have a weekly post for users to share or ask for games. You can find some of these posts [here!](https://www.reddit.com/user/BloxBot/submitted/)\n\nAs this is a frequent question on the subreddit, it benefits everyone if there is a centralized spot to make it easier to look for games to play!\n\nThis is an automated comment. Your post has not been removed.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/roblox) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CDRedstone",
            "body": "Looking for feedback on a game I've made. It's a facility game/core game. (I know, quite a niche category) Here's the link, check it out if you want: [https://www.roblox.com/games/13473180530/](https://www.roblox.com/games/13473180530/)",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "DOUBLEX01",
                    "body": "this is probably the first time i've ever seen someone outside of a core game who is into facility/core games on roblox. i'm definetely checking it out",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NoobieBlox",
            "body": "[Nex Tower of Hell \\[Well built parkour game\\]](https://www.roblox.com/games/13224311959/Nex-Tower-of-Hell-EVENT#!/about)",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Severe_Box3675",
            "body": "burgeria.\n\nits kinda like a papas game. goated tho",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mynameisnotaura",
            "body": "idiotic investing",
            "score": 1
        },
        {
            "depth": 0,
            "author": "mustarfa",
            "body": "northwind, trust me best coop",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dense-Ad4627",
            "body": "shoot universe [https://www.roblox.com/games/17554755845/Shoot-Universe-tps](https://www.roblox.com/games/17554755845/Shoot-Universe-tps)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DOUBLEX01",
            "body": "I have two games that i think are pretty fun. The first one is Doomspire brickbattle. Basically a game by shedletsky from 2007 (i think) where there are four towers and four teams. you get classic weapons and you have to wipe out all the other team's spawns. My second game is Super Doomspire. Basically it's like the aforementioned Doomspire Brickbattle, but it's much more.. modern? there are more weapons, a shop, and alot of stuff. it blew up i think somewhere between 2020 and 2023. fun brickbattle games, you should try them out.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "nairdasugoisonreddit",
            "body": "Yo uh, found this very very underrated game called \"Cart ride to the center of the universe\", it might look bad and its 30 minutes long but its just beautiful, with the scenes your time goes flying, played 2 times no regret, here link:\n\n[https://www.roblox.com/games/6365212424/Cart-Ride-to-the-Center-of-the-Universe](https://www.roblox.com/games/6365212424/Cart-Ride-to-the-Center-of-the-Universe)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hutcle",
            "body": "I made a retro fighting game: [https://www.roblox.com/games/17181324426/Showdown](https://www.roblox.com/games/17181324426/Showdown)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Virtual-Card-3575",
            "body": "Space tycoon is a cool game that has not had a lot of exposure because of bad ads on roblox, please give it a look if you could!!!             [https://www.roblox.com/games/7535149098/Space-Tycoon](https://www.roblox.com/games/7535149098/Space-Tycoon)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "IronKnight238",
            "body": "Found this interesting sort of horror game that seems to revolve around the whole Old vs New Roblox issue. Not really overly scary but it's a neat concept.\n\n[A Nostalgic Hangout Game...?](https://www.roblox.com/games/13892378955/1-A-Nostalgic-Hangout-Game) (Part 1)  \n[A Crossroads Hangout Game...?](https://www.roblox.com/games/14439504489/2-A-Crossroads-Hangout-Game) (Part 2)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "skeebys",
            "body": "is this allowed? Blade ball serious breach of privacy\n\nI’ll tell the full story here, as i really want opinions on this or to know if this is even allowed? I got banned in blade ball pretty unfairly and it was a massive breach of my privacy. \n\nSo, this was around October last year. I was playing blade ball in a  public lobby, and an admin (Of blade ball) joined. Her name was Kitty, and after playing for a few rounds she assumed i was hacking. She told me to do a pc search or i would get banned. Of course, i wasn’t hacking, so i accepted. We exchanged discords and i got added to a group chat with her, and another guy. She told me that the other person was her boyfriend and that he would be pc searching me. Not really understanding the whole situation i just didn’t want to be banned so i agreed with what they told me to do. They made me download anydesk, a remote access tool that allows them access to my pc, they can move my mouse, type etc. They then searched through all of my files, downloaded searching programs like a program called process hacker, search everything, voidtools. This went on for about 15 minutes with him on my pc and i was getting kind of worried. Eventually though, after not finding anything, the admins boyfriend got off my pc and said in the chat “Well you’re annoying anyways just ban him” And kitty did ban me. It’s a permanent ban, tried to appeal but got denied. Messaged some moderators but they told me in order to get unbanned id need to give them 50k robux. I would provide screenshots but they kicked me from  the group chat after the ban, and i’m banned from all blade ball servers, including the appeals discord.\n\nIm not sure if this whole screen sharing thing is even allowed? It’s a huge breach of my privacy. Not to mention the fact that they actually didn’t find anything, and still banned me despite me spending like 20k robux on that game. Just really sucks. Any advice? Can i go anywhere with this? Thanks",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Natural-Temporary-61",
                    "body": "that situation sounds pretty messed up, and it definitely raises some red flags. Let's break it down:\n\n1. **Privacy Violation**: What they did by making you install a remote access tool and searching your files is a huge breach of privacy. Legit game admins and moderators typically don't do that. They have other tools and methods to detect cheating or hacking that don't involve invading your personal space like that.\n2. **Unfair Treatment**: Banning you despite finding nothing is super unfair, especially after you complied with their invasive request. It's like getting punished for something you didn't do.\n3. **Extortion**: Asking for 50k Robux to get unbanned? That's straight-up extortion and completely unethical. No legit admin or mod would do that.\n4. **Anydesk**: Using Anydesk for such purposes is sketchy at best. Anydesk and similar tools are meant for legitimate remote support, not for game admins to snoop around your PC.\n\nHere are some steps you can consider:\n\n1. **Report to the Platform**: Contact Roblox support directly and explain the situation. Provide as much detail as possible. While you might not have screenshots, your detailed account of what happened might be enough for them to take action or at least investigate.\n2. **Cybersecurity**: Since you gave them remote access, make sure to change all your passwords and check your system for any malicious software. Tools like Malwarebytes can help scan your system for any unwanted programs that might have been installed.\n3. **Community Awareness**: Share your story on relevant forums and communities. This can help warn others about the potential abuse and maybe even rally support for your case.\n4. **Legal Advice**: Depending on your location and the severity of the breach, you might want to consider seeking legal advice. Unauthorized access to your computer can have legal implications, and a lawyer could help you understand your options.\n5. **Public Exposure**: Sometimes, bringing these stories to light can help. Platforms like Reddit, Twitter, or even YouTube can be powerful tools for raising awareness about unfair treatment and privacy breaches.\n\nIt's really unfortunate what happened to you, and I hope you can find a way to resolve this. Stay strong",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "skeebys",
                            "body": "Thank you so much. I have changed all passwords, and i’ve tried posting and sharing this story around but automoderator keeps deleting it wherever i post 😭. I’m thinking of taking legal action on the blade ball studio as im sure kitty and the other moderators would be able to get their accounts dm checked by discord if this were pursued legally and all the of evidence would be right there. It’s impossible for me to contact an admin of blade ball myself as she banned me from all of the servers.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "lolololol13716",
                    "body": "wow, just wow, i have no comment to help i apoligize, but i just realized blade ball devs / mods are horrible, first they make you do a pc search, after not finding anything they ban you because they thought you were afk,  \nafter that, you appeal and they want you to pay robux to get unbanned?? holy hell they are greedy and horrible",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ssd21345",
                    "body": "if you have recording of them doing it you can get them in trouble both irl and inside roblox. If you don't have proof there is no way aside asking popular youtubers to bait them doing it (which is unlikely)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "lolololol13716",
            "body": "balanced craftwars overhaul, its like a boss fighting simulator with waves of enemies, but with a lot of content, theres mines, dungeons, crafting, companions, hidden bosses, and so much stuff, the game revolves around biomes, and enemy spawns you can also get cool but rare boss drops,\n\nheres the game link, [https://www.roblox.com/games/8811271345/Balanced-Craftwars-Overhaul](https://www.roblox.com/games/8811271345/Balanced-Craftwars-Overhaul)\n\nand heres the games trello, [https://trello.com/b/H1f7ajDH/bcwo-trello-general](https://trello.com/b/H1f7ajDH/bcwo-trello-general)  \n(a trello is basically like a wikipedia but in my opinion more convenient)(and the trello is still in development)\n\nheres the discord server, [https://discord.gg/nNkMPc3v](https://discord.gg/nNkMPc3v)  \n(id reccomend you go here for help)\n\nsure the game might bassically bombard you with many features, but its a great game you can spend many hours on",
            "score": 1
        },
        {
            "depth": 0,
            "author": "The-epic-cutlery",
            "body": "[https://www.roblox.com/games/5561268850/Randomly-Generated-Droids](https://www.roblox.com/games/5561268850/Randomly-Generated-Droids)\n\nRandomly generated droids\n\nI love this game 😍😍",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Puzzled_Area_307",
            "body": "Is it just me or does the ESC button not let you leave? I used to be able to click ESC L and then Enter to leave, but this doesn’t work anymore. So when I’m in first person games I cannot leave unless I switch tabs and close Roblox.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "StrangerAdditional93",
                    "body": "no it still works for me",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Emenequ",
            "body": "[https://www.roblox.com/games/17399149936/MINI-UPD-Anime-Crossover-Defense](https://www.roblox.com/games/17399149936/MINI-UPD-Anime-Crossover-Defense)\n\n  \nI think it's a really good game. It feels comfortable, and the progression is neither too slow nor too fast. It's not a game that depends on codes. Everything in the game is easily obtainable if you try. There's a very good balance between the units. You can choose to set the speed to X2. The graphic quality seems very good to me; the colors are neither too bright nor too dull. Personally, I think the animations are amazing",
            "score": -1
        }
    ]
}