{
    "title": "Did we not just had these games last Hunt? ",
    "comments": [
        {
            "depth": 0,
            "author": "Cijex",
            "body": "Ah yes, some CLASSIC ~~games~~ experiences",
            "score": 70,
            "replies": [
                {
                    "depth": 1,
                    "author": "Necessary_Pound4862",
                    "body": "Is bee warm sim classic?",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pixelytman",
                            "body": "not really. it's the closest to classic (the oldest), but it's not a game from the classic era.",
                            "score": 10,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "astral_reborn",
                                    "body": "Arsenal was made in like 2015 so it's not the oldest",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Shadowmere_Playz",
                    "body": "Ah.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lok4na_aucsaP",
            "body": "IM NOT PLAYING ADOPT ME YOU CANT MAKE ME ROBLOX",
            "score": 42,
            "replies": [
                {
                    "depth": 1,
                    "author": "nobody-cares57",
                    "body": "\"We've got you surrounded! Come out and play these places for rewards!\" \n\"I WON'T PLAY ADOPT ME I WON'T PLAY ADOPT ME I WON'T PLAY ADOPT ME\"",
                    "score": 18,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheodorCork",
                            "body": "NOOOOO, I WILL LET BEE SWARM SIMULATOR CONSUME MY LIFE INSTEAD OF PLAYING ADOPT ME FOR AN HOUR!!",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lok4na_aucsaP",
                                    "body": "Flair checks out",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "L3GlT_GAM3R",
                            "body": "You only need like… 36, or something. You can get like 6-10 of them in the lobby, somyou really just need to play like 5 games.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AnTotalOrdinarUser",
                    "body": "Roblox made that you only needed to complete like 2/3 of the games to receive all the rewards",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "aantlord",
            "body": "Man Toilet tower defense gives me so much nostalgia, it was my childhood!\n\n-Literally noone (I hope)",
            "score": 52,
            "replies": [
                {
                    "depth": 1,
                    "author": "LowlySpirited",
                    "body": "They aren't old enough yet. Give it 5 years and they'll appear",
                    "score": 17
                },
                {
                    "depth": 1,
                    "author": "GameMelon_",
                    "body": "*5 year olds in 15 years",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "CardboardSalad24",
            "body": "Classic hub quests were more fun then 11 of those games events unironically (only ones I liked were Gunfight arena and dusty trip) I hate it when roblox makes like half of exclusive items available only through robux or stupid star creator system",
            "score": 10
        },
        {
            "depth": 0,
            "author": "riley_wa1352",
            "body": "the classic is terrible",
            "score": 9
        },
        {
            "depth": 0,
            "author": "mrworldwidearrived",
            "body": "It's literally the exact same games every event and these games have the same quests. It's so lazy.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AndreiR_memes",
            "body": "they had *one shot* to become classic, but they ruined it",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Armored-Duck",
                    "body": "And its not difficult to do it either, they just actively decided not to",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "StopsuspendingPpl",
            "body": "Oh wow who knew this would be a horrible devhunt oh i know EVERYONE. They’re just taking advantage of peoples nostalgia",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Text93838",
            "body": "Ahh yes, classic games",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PuzzleheadedPoint882",
            "body": "This would be good if Roblox hired fans who researched old Roblox to make this much like how Sega hires fans",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Paul_unfunny",
            "body": "Roblox be putting the shittiest moder games in the classic event.\nTo go REALLY classic, let's put, maybe, Heli-Wars in there",
            "score": 4
        },
        {
            "depth": 0,
            "author": "ICantThinkOfAName139",
            "body": "At least it’s better than the hunt, and it’s only better than the hunt because of the hub (which is the best part about the event)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "joeMAMAkim",
            "body": "\"Why no actual Classic games?\" How many old games are still being updated? Natural disasters? Work at a pizza place? What other old games Even gets updates anymore?",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Practical_Door_1934",
                    "body": "They could have at least attempted a couple. Multiple developers have come out saying that Roblox didn’t even try to invite them, games like make a cake, work at a pizza place, natural disaster survival, flood escape, all of those would’ve worked, I understand not making every single game classic but it’s apparent that they didn’t try at all.",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "murstruck",
            "body": "The only \"classic\" is TDS\n\nNot the skibidi toilet thingy the other TDS",
            "score": 1
        }
    ]
}