{
    "title": "What are your thoughts on the \"the classic\" event",
    "comments": [
        {
            "depth": 0,
            "author": "pretzeld",
            "body": "I'm so confused by this event, there are so many things to do in the hub alone and they only gave us 5 days to do all that + everything else???? I don't get it at all.",
            "score": 124,
            "replies": [
                {
                    "depth": 1,
                    "author": "Kuni69gunda",
                    "body": "SAME BRO",
                    "score": 18
                },
                {
                    "depth": 1,
                    "author": "MagicalAnimeBeast",
                    "body": "yea i’m just confused about everything and nothing is giving explanation for what to do. I got super overstimulated just from the lobby alone. I like the little animations and the map though but otherwise there’s wayy too much going on",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pretzeld",
                            "body": "I feel the same way about it. The general style of the lobby also feels inauthentic to me, especially with how the colors are super oversaturated. It looks more similar to Toilet Defense Simulator than any classic Roblox game. 😭",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Twinmill53",
                    "body": "Each game takes an hour to complete which idk seems tedious for 10 tix",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "adotang",
            "body": "The hub is the best part. By far the most genuine-feeling part of the event, the team that made it definitely grew up with Roblox and knew their stuff well. Wasn't expecting the \"guess the name\" walls to show up (especially since 99% of the time back in the day those used copyrighted characters), and it was nice to see HelperBot from Welcome to Roblox Building make a return. I also like how The Classic's event page suggests Tix will actually be a permanent event currency alongside tokens—they were never going to bring it back in full but at this point *any* permanent history callbacks are appreciated—though maybe they should've used Player Points instead of tokens. One joke I actually found kinda funny: the 35 Tix item \"Mom's Dog\", which is a reference to old RP games where there was always someone using the dog or baby morph and asking for a family. Seeing that type of stuff actually brushes really close to Roblox rules on ODers, they must've really had to find a way to argue that one through.\n\nThe existence of secrets in the hub adds to the wanderlust which I like. You could spend a whole day of the event searching the hub with friends. I know soon this sub is going to be full of spoilers, but the existence of game secrets with zero assistance reminds me of when I was younger playing Roblox and other games, because I rarely checked the forums (using it at all was a free warn) and most games were simply not designed to have a community nor guides, so if a game had a secret badge or whatever, either you serverhopped to find someone who knew and would help you, or you got down to searching.\n\nLots of event stuff I don't really understand though, like what the Tix tower is for or why the drink vending machine seems to be important enough to require a 4 Tix coin and a careful selection. But I'm sure that stuff will come later, and will inevitably be fully explained in this sub.\n\nHaven't tried the other games in the event. Partially don't want to. Everyone says \"where's the classic games???\" without realizing there's a reason Roblox, a public corporation with profit-desiring shareholders, always selects their most popular high-revenue games for events, and never older games with lower playercounts that predate DevEx. Still, would've been nice if they got to officially tag along.\n\nIn all, so far, quite surprised. I thought this was gonna fucking blow, and it only *sort of* did. Shame nothing permanent will come from this like retro site themes or client skins. Roblox would definitely win me over if they announced something like that by surprise right as the event ends, but you know they won't, I know they won't, we all know they won't.",
            "score": 63,
            "replies": [
                {
                    "depth": 1,
                    "author": "spaceforcestudios",
                    "body": "Why is this lore rich event only 5 days?I agree with your opinion, better than the hunt by 100 miles. I heard the event games are well made aswell, you should try them",
                    "score": 20,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TruePureGold",
                            "body": "and theres a ton of actually good and well made classic games that they could of used instead of brainrot skibidi toilet game",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Random0415",
                                    "body": "The thing is, those makers of those \"actually classic\" games would have to update their game, and most \"classic roblox games\" are either nonfunctional, dead from a lack of updates, or both.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "L3GlT_GAM3R",
                    "body": "About the no classic games, I hear they pretty much requested a lot that the game devs out a lot of effort into this, or as much effort as they could.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Toast_The_Ghost",
                    "body": "Yeah the dog instantly brought me back to my robloxaville days if anyone remembers that from ~2010. Do you know all the guess the names users? I was able to figure out up to clockwork, I don’t know who the last two are",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fish_4_One",
            "body": "the event is mid as fuck, I mean, at least they lowered the amount of games for the event, but almost none of them are classic, they’re just “classic” themed, which isn’t shocking, but is understandable.\n\nas for the items, I feel they could’ve done better, instead of just re-uploading 2-3 old items with a different texture, they could’ve just re-released old items that have been offsale to fit the “classic” theme.\n\nI really feel like the only heart they put into the event was just the lobby of the main event, which kinda sucks to think about, everything else kind of just feels like a major cash grab and just plain nostalgia bait.\n\nI really do hope Roblox can get to know their community better and take the feedback to make a possibly better event in the future.\n\noverall, I give the event a 6/10",
            "score": 40,
            "replies": [
                {
                    "depth": 1,
                    "author": "ItsFastMan",
                    "body": "They will (hopefully i swear) re-release classic items to put onsale, and twin atlas did an incredible job on the hub its truly the best i've ever seen",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "spaceforcestudios",
                    "body": "Everyone says none of the games are classic, but what do you want them to do? Put sword fight on the heights on the front page and call it a day? Guess what. They literally did that yesterday as part of the promotion. This is like expecting only Easter games to be in the Easter hunt. It's silly, limiting and doesn't achieve much",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fish_4_One",
                            "body": "sorry, I didn’t specify by what I meant in “no classic games”, I just meant games from the 2009-2015 era which are still alive and thriving today and are at least on the front page, in which there are almost none, some that are still alive are just waapp, nds, sr4, epic minigames, lt2, and maybe some more, which were advertised the day before the event but never made it into event which was kind of odd, I was atleast expecting nds or epic minigames to be one part of the event.",
                            "score": 6
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "yannick5612",
                    "body": "The modern game issue is definitely a problem, but certain games like a dusty trip went all out",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TungstenAlloy678",
            "body": "having toilet tower defense in there is a crime",
            "score": 31,
            "replies": [
                {
                    "depth": 1,
                    "author": "Difficult-Week7944",
                    "body": "Having any of the games that are there don’t seem right make the haves classic ones not blade ball or (redacted) tower defence",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BarristerBerry",
            "body": "would've liked actual classic games",
            "score": 45,
            "replies": [
                {
                    "depth": 1,
                    "author": "fazal1856",
                    "body": "Not having nds is a crime.",
                    "score": 16,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "reknite",
                            "body": "stickmasterluke probably didn’t want to be part. There’s no way they didnt at least try to get nds.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "darhwolf1",
                    "body": "Same. Not worth it for the items ngl. The hub is really cool, but the rest of the event is mid",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "strawberrysoda5",
            "body": "The hub is awesome!! I decided to do livetopia first because I assumed it would be the easiest and so far i'm liking it. I do wish that the event would have stayed a full week but I think thats my only complaint so far.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "riley_wa1352",
                    "body": "the dragon game is prty good. it just doesnt fit the theme imo",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Axolotl_Man",
            "body": "I’m more excited about the public audio update stuff found in the API",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "adotang",
                    "body": "Huh? What public audio update? You mean the return of actual sound effects and user-uploaded audios?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Axolotl_Man",
                            "body": "[https://www.youtube.com/watch?v=lfJKs4XTRHQ](https://www.youtube.com/watch?v=lfJKs4XTRHQ)\n\nGreenlegocat's April Fools' videos keep coming true, I swear...",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BakeNoodle",
            "body": "I find it rudely blatant how much they don't give a crap about the community, they really released 2 bundles for 200 dollars that would even be worth a tenth of their price as well as the rewards looking quite basic.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "UsernameArentCool",
                    "body": "no sane person would buy robux for the bundles lmao people can get the robux from games and with premium payouts",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Chis200",
                    "body": "Nobody who isn't stupid is buying it having it there is a completely victimless crime and makes the event more profitable",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Clay_idv",
            "body": "I’m happy they’re at least starting to listen to the community :D",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Crossiiant",
            "body": "It's alright but most of the selected games are just meh",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Brilliant_Win_1034",
            "body": "it's alr ig, 5 days kinda short but at least the avatar items are wearable👍",
            "score": 3
        },
        {
            "depth": 0,
            "author": "mlpfreddy",
            "body": "Bring tix back permanently I don't care what people say about it throwing off the economy that can be fixed in 2 ways.\n\n1. By having points actively given out on completion of tasks on verified games. This stops people from afking. By having random tasks it makes it so hackers can't set up bots in companion with a auto clicker detecter they could bring it back permanently. Having every 100 points give a tix and every 100 tix to a robux this makes it so you actively earn rewards playing games.\n\n2. Have a tix exclusive item shop much like they are doing in the event but tix would be the unable to be transferred into robux whole point of the tix shop being it let's smaller verified creators to get their items known thus making more people create items for the normal roblox item store. Let's say people really like some dinky snake boots or something they buy it with tix (1 earned hourly) and then that creator gets featured on the roblox item store in like a top 10 tix earners so you can check out their other better stuff.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "LucidS58",
            "body": "It's garbage that has literally nothing to do with classic roblox and exists for the sole purpose of being a fucking cash grab.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "spaceforcestudios",
                    "body": "U sure? Have you actually played it?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "LucidS58",
                            "body": "The only thing thats “classic” about it is the hub where you go to the non-classic games. Literally the three games promoted to the top are all games that were made last year and are only part of the event because they made roblox a shit ton of money.",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Pivern",
            "body": "First thing i saw were two bundles that costed 19000 buxs",
            "score": 2
        },
        {
            "depth": 0,
            "author": "AmadeoOOFDeReddit",
            "body": "DUDE NOT EVEN A SECOND PASSED",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Bonnie_BS_Main",
            "body": "It's good, except TTD and Blade ball, and also the fact that it's only 5 days",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Flameelliot854",
            "body": "The hub is the only real good part of it.\nThere’s no classic games, it’s all stuff like “Toilet Tower Defence” or whatever.. like I wanna play the games of my childhood not whatever kids now are playing 😭",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Just-a-Stick",
            "body": "I honestly ecpected much worse",
            "score": 1
        },
        {
            "depth": 0,
            "author": "qaanag",
            "body": "It's \"fun\" but kinda disappointing to me... It's supposed to be nostalgic, right? Why not add ACTUAL classic games??? ( - . - \")",
            "score": 4
        },
        {
            "depth": 0,
            "author": "hwithsomesugarcubes",
            "body": "awesome, looks nice.\n\nthe items are really cool looking too",
            "score": 1
        },
        {
            "depth": 0,
            "author": "spaceforcestudios",
            "body": "Better than the hunt by far....",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TrainingUnit51",
            "body": "Honestly it's alright just not my cup of tea",
            "score": 1
        },
        {
            "depth": 0,
            "author": "The_Steam-Cheese",
            "body": "has potential, better than the first, they just need 2 include other games",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Fabulous_Watercress6",
            "body": "They should've added classic games",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Mastakillerboi",
            "body": "What is going on",
            "score": 1
        },
        {
            "depth": 0,
            "author": "y_kal",
            "body": "Tix seem useless. Some events have repetitive quests for the ropoints like arsenal. I haven't even touched the other games except bee swarm.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Necessary_Pound4862",
            "body": "Like a 7.5/10",
            "score": 1
        },
        {
            "depth": 0,
            "author": "IronKnight238",
            "body": "I've been enjoying it. It's about what you would expect for classic themed.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InnerRabbiTan",
            "body": "It feels like most of the effort went into the hub. The included games honestly feel like an afterthought. I don't really have much of a problem with the games themselves as long as they were able to capture the event's style, but to my disappointment a lot of them seem to be tedious and bland.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Practical_Door_1934",
            "body": "Could’ve used some different games honestly. We’ve seen most of these games in the hunt, you would think a classic event would attempt to incite some classic games right? Nope cause toilet tower defense makes more sensr",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Etuber4",
            "body": "surprisingly good tbh",
            "score": 1
        },
        {
            "depth": 0,
            "author": "troitheidiot",
            "body": "The Hunt was a clusterfuck of games. Too much games, too less time. Yet, a step in the right direction.\n\n\nThe Classic is a whole other page. Just the hub alone is worth a whole ass essay to write about. The games are meh, but they're low on number this time. \n\n\nWe're so Roback.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheodorCork",
                    "body": "Agree, with almost everything except the game bss being  meh, definitely not biased to the game",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cody645",
            "body": "I’ve only had the chance to try it out for about 5 minutes, but very early thoughts. \n\nSo far, not much stood out as blatantly awful other than the premium items and those two ugly packages that cost a fortune, but I was expecting that. Otherwise, it’s charming, lots to do in the hubworld alone and the partner games seem for the most part to be not too shabby. \n\nI will echo someone else’s comment and mention that a little over 5 days seems awfully short for an event of this size. We’ll see!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "youresowarminside",
            "body": "too much to do in only 5 days but launching people with rocket launcher is really fun and fun fact about it: people with ugc items get launched further than non ugc users",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Vaxtez",
            "body": "It's meh at best?  \nThe theme is brilliant, the Hub is glorious and i so desperatley wish it took more of a center stage as a main game, as it's a great callback to the 2007-2009 era. My praises end there sadly, as i am not a fan of how prizes are obtained. The fact that you have to do well over 35 tasks to do all items, as you lose your tokens when you get a prize. One could argue that it makes the event too easy, and that is a fair point, but i feel as if the hunt's system with prizes was better, as you could continue onto the next item.\n\nAs for the games? Not a fan. From the few i've played (Bee Swarm,Arsenal,TTD,TDS,Driving Empire) most felt painfully reliant on 2 players, as else they were tedious to do (Like Arsenal, TTD if your only there for event with 0 progress) or basically straight up P2W (\\*Coughs Driving Empire\\*), Some were not too bad (TDS was pretty solid tbh). I think the theme of late 2000s - 2012ish Roblox was cool, but the tasks let it down, and i think it's the events main shortcomings. The tasks just feel too monotonus and/or grindy to justify playing it after a while. The 5 day timeframe does not do the event any favours either, as it should be 7-10 Days to be honest.\n\nOverall, its a 5/10 event. Great potential, but it felt wasted.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TheodorCork",
            "body": "Best part is that bee swarm simulator is here",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Just_MessingAround",
            "body": "Fee 2 Pay taxing your childhood edition",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ark3452",
            "body": "i dunno yet, what i do know is that imo, blade ball fucking sucked, the tix spawns are so rare that it feels like they’re just trying to farm premium engagement, blade ball was a fun game other than the event part tho ill admit.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "daniel1234556",
            "body": "I never experienced the old roblox, but a least is good the event because i finished 6 quest and i have 11 left \nThe bad thing are where the event are only for 5 days",
            "score": 1
        },
        {
            "depth": 0,
            "author": "YourAveragelmbeciIe",
            "body": "Haven't played it and honestly don't feel like it. It seems very mid anyway",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ICantThinkOfAName139",
            "body": "The hub is amazing, half of the games are good and the others are absolutely terrible (looking at you toilet tower defense)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "detroit-doggo0",
            "body": "it's good but couldn't they have given us 7 days instead, there's so much to do",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Educational_Plant519",
            "body": "THE HUB IS AMAZING!!!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "throwawayno1998",
            "body": "best thing theyve done since 2018",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Piglordthepig",
            "body": "I was excited until I saw the words \"Toilet Tower Defense\" as the first game on the list.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Huge_Comparison3503",
            "body": "I haven’t really played it due to paper mario ttyd remake, and also only played bee swarm simulator which was pretty good, the thing that makes me mad is that most of these games aren’t even classic and 5 days feels like a crime to do ALL OF THAT, so yeah not the best but not the worst.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Advanced-Hour-108",
            "body": "It’s a tragic mess. I think we should just leave events in the past.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Big-Jellyfish-6115",
                    "body": "A year ago I’d hate for it for saying this, considering how Roblox full on abandoned them, but now it feels like they’re just kicking a dead horse",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "CharlesTheGreat8",
            "body": "best event yet, still not doing it (i dont want to play any of the games there)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "scott123quartz",
            "body": "cheeks",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ToastGhostx",
            "body": "didn't even try it yet because the fuckers running (ruining) roblox took away linux support. again.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sea-Astronomer-8303",
            "body": "I like it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ISAIDWETIEDTODAY",
            "body": "I enjoy the hub and thats it.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Literally9thAngel",
            "body": "I did gunfight arena and didnt get my tokens, which sorta set me off, it just feels rushed imo. I mean we all know blade ball payed roblox under the table for a spot in the event right?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Shot-Actuator-5081",
            "body": "Where are the classic games?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WolfyProd",
            "body": "Yeah it's uh... its an event of all time alright. Not exactly classic in any way other than the lobby sort of but it's the thought that counts I guess... Is what I would say if it wasn't an absolute train wreck.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Upper_Influence_92",
            "body": "It’s actually a bit fun. But it’s confusing. Also 19,000 each for a shitty skin that is supposed to be for a classic event, yet not even half the items work on r6?! Not to mention some of the games don’t make sense for a “classic” event. Like an ass skibidi toilet game?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bla639",
            "body": "good shit",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Still_Silver7181",
            "body": "When you played the game in 09, and you see fucking Blade Ball, and Toilet Tower Defense, and none of the \"Classic\" games are made before 2017, you get a little pissed about the shit ass event",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Sweet_Star_On_RBLX",
            "body": "I like the old stuff, the lobby is cool but the game selection hurt the event, none of these games are actual classics, I expecting classics that are still alive like Work at a Pizza place, Natural Disaster survival or Flood Escape but instead we just got the most popular games and most of them were pretty bad..",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Accomplished-Ad-3217",
            "body": "Shit, complet dogshit, they cover up terrible game choices with a good lobby but it doesn't help, I was jumping into this expecting fun games that were at the latest maybe 2017 or 18 but all the games are from the past year pretty much, its just another cash grab like the hunt.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AnTotalOrdinarUser",
            "body": "The games are simple to complete (except dusty trip) and I already completed 3",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Jessewastaken_but_no",
            "body": "Kinda annoying",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Elchico_mudo",
            "body": "Better than the hunt, way much more",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bullybilldestroyer_a",
            "body": "Only the hub is actually classic.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "apple12345671",
            "body": "its better than what i was expecting, but still not as good as the old roblox events as its still covered with teleporters",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Un-true_gamer",
            "body": "Needs more classic GAMES with the classic event.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SquishyBlueSodaCan_1",
            "body": "They gotta consider that 85% of their player base is still in school",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SCP-173irl",
            "body": "Idk why but i always get hyped for events and like never actually play them",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RoxanneNotAvailable",
            "body": "TOP 100 REASONS FOR ME TO KMS!!<333:",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WendigoLemon",
            "body": "I'm sick and can't even play it 👍\n\nDon't wanna risk getting out of bed and passing out\n\nHope y'all having fun",
            "score": 1
        },
        {
            "depth": 0,
            "author": "aperturesci_ence",
            "body": "Horribile. 0/10. Toilet Tower Defense.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "spaceforcestudios",
                    "body": "It's really funny that ao many people see the toilet tower defense and just ignore everything else. You don't even have to play it to get all the rewards",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TruePureGold",
                            "body": "The big reason why toilet tower defense is getting called out so much is that its the complete opposite of anything that classic roblox was, quite literally being the farthest thing from \"classic\" roblox",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Own_Classroom2667",
            "body": "better than the hunt, only good things about this event were the hub, bss and tds (even though they aren't classics)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "eyy_gavv",
            "body": "man barely any of yall are even classic og players this saddens me",
            "score": 1
        }
    ]
}