{
    "title": "just to let you guys know a dusty trip has updated for the classic event",
    "comments": [
        {
            "depth": 0,
            "author": "jerrymatcat",
            "body": "im Being careful with the rules of this sub But the whole situation with this game is kinda wacky",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "ShastaMite",
                    "body": "What situation?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fralite",
                            "body": "Found it. His other comment from another post mentioning about the old dev of this game getting mad that the new devs is milking the game.",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "cumdevourer68",
                            "body": "The event didnt even start yet",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ShastaMite",
                                    "body": "I wasn’t talking about the event. The person I replied too said the situation with the game is wacky and I was wondering what situation. Like if there was a controversy or something.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cumdevourer68",
                                            "body": "Thats the situation, they published the update too early",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ShastaMite",
                                                    "body": "Oh okay.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Candy_Stars",
                                    "body": "I thought it did start? Unless it’s starting later today.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cumdevourer68",
                                            "body": "The dusty trip published its the classic update a few hours early",
                                            "score": 0
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fralite",
            "body": "Confused that the game is joining the classic event even though the game isn't classic unless I'm missing something\n\nEdit: Oh my days....this is fucked up event so much for being \"classic\"",
            "score": 9
        },
        {
            "depth": 0,
            "author": "RallySubbie",
            "body": "Please play the original The Long Drive instead on steam. The devs also are bribing their playerbase with a free car if they vote for them in the innovation awards aswell to get undeserved votes. (as seen in their discord servers announcements channel. [https://imgur.com/a/EgoxDnF](https://imgur.com/a/EgoxDnF) )",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Different-Comb-1525",
                    "body": "mf almost every game on Roblox is some kind of ripoff ion know why this game gets dogged on the most. Ain’t even like the og is thaat much better",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RallySubbie",
                            "body": "Just because its a common practice does not mean it should be ignored and encouraged.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Different-Comb-1525",
                                    "body": "yet yall still do ts, doors and evade are also like the biggest games on the platform n basically ripoffs but I ain’t hear no complaints",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "goingtobabystore",
                                            "body": "probably because every game jandel touches turns into a soulless cash grab game lol, the moment i saw the golden ak47 i knew it was going downhill",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "oFIoofy",
            "body": "pretty sure this game isn't even a classic? unless i've just been blind for years",
            "score": 6
        },
        {
            "depth": 0,
            "author": "yannick5612",
            "body": "Even though i hate the developers with a burning passion, they actually did something cool for the event",
            "score": 1
        },
        {
            "depth": 0,
            "author": "blobredditor",
            "body": "WHAT A CLASSIC WHOOO!!!! WHAT NEXT? CREATURES OF SONARİA, PET SIM X? SOOOO CLASSSIC YEAAAH",
            "score": 1
        }
    ]
}