{
    "title": "Thomas Frank interview: 'I'm happy here - it's close to the perfect football life. But I’m open for what can happen'",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LiLSteve29",
            "body": "If the price is right lol",
            "score": 21
        },
        {
            "depth": 0,
            "author": "redswan4",
            "body": "He really went with \"I'm happy here, unless??\"",
            "score": 32,
            "replies": [
                {
                    "depth": 1,
                    "author": "Existing-Employee-36",
                    "body": "Dude, thats what 99% of managers will say in general..",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "thunderousboffer",
                    "body": "Gotta keep yourself open when the biggest club in London is sniffing after you 😏",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "redswan4",
                            "body": "*biggest bench in London\n\nJokes aside it would be a weird hire considering the clubs statement and Frank only bring 2 years younger than Poch",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "thunderousboffer",
                                    "body": "Agreed, would be an odd appointment when our idiot owners allegedly want a young manager",
                                    "score": 6
                                },
                                {
                                    "depth": 3,
                                    "author": "Godnion",
                                    "body": "tbf 50 is relatively young for a manager no?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "redswan4",
                                            "body": "Well I'd agree with that yeah, but Poch is 52. So getting rid of him because they want a young manager and hiring Frank wouldn't make sense as they're basically the same age",
                                            "score": 8,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Godnion",
                                                    "body": "Knowing Chelsea, they probably mean younger as in keeps quiet and lets the board do everything 😭",
                                                    "score": 7
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "New_Brother_1595",
                    "body": "It’s what his star striker has been saying all year so why not",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "QouthTheCorvus",
                    "body": "In fairness, it makes complete sense. It doesn't make sense to close doors, especially not in a job where you can't be around forever.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Neither-Tie8478",
            "body": "De Zerbi was also happy !",
            "score": 8
        },
        {
            "depth": 0,
            "author": "ragecndy",
            "body": "I know the current climate is the opposite but actually be a little worried if they got De Zerbi, Frank would just be another Potter",
            "score": 5
        },
        {
            "depth": 0,
            "author": "BobaddyBobaddy",
            "body": "Life could be perfect, in Brentford.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "bennn_8767",
                    "body": "tbf, I highly doubt he lives in haverfield estate with MC grinder.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "toadphoney",
                            "body": "Maybe you should do your \n[research](https://gprivate.com/6bc9p)",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "milkonyourmustache",
            "body": "I like Thomas Frank, be a shame if he went to Chelsea.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "New_Brother_1595",
                    "body": "Surely he’s too smart for that",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "PJBuzz",
                    "body": "I have to be honest and say I don't like him purely because of his salty comment when Isak scored for NUFC to win last season. \n\nIt's entirely petty, and I don't care, but they whinged about Isak's price tag when they put a similar price tag on Toney's head. \n\nHe's a bit of a sausage.",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mone3700",
                            "body": "I feel like every single manager in the league whines though, if you look for it probably any manager has had something to say after playing Newcastle in the past couple years either about reffing, money or whatever have you",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PJBuzz",
                                    "body": "It was the hypocrisy of it. Claiming the reason he lost was a £65m striker.\n\nWas just such salt and it's not the only time he's claimed the only reason he lost is money.\n\nI say send him to Chelsea and let's see how he does with an expensive squad",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mone3700",
                                            "body": "Honestly reckon if he was backed properly he could do pretty well on a top team. Watching newly promoted Brentford play energetic pressing football and finishing midtable was pretty great to watch. And I'm all for hating and rivalries, but every manager is salty after a loss. Pep Arteta Ten Hag Klopp all have soundbites i remember off the top of my head",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "slayerkj",
            "body": "He gone.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "VladThePain",
            "body": "They finished 16th and got some utter spankings. Not really sure why he’s made out to be the messiah.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Lego-105",
                    "body": "Because he did it with a team that are utter shite. Granted, they still could’ve done better, but without Toney that’s a squad that are comfortably relegated even this season, and Toney didn’t even perform at his level this season.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PM_ME_YOUR_ARSEnal",
                            "body": "Brentford hardly have a shite team, and their league position had nothing to do with the quality of the squad (other than depth), at one point Brentford had the worst injury list in the premier league and given the stink that is made about Newcastle or United or even Liverpool's injury list this season, that's worth baring in mind. The season before that they had one of the leagues best defences, the fact it fell apart because 90% of the players were injured and they lost Raya also speaks volumes. Long term injuries to both starting wingbacks all season as well, it's really unfair to say they had a shite team, shite depth, yes, but their starting 11 is comfortably mid-table.\n\nYou also don't know what you're talking about regarding Toney, who was utter shit when he returned and has had one eye on a move since. Brentford played better football when he wasn't on the pitch with a Wissa - Mbuemo - KLP front 3 than they ever did when he started this season, and again Mbuemo was injured from December - March, and Wissa went to AFCON for part of that.\n\nThe fact Frank kept them up with plenty of games to go is a testament to his abilities as a manager, but there is no denying that it would have been dicier in a more normal year. Hopefully this a wake up call on the recruitment side of things, especially if Frank decides to go elsewhere, because the squad needs depth and strengthening in key areas this season, there is always a risk of stagnating and collapsing in the Premier League.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NotableCarrot28",
                                    "body": "Factos",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "RefanRes",
                            "body": ">Toney didn’t even perform at his level this season.\n\nNot really surprising. That many months out its going to be tough to get back in the flow midway through the season. If Frank stays at Brentford I'd expect Toney to fair better next season when he's had pre-season with the team and things.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NotableCarrot28",
                                    "body": "He's leaving... We've bought his replacement",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "RefanRes",
                                            "body": "Thats if a club comes in with a suitable offer isn't it? At least thats what I heard Thomas Frank said. Can't see him getting the sort of move that he was being linked with before like Chelsea, Spurs or Man Utd based on how hes been since he returned though. So do Brentford even get the sort of money they want?",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "NotableCarrot28",
                                                    "body": "We will sell him for what we can get, or he leaves for free the season after. He's not worth 25mill to us to keep him on for just 1 more year, so we'd rather sell him for that than sell him for nothing.",
                                                    "score": 2
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "soccer_footballmania",
            "body": "I really like his Brentford team. Quality manager!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Miliktheman",
            "body": "Frank is definitely ready for a step up, he's done an excellent job at Brentford. I'm a huge admirer of him, I think his ability to play in more than one strict way is a huge quality. I'd be very excited if he became Manchester United manager.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Neat-Box-5729",
                    "body": "Ten Hag is staying until 2084",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "pablove_black",
            "body": "He’s a salty bellend.",
            "score": -4
        }
    ]
}