{
    "title": "Man City Charges Megathread",
    "comments": [
        {
            "depth": 0,
            "author": "redbossman123",
            "body": "In my opinion, I believe that they're going to basically have nothing happen to them, but that's actually what I want, for the sole reason that I want FFP scrapped.\n\nAt this point, a lot of people have the opinion that FFP was never to actually try and stop Portsmouth and Leeds from happening again, it was to prevent the likes of people like Roman and Sheikh Mansour from buying clubs and then using their money to compete with the already established clubs.\n\nThis is accented by the fact that the history of the sport for the most part is defined by teams who spent the most money winning the trophies, and the teams let the already corrupt UEFA put in a rule for the sole purpose of stifling the competition. \"Organic\" growth is almost impossible because every time a smaller club has a good season, bigger clubs poach their best players and those smaller clubs have to get recruitment perfect, or else they end up like Southampton and get relegated once the well of top academy talent dries up.\n\nIf you really wanted to prevent Portsmouth, Leeds, Rangers, etc from happening again, a much better way of doing things would be to make the owners put up the money on the spot. For example, if there is a player whose total transfer fee is 50 million GBP and their wages over the course of the contract after accounting for all incentives and bonuses comes out to be 30 million, the owner/club would have to put down 80 million in a bank account on the spot to prove they have the money for said player, and then at the end of the contract or when they sell the player, they'd get back the unspent wages or otherwise be able to use the transfer fee received for that player to prove they had that money. What this does is prevent owners from being awful by putting a ton of debt onto the club, while allowing for owners to do what they always did before 2010 and dump their own money in if necessary.\n\nThis is just my two cents on the matter because in general I think the rules shouldn't exist as they exist now as all it does is stifle clubs like Villa from having their owners spend a bunch of money to invest because they have to go off of the revenue the club made instead of being able to put their outside money in.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "arsehenry14",
                    "body": "All this does is effectively further entrench Man City and Chelsea or similar clubs because most actual business have to project out future revenue and cash flow before making for example equipment purchases that will be used over future years.  Arsenal is a great example, we got the short end of the stick with rise of Abramovich and Sheik Mansour.  We had Highbury 38,000 seat stadium, but to compete with Old Trafford in the 00’s we built a new stadium.  We had to pay off the debt of the stadium so we had to be very careful about spending.  Abramovich with his stolen Russian billions did not.  With your rule only he and maybe Man United at the time could have bought expensive players.  Same when Sheik Mansour came along to lift Man City within 3 years from firmly mid-table at best team to title winners.  All business run on debt and loans while projects are going on before the revenue is collected.  My small consulting firm does.  I see no reason why soccer clubs should not be able to do that.  The problem is when the spending is not tethered to the reality of revenues.  Chelsea first and then Man City mastered this.  Chelsea through straight up owners “loans” and Man City through their £400 million related entity Etihad Airways sponsorship deal that was larger than Arsenals and Liverpools based on my recollection despite Man City not being a fair comparison in terms of on field success at the time.  Now Chelsea is using 7 year contracts, now banned, and selling its training ground to “itself” to create paper cash flow.  City is using Girona FC to stash upcoming prospects.  \n\nWhat we need is common sense rules, like one club cannot own another, having independent evaluation of all sponsorship deals, etc.  stuff like that",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "gelliant_gutfright",
                            "body": "I think banning state ownership of football clubs would be a sensible move.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "3106Throwaway181576",
            "body": "The posts are at a rate of 1.15 posts a day",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "MinisterofSandwiches",
                    "body": "1.15 xP ... fify 😆",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cawn1",
            "body": "What's the point when it won't be decided for ages anyway?",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "L0laccio",
                    "body": "We need to keep up public pressure. Ensure everything is transparent. I want marches on Downing Street, hunger strikes, the works",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "Happy-Ad8767",
            "body": "This looks like a Tottenham fan supporting City.\n\nFeels like normal.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Commandant1",
                    "body": "Anyone But Arsenal.",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "ajtct98",
            "body": "I think we will need a separate thread for each individual charge",
            "score": 7
        },
        {
            "depth": 0,
            "author": "abitmoreinsanerer",
            "body": "1. Are there 115 threads? \n\n2. How soon will there be 115 comments?",
            "score": 6
        },
        {
            "depth": 0,
            "author": "TurdShaker",
            "body": "Yeah guys, we should wait atleast 115 days until more information is available before we slanderize oil city fc",
            "score": 6
        },
        {
            "depth": 0,
            "author": "ApprehensiveImage132",
            "body": "Funny how no one here has actually read the charges or even the original bbc article. It’s 130 not 115. Next you will be trying to insult us by saying it’s only 100.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "NootNootington",
                    "body": "They're not even charges, they're alleged breaches. Nobody has a clue what they're on about.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "takenolsolatunji",
            "body": "4 peat 🔵",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BlackCaesarNT",
            "body": "About time.\n\nFucking devolved to the point where it was just \"hur dur 115\" kiddie shit...",
            "score": 5
        },
        {
            "depth": 0,
            "author": "BlueMoonCityzen",
            "body": "Good luck with that",
            "score": 4
        },
        {
            "depth": 0,
            "author": "L0laccio",
            "body": "Au contraire m’lud, we haven’t even got started",
            "score": 3
        },
        {
            "depth": 0,
            "author": "BiancoNero_inTheUS",
            "body": "Won’t somebody please think of the children!?!?!?!?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Dazzling-Yellow5395",
            "body": "But but no one cares about city",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Shot-Shame9637",
            "body": "Are you a mod?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Commandant1",
                    "body": "yes",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RemnantOfSpotOn",
                            "body": "Finally we see Tottenham stopping City charges...",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Commandant1",
                                    "body": "You drastically overestimate the power of a reddit mod.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "RemnantOfSpotOn",
                                            "body": "Im with you....we should have All posts about Manchester City Megathread so people who really don't care much about those posts, which is 99 percent estimated, could be spared",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Friendly-Profit-8590",
            "body": "Aren’t we still like a year out before anything starts to actually happen?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "fu115",
            "body": "Why! How do I farm Karma, then?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Agreeable-World-9572",
            "body": "!flair :West_Bromwich_Albion:",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WorldWideWes2",
            "body": "damn I love drinking my morning tea to those threads.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "oyohval",
                    "body": "Yea, I was kind of getting used to reading all the new and creative ways that people want to punish our club and providing justifications for their absolute assurance of our guilt. \n\n\nBoo to the moderators on this move.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Far-Pin-5535",
                    "body": "Dont forget to save some for Sunday League! Heard the service aint the best out of the league system.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "PenisManNumberOne",
            "body": "Get over it who cares",
            "score": 0
        },
        {
            "depth": 0,
            "author": "monkeybawz",
            "body": "GL trying to contain this swarm of bees.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "jsuarezthecreator",
            "body": "https://x.com/santismagic/status/1790707385570394144?s=46&t=EVAzEvKZ125CAe-UICKZWQ here is a report of everything about the 115 charges against Man City",
            "score": 0
        },
        {
            "depth": 0,
            "author": "breen_bean",
            "body": "I know this is a karma farm by a desperate Spurs fan but I did notice something interesting yesterday. There is no Wikipedia page for the charges or allegations. There is a Wikipedia page for even the most obscure topics but not this. Obviously being scrubbed by the ownership but certainly doesn’t help the innocence case. Anyway. Carry on",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "YoungGriffVI",
                    "body": "Could it be for legal reasons? I know at least in some places they wouldn’t be allowed to speculate on certain unproven allegations that have yet to be decided in court. And while you could talk about them insofar as they’re alleged, speculation does not for a good Wikipedia article make. \n\nAnyway, it doesn’t have to be a cover up. It could be; I know nothing about UK law. But it doesn’t have to be.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "breen_bean",
                            "body": "That could certainly be the case. I don’t think there would necessarily be speculation on Wiki, though. Just a primer and background on the specific allegations, etc. The charges are mentioned on the Man City Wiki page but in less than one sentence. For me that is evidence of careful curation",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Commandant1",
                    "body": "You realize that self-posts don't get Karma.\n\nThis isn't Karma farming.  This is trying to organize the subreddit and get rid of repeated duplicate posts that don't say anything new. \n\nWhen there is an actual development, we can post and discuss it.",
                    "score": -1
                }
            ]
        }
    ]
}