{
    "title": "[Official] West Ham United’s Lucas Paqueta has been charged with misconduct in relation to alleged breaches of FA Rules...\"intentionally seeking to receive a card from the referee for the improper purpose of affecting the betting market in order for one or more persons to profit from betting.\"",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "H0BYo",
            "body": "If he's guilty he can kiss his career goodbye. To give you an idea of the length of the ban Paqueta might face, the footballer linked below was banned for 10 years for a single case of spot-fixing. Paqueta has been charged with four cases of spot-fixing.\n\n[https://www.bbc.co.uk/sport/football/63302914](https://www.bbc.co.uk/sport/football/63302914)\n\nedit: another player, Bradley Wood of Lincoln City, was also banned for five years for intentionally getting booked twice. \n\n[https://www.bbc.co.uk/sport/football/43829525](https://www.bbc.co.uk/sport/football/43829525)",
            "score": 76,
            "replies": [
                {
                    "depth": 1,
                    "author": "Soul_Acquisition",
                    "body": "Holy crap, he could be finished then",
                    "score": 24
                },
                {
                    "depth": 1,
                    "author": "DVPC4",
                    "body": "Cricket players were also sent to prison for spot fixing",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "twoheels",
                    "body": "In fairness there's a bit of difference between Paqueta and Stratford Town's Kynan Isaac. He won't be getting 10 years.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "itsjustchat",
                            "body": "Why not? He could very easily get banned for the rest of his career off this.\n\nIt’s not comparable to recent betting charges. He is fixing the sport basically.\n\nThey take this very seriously as it essentially opens the door to everything in the game being fixed. If a player is getting intentional yellows? Why not throw ins. Why not number of fouls etc.",
                            "score": 15,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "twoheels",
                                    "body": "Because he's a Premier League player, he won't face the same punishment as the average joe. \n\nThe PL has had tax cheats, cheaters, murderers, rapists and all kinds come through it and many have never faced actual punishment for their crimes, the ones that did maybe paid a small fine and that was it. \n\nThey're the elite of society. They're almost immune to a lot of consequences.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "byrgenwerthdropout",
                            "body": "Yeah, but it will definitely fuck his transfer to city which would have made for his best spell of his career, regarding both football achievements and financially.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "twoheels",
                                    "body": "I mean they have enough to deal with PR wise around financial irregularities as it is, what's a few more ay?",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "twoheels",
                                    "body": "I mean they have enough to deal with PR wise around financial irregularities as it is, what's a few more ay?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "byrgenwerthdropout",
                                            "body": "116 would obviously be too many. 115 is where city's khalifa draws the line.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bduk92",
            "body": "I can never understand the logic of players who do this.\n\nYou're earning astronomical wages, why risk ruining your career by trying to squeeze out a little more on the side?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "milkonyourmustache",
                    "body": "Probably embroiled in some dodgy shit, or is just *that* stupid.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "XOQXOQXOQ",
                    "body": "Huge risk, small reward,",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Mackerelage",
                    "body": "It’s often friends and family who stand to benefit, not the player. And given our utterly ubiquitous gambling is in football it’s also no surprise that dodgy gambling seems so common.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Reasonable_Command98",
            "body": "If found guilty he can be banned for many years. At 26 yo this could be a career ending punishment. My question is simple. Why in the world do a multi millionaire player need to do that? Baffling.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "From what I read last year he was doing this while his buddies placed the bets",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Reasonable_Command98",
                            "body": "Unbelievable. Stupid thing to do. If your buddies need cash just give them some instead of draining your career to the toilet.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "littleAggieG",
                            "body": "So loyal, he’s risking his career & possible jail time to secure the bag for his boys. Insane. I’m begging athletes to be smarter than this.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Headlesshorsman02",
                                    "body": "It isn’t even just footballers though athletes of all sports are dummies, they think they are above the law",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "littleAggieG",
                                            "body": "Yup. And honestly, a lot of athletes are just very stupid with money.\n\nIn the US, Antonio Brown, a big NFL wide receiver who’s made $88m as of 2021, filed for bankruptcy this week. He owes creditors $3m and says he only has $50k in assets.\n\nTravis Kelce admitted that early in his career, he was basically broke despite making like $100k a week. He was splitting private jet trips with his teammates. It was $30k each & he said he was doing it like 2-3 times a month. By the time his paycheck came, he was paying off bills he’d accrued.\n\nAnd in the PL, read up on how Craig Bellamy went broke less than 10 years after retiring, after earning over £50m.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Eeedeen",
                            "body": "The bets were placed from accounts registered in Paqueta, an island off Rio de Janeiro, but the bets were not placed by Paqueta and he denies any wrongdoing. [sky sports ](https://www.skysports.com/football/news/11095/13141950/lucas-paqueta-west-ham-midfielder-charged-by-fa-for-alleged-breaches-of-betting-rules)\n\nHis nickname, Paquetá, refers to Paquetá Island and the eponymous neighborhood he grew up in [Wikipedia ](https://en.wikipedia.org/wiki/Lucas_Paquet%C3%A1)\n\nThey could have at least used a VPN so they didn't wave the obvious red flags",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Raptors887",
                    "body": "An NBA player recently got banned for life for doing this exact same thing.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Bartins",
                            "body": "That guy wasn't a multi millionaire though and wasn't guaranteed to even be on a roster next year. Paqueta is throwing away likely 50m+ in future earnings with this.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "wantabeeee",
                                    "body": "Jontay Porter the Nba player earned 2m Usd his first year, 1.8 his second year and had just signed a 5.9m contract over 3 years.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "DangerousAd3347",
                                    "body": "Not just that potentially an elite career with city winning endless trophies. A World Cup with Brazil even etc",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Reasonable_Command98",
                            "body": "Exactly.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Theres3ofMe",
                    "body": "But Tonali at Newcastle didn't get a massive punishment though? Was like 10 months. Then he did it again and got same I think....",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Vegan_Puffin",
                            "body": "I can't remember the specifics of the Tonali case but in Toney's case it was bets on matched he was not directly involved in. Paqueta made bets directly on himself in a match he had direct involvment in and had almost total control over whether or not he got the result he wanted.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "DangerousAd3347",
                            "body": "Tonali wasn’t match fixing though he was betting on his team to win which you obviously would be doing anyway. It’s different when you do something just because you bet on it",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Reasonable_Command98",
                            "body": "What did Tonali do regarding the gambling thing? Remind me the specifics of the case please.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "jhollis94",
            "body": "Head on over to ESPN bets now to bet on the length of the punishment!",
            "score": 1
        },
        {
            "depth": 0,
            "author": "throwaway72926320",
            "body": "If I'm wrong anyways let me know. But from memory this all sprung from West Ham v Villa on March 12th of last season. That game Paqueta committed 4 fouls, above his average of ~ 1 a game, not completely unusual to happen though. \n\nThe problem was that multiple accounts were created the day before all with some relation to Paqueta, and all of whom bet the maximum amount on him to receive a yellow. \n\nSuper fucking fishy also add to the fact he was odds on 8/11 to receive a yellow (had 3 to this point), and all new accounts were created on Betway, sponsors of West Ham. \n\nDoesn't look good.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "EugeneStonersDIMagic",
                    "body": "How could he be so fucking dumb?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "charlos74",
                    "body": "It looks very fishy. Perhaps there are outside pressures on him or his family that explain it. \n\nIf not, he looks fucked.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "adamlundy23",
                    "body": "It was so obvious that my mates even started adding “Paqueta yellow” to their bet builders every time West Ham played",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Ichxro",
                            "body": "My mates did the same, that match against spurs he was doing the most at time for no actual reason some even joked he’s got a bet on.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Minute-Instance-7370",
            "body": "A footballer is a footballer because he can kick a ball. It doesn’t mean he’s got a brain.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DangerousAd3347",
                    "body": "Generally you have to make sensible decisions to be an elite player though, especially in modern times.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "gagsy10",
            "body": "Besides the spot fixing crime itself could Paqueta also be punished for essentially endangering other players on purpose? Assuming he is found guilty of the betting of course. I know at least two of those yellows he got were for late lunges. I know players get yellows for those type of tackles all the time but those players were doing it for the game, not for bet fixing.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ryan10133",
                    "body": "Guess it depends on how he went about receiving the yellow? If it’s kicking the ball away or calling the ref a cunt then probably not I would say",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "silentninja79",
                    "body": "Exactly...I would imagine if he is found guilty then those players affected could bring private prosecutions against him for reckless endangerment or assault on top of whatever other fines etc he may be facing from the premier league/FA/legal system.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Peterd1900",
                            "body": ">could bring private prosecutions against him for reckless endangerment or assault\n\nNo such thing as Reckless Endangerment in English Law\n\nScottish law has Culpable and reckless conduct but there is no real equivalent in England\n\nRecklessness can make up element of other offences for example\n\ncriminal damage with intent to endanger life or reckless as to whether life endangered and assault is committed when the defendant intentionally or recklessly causes another to apprehend immediate and unlawful violence\n\n it might be possible to charge the offences of assault and battery, or certain offences under the Offences against the Person Act 1861.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "DangerousAd3347",
                            "body": "Why would millionaires go through the trouble of private prosecutions for a tackle something they receive every week ?",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "QuaLiTy131",
            "body": "This as a chant will go crazy",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LetsKillKenny",
                    "body": "Just bet my car\n\nOn Lucas Paqueta",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "themaestronic",
            "body": "Betting companies review anything remotely close to be questionable especially with football and markets like cards. Guarantee that if the bets were made near to his home town and names linked to him he’s done",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "alexytin",
                    "body": "My mate works for a large betting company that trades in Brazil and that is exactly what has been happening. They have reported him multiple times over the last 18 months and he was getting frustrated that nothing was being done. Interesting he has finally been charged now.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "whyarethenamesgone1",
            "body": "He has since responded on instagram, he says:\n\n\"I am extremely surprised and upset that The FA has decided to charge me. For nine months, I have cooperated with every step of their investigation and provided all the information I can. I deny the charges in their entirety and will fight with every breath to clear my name. Due to the ongoing process, I will not be providing any further comment”\n\nhttps://www.instagram.com/p/C7ULioTOLMI/?igsh=cDA5bDV1ZnNwYTg2",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "MattJFarrell",
                    "body": "Damn, I had a bet on him getting charged in June",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "irishnugget",
                            "body": "So did he",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Visionary_Socialist",
            "body": "Fuck it, bring him in and make it 116",
            "score": 105,
            "replies": [
                {
                    "depth": 1,
                    "author": "ParticularProgram783",
                    "body": "Stfu and take my upvote",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "TheFettz79",
                    "body": "👏",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "Dry-Double-6845",
                    "body": "That would be hilarious. Any idea the possible suspension length?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Illustrious-Gap1153",
                            "body": "Well here is an example of 10 year ban\n\nhttps://x.com/matthughesdm/status/1582373343872679939?s=46&t=uitHgI1gPsE8gFiYOryhjQ",
                            "score": 4
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "justathrowawaym8y",
                    "body": "OK that was good",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "oljackson99",
                            "body": "He's just stolen it from Twitter.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "justathrowawaym8y",
                                    "body": "Blast",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Express-Hawk-3885",
            "body": "Good advert for Betway",
            "score": 1
        },
        {
            "depth": 0,
            "author": "christianrojoisme",
            "body": "Imagine doing your damn best playing the game and your teammate is in his own little side quest for a card. Utterly abhorrent",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Boopdelahoop",
                    "body": "Wouldn't personally mind if it was a victimless crime (e.g. dissent in the 95th minute) but match fixing in any form is rotten. If guilty he should never play again.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Nels8192",
            "body": "Well there goes the £70m City deal.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "gigibuffoon",
                    "body": "This act fits right in with City's ethos",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "stoatfacelanust",
                    "body": "Probably City who leaked the info for a cheaper deal, oil money must have run out.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "pacothebattlefly",
                            "body": "Your lot is still getting plenty of oil money though,  right?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "stoatfacelanust",
                                    "body": "Do they have much oil in Denver?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "pacothebattlefly",
                                            "body": "Actually yeah, it’s in the top 5 oil producing cities in the US. And you know, you have Emirates to fall back on too.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "stoatfacelanust",
                                                    "body": "You’re really reaching… 😂",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "pacothebattlefly",
                                                            "body": "Or it’s just a fact",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "stoatfacelanust",
                                                                    "body": "Top 5 oil producing states in the US. Do you know how weak that sounds?? If you honestly think Arsenal and oil money go together, fair play. 😂😂",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "pacothebattlefly",
                                                                            "body": "I don’t think it, it’s not an opinion. It’s a fact mate. What’s 😂 is that you had no clue 😂",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "stoatfacelanust",
                                                                                    "body": "Waiting…….",
                                                                                    "score": 1
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "stoatfacelanust",
                                                                                    "body": "Tell me how the Kroenke’s made money though oil",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "pacothebattlefly",
                                                                                            "body": "You asked about Denver, not Kronke. But he does have a shit ton of oil wells on his massive ranch. Beyond that, Emirates. To deny Arsenal is operating with oil money is just wrong.",
                                                                                            "score": 1
                                                                                        },
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "michaelstone444",
                                                                                            "body": "Just looked it up cause I was curious and turns out he does actually have a bunch of oil wells on his massive ranch in Texas, the Waggoner Ranch. It's the largest single fence ranch in the US at 535,000 acres. It is used for oil production amongst other things.\n\nI suspect the guy who brought up the oil money thing was referring to Emirates rather than Stan Kroenke though",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DangerousAd3347",
                            "body": "Why would city have the info ?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "stoatfacelanust",
                                    "body": "They don’t. Their oil money also hasn’t run out…. It was a joke.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DangerousAd3347",
                                            "body": "A bad joke *",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "fffjayare",
            "body": "sponsored by betway",
            "score": 31
        },
        {
            "depth": 0,
            "author": "Swoosh33",
            "body": "Fucking joke man. As if they don’t make enough money. I’ll say it again 97% of professional footballers are not worth looking up to",
            "score": 24,
            "replies": [
                {
                    "depth": 1,
                    "author": "byrgenwerthdropout",
                    "body": "Absolutely, but lol 97% is oddly specific!",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "No_Needleworker_6109",
                            "body": "r/theydidthemath",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sondergaard913",
            "body": "Welcome to Manchester City, Paquetá!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Snguine",
                    "body": "Think we’ll have to give this one a pass. 115 is one thing, but I reckon the 116th would really ruin our reputation",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "paradigmshift7",
            "body": "I hate all this sports betting bs, but if we must have it, can we at least not allow betting on trivial things that players can easily affect the outcome of?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "skillertheeyechild",
                    "body": "You mean the mini/in game bets people tend to make when chasing a loss and tend to make bookies more money? \n\nUnfortunately won’t happen, gambling makes too much money and with the power that lobby has its easier to let idiots like this slip up and ban them than make gambling ethical in any way.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Nels8192",
                            "body": "Like a goal in the next 60 secs at 8/1. Don’t even try to hide ripping people off with prices like that",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "littleAggieG",
                    "body": "Correct me if I’m wrong, but I think a provision for playing any sport professionally is that you may not bet on that sport at any level.  And when you get caught doing it, you face bans like Toney, Tonali, and now Paqueta.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "paradigmshift7",
                            "body": "Yes, obviously it's ultimately the player's fault, but I view banning them as treating the symptoms of the main issue, which is a lack of regulation on gambling companies. If you can bet on literally anything happening on the pitch, you WILL have idiots like the above getting banned. I'm guessing teams would prefer that this wasn't a possibility at all.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "Yeah, sports gambling is like Pandora’s Box. Once you let it out of the box, there’s no way to put it back in except laws that would make sports betting illegal, which is highly unlikely.\n\nEven if the leagues cut sponsorship ties with betting companies, players can still make bets with Betway etc. on their own. I think the leagues are kind of handcuffed here: all they can do is punish players who take part.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "OldSaul",
            "body": "The lads gotta eat!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Previous-Loss9306",
                    "body": "Factos smh 👍",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "SmegB",
            "body": "No wonder Man City want him, he'll fit right in",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ragnarrmb",
                    "body": "That oil money clean the charges right up!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SmegB",
                            "body": "PR spin it so that Paqueta is the poor, innocent oil-stained seabird",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Little_Ruskie",
                            "body": "Heard it's purer than the colonization money currently flowing through the other clubs. That's why it works so well 😁.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pacothebattlefly",
                                    "body": "That’s unfair. Arsenal also have plenty oil money.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Top_Housing_6251",
                                    "body": "Are you disavowing your english heritage now?  i thought man city fans all thought you were a big club before you were taken over - guess not.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Long-Ad727",
                                    "body": "Is this your guys strategy now?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AdornVirtue",
            "body": "Imagine being a prem player making millions yet still resorting to betting",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "trevlarrr",
                    "body": "He wasn’t the one betting, the allegation was someone else (a relative?) back in Brazil was placing bets. Who knows if it’s true or not though.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "whu-ya-got",
                    "body": "This is the sport version of insider trading. A sales leader at a publicly traded company company shares with his inner circle that the company’s sales are behind forecasts, they offload their shares ahead of an earnings call where the disappointing numbers trigger a sell off. It’s insider trading, it is illegal, but not super policed. \n\nIt’s *obviously* a big issue when some common folk living in Rio start making life changing money at the expense of the big corporate sponsors of the premier league.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "finestryan",
                            "body": "Yeah but insider trading is ok to do if you’re rich. The mechanisms in place only restrict and punish retail traders. Hence why I think there will be some bullshit with paqueta having the charges dropped or something.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Bukaja",
                    "body": "No betting addict is in it for the money",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MegaMugabe21",
                            "body": "Tbf it sounds like he wasn't actually betting, but rather helping someone out. \n\nThis doesn't really sound like a case of a gambler trapped by their addiction, but rather a daft multimillionaire fucking up their career for a few more quid.",
                            "score": 9,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "Anybody familiar with UK laws: could he face legal problems from the UK for this? In the US, he’d be facing a federal felony charge under the Sports Bribery Act.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "gufeldkavalek62",
                                            "body": "Seems it’s called spot fixing and there’s precedent for multiple year sentences for it. Some cricket players were sentenced to between 6 months and 2y 8 months in 2011, presumably based on each players involvement in it",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "littleAggieG",
                                                    "body": "Geez. It’s absolutely crazy that Paqueta would put himself in a situation where jail time could even be a remote possibility. Insane.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "OceanMammal10",
                            "body": "What are you talking about? They’re all in it for the money. BIG MONEY!!",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "littleAggieG",
                    "body": "Gambling addiction isn’t about money, it’s about the dopamine rush & thrill of scoring a win.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jevchenko",
                            "body": "You might still think that professional athletes should have more than enough of that. He probably has bonuses in his contract for performance. Really wonder why that isn’t enough for them.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "BlueLondon1905",
                                    "body": "Addiction doesn’t make sense.  \n\nI can rationally tell you that a casino is a bad return on investment and you should invest in the stock market but if you sit me at a table game I would play for hours and feel the rush, and want to bet more and more.",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "MaryBerrysDanglyBean",
                                    "body": "Bonuses don't give you a short term rush. That's something that's earned over a season",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "No I agree, but I think gambling addicts like the rush of feeling like they’ve outsmarted other people & winning a bet quantifies that. I have friends who day trade stock options & it’s basically the same thing. They get addicted to that feeling of a big win so they’re constantly chasing it.",
                                    "score": 2
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "WCBIS",
                            "body": "Does that apply if you are completely in control of the outcome?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "I don’t know? But Paqueta trying to control the outcome might be legally problematic for him, beyond just the FA. In some countries, it toes the line with corruption & could lead to jail time.",
                                    "score": 0
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "UnusualAd3909",
                            "body": "That doesn’t apply here tho",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "Are you Lucas Paqueta?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "UnusualAd3909",
                                            "body": "So you can make a claim that he did something because x reason but i cant say that is not the reason because im not paqueta? Sound logic there buddy. \n\nYou dont get the rush you get from wins if the win is 100% guaranteed. I dont keed to be paqueta to understand gambling addiction.\n\nHe bet on something 100% under his control it’s purely about money not because he is addicted lol",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Judgementday209",
                            "body": "This is next level to just gambling though.\n\nI've never understood people who cheat to experience the thrill of winning.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "I don’t get it either. And to do it with sports gambling? Yikes. There’s a potential for jail time there. Crazy.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "officialmt75",
            "body": "If he's found guilty, it might not just be a lifetime ban but maybe even a restructuring of the betting system",
            "score": 1
        },
        {
            "depth": 0,
            "author": "slippyman1836",
            "body": "Sports betting is going to ruin sports",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Busy_Bunch5050",
            "body": "This absolutely happens more often than is admitted.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "potato-enjoyer1",
            "body": "Casino League",
            "score": 1
        },
        {
            "depth": 0,
            "author": "brazyB2",
            "body": "Doesn't surprise me at all speaking from a Brazilian perspective, very unethical and stupid.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "itsheadfelloff",
            "body": "Shame, bloody good player when he's not getting booked",
            "score": 1
        },
        {
            "depth": 0,
            "author": "AdamTheAmmer",
            "body": "Should have just kept going and done it 115 times.",
            "score": 29
        },
        {
            "depth": 0,
            "author": "_ronty12_",
            "body": "Spot fixing. Should be between 2 to 5 years ban going by similar incidents in other sports.\n\nThrowing away your footballing career when you are already earning millions is beyond stupidity.",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "DEGRAYER",
                    "body": "Sandro got 10 months. Paqueta just has to come clean.",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Many-Consideration54",
                            "body": "Not even remotely the same.",
                            "score": 12
                        },
                        {
                            "depth": 2,
                            "author": "justathrowawaym8y",
                            "body": "If I recall correctly, none of Sandro's charges had anything to do with spot fixing.\n\nPlus Paqueta is now denying the charges, so any cooperation leniency has just gone out the window.",
                            "score": 8
                        },
                        {
                            "depth": 2,
                            "author": "robstrosity",
                            "body": "He was betting on games he wasn't playing in wasn't he? \n\nSounds like this is more serious because Paqueta was betting on things that he could directly influence.",
                            "score": 11,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DEGRAYER",
                                    "body": "Tonali did bet on his own team to win",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "privateblanket",
                                            "body": "That shouldn’t really be against the rules to be honest, only betting on your team losing or any specific bets I.e. corners, cards",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "user-a7hw66",
                                                    "body": "Nah because you still have more info than the bookies.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "privateblanket",
                                                            "body": "I didn’t think about that actually, makes sense to me now",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "SuperAd1793",
                                                    "body": "the main reason it’s banned is because you know more information than the regular punter. i think not even staff who work for the club can bet technically. because you know more about the players, potentially injuries etc. that’s a big reason why it is banned",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "privateblanket",
                                                            "body": "Yeah I never considered that really, makes a lot of sense",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "DEGRAYER",
                                                    "body": "It's a slippery slope",
                                                    "score": 1
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "robstrosity",
                                            "body": "Oh did he? I didn't realise. \n\nI guess it comes down to whether they find a distinction between betting on your team to win Vs betting that you'll get a yellow card.",
                                            "score": 0
                                        },
                                        {
                                            "depth": 4,
                                            "author": "whitegoatsupreme",
                                            "body": "Win?? By then shouldn't it be no problems?\n\nI thought he bwt them to lose",
                                            "score": -1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "kolasinats",
                            "body": "Sandro just placed bets? Paqueta was fixing",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "justathrowawaym8y",
            "body": "If that's true, he is utterly fucked.\n\nBetting on football games is one thing, manipulating the game for the purposes of betting?\n\nI can't imagine the result will be anything other than \"book being hurled at his fucking head\"",
            "score": 8
        },
        {
            "depth": 0,
            "author": "MelodicPreparation93",
            "body": "Assuming this is proven and he's found guilty, this will potentially be a huge ban right?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheRealBBG",
                    "body": "Probably massive. It’s not like he did general sports betting, which would earn him a large ban in and of itself (I.e., Tonali, Toney). But he bet on himself.  That’s the closest an individual player can get to match-fixing.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "officialmt75",
                    "body": "I'd say for life",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "A_StarshipTrooper",
                    "body": "has to be",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Joshthenosh77",
            "body": " But why ? They earn enough",
            "score": 1
        },
        {
            "depth": 0,
            "author": "I_Am_Groot14",
            "body": "Let's be honest he's fucked if this is true, his career will be over",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "Absolutely, match fixing is an absolute no no, especially with some of the big prem sponsors being betting companies, they will not take very well to that",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "I_Am_Groot14",
                            "body": "If true, I think there's more to it because realistically why would someone of his stature playing in this league and a full brazilian international commit something like match fixing, it's just nuts",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Headlesshorsman02",
                                    "body": "From what I read last year he was doing this while his buddies placed the bets but you may be right and it is circumstantial",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "I_Am_Groot14",
                                            "body": "Unless he comes out and says he did it because his family's safety was threatened or something of that nature then I don't see why he would risk his entire career, for that sort of reason I could understand him doing it \n\nOn another note i see your a chelsea fan, what a fuck up to let poch go in my opinion when he was just getting them to click, from a spurs fan I know only too well how good he is at getting young players to come on and progress, palmer has to be 1 of the signings of the season even I can admit to that he's been phenomenal",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Headlesshorsman02",
                                                    "body": "You don’t have to tell me lol 😂 I was just thinking we had turned a bit of a corner then back to square 1 lol 😂",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "The_prawn_king",
            "body": "Why don’t we just stop betting?",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "Soul_Acquisition",
                    "body": "It's too heavily involved in football already with the sponsorships imo.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "The_prawn_king",
                            "body": "Oh yeah I mean there’s no way and like banning it wouldn’t even stop it. But still it’s a problem only because of a thing that we made up that does almost no good in the world. I know we made most things up but like gambling just feels extra bullshit",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "milkonyourmustache",
            "body": "How do you fumble the bag this much?!",
            "score": 14
        },
        {
            "depth": 0,
            "author": "lolidcwhatthisis",
            "body": "If this turns out to be true, it's gotta be a much harsher sentence then Toney and Tonali betting on games they're not even playing in.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Aggressive-Bat8780",
                    "body": "Think they both have issues with addictions too, where as this seems like greed",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "rompthegreen",
                    "body": "Much harsher than 115",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheCarroll11",
            "body": "Ooof. That’s probably about a year ban, at least. Could see it as a year with an understanding he leaves England after. That’s just below match fixing. It’s basically a form of it.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "PalKid_Music",
                    "body": "It's called spot fixing - influencing events within the game, without influencing the outcome of the match.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "batch1972",
            "body": "Wonder if this is linked to the Macarthur FC case\n\n[https://apnews.com/article/matchfixing-corruption-australia-soccer-e48d4e971d3c3001dad681d1eb61afe6](https://apnews.com/article/matchfixing-corruption-australia-soccer-e48d4e971d3c3001dad681d1eb61afe6)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DeltaMusicTango",
            "body": "That's into match fixing territory.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "MattJFarrell",
                    "body": "I tend to think you can rehabilitate a player who just bets on games they're not in. But when you're taking action to fix outcomes? I'm not sure you should get a second chance. To your point, how far of a reach is from getting a yellow to getting a red, or worse?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "flymypretty88",
                    "body": "Now investigate the officials!",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DeltaMusicTango",
                            "body": "Personally I think most of it is incompetence and a system designed for a lot of personal interpretation. There may be some personal bias and the occasional conflict of interest as well.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BreakSad8773",
            "body": "Domino effect: City go for Bruno G?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Yorkshire_Tart",
            "body": "Is it West Ham who keeps dropping these rumours and charges? Scuppered his move to City last year and again this year 😂",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "xvd529fdnf",
                    "body": "ikr? I know it takes time to do investigations, but it’s kinda weird that the story only gains heat close to or during the transfer window.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ill-Maximum9467",
            "body": "Gave the ball away for 115 FC’s first goal on Sunday",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "red-fish-yellow-fish",
                    "body": "Man city have now taken to paying opposition players, VAR and referees “employed” on trips to UAE while getting “special room service and sundries” \n\nThis is Donald Trump levels of golden shower hookers corruption.\n\nAnd they say we don’t need a regulator",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "christianrojoisme",
            "body": "Now it all makes sense with the way he plays",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Arqlol",
                    "body": "Man couldn't buy a card most games",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "sensitiveCube",
                    "body": "And still City wants him, just because he looks cool on the bench.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Friendly-Profit-8590",
                            "body": "City could make the charges disappear",
                            "score": 16
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Vegetable-Echidna534",
                    "body": "Also in that Brazil vs England game he was crazy aggressive and just searching for a yellow… it was obvious something was up because it was so odd to play like that in an international friendly \n\nAs a proud Brazilian, he’s an absolute fucking disgrace and I want him gone from our national team immediately.  He’s a cancer",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "infinitude_",
            "body": "Whaaaaat an idiot ? \n\nLike bro you’re a millionaire if your friends need money and you’re willing to go to these lengths just give them the cash yourself surely😂😂😂",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "littleAggieG",
                    "body": "My theory is that Paqueta owes somebody money from a previous bet & is doing this as a favor to forgive that debt or buy himself some more time.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "runJUMPclimb",
                            "body": "Exactly. Or someone back home has something on him and he had to. ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "That’s what I’m thinking too. There’s no way you’re risking jail time (spot fixing) simply for money. On the other hand, my MIL was a regional VP of a bank & she said about half of the NFL players who banked there basically lived paycheck to paycheck.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DangerousAd3347",
                            "body": "100k a week isn’t enough to pay the debt back? Who’s he in debt to bill gates ?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "littleAggieG",
                                    "body": "More likely in debt to somebody who could break his legs.\n\nAnd you’d be surprised how many very rich people live paycheck to paycheck. Their expenses are too high so a large chunk of their paycheck is already spoken for before they receive it every 2 weeks.\n\nTravis Kelce, the NFL player who’s dating Taylor Swift, talked about how he was basically broke early in his career, despite basically making 100k a week.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DangerousAd3347",
                                            "body": "What would he be in debt for millions that someone would break his legs ? Unless he’s deep in the underworld of drug smuggling that doesn’t seem likely.\n\nIf it’s things like rent, cars etc they’d be from companies unlikely he’s buying his shit from local gangsters",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "littleAggieG",
                                                    "body": "I don’t think you’d need to be in debt for millions for someone to break your legs, nor would you need to be involved in drug smuggling.\n\nAbout 10 years ago, an NHL player called Thomas Vanek tried to sign over a paycheck for $230k to a bookie to pay off his gambling debt. Eventually the investigate unveiled that he owed about $10m in gambling losses to multiple bookies.\n\nI’m not saying Paqueta is in as deep, but it’s not completely unbelievable that a professional athlete would owe bookies more than he could afford to repay upfront.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "DangerousAd3347",
                                                            "body": "Official betting companies are not in the business of leg breaking mate this isn’t 1920’s New York. If it’s not drug smuggling I can’t think what he’s owe so much money for that he’d have his legs broken",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "littleAggieG",
                                                                    "body": "Lol I highly doubt any of these guys owe official betting companies money. You usually have to pay your wager upfront to place a bet with an official betting company. Besides, an official company wouldn’t break your legs. They’d take you to court for what you owe.\n\nIt’s way more likely these guys are placing bets with people who extend them credit & are affiliated with organized crime. I’m hypothesizing why Paqueta might be trying to influence a stat line “for the purpose of affecting the betting market.”",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "DangerousAd3347",
                                                                            "body": "What you mean these guys ? The actual bets were with officisl\nCompanies who are you referring to by these guys ?I find it pretty unlikely the player is pacing bets with organised criminal that quite a jump of an assumption there mate.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "littleAggieG",
                                                                                    "body": "“These guys” meaning incredibly rich athletes who end up owing more money in gambling losses than they can afford to pay despite their enormous paychecks. \n\nI’m skeptical that anyone would risk jail time for spot fixing, to affect bets that are only placed with an official company. Maybe I’m way off base but I feel like someone in a position of such privilege would only risk their career/livelihood under threat of bodily harm.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "DangerousAd3347",
                                                                                            "body": "I can’t think of any situations in uk where prem footballers have gotten in trouble with organised dangerous criminals. Seems a stretch to me. \nMaybe he was just stupid and it didn’t occur to him the fa would have ways to investigate it. I can imagine him thinking “there’s no way the fa in uk would know my family back in Brazil are placing bets” not knowing  how connected and easy to access everything is.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "rex0810",
            "body": "Cards for cash",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Headlesshorsman02",
            "body": "His career could be finished man, that is a HUGE conviction",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kolasinats",
            "body": "Premier league should have waited until City signs him to do this",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "finestryan",
                    "body": "Yeah kinda annoyed they didn’t wait.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "littleAggieG",
            "body": "Oh wow. This is basically like match fixing. Yeah, the PL’s betting partners are not going to let the PL just give him a slap on the wrist. He’s fucking with their bottom line.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Billoo77",
            "body": "Wow, sounds like an actual match fixing charge. What an idiot. \n\nSurely that’s at least a year long ban if just betting alone lands you 9 months +",
            "score": 4
        },
        {
            "depth": 0,
            "author": "External-Piccolo-626",
            "body": "If it’s that one clip of him getting a yellow then he’s bang to rights. He didn’t even try to disguise it.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "No-Set-2576",
                    "body": "1 of 4.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "fifadex",
            "body": "Out the loop here. I assume it's a specific match? Can anyone tell me what match it is or what the context was that made it seem less than genuine?",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "MiddleClassZambian",
                    "body": "I read it a long time ago so might be better googling it yourself. But I think there's a specific game where he had to get a yellow card in the 1st half. And during the half he basically hugs a guy to get a yellow. The bad part is one of his family members or close friend (I think it was his uncle) made a specific bet for a lot of money that Lucas would get a yellow card in the first half. \n\nSo it's not looking good. I think even the betting company might have notified the police on the specific betting being out of the norm on the amount of money used",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lonely-Walrus94",
                            "body": "Correction, he trips a player who is breaking away and stops a counter attack. It wasn't suspicious, it was a very typical professional foul. It was 1-1 at the time.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MiddleClassZambian",
                                    "body": "I remember it looking very blatant. Anyways we can agree to disagree.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lonely-Walrus94",
                                            "body": "No we can't. Go and look 😂. It was a textbook trip to stop a breakaway.\n\nYou can't just drop agree to disagree when you're wrong what the fuck 😂😂",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "MiddleClassZambian",
                                                    "body": "Watching it back it looks blatant, and like you said \"professional foul\". Calm down kiddo, there's no need to get so mad",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Lonely-Walrus94",
                                                            "body": "A Professional foul to stop a break away, it's not clearly a stupid thing to do, it's something that happens all the time in football.\n\nRegardless of your viewpoint it's far from hugging the guy.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "MiddleClassZambian",
                                                                    "body": "Jesus you are thick. Re-read the first comment I made.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Lonely-Walrus94",
                                                                            "body": "\"he basically hugs a guy\"...\n\nI've read it? What? Did you forget to edit the message?",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "MiddleClassZambian",
                                                                                    "body": "No need to edit. Look a little higher. You'll get there eventually",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Lonely-Walrus94",
                                                                                            "body": "Ah, so youre using the ignorance excuse?\n\nI couldn't be bothered, so I made something up, and then tried to argue that a fact is somehow something we can agree to disagree on?\n\nDo me a favour and fuck off 😂",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "fifadex",
                            "body": "Thanks for the reply, appreciate it 🙏",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "MiddleClassZambian",
                                    "body": "No worries 🙌",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "deKaizrr",
                    "body": "[https://twitter.com/westham\\_central/status/1692618183478218968](https://twitter.com/westham_central/status/1692618183478218968)\n\nThe video in question.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "blither86",
                            "body": "Can't view that, any chance you could download and post elsewhere? Can anyone else see it?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[deleted]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "blither86",
                                            "body": "That's in the 2nd half though?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "fifadex",
                            "body": "Thank you 🙏",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MasterReindeer",
            "body": "Career donezo",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Different-Thanks-431",
            "body": "One thing that will never sit well with me is footballer placing bet. You earn a lot for you to be doing that.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Nels8192",
                    "body": "He’s not placing the bets, he’s essentially spot-fixing for someone else’s benefit.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Different-Thanks-431",
                            "body": "I understand, but he is still doing that for his own benefit, because if he is not seeing anything from it, he wouldn't risk such a thing.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jimbluenosecrab",
                                    "body": "If he’s spot fixing isn’t that prison?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "lil-bitch42",
                                            "body": "Yeah 3 Pakistani cricketers got prison time for spot fixing against England in 2010",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "DangerousAd3347",
                                    "body": "If it’s family members doing it, he could be doing it to help them out",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DangerousAd3347",
                    "body": "Gambling isn’t done because it’s an effective way to make money, it’s because of the dopamine and excitement",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "shaftydude",
            "body": "Ban yellow card betting instead.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "LilCubeXD",
                    "body": "Ah yes, the reasonable take… 🤡",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "divsandpremium50",
                    "body": "Clown take",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Rare_Excuse_6347",
            "body": "The NBA handed out a lifetime ban to Jontay Porter for this sort of behavior…",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "trevlarrr",
                    "body": "He was betting on his own points scored, taking the under and then intentionally missing shots to win his bets. Making no excuse for Paqueta if he’s found guilty but taking a yellow card isn’t the same thing.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mackieeeee",
                            "body": "Not the same thing? How is it not",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "trevlarrr",
                                    "body": "The equivalent would be him betting on himself to miss a penalty or score an own goal, intentionally changing the score, which picking up a random yellow obviously isn’t doing. Don’t get me wrong, if he’s found guilty he’s getting a multiple year ban and rightly so, but it’s not really the same as Jontay Porter.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "purpleplums901",
                            "body": "What for spot fixing? He could be looking at prison if the CPS feel like it\n\nSee the Pakistan cricket team in England in 2010 https://en.m.wikipedia.org/wiki/Pakistan_cricket_spot-fixing_scandal",
                            "score": 5
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "No-Form7379",
            "body": "Welp, there's Lopetegui's summer budget down the drain.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Jambot-",
            "body": "Deliberately getting yellow cards in the prem? #InvestigateOtamendi",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "_Pohaku_",
                    "body": "Rumour has it that Fernandinho is in hiding from several cartels after accepting payments to get a yellow card in 200 matches, but bizarrely found himself immune to being booked despite his best efforts.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Aggressive-Bat8780",
            "body": "You do have to wonder what all the markets achieve in football, and other sports\n\nIs about 300 on each game. Is so ripe to abuse. \n\nAnd obvious answer is it provides money to gambling companies. But seems very little if any other positive. \n\nThink morally gambling is at a tipping point, people really starting to see the damage it does and provides pretty much zero positive impact on society. Advertising should be banned as the very minimum.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "towelie111",
                    "body": "Happy for gambling on roulette, or poker etc. But in sports people can be bought, bribed and influenced to affect the gambling market, and it’s happening a lot more than the cases we get to find out about.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Aggressive-Bat8780",
                            "body": "Even that I feel should be actual poker and roulette, the machines just seem a way to lose money quickly. \n\nThe ruling that can now use debit cards on slot machines is an awful idea.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nels8192",
                                    "body": "A big improvement from just 5 years ago when you could gamble directly off of credit cards",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "_Novapyre_",
            "body": "[“Paquetá denies wrongdoing and any knowledge of the suspicious bets, which have been traced to Paquetá Island, off the coast of Rio de Janiero.”](https://www.reddit.com/r/PremierLeague/s/RrKryJdYMJ)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "platosapron",
            "body": "I’m going to offer a slightly different opinion and keen to hear if other people have similar experiences or anecdotes. A buddy of mine is a professional poker player, and by proxy, got involved in a lot of rather shady sports betting run by organized crime. \n\nSome of the names involved (hearsay from buddy) are rather high profile in English football - I suspect if folk Googled the intersection of sports betting and English football (not footballers, but very high profile folk in the actual football business), you’d get a pretty good idea of who might be involved. But I’d rather not name names given the public nature of this forum. \n\nFrom what I’ve heard, the betting rings involved could influence results of games, typically in lesser known leagues, but I’ve heard anecdotes within top European leagues such as Serie A, though not explicitly in the EPL. Now when it comes to organized crime and the sums of money involved, sure there could be carrots to get footballers to influence a result, but there’s also the stick. I wonder how many players might be coerced into some of these, rather than simply fall into this out of stupid greed. I don’t think it applies to Paqueta given the details of the case, but it’s worth a thought. \n\nAre there any other folk who have heard similar stories on betting syndicates?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "littleAggieG",
                    "body": "There’s definitely an intersection between gambling and organized crime.\n\nOne of my husband’s commercial tenants is a restauranteur, early 40s guy. A few years ago he told my husband that he’d lost about $100k *that year* betting on basketball games. Husband asked if he was on Fan Duel or Draft Kings & he said “no, it’s a guy my brother knows.” Maybe I’ve seen The Sopranos too many times, but if you’re losing $100k making bets with “a guy,” there’s a high probability of that guy being involved in organized crime.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "matti-san",
                    "body": "Could referees be involved? Is that how it seems like some players are more likely to get penalised for one thing than another player for the same infraction?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "platosapron",
                            "body": "I’ve never heard explicit tales of whether the player or the referee or coaching staff is involved, just that the betting syndicates had a fairly reliable way to get results they needed relative to what was on their books for the particular match.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "L0laccio",
            "body": "Go to city. They’ll lawyer up and you won’t have to face the charges till you have retired anyway !",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "pacothebattlefly",
                    "body": "💩",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Mugweiser",
                    "body": "🥱",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "VivaLosHeavies",
            "body": "Lucas paquetas  statement via social media\n\nhttps://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2F80wh3eb2072d1.jpeg",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sub2pewdiepieONyt",
            "body": "[This made me think of the cricket spot fixing thing and that wasn't just sports bans, People did prison time for it. Surely it would be similar? Guess Prison FC making moves?](https://en.m.wikipedia.org/wiki/Pakistan_cricket_spot-fixing_scandal)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Bigchiefdaddy_",
            "body": "Clubs should not pay these players their salary when they get suspended for match fixing/betting.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "maver1kUS",
                    "body": "I think most clubs have a clause that empowers them not to pay the players when they are suspended for non-footballing reasons. Some even have clauses that allow them to terminate the contract if club is brought into disrepute, which West Ham can legitimately argue here.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EldritchWyrd",
                            "body": "Isn’t their shirt sponsor a betting company? Dunno if they could actually argue the disrepute part lol.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Nels8192",
                            "body": "Be amazed if they did that to a £70m asset without substantial proof first",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DroneNumber1836382",
            "body": "Just pay the bets.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WestwardLord",
            "body": "Oof size: extra large",
            "score": 1
        },
        {
            "depth": 0,
            "author": "guilhermeabs",
            "body": "I'm Brazilian. Followed him at Flamengo when he started.\n\nUntil Lyon, he was jot that player.\n\nOne could argue that French league is physically too intense compared to Brazil. We do have this as a debate because of how things went for Neymar.\n\nYou could argue Neymar was diving, but from BR perspective, he was constantly receiving a foul. So, French league, FOR US, does a lot of fouls that the referee doesn't do. \n\nPaqueta went there to play in a mid team, got too \"hardcore,\" right?\n\nAbsolutely not. \n\nWhen he arrived at Orem, Me and other friends commented how he was constantly being booked for stupid fouls. Most of them made no sense. Not like in Lyon. He doesn't do just tactical fouls, he does stupid, nonsense, too violent fouls out of nowhere.\n\nLong ago we started commenting on betting for him being booked. It's no surprise he is involved with that. I've watched a lot of his games. He is far away from the player he was in Flamengo from a foul perspective. To me, he is absolutely involved with betting schemes.\n\nI ask for a WH fan here, do you think the fouls he does in the games are \"normal\"? I don't think so. Too bad for him bc he is a very good player that could go higher (with all respect for WH).",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Euphoric_Living2053",
            "body": "Fa charge city n fuckall happens , powerless unless concrete evidence of him telling someone to put a bet on because  the refs are useless n book you for nothing",
            "score": 1
        },
        {
            "depth": 0,
            "author": "futbolr88",
            "body": "This is how my friends and I play fifa. Can’t win if you don’t get a red card.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ItsTom___",
                    "body": "Forget scoring the winner is the one who forfeits the match",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Riespieces16",
            "body": "How can you prove that unless he openly admitted to it?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Thinlinebaby",
                    "body": "Apparently a relative was putting in large bets and winning every time. If true, he’s pretty dumb and/or naive.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "gilly5647",
                    "body": "It’s a pattern, he probably told one person in his home town. This person than told one more person and it kept spreading, all of a sudden a large number of people from his hometown are betting on him getting a card in this certain game, probably multiple new customers as well to make it even more bait.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Riespieces16",
                            "body": "Yeah this definitely makes sense. If there are a bunch of suspicious betting patterns then that’s a pretty big giveaway depending on the situation. Tbf paqueta is a pretty emotional player so betting on him to get a card would t be that crazy to me lol",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Remus71",
                                    "body": "What do you mean ~if~ there was a bunch of suspicious bets? How do you think the while thing came to light? He was 100% reported by a betting company.",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "DangerousAd3347",
                                    "body": "If it’s a family member like come on the family member is gonna put a huge bet on him\nGetting a card and not mention it to him ?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "dispelthemyth",
                    "body": "You don’t have to prove it 100%, just to a certain degree and if the betting companies say people from his home town did the bet out for he blue with no history of making the bet and he gets a dodgy pen that’s setting alarm bells off no?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Will_Rage_Quit",
            "body": "Surely they've not charged him without having some serious evidence. This could be the end of his career. \n\nMy father was a gambling addict so I really hope he hasn't got an addiction. This is why I hope they've really thought about this before they've charged him. The line between gambling addiction and greed can be hard for some to see, but it is there. \n\nIf you have a gambling addiction, please seek help immediately. It nearly destroyed my family so don't let it destroy yours.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "chucklebrother1and2",
                    "body": "This isn’t about him gambling, it’s him doing something on the pitch for monetary gain, Spot fixing I believe. He’s deliberately getting yellow carded and his mates are betting on it to make bank. I personally believe his career is done.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "CommerceOnMars69",
                    "body": "What does gambling addiction have to do with this? The issue isn’t that he was betting. If the allegations are true he’s tried to basically fix the outcome of a game (yes even a yellow card can have a huge impact, what if he got sent off or the manager subs him etc because of the card) for what we can assume is some kick back either for himself or from someone else. It’s just plain old criminal action motivated by greed.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "patelbadboy2006",
                    "body": "This is more match fixing then it is gambling.\n\nSimilar to what happens in cricket.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DVPC4",
                    "body": "I can’t see how this would be a case of gambling addiction. He wasn’t gambling in any way at all, he was cheating his way into money by guaranteeing a win",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Moe_180",
            "body": "In some cases it makes me giggle. It’s so blatant with friends and family suddenly betting but some are nuts there is literally no evidence and they are found guilty because they refuse to interact with the FA. What utter bollocks, you claim I did it why on earth would I help you in any way innocent or guilty",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DangerousAd3347",
                    "body": "If you’re innocent why would you refuse to interact with someone accusing you of something ?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GlasgowTHCVapeCarts",
                            "body": "Why do you think they tell you to say no comment when interviewed by Police?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Moe_180",
                            "body": "I would be of the opinion guilty or innocent, you’re accusing me, you prove it. \n  The police use the same tactic. ‘Anything you say or do not say can be used against you’re it’s bullshit. You’re the one accusing me and it’s your job to prove it not the other way round.\n     The ONLY reason the FA want/insist on cooperation is hoping you drop yourself in it and if possible twist your answers to suit their own narrative.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DangerousAd3347",
                                    "body": "I mean almost logical thinking people would prevent any evidence they have suggesting they’re innocent. \n\nYou don’t speak to the police but in court you present your case of innocence don’t you ? You wouldn’t just go to court and sit there in silence",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Moe_180",
                                            "body": "The difference is in court all their evidence is laid out and you get to dispute it to a jury of your piers. \n     These cases are not done like that they are a few old men from the FA sat behind a table deciding your fate. I have attended a few hearings by the fa when I played and believe me it’s a kangaroo court. It’s a nightmare proving your innocence I could not imagine its any easier with their top hangmen waiting for you.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DangerousAd3347",
                                                    "body": "You’re talking like they are constantly going around accusing innocent people of stuff, seems unlikely to me.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Moe_180",
                                                            "body": "Did you ever play football??? The amount of people I played with over the years who were sent off and had to appear before the fa was huge and always and I mean always if you didn’t have a few witnesses usually from the other team you are screwed. The ref was always believed before a player even if he had a witness especially if the witness was from his own team.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "DangerousAd3347",
                                                                    "body": "Well of course the ref will be believed before the player lol, otherwise every time a players sent of the player and his teammates wound just say it was wrong decision and have it rescinded.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Moe_180",
                                                                            "body": "The point was even when you have a witness to back you up you’re not believed. Did you know almost 1000 innocent people in the U.K. are sent to prison every year. So yes again it’s their job to prove you did it not the other way around",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "DangerousAd3347",
                                                                                    "body": "Of course they won’t believe you if your witness is your team mate lol every team would just lie for there teammates if that were case",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Moe_180",
                                                                                            "body": "So basically you agree you’re pretty much screwed so why would you help them?",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "DangerousAd3347",
                                                                                                    "body": "Well no just you need evidence aside from what your teammates say",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Moe_180",
                                                                                                            "body": "So where are you going to find an independent witness on say a Sunday morning in a local park willing to travel miles to back you up on a Tuesday night? You’re not are you so again you’re basically admitting I’m right so why continue with your silly assumption that these hearings are fair in any way?",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "DangerousAd3347",
                                                                                                                    "body": "So you’re saying it would be fair for them  to believe a players team mates ? So any time a players sent off his teammates can just say it was wrong decision and it’s reversed ? If you don’t see how that’s not a fair way ti do it either I can’t help you\n\nSo a player can just say “the ref was wrong” every time and be believed ? Lol I can’t even",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "Moe_180",
                                                                                                                            "body": "No you’re being silly now the point is it is biased in their favour but you know this you’re just being a tool but I guess I expect it on here. \n   The question isn’t if the system is fair because that’s not even a question because anyone with a basic intelligence would know it isn’t a fair system. The FA, premier league, uefa and fifa are not an independent or fair in any shape way or form. Never have been and never will be which is why the original point you made was idiotic at best. The only person who would cooperate is an idiot or quilty and hoping to get a reduced punishment. It’s hard enough to get a fair hearing let alone help them to screw you over.",
                                                                                                                            "score": 1,
                                                                                                                            "replies": [
                                                                                                                                {
                                                                                                                                    "depth": 15,
                                                                                                                                    "author": "DangerousAd3347",
                                                                                                                                    "body": "Of course it’s biased in there favour they own it and make the rules. You’re going to be biased for your own team as well obviously it’s not like you and your teammates will have unbiased opinions on a match you’re playing in is it lol",
                                                                                                                                    "score": 1,
                                                                                                                                    "replies": [
                                                                                                                                        {
                                                                                                                                            "depth": 16,
                                                                                                                                            "author": "Moe_180",
                                                                                                                                            "body": "So again it would be stupid of you to help them then wouldn’t it. You’ve literally answered your own question. Regardless of whether you’re innocent or not you would be a fool to help them knowing it’s going to be skewed to their interests because it’s a rigged system. Well done for finally catching on. Goodnight it’s bed time for me. Have a great weekend",
                                                                                                                                            "score": 1,
                                                                                                                                            "replies": [
                                                                                                                                                {
                                                                                                                                                    "depth": 17,
                                                                                                                                                    "author": "DangerousAd3347",
                                                                                                                                                    "body": "It’s not a rigged system lol the system is the ref is the decision maker, if you let the players make the decisions there’s no point having a ref.",
                                                                                                                                                    "score": 1
                                                                                                                                                }
                                                                                                                                            ]
                                                                                                                                        }
                                                                                                                                    ]
                                                                                                                                }
                                                                                                                            ]
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Simba-xiv",
                    "body": "It’s not his fault",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Eeedeen",
                    "body": "Hide the cats!",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Swap2909",
            "body": "Now we know why city want him.. culture fit",
            "score": 1
        },
        {
            "depth": 0,
            "author": "NotMyFirstChoice675",
            "body": "So he can get charged but city just walking around spending ill gotten money like it’s no thing 😂",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DangerousAd3347",
                    "body": "City have also been charged. Both cases are in the investigation stage",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NotMyFirstChoice675",
                            "body": "Thanks for clarifying",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "bobbieibboe",
                    "body": "It's crazy right. And they're going to have a general election, and the Euro tournament is going to go ahead, all while city are walking around spending money. \n\nAlmost like none of those things are connected at all.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NotMyFirstChoice675",
                            "body": "I’m talking about FA rules being broken and activity or, inactivity from the governing body….so very much on topic thank you",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bobbieibboe",
                                    "body": "Classic ignorant take, not even the same governing body",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DestructoSpin7",
                    "body": "Reddit spent so long screaming 115 that they actually forgot what it means.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NotMyFirstChoice675",
                            "body": "Who’s they?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DestructoSpin7",
                                    "body": "The authors of such genius as:\n\n>So he can get charged but city just walking around spending ill gotten money like it’s no thing 😂",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "NotMyFirstChoice675",
                                            "body": "Oh football fan has a football opinion. \n\nSorry I named the wrong governing body. Are you feeling better now?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DestructoSpin7",
                                                    "body": "Who said anything about governing bodies?\n\nYou are implying that city have not been charged, when the topic of their 115 charges have been dominating headlines for over a year, so either you have been living under a rock, are being willfully ignorant, or are woefully underequipped for logical thought.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "NotMyFirstChoice675",
                                                            "body": "Yep-that’s me all of the above. X",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Wild_Ad969",
                    "body": "You know City's owner money source aren't exactly unethical, unless you are an environmentalist that believe fossil fuels usage are evil. \n\n\nThe bad things about them is in how they use their money to run a repressive autocratic regime, complete with modern slavery too.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NotMyFirstChoice675",
                            "body": "I’ll gotten money being CLUB revenue not the owners revenue.\n\nYou know how they were able to buy all the top players, some of who had g even heard of them-Robinho etc….that was the foundation of what we have now. They literally bought their way to success breaking ffp.\n\nContrast in the same period Arsenal moved into the emirates stadium and had to SELL players despite being recent champions etc, we had to sell players to pay for the stadium…in fact quite a few poached by City",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "covid401k",
            "body": "Unless they have the bets being placed from his IP there’s no way they’re proving this.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Super_Maximum_9030",
                    "body": "You could be right of course, but why would PL charge him, and risk reputational damage to Paqueta and the league itself, if they weren't confident the charges would stick?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "covid401k",
                            "body": "Not sure. Perhaps they want to cover their arses and say at least we did our part, let’s get this to an independent regulator and now it’s someone else’s problem. Same with cities 115 charges,",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Usual_Durian2092",
            "body": "dude thats spot fixing. Pakistani crickets were jailed for it, and some got life bans.\n\n[https://en.wikipedia.org/wiki/Pakistan\\_cricket\\_spot-fixing\\_scandal](https://en.wikipedia.org/wiki/Pakistan_cricket_spot-fixing_scandal)",
            "score": 1
        },
        {
            "depth": 0,
            "author": "hotspured",
            "body": "If you are going to have sports bets sponsors all over everything he better get wrecked if this is true… he should never play again",
            "score": 1
        },
        {
            "depth": 0,
            "author": "twoheels",
            "body": "Financial rule breaking? Makes sense that City seems so keen on him so.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Icy_Ad_573",
                    "body": "It’s Gambling on himself which will affect what he does on the pitch it’s not really financial.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "finestryan",
                            "body": "It’s fraud silly. You should be familiar with that.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Icy_Ad_573",
                                    "body": "No it’s affecting the integrity of what’s happening on the pitch. Finances are secondary to that. The FA aren’t angry at him making money.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "finestryan",
                                            "body": "Finances are the motivator behind the actions and the subsequent impact on integrity. But tbh premier league integrity has been in the mud for a while now…hasn’t it?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[removed]",
                    "score": -9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[removed]",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[removed]",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "[deleted]",
                            "body": "[removed]",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "[deleted]",
                                            "body": "[removed]",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[removed]",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "[deleted]",
                                                            "body": "[removed]",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "[deleted]",
                                                                    "body": "[removed]",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "vdentata20",
            "body": "Is that illegal? Lol",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SovannRoussard",
            "body": "Bro is never going to City now",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheFettz79",
                    "body": "Might be the only chance he has to get away with it 🤪",
                    "score": 8
                }
            ]
        },
        {
            "depth": 0,
            "author": "normal_life87",
            "body": "Sick",
            "score": 1
        },
        {
            "depth": 0,
            "author": "VivaLosHeavies",
            "body": "Players really think they are invincible. Throw the book at this fucker right after man city sign him for 100M",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "trevlarrr",
                    "body": "So we’re not even waiting to see if he’s found guilty then? Cool!",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Fire_Bucket",
                            "body": "Have you not been on this sub for the past year?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "finestryan",
                                    "body": "Lack of cooperation is a primary indicator of guilt. First thing I learnt in forensic accounting class. Shush.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LMinggg",
            "body": "He should join man citeh",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Home_sick_alien",
            "body": "God forbid men have hobbies",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "EugeneStonersDIMagic",
                    "body": "Which hobby are we talking about?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ret990",
            "body": "🎶 We're all having a party 🎶   \n🎶 We're all having a party 🎶  \n....",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "charlos74",
                    "body": "It’s just a shame that such a talented footballer may have fucked his career up.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "haziola",
            "body": "They're doing all this nonsense just because City wanted him. The Prem cartel are so scared of us. Pep tactics are just overpowered. 4peat baby!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Previous-Loss9306",
                    "body": "r/soccercirclejerk wya",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "kaiderson",
                    "body": "Take your meds son",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "igetpaidtodoebay",
                    "body": "Avg. r/pl yank",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Prestigious-Sea2523",
            "body": "I know this is going to be unpopular because everyone seems to think he's the second coming of Messi but I'm glad. He is capable of an unbelievable pass once every few games but 90% of his game hinders us and he's wildly overrated. I'm actually disappointed at this because it means the club won't be able to sell him.",
            "score": -9,
            "replies": [
                {
                    "depth": 1,
                    "author": "OfficialSlippery",
                    "body": "Don't think anyone thinks he's the second coming of Messi, but our win rate with and without him this season says everything. He's having a bad spell at the moment but is easily one of, if not our best player",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Prestigious-Sea2523",
                            "body": "Heavy disagree. Bowens is our best player. And that period where we didn't have him in the team, we had plenty of other issues and other players having bad runs of form somewhat masking his effect on the game.",
                            "score": -2
                        }
                    ]
                }
            ]
        }
    ]
}