{
    "title": "Sean Dyche deserves to be the BarclaysFooty Manager of the Season",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FuzzFest378",
            "body": "As an Everton fan, I strongly believe Dyche is a the best manager for Everton we could have at this stage, he’s instilling that fighting, hard to break down mentality, but with respect to manager of the season, Pep and Emery have been better rounded and more consistent managers- granted they didn’t have the issues Dyche had to deal with but they’ve done so well.",
            "score": 33,
            "replies": [
                {
                    "depth": 1,
                    "author": "calm_down_dearest",
                    "body": "Let's be honest, Pep has it fucking easy. Emery and Dyche are the only real contenders.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "FuzzFest378",
                            "body": "Yea, but he also didn’t fuck it up, for 4 years in a row 🤷‍♂️",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "calm_down_dearest",
                                    "body": "The most expensively assembled team in football history, no barriers to purchasing power, state of the art sports science and nutrition and the team had just won the treble the year before. \n\nHowever did he manage to win the league...",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TomDobo",
            "body": "Everton fan here and I think Dyche did an amazing job and should be in the shortlist for the award. But id have to say Unai Emery deserves the no1 spot for it. He turned a struggling Villa side to a top 4 finish and were one of the more exciting teams this season.",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "CasterlyHeavyMetal",
                    "body": "As an Arsenal fan I’d agree. Dyche and Emery would be my top two, with the latter winning it.\n\n(Also side note, please give all the love possible to Coleman. His behaviour towards Odegaard at the end of the game was pure class)",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TomDobo",
                            "body": "Coleman is probably the nicest guy in world football. He deserves all the love and is a proper class act.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Ndumixo",
            "body": "If PL gave Dyche a trophy, they'd take it away ",
            "score": 17
        },
        {
            "depth": 0,
            "author": "BoopAndThePooch",
            "body": "He’s done a fantastic job this season, and deserves credit and to be on the shortlist for the accolade. However, what Unai Emery has done is remarkable. It’s him for me.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "DC25NYC",
            "body": "If villa didn't finish top 4 sure.",
            "score": 10
        },
        {
            "depth": 0,
            "author": "sirdougie",
            "body": "He did a good job, but no way does he deserve to be MotS. He hasn't done any better a job than other succesful midtable managers in Glasner, Iraola, O'Neill, Frank, Silva. He's taken Everton to pretty much where they should be. Tenth highest wage bill in the League, and would have finished eleventh without points deductions.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "PerfectlySculptedToe",
                    "body": "I'm not disagreeing really, but saying \"tenth highest wage bill\" completely misses the fact that a huge chunk of that wage bill is wasted on shit players that haven't played all season because of previous mismanagement.\n\nDele, Gomes, Keane, Danjuma are a combined £350k a week or about 1/3 of our wage bill and have a combined 1527 minutes between them and the vast majority of that has been 10 minutes at the end of a game. \n\nThat's also not including Doucoure, DCL, Onana, Harrison, Godfrey all on massively inflated wages that they'd be lucky to get half of at any other club. \n\nPoint being wages is a good indicator of where a squad should finish, but not with the gross levels of incompetence our board has shown over the last decade.",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "sirdougie",
                            "body": "So Dyche has a core of experienced, even if overpaid, players to draw on in the squad to bring on at the end of games. Most other teams have to dip into youth teams to fill out the bench. \n\n  \nDyche has done a good, if unspectacular, job in diffuclt circumstances. No more, no less.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PerfectlySculptedToe",
                                    "body": "If you want to completely disregard my entire point, or disagree over the level of job Dyche has done, by all means. But please don't completely make up stuff to try and make a point. We've had 2 keepers and youth players on the bench practically every game. Dele hasn't made the bench once (with his £100k a week), Gomes can barely stay fit for 90 minutes because Son is a crying arse wipe. Keane was literally brought on up front because we had no other options.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "ProfetF9",
                    "body": "mid table teams\\* because if you take Pep and put him in his spot he would have failed i bet, in fact any manager would have failed this task so .. op has a point.",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BruceBrownMVP",
                            "body": "If you put Dyche in Peps spot he would have failed so that's dumb logic",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ProfetF9",
                                    "body": "Why?",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BruceBrownMVP",
                                            "body": "Why what?",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ProfetF9",
                                                    "body": "Why could he not take the epl?",
                                                    "score": -2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "BruceBrownMVP",
                                                            "body": "Come on lad",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "somethingnotcringe1",
            "body": "I don't think you can win 1 match in 4 months and be manager of the season",
            "score": 8
        },
        {
            "depth": 0,
            "author": "AsylumRiot",
            "body": "Emery surely? Pottechino with a late claim getting that pile of dogs mess into 6th somehow.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Space0asis",
                    "body": "Poch is already out of the job lmao",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AsylumRiot",
                            "body": "Even more reason, batshit crazy owners.",
                            "score": 6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RogerFederer4",
            "body": "This reads like an advertisement with the forced Barclays footy part",
            "score": 5
        },
        {
            "depth": 0,
            "author": "dbe14",
            "body": "As a Toffee I agree, but my vote goes to Unai Emery, 4th with Villa is an incredible result.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "jasonbirder",
            "body": "He's done a solid job no doubt, but does \"taking team from just above the relegation zone whose natural home is bottom half of the table, to bottom half of the table slightly more comfortably above the relegation zone\" reallys scream \"Manager of the Season\" to anyone?",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "Toffeeman_1878",
                    "body": "Dyche’s team won 48 points this season which would’ve seen them finish 11th in the league. Same points total as media darlings Brighton. This is a 33% improvement on the points total from last season. Achieved with zero money spent. Add in having to manage a team through 2 separate points deductions and I don’t think it’s fair to characterise things as simply avoiding relegation more comfortably.",
                    "score": 12,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "redd5ive",
                            "body": "11th in form with the 10th highest wage bill doesn't really scream MOTS to me either. They *would* have finished with the same points tally as Brighton with a squad paid £15M more.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Toffeeman_1878",
                                    "body": "Dele on 100k pw. \nMichael Keane on 80k pw. \nHolgate on 72k pw. \nGomes on 120k pw. \nGodfrey on 70k pw. \n\nThat’s almost £20 million per year on players who didn’t contribute (with the possible exceptions of Gomes and Godfrey). Are you suggesting that Dyche is responsible for the incompetent executives who signed bang average players on big wages? All of whom were signed before he arrived at the club? \n\nYou are pointing out a lot of what has gone wrong at Everton but it’s wrong to suggest that Dyche has some super squad at his disposal. He has very good defenders, a decent keeper and hard working midfield with no pace and little creativity.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "redd5ive",
                                            "body": "Dyche has done a good job, obviously he isn't to blame for mistakes made before his tenure. Nothing about the job he has done has screamed \"best manager of the season\" to me.",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "jasonbirder",
                            "body": ">I don’t think it’s fair to characterise things as simply avoiding relegation more comfortably\n\nI'm not saying Dyche hasn't done a decent job...but how else would you describe it? Going from 17th to a notional 12th without deductions (actual 15th) is what?",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Toffeeman_1878",
                                    "body": "I think a little context is needed here. Everton as a club is a shambles. It’s been in freefall since Ancelotti left and Moshiri (and whoever might be backing him) decided they wanted out. It was circling the drain in the two previous seasons, avoiding relegation on the second last match and last match respectively. He spent nothing in the summer, had to sell players such as Gordon to offset PSR. He had to manage through 2 points deductions. Dealing with one of these issues would be trying but dealing with all of them at the same time, still securing a 33% improvement in points won and achieving safety before the final rounds of matches is an achievement(all things being equal). It might be hard for non-Everton fans to understand but I feel that those fans who have lived the season will appreciate this.\n\nEdit: he also shored up the defence. Only City, Arse and those lovable reds had a better defence this season. Pickford pushed Raya for the golden gloves. He brought on the likes of Branthwaite and has improved Mykolenko and Tarkowski. Others may not appreciate his “style” (and it can be tough to watch sometimes) but it is effective in achieving results over 38 games. Ask Burnley fans would they rather Kompany’s “philosophy” of pretty football or Dyche’s pragmatism of winning points.",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Icy_Revenue_8944",
                                            "body": "Well said and explained! I agree that he's done a massive job this season. The points deduction really ruined things but they stayed up!",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "andreew10",
            "body": "Should be Emery and I don't think it's really close. If not Emery you could maybe have Iraola or Dyche but it has to be Emery.",
            "score": 14
        },
        {
            "depth": 0,
            "author": "theopacus",
            "body": "I like Dyche. Has the ability to save lost causes like e.g. Big Sam had, but in addition, Dyche’s teams actually try to play football.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Green117v2",
            "body": "Dyche certainly has to be in the running along with Emery. Both did wonders this season; a accumulation of what they had to work with, what they had to deal with, and where they finished respectively.",
            "score": 7
        },
        {
            "depth": 0,
            "author": "dtan8288",
            "body": "Dyche has done an awesome job this season with points deduction and uncertainty of the ownership at the club. Due credit has to be given to him n everyone at the club. All the best to him n Everton in the new season.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "PenisManNumberOne",
            "body": "Made sure Klopp ate an L on his way out was beautiful",
            "score": 10
        },
        {
            "depth": 0,
            "author": "BrewtalDoom",
            "body": "I don't really care about the award, as it's hard not to give it to the manager who wins the league for the fourth time in a row. So forgetting that, what Sean Dyche has done this season has been nothing short of brilliant (I can't use \"spectacular\" to describe Sean Dyche's management, can I?!). Over the last few seasons, the bulk of this Everton squad have shown themselves to be unreliable bottlers who have been dragged over the line *twice* by the supporters and some last-minute luck. Yet this season, those same players have been disciplined and resilient. They've played through **TWO** points-deductions and still not crumbled. \n\nAnd Dyche is the reason.\n\nWhere Benitez (still can't believe that happened) was pig-headed, obstinate, petulant, and prone to drama, Dyche is pragmatic and goal-driven, not ego-driven. And where Lampard was emotional, idealistic, and yearning for praise and acceptance from the fans and the board, Dyche has been level-headed, consistent, and neither pleading nor apologetic. He's not someone who is going to let off-field issues and emotions filter down to the players. It's *his* team, he's their buffer, and it looks like they're playing for him and for the shirt, and that's what we want to see as Evertonians.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "verifiedkyle",
                    "body": "Dyche knows exactly who he is and exactly what he wants of his teams. When your club is in turmoil, that’s exactly what you need. Loved watching what he did this season.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "WonderfulBlackberry9",
                    "body": "I think it speaks volumes that with another poor squad, arguably their poorest ever, Everton probably looked their most comfortable and safest in years. \n\nGranted, the three teams that went down were horrible. But from memory Everton never looked too troubled even after two separate point deductions. You just back Dyche to beat the drop",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bulbamew",
            "body": "Emery did the best job",
            "score": 7
        },
        {
            "depth": 0,
            "author": "JoeDiego",
            "body": "Luton, Burnley and Sheff U were so bad that nobody looked in danger of relegation, maybe Brentford, Forest and Everton for very brief periods.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "rliss75",
            "body": "Dyche top 3 for sure but Emery top.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "devils__haircut",
            "body": "Only didn’t look in danger of relegation due to the absolutely shocking form of the bottom 4.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "g0ldingboy",
                    "body": "So 14 points clear, should have been 22 is relying on the. Bottom 4? Deluded mate.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "lolzidop",
                    "body": "Only in danger of relegation at one point because of our points deductions. We finish 12th without the points deduction, so how you say we only didn't look in danger because of the bottom 4 is beyond me. Surely, by that standard, most of the bottom half should have been in danger of going down. We could have had a further 14 points deducted, and we still wouldn't have been relegated.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "FuzzFest378",
                    "body": "I don’t think 40 points was ever at risk of needing bad form from the bottom 4 teams mate",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "devils__haircut",
                            "body": "what I meant was that in previous seasons 40 pts wouldn’t have made them as comfortable as they were this year",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Immediate_Wolf3802",
            "body": "I agree...its hard to stave off relegation with points deductions and a side that doesn't score goals \n\n\nOnana unsung hero in midfield and the whole defence deserves a round of applause 👏 difficult to score against",
            "score": 5
        },
        {
            "depth": 0,
            "author": "DigitialWitness",
            "body": "Would've ended up 12th without the points deductions.\n\nEdit: 12th.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "wjt7",
                    "body": "12th 🦆",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DigitialWitness",
                            "body": "Ya, still good though.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ElSpazzo_8876",
            "body": "I kind of respect Dyche in a way. Using all limited resources that he had to create a great siege mentality for Everton. Sure, the football might be dour to look at and sometimes we probably have a hard time beating them. However, it doesn't change the fact that I still respect Dyche for what he was and heck, I kind of respect him more than Kompany if you ask me.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "3106Throwaway181576",
                    "body": "People always think Dyche plays a low block Simeone Terrorism football but he doesn’t. \n\nHe’s a much more versatile manager than he gets credit for",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Progression28",
                    "body": "Dyche‘s football at Everton was not nearly as destructive as the Burnley you‘re thinking of.\n\nDyche is a great manager who plays pragmatic football and result orientated football.\n\nEverton, when permitted, played decent football.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ocbeezilla",
                            "body": "the football is limited by the fact half the squad struggles to play it",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "ElSpazzo_8876",
                            "body": "Fair point",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "wjt7",
            "body": "Definitely had a good season but can't get too excited with the 12th place they'd have come without points deduction. Still think Emery deserves it more. \n\nI've heard a lot of people bring up the \"uncertainty of points deduction\" but you could easily argue the other way that it could have a galvanizing effect on a team. Certainly there's not a clear correlation points deductions make you play worse when you look how some of the football league teams have done after administration, or serie a after calciopoli.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "PJBuzz",
            "body": "He deserves to be in the discussion.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Texaslonghorns12345",
            "body": "What about O’Neil and Iraola?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "ThunderRoad_44",
            "body": "Who were the two strikers?  Beto and ?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "tuckyofitties",
                    "body": "Chermiti",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "therealkimjonguno",
            "body": "No manager of a team with FFP charges should be in the discussion",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "SokkaHaikuBot",
                    "body": "^[Sokka-Haiku](https://www.reddit.com/r/SokkaHaikuBot/comments/15kyv9r/what_is_a_sokka_haiku/) ^by ^therealkimjonguno:\n\n*No manager of*\n\n*A team with FFP charges should*\n\n*Be in the discussion*\n\n---\n^Remember ^that ^one ^time ^Sokka ^accidentally ^used ^an ^extra ^syllable ^in ^that ^Haiku ^Battle ^in ^Ba ^Sing ^Se? ^That ^was ^a ^Sokka ^Haiku ^and ^you ^just ^made ^one.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "omnipotentmonkey",
            "body": "Pretty low bar for \"manager of the season\"  \n\nwith the points deductions removed he's ten points better off than last season, which is an improvement, definitely, he deserves some credit,   and he's held things together well through a cloud of uncertainty,    but even without the deduction Everton only climb to 14th, via goal difference at that,   it's not exactly a \"manager of the season\" level change, at all.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "adamaley",
                    "body": "Didn't they fight relegation last season and escape it by a few points? I'm sure some had them as relegation candidates preseason as well due to the lack of incoming transfers. Then to get 10 points deducted, something that could easily demoralize a team, and stay galvanized to finish comfortably above relegation this season. Kudos to him",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "No-Set-2576",
                            "body": "In the relegation zone for a while on final day until we scored around the 60th minute to win 1-0. A draw and we’d have been relegated.",
                            "score": 3
                        },
                        {
                            "depth": 2,
                            "author": "omnipotentmonkey",
                            "body": "They were close to relegation last season, they'd have been at least reasonably close this season if not for the worst set of promoted teams in PL history by points totals.\n\nwhile they initially had 10 points deducted, this was reduced to 8 points,  I mistakenly though it was 6 points, but ultimately neither one gets them that much further up the table.\n\nDyche deserves massive credit for the stability, but ultimately it's not a huge leap and not really warranting a manager of the season award.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lolzidop",
                                    "body": "We've gone from surviving on the final day to finishing 12th if it wasn't for points deductions, I'd say that's quite a large leap.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "omnipotentmonkey",
                                            "body": "It's a decent leap,  but the gap between 12th and the relegation zone isn't usually that large.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "No-Set-2576",
                    "body": "I’m an Everton fan and I don’t think he should get manager of the year, but at least hit it with correct facts. Without deductions, it’s 12 points better than last season. And without deductions, we’d be on equal points with Brighton and in 12th. Not much of a difference but facts matter.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "omnipotentmonkey",
                            "body": "thought your deduction was reduced to 6 points, not 8,  my mistake.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "DigitialWitness",
                    "body": "They would've ended up 12th. They have 40 now, they were deducted 8 points in total so that's 48 points, which leaves them in 12th on GD above Bournemouth.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "omnipotentmonkey",
                            "body": "Yeah, I've already addressed that in a reply, I mistakenly thought their deduction was reduced to 6 points rather than 8",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DigitialWitness",
                                    "body": "I actually saw it in a news article too on the Mirror so it's not just you!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "omnipotentmonkey",
                                            "body": "Well, looks like I can be a journalist for the Mirror!  the bar's somewhere around the marianas trench, but I'll take it.",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DigitialWitness",
                                                    "body": "Imagine where the bar for the Mail is...",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "omnipotentmonkey",
                                                            "body": "melting in the earth's core.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "DigitialWitness",
                                                                    "body": "What about GB News?",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "omnipotentmonkey",
                                                                            "body": "GB News is basically just the Mail with a \"find and replace\" run",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "throwawaysis000",
            "body": "I don't hate the take but I'd still give it Emery personally, definitely in the conversation for top 3.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "graveyeverton93",
            "body": "Even as a Blue I have to disagree! Nothing but respect for him because he led us through the tough times with the deductions and he guided us to safety comfortably and without the deductions we finish mid table, which before the start of the season all Blues would have bitten your hand off for given the previous 2 years... But it is also a fact that during this season we went on the longest run in our entire 146 year history without a League win. He's done a really good job given the circumstances, but Manager Of The Year? Not for me.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "NorskKiwi",
            "body": "Unai Emery was my manager of the season.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "slfc90",
            "body": "It should be Unai Emery or Sean Dyche for sure",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "No-Clue1153",
                    "body": "Emery is miles above Dyche imo.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Theodin_King",
            "body": "No he doesn't",
            "score": 5
        },
        {
            "depth": 0,
            "author": "rowejl222",
            "body": "Damn straight",
            "score": 3
        },
        {
            "depth": 0,
            "author": "PaulShannon89",
            "body": "Absolutely should have been a candidate. Best manager should take into account resources at their disposal.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "I_am_Reddit_Tom",
            "body": "Him or Unai Emery for me, agree",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BlueMoonCityzen",
            "body": "In the discussion but it’s emery for me",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Franchise1109",
            "body": "Him or Emery",
            "score": 2
        },
        {
            "depth": 0,
            "author": "tedium-incarnate",
            "body": "Absolutely no way. Are you even aware of any other clubs?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "1Falcon3",
            "body": "Iraola deserves it more than dyche....gets his team to play eye-pleasing football and hasn't spent much",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PakLivTO",
            "body": "Emery for sure followed closely by Pep.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "patelbadboy2006",
            "body": "As an Arsenal fan, I have to agree.\n\nApart from a few bad matches, he has done an outstanding job with the squad he has.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Discombobulationiser",
            "body": "As an Arsenal fan, it has to be Emery. If it weren't for that bastard, we'd have the title lmfao. Beat us twice and literally rolled over for city. ",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Toffeeman_1878",
                    "body": "Didn’t Villa take 3 points off Citeh?",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "Undeniable-Quitter",
                    "body": "Villa beat City at home and then had a lot of injuries for the away match.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "scrubLord24",
                    "body": "Villa literally beat city at home and then lost when they were playing barely any of their normal starters, nice try.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Discombobulationiser",
                            "body": "Man city didn't have Rodri for that game. Hence the loss. This is not 'nice try' at all. It's objective fact. You're free to go look at the line ups, their differences and the missing inform players at the time. This is literally not up for debate. ",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "scrubLord24",
                                    "body": "Ok mate, we are talking about City fielding a few of their substitutes... City one of the most expensive teams in the world.   \nUnlucky on the league mate, better luck next year. Maybe get more than 1 point against City next season, might work out a bit better for you then.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kyyes",
            "body": "🤣🤣🤣",
            "score": -1
        },
        {
            "depth": 0,
            "author": "True_Contribution_19",
            "body": "Staying up vs the three worst teams in Premier League history is hardly impressive. \n\nDecent season but they dropped off a lot in the middle and it’s not like they played good football.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "bielsasballholder",
            "body": "Lmao. The previous two managers at Everton were sacked for being in this position. Two flop strikers? Their previous managers had Maupay as backup and DCL injured. 😂 He’s had DCL fit all season.\n\nIt’s also been the easiest season to stay up in a long time. 27 points would have kept you up this season, which is laughably low. You usually look at 38 to ensure you stay up. \n\nThe British bias is insane. 😂 Thomas Frank has done a better job, Iraola has done a better job. Emery has done a better job. \n\nNot to mention the awful football he plays.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Toffeeman_1878",
                    "body": "Lewin wasn’t fit all season. He missed the start and then got an eye socket injury against Villa which kept him out until end of September (iirc). Let’s be honest, even when he is fully fit he’s not a Kane or Watkins. He’s probably a 12 goal a season striker. Think he finished on 8 at the end. \n\nDyche’s team won the same points as Iraola and De Zerbi, 9 more points than Frank and 2 more than O’Neil (who has done a great job at Wolves). \n\nAt least be accurate with the figures before you let your negative bias loose 😉",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bielsasballholder",
                            "body": "Most of the season then. He’s played in 32 games and started 26 of them. Much more than the previous two seasons.\n\nWell, under Ancelotti he was a top striker. Dyche only managed to get 5 open play goals out of him.\n\nWhich inaccurate figures did I give? He got 48 points. Do you really think that’s something to shout about? Bournemouth and Brighton also play really good football. Fulham play better football as well. Brentford do at times.\n\nAnd Everton are the biggest club of any of those. Everton are the biggest club in the bottom 12 by far. What are these standards? 😂\n\nI know you haven’t spent much money in the the last couple of years, but you have some good players. The best managers raise expectations, not lower them.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Toffeeman_1878",
                                    "body": "Ancelotti had better attacking options in James Ridriguez, Sigurdsson, Richarlison and Bernard. Also, had an attacking LB in Lucas Digne and a younger Coleman to push on. They helped Lewin to score the goals he did. Even then, he missed plenty of chances. 20 goals a season is punching above his weight. He’s a 12-15 goal man at most.\n\nDyche had none of those attacking options and also had to rely on 38 year old Ashley Young and a defensive LB (Mykolenko) - they are hardly going to cut teams open. However, he found a system that those players could play effectively.\n\nAs for inaccurate figures, it’s hard to claim someone is better if they finish alongside or, in Frank’s case, way below. The table rarely lies. As for “playing better” football, what is that? All those teams (including Emery’s Villa) shipped more goals than Everton. Is good defending not part of “better football”? Or do you only consider tippy tappy, pass for the sake of it with little end product as “better football”? Does the PL award points for artistic merit now?\n\nYou are right about one thing though. We do have some good players. Most of them are defensive minded though - explains the tight defensive record. We lack pace and creativity in midfield and upfront. As I mentioned those type of players were sold in order to try (unsuccessfully, as it panned out) to meet PSR rules and also because the owner wants out. As for standards and principles, you can afford to have those when you’re not on the brink of financial oblivion thanks to 30 years of low ambition and incompetent administrators. The main aim for the club is to try to survive long enough to get into the new stadium and hopefully secure new owners who can instil some form of modern, professional approach to running a football club. Unfortunately, that is the current reality, as sad as it sounds for a club of the size and history which Everton has. To suggest anything else is delusional.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bielsasballholder",
                                            "body": "Ancelotti had James because he signed him. He came (for free or on loan iirc) because of Ancelotti. Dyche signed Young. \n\nBetter managers tend to attract better players. And vice versa. \n\nBernard? Lol. Come on. He also had Michael Keane and Fabian Delph.\n\nFrank performed better because he has worse players and has spent hardly any money the last 3 years, since promotion. He lost Raya in the Summer and had Toney suspended most of the season— that’s the two most important positions in the team. Where would you be if you lost Pickford and DCL?\n\nAnd Frank shows more tactical variety and innovation. Good football is attacking football and, yes, “tippy tappy” football, ie passing and possession.\n\nFans reward artistic merit. That’s why big clubs and top clubs are rarely interested in the likes of Dyche or Moyes or Fat Sam. It’s why Bayern want Kompany and not Dyche.\n\nDyche signed players to suit the way he plays. Workmanlike. There’s nothing wrong with that. But let’s not pretend he didn’t have options. I’m a Leeds fan and basically our whole squad was available for loan in the Summer. Dyche chose to take Harrison, who was a good fit (although he’s played him out of position all season). But he could have gone for Sinisterra, who has a lot more ability.\n\nI don’t really buy the “you have to play rubbish football to get results” shtick. Also, playing good football tends to create better assets to sell, as it makes players look better and top clubs gravitate towards teams who play good football when scouting transfer targets. Look at Brighton. Look at how good Bielsa made Kalvin Phillips look, etc.\n\nAnyway, you’re lucky it was a very weak season at the bottom. Next year should be more fun. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Toffeeman_1878",
                                                    "body": "Some responses to your points.\n\n>Ancelotti had James because he signed him. He came (for free or on loan iirc) because of Ancelotti. Dyche signed Young. \n\nEverton had money to afford James's fee and wages. Since the Ukraine war, they are skint (I'll leave it to others to speculate on the link between the two events). Last summer's transfer dealings relied on loans, frees and \"zero down pay the rest on the never never\". Lack of money affects who you can sign, especially in the premier league.\n\n>Frank performed better because he has worse players \n\nMost Evertonians would happily swap Mbeumo, Wissa and Toney for Doucoure, Lewin and McNeil. Brentford have other decent professionals in Cristian Norgaard and Rico Henry too. Granted their central defence and keeper aren't up to much but you make them out to be at Luton's level. That squad finished 9th last season.\n\n>And Frank shows more tactical variety and innovation. Good football is attacking football and, yes, “tippy tappy” football, ie passing and possession.\n\nDyche cut his cloth according to the squad's strength this year. That was basically stay in shape, let the other team have the ball, wait for them to make a mistake and try to profit from it. I would be disappointed if he played that way with the Man City squad but unfortunately Jimmy Garner is not Rodri, Doucoure is not Foden and McNeil is not Silva.\n\n>Dyche signed players to suit the way he plays. Workmanlike. There’s nothing wrong with that. But let’s not pretend he didn’t have options. \n\nAny options he may have had were extremely limited by the fact, and I am not sure if I mentioned this already, THE CLUB IS SKINT.\n\n>I don’t really buy the “you have to play rubbish football to get results” shtick.\n\nReal Madrid played what you call \"rubbish football\" to beat Man City and get to the CL final. They put 10 behind the ball, gave possession to City and said \"do something\". City couldn't, Madrid are in the final and I guarantee not one of their fans gives two shiny shites.\n\n>Also, playing good football tends to create better assets to sell...\n\nThe sad reality is that Branthwaite is likely to be sold. Happily, he is likely to fetch a big fee. The same would go for the likes of Pickford and Onana. By your logic, Dyche has contributed to growing the value of these assets.\n\n>Anyway, you’re lucky it was a very weak season at the bottom. Next year should be more fun.\n\nDon't you mean that Forest were lucky it was a very weak season? After all, they finished below Everton as did your dad, Frank, and can be thankful that the bottom three were so weak. Anyway, it's going to be another challenging close season because of the ownership situation. Not predicting anything next season until we see what the squad is likely to look like.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "bielsasballholder",
                                                            "body": "According to capology, Everton have double the wage bill of Brentford, and the highest wage bill after the top 7 and West Ham. Which correlates with the size of the club.\n\nYou wouldn’t swap DCL for Toney this season, because Toney has been suspended most of the season. And Frank developed all these players, he’s been at Brentford years and got them promoted, which means he gets credit for, well, everything.\n\nDyche has played the same way he always plays. Why do you think West Ham fans are sick of Moyes, and he flopped at Man U? Why do you think Hodgson flopped at Liverpool and for England? Why do you think Allardyce flopped at Newcastle and West Ham got sick of him?\n\nComparing Dyche Ball to Ancelotti is a bit extreme. 😂 ",
                                                            "score": 0
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "harrisonmcc__",
                    "body": "How’s Thomas Frank done a better job if he’s under Dyche in the table even with the point dedications? Obviously he’s got you on strings mate.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "bielsasballholder",
                            "body": "Because he’s spent no money and has a worse squad. He sold his GK in the Summer and has had his star striker suspended most of the season. ",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "harrisonmcc__",
                                    "body": "Dyche has Ashley Young. Case closed.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "bielsasballholder",
                                            "body": "Didn’t Dyche choose to sign Ashley Young? ",
                                            "score": 3,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "harrisonmcc__",
                                                    "body": "Self inflicted handicap. Wanted to test himself.",
                                                    "score": 3
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "L0laccio",
            "body": "We all agree it should be Arteta \n\n*hides from the mob*",
            "score": -4,
            "replies": [
                {
                    "depth": 1,
                    "author": "14JRJ",
                    "body": "Arsenal were brilliant this year, debate aside. Enjoyable to watch, more resilient. Just came up short against one of the best club sides England has seen",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NorskKiwi",
                            "body": "Exactly man. Was really fun watching their games this year.",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "L0laccio",
                            "body": "Cheers bro 👊. Villa likewise, excellent",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "NorskKiwi",
                                    "body": "We both had a season we can be proud of. Hopefully next year we can both take 6 points off City,",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "L0laccio",
                                            "body": "Amen to that!",
                                            "score": 2
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "jlangue",
            "body": "Guardiola won because deserves it. He works harder, prepares better and motivates his players better when they need a kick up the back side.",
            "score": -8,
            "replies": [
                {
                    "depth": 1,
                    "author": "monkeyofthefunk",
                    "body": "He does cheat better than most too.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jlangue",
                            "body": "You’d better run along. Old Trafford is falling down.",
                            "score": -8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "monkeyofthefunk",
                                    "body": "It is but at least we won’t launder some cash to repair it.",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jlangue",
                                            "body": "😂 Chemical Jim begging the government for money for a new stadium. 😂",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "monkeyofthefunk",
                                                    "body": "Unlike Sheikh ‘n Vac laundering money from his government through family members to invest in a club with no history. Like turning a prostitute into a model using plastic surgery. Still lacks class.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "jlangue",
                                                            "body": "😂 You calling anyone plastic is pure comedy. Do you watch the EPL on TNT or NBC? 😂",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "monkeyofthefunk",
                                                                    "body": "I’m from Manchester mate. Born 15 minutes away from OT, Park Hospital (now Trafford General) So you got another wrong buddy. Nice try though. Watched United home & away since the mid 70s.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "jlangue",
                                                                            "body": "Of course. 15 mins from the ground. So not from Manchester. Perfect. Beware of falling waters! 😂",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "monkeyofthefunk",
                                                                                    "body": "What are you on about? Flixton, Urmston, Manchester. That’s the address pal. You might want to go back to school and take geography next time. \n\nGive up mate, please.",
                                                                                    "score": 2,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "jlangue",
                                                                                            "body": "Old Trafford is in Stretford. Not the City of Manchester. Everyone knows that.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "jlangue",
                                                                                                    "body": "Urmston is a town in Trafford.",
                                                                                                    "score": 1
                                                                                                },
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "monkeyofthefunk",
                                                                                                    "body": "Stretford isn’t a city mate. Manchester is, Stretford is a suburb of Manchester, same distance as the Emptyhad is from town.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "jlangue",
                                                                                                            "body": "Stretford is not in the City of Manchester! That’s why the City of Manchester helped City with the stadium and the reason the good sheikh invested in a club with a solid foundation. Old Trafford is not connected to the City of Manchester or in the city limits.",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "monkeyofthefunk",
                                                                                                                    "body": "It’s closer to Manchester than your ground mate. Check its address. Sir Matt Busby Way, Stretford, Manchester, M16 0RA.\n\nDoesn’t matter what spin you put on it, it’s in Manchester.",
                                                                                                                    "score": 1,
                                                                                                                    "replies": [
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "jlangue",
                                                                                                                            "body": "Are you for realz? The stadium is officially the City of Manchester Stadium and owned by the City Of Manchester. You can’t be this dim. Or maybe just another wannabe imposter.",
                                                                                                                            "score": 1
                                                                                                                        },
                                                                                                                        {
                                                                                                                            "depth": 14,
                                                                                                                            "author": "jlangue",
                                                                                                                            "body": "Stretford is NOT in the City of Manchester. A basic facts and these parts.",
                                                                                                                            "score": 1
                                                                                                                        }
                                                                                                                    ]
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "PanzarenBanteeb",
                                                    "body": "Well done for reading half a story and not understanding it",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TheRR135",
                    "body": "You're right. He works really hard to cheat.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "NotAnotherAllNighter",
            "body": "As much as a rate Sean Dyche, surely it’s got to be Pep who’s won a record 4 titles in a row.",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "ShockingJob27",
                    "body": "Okay first of all its manager of the season, the fact its number 4 doesn't matter.\n\nSecond its unai or arteta for me.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SuspiciousSystem1888",
                            "body": "What in the world has Arteta done to deserve it? \n\nTaking second means absolutely nothing. Sure he competed with City, but City won so Pep wins over him there. \n\nArsenal go another season without a trophy as well so as well as Arsenal did, Arteta shouldn’t win. \n\nEmery is a good shout and probably deserving, but City winning and probably winning the FA Cup means Peo should be the guy. ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ShockingJob27",
                                    "body": "You understand it isn't done for winning right?\n\nWhat do you mean what has he done to deserve it? Have you seen arsenal's form since the turn of the year?\n\nThe fact he's taken arguably one of the greatest teams the prems ever seen to the final day? The fact he's genuinely been a good manager? \n\nTo say what the fuck has he done to deserve it to say second means nothing, to then pep should win it for winning the league?\n\nLaughable at best, I'd be interested in who you think should win it (it won't be pep)",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SuspiciousSystem1888",
                                            "body": "If you are comparing Pep to Arteta, Pep is the clear winner. \n\nWhile Arteta has turned things around he was still beaten by City. What I meant by nothing is that no one cares who comes in second in the league. \n\nAnd if it’s not done on winning, what are you even basing it on? Losses and draws? \n\nYou would select a winning team that wins games, not just for tactics…\n\nI already said, Emery is in a good shout. He’s done more with less investment than Arsenal and City. \n\nArsenal spent heavy, so you’d expect them to compete for the league. Again, I’m not saying Arteta did bad by no means, just falls short. \n\nBut if Pep wins the FA Cup, he’s literally done the double and has secured 90+ points in a season. Hard to argue against that. ",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ShockingJob27",
                                                    "body": "If it was done on winning then the manager of winning team would win it every year..",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "L0laccio",
                                    "body": "Nah he’s unbiased. He’s United. Man speaks sense. It’s Arteta ❤️",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SovannRoussard",
            "body": "Did he win the Premier League?",
            "score": -8,
            "replies": [
                {
                    "depth": 1,
                    "author": "by-election",
                    "body": "It is absurd to think that the one who won the league should be the best.\n\nJob is easy when you have unlimited oil money and owners who failed to disclose financial info to the league (half of the 115 charges)",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Toffeeman_1878",
                    "body": "If you need to ask who won this season's PL why are you on the PL subreddit?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SovannRoussard",
                            "body": "🤡🤡🤡🤡🤡^^^^^^^/s",
                            "score": -6
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "strykerlmao03",
            "body": "Emery or poch should have won it imo\nPoch had the most improved side and if he had stay he would cook while villa made it to the champions league which is a huge achievement for that club",
            "score": -3
        },
        {
            "depth": 0,
            "author": "RandomBloke93",
            "body": "Mmm id probably say the manager that just navigated his side to a 4th title in a row, something no other manager in 134 years of English football history has managed to achieve. Sorry Sean.",
            "score": -12,
            "replies": [
                {
                    "depth": 1,
                    "author": "MatticusGisicus",
                    "body": "Isn’t hard when you have literally unlimited resources and a laundry list of alleged violations",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "RandomBloke93",
                            "body": "United, Chelsea, Arsenal and Liverpool have all spent 100s of millions and have barely had a sniff. So that disproves your first point. \n\nRe the alleged violations, I already know you can’t name a single one never mind actually understand it so I won’t waste my time 😂",
                            "score": -5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "[deleted]",
                                    "body": "[removed]",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jlangue",
                                            "body": "You mean ‘English sport’, if you’re English…and you’re not.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "jlangue",
                    "body": "Exactly.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "ElectronicPlant2336",
            "body": "City win a historic 4 peat and have unproven FFP charges hanging over them.  Plenty call for their titles to be stripped!? Dyche has won nothing and finished 15th with a club that admitted to breaching FFP and should be manager of the season?",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Drigg_08",
                    "body": "You can only judge the football played on the pitch lad. That's the manager's job",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ElectronicPlant2336",
                            "body": "I am. By that measure it's 91 PTS compared to avoiding relegation.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "throwawaysis000",
                                    "body": "Even if City turn out not to be financially doped up to the eyeballs they still have a ludicrous budget even compared to their closest competitors. Comparing City and Everton is comparing apples and dust.",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ElectronicPlant2336",
                                            "body": "Indeed, as only one of them is spunking £750 million into a new stadium...",
                                            "score": -1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "setokaiba22",
            "body": "Nah he’s not been consistent across the season at all and there were some very poor performances around the bottom. Emery was far more shocking in expectation - Dyche was hired to do this job on the expectation he would in honesty",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BrewtalDoom",
                    "body": "Consistency is looking back at the season as a whole. Even if you split the season into two-halves, we finish comfortably mid-table in each. When that is pretty-much your highest goal, that's consistency.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Such-Sympathy-5816",
            "body": "While he was not directly involved in the cheating, he survived relegation using players obtained during the cheating.",
            "score": -10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Worldly_Science239",
                    "body": "Yes, because that 19.5 million and 16.5 million would buy you the superstars required to get you to 12th, so having spent that 32million, why would you need to spend any more.\n\nI'd suggest that maybe  if spent wisely that might have got you a few extra points, all of which got removed by the punishment \n\nBtw, I'm a liverpool supporter, so have no vested interest in everton surviving, but for you to pretend that It WaS tHe OvErSpEnD wHaT sAvEd ThEm is bollocks",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Such-Sympathy-5816",
                            "body": "Maybe I am biased because I hate Everton and root for whoever they play, but I actually like Dyche, just don't think he is Manager of the Year.  It is probably Emery.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Worldly_Science239",
                                    "body": "Oh, i agree with that, there's no way he should be manager of the year, and agree that emery should definitely be in the running, but i just disagreed with the point about everton's survival.  They were found out, they were punished, any benefit from their overspend is small potatoes in the grand scheme of things",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "haziola",
            "body": "Nope. Pep deserves it which is why he won it. Salty rival fans just want anyone other than Pep to win it because he has traumatised you all. So you never want to hear his name or see his beautiful bald head because it brings back the bad memories.",
            "score": -12
        }
    ]
}