{
    "title": "Man Utd and Bayern on high alert as Pochettino leaves Chelsea",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "codefoudre",
            "body": "Man Utd hasn’t been on high alert since Ferguson",
            "score": 32
        },
        {
            "depth": 0,
            "author": "PickaxeJunky",
            "body": "Sorry Poch, big clubs are only interested in championship managers at the moment. \n\n\nAnd Wayne Rooney is available. ",
            "score": 32
        },
        {
            "depth": 0,
            "author": "ProfessorBeer",
            "body": "If a high-profile manager is fired, and isn’t linked to Man Utd within 48 hours, has he really been fired?",
            "score": 28
        },
        {
            "depth": 0,
            "author": "ReddittIsDead",
            "body": "Man United, alert high, table low.",
            "score": 21
        },
        {
            "depth": 0,
            "author": "L0laccio",
            "body": "What do you reckon they do when they’re on high alert?",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "allnimblybimbIy",
                    "body": "Ride segways around the office throwing filing folders into the air.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "SnooPies3316",
                    "body": "This just means there’s an extra 3% surcharge added to the Glazers management fees under the LBO financing terms.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "zanziTHEhero",
                    "body": "Do an extra line of coke...",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mba1956",
            "body": "Poch going from Chelsea to Man Utd would be jumping out of the frying pan into the fire.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "j0emang0e",
            "body": "If Poch couldn't manage the primadonnas at PSG he stands no chance for the divas at Man U",
            "score": 36,
            "replies": [
                {
                    "depth": 1,
                    "author": "Nole_Based",
                    "body": "As much as United fans probably don’t want to hear this but Bruno and Rashford would and should be the first 2 to go",
                    "score": -4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WeeTheDuck",
                            "body": "Bruno goes and they're kinda fucked",
                            "score": 17,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tjag96",
                                    "body": "Even better",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "WeeTheDuck",
                                            "body": "true, but from their perspective it won't be a good transfer lol",
                                            "score": 5,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "tjag96",
                                                    "body": "Tbh I don’t think they suffer that much. He is one dimensional player. Very good at shooting and long pass but that limits the game, even tho he’s good at that. And his attitude is annoying. Wouldn’t be surprised if some players disagree about him being the captain",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "slowsundaycoffeeclub",
                                                            "body": "We’ve had big drop offs when he’s not the starting lineup. Say what you want about his attitude when we are losing, but there are many times when he is the glue that holds any assemblance of cohesive playing style together.",
                                                            "score": 3,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "tjag96",
                                                                    "body": "That’s also true I agree. And he can pull a chance out of nothing with one pass. But he’s also the type of player you have to change the whole playstyle to accommodate him. That was my point",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Nole_Based",
                                                                    "body": "You’ve built a team to surround the equivalent of Son….  And you wonder why the squad struggles and can’t win anything",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "slowsundaycoffeeclub",
                                                                            "body": "You won’t get an argument from me around the feelings of our recruitment “strategy.”",
                                                                            "score": 2
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Nole_Based",
                                    "body": "Bruno is practically forcing them into a 4231..  it sounds ridiculous but they need to sell Bruno, and Rashford, use the money and buy some obscured players to set a base and foundation.",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BidWeary4900",
                                            "body": "Yes that is actually ridiculous, he is the clearly the best player at the club, selling him would just create the problem of having to replace him.",
                                            "score": 7
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "fusterclux",
                            "body": "one of those is not like the other",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nole_Based",
                                    "body": "Bruno is the equivalent of Son.. will put up some good stats but isn’t the guy you should build around. He’s a Bernardo Silva….",
                                    "score": -6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "fusterclux",
                                            "body": "you just listed two amazing players lmao",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Nole_Based",
                                                    "body": "Two amazing players that you shouldn’t be building a team around if your goal is to win the league…. They should just be another piece.  United have built around Bruno, therefore they struggle when he doesn’t play but not good enough to win anything. He  should be the equivalent of a Bernardo Silva on your squad.\n\nSell him, and Rashford, and Antony.. ETH is a bald fraud and play the kids and buy a few guys at CB….  Even if United had a striker this season, they are 10 guys from winning a title.  By the time United get to a point to complete, Bruno will be 33….",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "BroldenMass",
                            "body": "Rashford, yes probably time to get rid.\n\nBruno, fuck no. He can be petulant and whinge and shouldn’t be our captain but he’s legitimately a great footballer and our best player. \n\nYou could see the difference when he came back from injury for our last few games. The difference was night and day.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nole_Based",
                                    "body": "1.  You have a bunch of players who you deem are “it” but he wouldn’t start at arsenal and your goals are winning the league.  Again, he’s Bernardo Silva or Son level .  Looks immense at Tottenham, great at City but he’s not a KDB, or Odegaard, he wouldn’t start over Rice and Foden.  \n\n2. Also, probably your last year to sell him for any type of money\n\n3. To reiterate 3,  United need a 60+ million signing everywhere",
                                    "score": -5,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "iqbalides",
                                            "body": "He's way better than Odegaard",
                                            "score": -2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Godzooqi",
                                                    "body": "Hahahahaha... Nope.",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "rocklee_shinobi",
                                                    "body": "Odegaard has probably been the best midfielder in the PL since the start of 2024 though, you’d know if you watched Arsenal games",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "iqbalides",
                                                            "body": "Literally only Arsenal fans think that.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "rocklee_shinobi",
                                                                    "body": "He’s on most TOTS lists though so obviously it’s not just us lol",
                                                                    "score": 1
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Nole_Based",
                                                                    "body": "City fans wanted him to be the heir to kdb….  He’s been only worst then KDB on the creative side of the CM in the PL….",
                                                                    "score": 0,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "iqbalides",
                                                                            "body": "Well KDB himself put Odegaard below Bruno. Besides its not like city fans are intelligent.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Nole_Based",
                                                                                    "body": "Paying respect to a guy who puts up great numbers…. You also don’t know how much trolling is happening with players.",
                                                                                    "score": 0
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "cruisingqueen",
                            "body": "Such a poor take on Bruno - how much do you reckon United could get for a 29yr midfielder given their track history and the fact other teams will know United are in a sellers market.\n\nNow tell me if the value to United exceeds that number.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Nole_Based",
                                    "body": "Oh, United fans would want something like 60/70m when the figure is probably closer to 40m maybe 50m if PSG got involved.  \n\nAgain, everyone is thinking terms of how poor United looks without Bruno and the stats he puts up but don’t understand that the team is built around him so of course the team looks like ass when he’s out of the lineup",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "cruisingqueen",
                                            "body": "Those fees would be a capital loss on the books before taking into account that Sporting will take a further 10% of the transfer fee if sold. Selling him would **demand** a replacement as unfortunately Mount hasn’t proven himself to be reliable at all this season. \n\nI very much doubt United could find anyone to replace his quality at the money they’d make from selling him, especially when the classic Manchester United tax gets added on too.\n\nToo many other positions to prioritise before even looking in Bruno’s direction.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Nole_Based",
                                                    "body": "1. You’re taking a loss on him regardless.  He was €80m…. \n\n2. This is about getting to a point to being competitive… is it better to be mediocre and keep a player who you will sell for less then his worth but can’t get you anywhere you want to get to or to reset and begin building a better squad not built around a guy who isn’t good enough to be the guy…. Again, he’s not a guy to build around but should just be a puzzle piece.  Note Declan Rice, the guy at West Ham, goes to Arsenal and he’s just another good puzzle piece.\n\nif you’ve built around a guy who can’t get you there, then move on from him.  Sell for 40m and buy a 40m midfielder….   He also limits what formations you can play. Basically placing him in a 4231….",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "cruisingqueen",
                                                            "body": "No it’s about being pragmatic - United finished 8th this season and you’re talking about being competitive for the premier league in a single transfer window? Come on. \n\nThere are at least 4 other positions that require prioritising before Bruno. This idea that you keep repeating about building a team around 1 guy won’t work when there’s equally no quality around him.\n\nAgain, I put it to you to recommend who you would have as Bruno’s replacement that would match his quality with the funds generated from his sale - from your own predicted sale of 36 million.\n\nI respect your opinion but in all honesty I take it with a pinch of salt in comparison to the United fans that watch him play week in week out.\n\nEdit - I’ve just seen your bottom statement about being locked into a 4231 with Bruno. This is completely false. Even in the last game of the season we played 4222 which was utilised with solksjaer. He has played 433 for both United and Portugal. He has probably played the most positions for United out of all current squad players. To suggest Bruno isn’t versatile is simply not true.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Nole_Based",
                                                                    "body": "4222 because United isn’t progressing but going backwards…. It’s not that complicated that he was doing a shift in positions/play style while dropping a ton of points down the stretch that allowed Newcastle and Chelsea to pass into Europe.  He was shaking the tree to find a result.  It’s simple, with all the years Bruno has been at United, they’ve never been close to winning the league.  4222 because you’re not scoring goals and not getting any production from the wide players.  Antony has less goals the Pepe’s first season at Arsenal, this after 2 with United.  Where’s Pepe now… turkey last I checked\n\nThe fact there people who literally feel this highly about a guy who is not going to be a legend shows partly why United are where they are.  Sell him now, by some younger players to build a base.\n\nSell him 40m and buy 2 guys that will 50m total.\n\nIt’s not like United need 1 guy… they need starters at RW, LW, ST, CM, RB, RCB at a minimum.  I question whether Shaw is good enough, and Martinez…. This is also stating you’re playing Mainoo as a future 6 and could role with Garnacho at a wing but this team needs a massive overhaul and rebuild",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "cruisingqueen",
                                                                            "body": "And yet once again you skirt around the question of who could feasibly replace him at 36 million.\n\nYou are living in a fantasy land.\n\nTo be honest at this point you’re beginning to sound identical to Souness re Pogba, blaming all of United’s woes on one man.\n\nI am not sure there’s any point continuing this discussion really. The general consensus amongst us match going fans is that Bruno is paramount to the team. Your contrarian opinion is not only controversial even by rival standards, but is of no importance to the team. If we keep Bruno and we remain shit, then it’s a win for you no?\n\nEdit - I’ve just seen your edit now where you admit the issue with United has been the flanks and the requirement to replace multiple roles. Can you not see the juxtaposition in comparison of your original stance that Bruno is the problem? It feels like you’re agreeing with me in everything except your conclusion…\n\nAm not bothering to reply anymore - it’s clear you haven’t got a clue in the process of rebuilding a team. Getting rid of our only avenue of attack 🥴 alarm bells should be ringing when people linked with United who have forgotten more about football than you will ever know say the exact opposite of your opinion.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Nole_Based",
                                                                                    "body": "No I answered your question, sorry that I need to explain why you’re not trying to replace him with a 36m player, it’s because the 10 is dead and unless you have 2 hybrid 8s in a midfield 3, you’re going to get overwhelmed.  You could be able to get it to work, if you had a double DM where their job is more to clean up second balls outside the box and win possession back immediately. That again limits you mostly to counter attacking and reduces your creativity centrally.   But you’re not trying to find a 10…. 10s are mostly done on the league.  You can do it in a 3421 but not in any type of 3 man midfield.  And the reason you can’t is because you get overwhelmed in the midfield\n\nI would look at Lucas Paqueta, Reider, Fabbian, Rohl… these are guys I would look to add balance to the midfield and not rely on one guy who clearly can’t do it.  You can say it’s a downgrade from Bruno, and they currently are but the point isn’t about keeping Bruno….  In 4 years, if United buy 1 of every position and nail it correctly, in 4 years bruno is 33 and at best a role player. Who’s been phased out as a primary 10 to a CM on Wed to play brentford.  Sure that could work, it’s better to cut and run and rebuild.  Same goes with Rashford.\n\nYou clearly don’t understand.  Say 10 is winning the league. You can have Bruno who is a 9 but because of the his limitations and tactics it forces you to have a bunch of 6/7s around him playing through him.  This isn’t Ted Lasso….  Multi role players are needed.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Aiko8283",
                            "body": "Rashford maybe. But keep brunos name out your fucking mouth. That man puts in more effort into games than the rest of the squad fucking combined. Without him we are relegation threatened ffs. We create nothing. The bruno disrespect needs to stop. Any fan would fucking adore the man if he played for their team. Such a shame we have been shit during his time with us.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "collapsedrat",
                                    "body": "He’s also the only one we could actually sell for a profit that isn’t under 25",
                                    "score": 4
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "SpareBetter2088",
                            "body": "Thank you. Agree with this. Need a fresh start!",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "GravyBoatWarrior",
                            "body": "Yes, let's sell one of the best players in the world. \n\nHint. It's not Rashford.",
                            "score": -4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dkclimber",
                                    "body": "I isn't Bruno either lol.",
                                    "score": 8
                                },
                                {
                                    "depth": 3,
                                    "author": "Clean-_-Freak",
                                    "body": "Lol best in the world? Can I have some of what you are smoking please?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "GravyBoatWarrior",
                                            "body": "\"One of the best in the world\". \n\nReading comprehension is not your strongest asset, I take it.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Clean-_-Freak",
                                                    "body": "Football knowledge is clearly not your strongest asset",
                                                    "score": -1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Clean-_-Freak",
                                                    "body": "Still technically the best in the world, just one of them. Muppet.",
                                                    "score": -3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "GravyBoatWarrior",
                                                            "body": "Why are you so angry? 80% of your posts are just angry nonsense.",
                                                            "score": 4,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Clean-_-Freak",
                                                                    "body": "I dont post on here",
                                                                    "score": -2
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Clean-_-Freak",
                                                                    "body": "I do call out BS comments though",
                                                                    "score": -4
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Nole_Based",
                                    "body": "Close to max value you’ll be able to sell and you’re a dozen players from competing for the league so not in hire lifetime at United…",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BaconOnTap",
            "body": "Poch will be joining Harry Kane and Eric Dier at Bayern. I'm 90% sure Kane will make it happen. They will then go on to finally win their trophies. It'll be one of the better storylines next season.",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "BabyHercules",
                    "body": "Subscribe",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "a445d786",
                    "body": "I thought Dier was a loan? Poch at Bayern makes some sense but what about De Zerbi?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Jevchenko",
                            "body": "Dier loan became permanent a while ago. Was based on appearances.\n\nBayern also already said that De Zerbi is not on their list. They actually said that their next manager won’t be Italian.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "a445d786",
                                    "body": "With the way theyve been going with the media, that means De Zerbi is defo the next manager",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "reporttimies",
                    "body": "HAAHAHAH",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dogzylla",
                            "body": "I mean let's not lie here, I think Leverkusen will compete for the title next season too but I don't think they're gonna go from \"the biggest bottlers the universe has ever seen\" to \"the next Bayern\" just like that",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "judge_death_ire",
            "body": "United have a manager",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "roosterman22",
                    "body": "Meh, sorta.  ;)",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Indiana-Cook",
            "body": "CLOSE THE CURTAINS JIM!!",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Alone_Shoulder8820",
            "body": "Mutual consent might mean he had a better offer and who wants to manage a squad of 50",
            "score": 9
        },
        {
            "depth": 0,
            "author": "PJBuzz",
            "body": "**BATTLE STATIONS EVERYONE, POTCH IS ON THE LOOSE**",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "PenisManNumberOne",
                    "body": "And he’s hungry!",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PJBuzz",
                            "body": "**OH GOD, WE ARE OUT OF SNICKERS.... THIS IS NOT A DRILL**",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Golden-Event-Horizon",
            "body": "This might be the first summer ever where the manager signings are more interesting/highly anticipated than the player signings are",
            "score": 8
        },
        {
            "depth": 0,
            "author": "robpottedplant",
            "body": "I cannot understand why they sacked him in a season where so many big clubs lost (or should lose) their managers.  \n\nI know it’s ‘mutual’ but I think we all know",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "fusterclux",
                    "body": "i don’t think “we all know”… it actually sounds like it could’ve either been poch’s idea, or poch had some demands that weren’t met",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fonzey200",
            "body": "Wins five in a row Chelsea on the turn and they sack him unless they bring back tuchel back this is a bad decision",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "collapsedrat",
                    "body": "Went 15 straight Prem matches without a loss, if I’m remembering correctly",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jltho",
                            "body": "Close. He lost 1 of the last 15. We lost 5-0 to Arsenal. 😩",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BadassBokoblinPsycho",
            "body": "Do it Ratcliffe",
            "score": 11
        },
        {
            "depth": 0,
            "author": "opinionated-dick",
            "body": "On high alert? The use of language regarding football rumours is almost as bad and cliched as estate agent’s house for sale summaries. \n\nCan imagine a plane flying overhead with Potch’s face looping above their stadiums, while Man Utd and Bayern execs scramble to train fog lights on him, ready for his potential incursion.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "skywalkerInTheRye",
            "body": "Man the comments here. I am a Spurs fan and our best run in recent history was under Poch. I watched a fair bit of Chelsea this season too. He is so massively often disrespected, ironically, a bit like Harry Kane. \n\nUnder Poch, your team doesn't sit back, it goes toe to toe with the best and competes. Be it City, be it Real Madrid or Barcelona. He is not obsessed with possession but still plays attacking football. Creates so many chances. Under him Spurs had one of the best defenses in the league and he built and grew that young team from the ground up. \n\nAnyone who has watched Chelsea knows they competed with the likes of City, Liverpool, beat Spurs and general play was good. He didn't have a striker and so many injuries. Two cup runs and 3 points of Spurs (who got massive accolades). \n\nPersonally I am happy that things ended with Chelsea for him. But I always believe he deserves to be top. A Bayern job would be great for him. A knack of improving players, getting the best out of them, reaching finals, going extremely close (yes, falling at the last hurdle but watch those who follow not even get close).",
            "score": 23,
            "replies": [
                {
                    "depth": 1,
                    "author": "Calergero",
                    "body": "His agent needs firing because his choice of jobs is what's really poor.\n\nHe started as a proper project manager at teams where he could realistically be given time, Espanyol, Southampton then Spurs.  Since then he's been working as a mercenary and if he goes to Bayern the same thing will happen. It makes him look disposable and the fact he hasn't won anything of note adds to that feeling.\n\nHe needs to take the Ajax job or something like that, maybe even Brighton would be good. Rebuild his reputation at a club that will invest in him over some owners ego.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "DanStFella",
                    "body": "Have to disagree with your “sit back” comment. There were times when he was so scared of conceding, he subbed all defensive players on for attacking players/sat ultra deep. Sure games often weren’t started like this, but it was particularly frustrating in the final vs Liverpool where it wasn’t necessary.\n\nYou’re right though, we played best against teams like City/Liverpool to some extent, we scored a ton of goals as well. However we also leaked a LOT of goals, often in a similar fashion, which showed a certain weakness in his coaching.\n\nWe were very much Chaos FC in almost every game which is very entertaining but not very consistent. \n\nInterested to see how he does wherever he goes though, if the same issues are there or if they somehow vanish.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "New_Discipline_1069",
            "body": "It says a lot when Bayern Munchen rather turns to Kompany than Poch.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "PatRice4Evra",
                    "body": "Not really, Bayern are badly managed at the moment.",
                    "score": 19
                }
            ]
        },
        {
            "depth": 0,
            "author": "intheshad0wz",
            "body": "Please don't do it UTD...",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Quinnerz",
                    "body": "It would be so funny though",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Amazing-Plantain-885",
                    "body": "ETH is going to be sacked",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wide_Astronaut_366",
            "body": "Wouldn’t be shocked to see Poch and Ten Hag swap clubs you know?",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "fusterclux",
                    "body": "no no no",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "Fonzey200",
            "body": "Won 5 in a row and then they sack him mad",
            "score": 10
        },
        {
            "depth": 0,
            "author": "SpryClearing",
            "body": "🚨 HIGH ALERT 🚨",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "L0laccio",
                    "body": "Two stages up from monitoring the situation",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "AtahualpaSan",
            "body": "Man United chose EtH over Poch 2 years ago. Doubt they’ll go back to him. I think EtH stays",
            "score": 3
        },
        {
            "depth": 0,
            "author": "findingnewrooms",
            "body": "Code red!",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Megleeker",
            "body": "Are they aye?",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "cruisingqueen",
                    "body": "Is it already that time already where United are linked to anybody and everybody?\n\nSuppose it gives those on here something to talk about .",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "soccer_footballmania",
            "body": "The two most likely destinations for Poch right now",
            "score": 3
        },
        {
            "depth": 0,
            "author": "John-1993W",
            "body": "Ten Hag stays for now.\n\nGet rid of the junk, give him a proper structure to work with.\n\nIf he still doesn’t improve, then get rid.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jurski17",
                    "body": "I want ten hag to stay forever.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Balbuto",
                            "body": "I thought his name was SevenHag",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Jurski17",
                                    "body": "Oh my bad",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "InPatRileyWeTrust",
                    "body": "I agree Ten Hag in. A new 10 year deal is in order, I reckon.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "JADWoodworking",
                    "body": "This club needs stability in multiple places from the ground up, so we either commit to this guy and his style of play or we move on. Regardless of either option the manager needs support and time while the club rights itself. This is a multi year project (3-5). \n\nI’m tied of instant gratification, we fell as a club, got complacent in our glory, and really did not have a plan when SAF retired. He was the bandaid covering the rotting flesh.\n\nI’m not saying we can’t compete, but our expectations of multiple cup glory needs to be checked at the gate for a few years and focus on squad building. Youth and third string players for everything but Champions league and FA cup. First team should only focus on top 4 finish. \n\nWe’ll see.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PenisManNumberOne",
                            "body": "Definitely commit to this guy, we would love it if you did. We’d love it!",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "joeturner25",
                    "body": "It’s not him who has to improve!",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "jevaisparlerfr",
                    "body": "Another TenHag stan . Club before stars and Man U might start to be relevant again",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "John-1993W",
                            "body": "Blah blah blah. \n\nWhat can any manager do given the situation?\n\nThe club doesn’t even have a proper scouting department.\n\nThe club can’t even control rain water in a stadium that is a direct front to the world. If the club has no shame in letting the literal face of the club fall down in front of the fans, the media and rest of the world, I can only imagine the shite happening behind the scenes.\n\nWhat the fuck is a stan anyway.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ContraVista",
                                    "body": "The term originated from the words \"stalker\" and \"fan\" and became popular in 2000 after an Eminem song of the same name. The song is about a dangerous super-fan of the rapper",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "John-1993W",
                                            "body": "So what you’re saying the person who replied to me is a child and has nothing constructive to argue? I get you. \n\nHe wouldn’t have the developed brain to understand the mountains of problems at the club.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "wylthorne92",
                                                    "body": "I mean everyone wants United to stay in the state they are in and it sounds like you do too so win win",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "PenisManNumberOne",
                                                    "body": "Lmfao “to be fair you must have a high iq to reply” I’m a grown man and can read it just fine. This is just you saving face bc you got smoked",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Different-Thanks-431",
            "body": "One thing I'm sure is he will definitely get a job.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Klewdo1",
            "body": "Haven't we come to the point where we can agree that the highlight of Poch's career was making Tottenham slightly less shit than they were for a while. Has he done enough to warrant Bayern Munich?\n\nI mean, united, I get that!",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "Impressive-Ice873",
                    "body": "Munich are also looking at Kompany. I would disagree about the Tottenham comment - they regularly got into the top 4 and got to a CL final. If it wasn’t for a moment of madness and a stupid handball they may have won it. Chelsea were looking dangerous towards the end of this season.",
                    "score": 12
                }
            ]
        },
        {
            "depth": 0,
            "author": "iamhome320",
            "body": "Money will talk. It will be interesting.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Onepackfatness",
            "body": "Are they really that much different in their styles? Both aren’t aggressive in their approach",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Thefdt",
            "body": "Kind of wish Liverpool waited it out",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Teaboy1",
                    "body": "Couldn't risk being caught with their pants down.\n\nThere'll be an inevitable drop off post klopp until arnie gets his players and methods across. This way they've got a whole transfer window and preseason to start that. I'd be amazed if some deals aren't already been organised.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "bigpapasmurf12",
            "body": "He won't get better than Bayern.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "SprinklesExpert7009",
            "body": "Imagine Solskjær just got fired and we need a new manager. \n\nOut of the available managers, I'd still take ETH.\n\nLet's give him another season.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "wylthorne92",
                    "body": "1000% please keep ETH and pass on poch. I wanna see how much farther you fall with your Frankenstein squad and Poch doesn’t deserve such a leaky stadium",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SprinklesExpert7009",
                            "body": "Huh, is that a noise? Nah, it's just Tottenham.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PenisManNumberOne",
                    "body": "ETH in people are baffling but whatever lol enjoy shit ball and the that old piece of garbage stadium you play in 😂😂😂",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "lewishamilton08",
            "body": "If Poch is so good why do rival fans not want him at their club?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "TechnicalBedroom7758",
            "body": "Lmao i can make better hiring decisions than the clowns at these clubs. Pochettino is not an elite coach. Never was, never will be. \"Long term\" merchant.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "reddfoxx5800",
                    "body": "He did fine, I always joke around with my cousin who's a big Chelsea fan but the team honestly surprised me a few times, especially with getting 6th, two wins from champions league football",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jltho",
                            "body": "He did more than fine. Our club is a total shitshow right now because of how our ownership group is operating. He took a totally dysfunctional club of inexperienced and young players that had never played together before and improved over the previous season significantly and got us back into Europe.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "reddfoxx5800",
                                    "body": "I joke when I say United needs to keep Ten Hag and wouldn't be surprised to see him sacked after Sunday but this one genuinely confused me. I personally think the most important thing the club needs is a excellent player/man manager for those young players with inflated wages and egos. I felt like he was definitely cooking something with the players but I  honestly think Mourinho would go crazy lol",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "jltho",
                                            "body": "I don’t think Poch is world class or even necessarily THE long term manager for Chelsea, but I did think he was the right manager for right now to provide stability to these young players and the club. He should have gotten another year or two. We need someone to settle us down.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TechnicalBedroom7758",
                            "body": "He didn't do fine. You are blinded by the excellent end of season run. He was horrendous for 75% of the season. His team underperformed for a vast majority of it. Those consecutive wins salvaged a horrible almost midtable season.",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Metal_Ambassador541",
                                    "body": "We haven't lost a game except to Arsenal since the Carabao Cup final. We had positive trends in almost every meaningful stat, and a lot of our players are unrecognizablg good. Poch should never have been our permanent managerial choice, but I'd rather boring 6-4th place finish over Graham Potter 2.0. Once we can get a tried and tested manager, then Poch can go.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Daewoo40",
                                            "body": "...Then Poch can go? Didn't he resign yesterday?\n\n\nDe Zerbi was linked with the Chelsea job and everything.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Metal_Ambassador541",
                                                    "body": "De Zerbi is not tried and true nor world class, and according to Fabrizio Romano, not a candidate anyways iirc.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Daewoo40",
                                                            "body": "Depends on what rag you read, I suppose \n\n\nwww.football.london/chelsea-fc/news/next-chelsea-manager-brighton-agree-29215173.amp",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "TechnicalBedroom7758",
                                            "body": "> Graham Potter\n\nGraham Potter is another bang average English manager, just like Moyes that people thought could go big time because he overachieved for a little while with a small club. Any decent foreign manager can seem world class when compared to him. He should not be the standard to which any Chelsea manager is compared to.",
                                            "score": -1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Daewoo40",
                                                    "body": "Both Moyes and Potter are good managers for small teams with a limited budget.\n\n\nWhat Moyes did at Everton pre-Manchester United was very good with the resources he had.\n\n\nPotter floated around Europe a little bit and then I'd argue Brighton weren't coming to the EPL without him, now they're a mid-table team, which De Zerbi carried on.\n\n\nThey're all decent managers, given time, and all 3 would see the same sort of success at the heights which Pochetino has seen had they been given the same opportunity at PSG.\n\n\nOddly, Potter has more silverware in his cabinet than Pochetino.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TechnicalBedroom7758",
                                                            "body": "Potter was beyond woeful when he was really expected to perform week in week out with expensive talent. Same with Moyes. Sorry but they just are not top tier, I was internally rooting for them both to succeed during their tenures but disappointment ensued. It's not meant for everyone. Most specifically English managers It seems, none of them can cut it no matter how many chances given. From Moyes to Potter to Hodgson, Brendan Rodgers, Mark Hughes, Stuart Pierce etc. None of them could cut it at the top.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Daewoo40",
                                                                    "body": "The examples you use are examples of managers who have won things with smaller teams yet couldn't do it with big clubs.\n\n\nMoyes won whatever international trophy with West Ham and constantly punched beyond Everton's weight during that tenure.\n\n\nPotter got back to back promotions with whatever Nordic team he managed.\n\n\nHodgson has had an extensive career around the globe and his tenure at Fulham was directly after Wally with the Brolley who took them to a European final, so relatively he didn't succeed but it isn't as if he floundered.\n\n\nBrendan Rodgers...Yea, he's essentially a Scottish Pochettino. He won the SPL with Celtic when they had no competition.\n\n\nThe problem is that no one seems good enough to manage the \"top\" teams. Every club wants a new manager to hit the ground running and win trophies which simply won't happen with the mentality behind the scenes/billboards not matching results.\n\n\nThat ETH and the succession of Chelsea/United managers have spent money and not gotten results, so ousted the manager, rather than sticking with them as a smaller team would've done.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TechnicalBedroom7758",
                                                                            "body": "And what did that get these smaller teams? What success did Brendan bring Leicester City? beyond ultimately getting relegated. What success did Hodgson bring Palace beyond fighting relegation season after season? Btw he was also hired by Liverpool and took his mediocrity there. English managers do not have the mentality and IQ required to coach at the highest level. It's baffling to me cause I do want them to succeed in their own league at least but they've failed. Even the next generation of Rooney, Lampard, Gerard are no better than their peers. The Xavi, Xabi, De Rossi, Thiago Motta, Artetas are all putting them to shame. It's truly baffling.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Daewoo40",
                                                                                    "body": "Arguably what they all brought was a place in the premier league for another season, every season. \n\n\nWith only 1 team being able to win the league and European football being *a* goal for some (West Ham being a recent one for it, Middlesbrough and Fulham of old), English managers seem to either have the EPL down whilst not being \"elite\" coaches or they fade to obscurity.\n\n\nI would also be hesitant to put Rooney in the same category as Gerrard or Lampard. Whilst his time at Derby was poor, the hand he was dealt was abysmal, Gerrard and Lampard don't get so much leeway from me, they were both poor inn the EPL despite one having relative success in the SPL.",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Metal_Ambassador541",
                                                    "body": "But he is the most similar manager to all our current choices except that De Zerbi & Maresca aren't English. They are all managers who are overachieving (in Maresca's case, I'd argue he's not even overachieving since Leicester spend a lot). McKenna hasn't played a single PL game ffs, how are we supposed to know his caliber at the highest levels.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TechnicalBedroom7758",
                                                            "body": "> McKenna hasn't played a single PL game ffs, how are we supposed to know his caliber at the highest levels. \n\nI'm simply going by the fact that no English manager has made it at the highest level in 30 years bar Fergie (Scottish, but all the same football culture.) Dalglish is also scottish. \n\nI'm sure at some point, someone will make the break through. My point is not to say no one ever will but its an embarrassment how they all have been failing to do so. Of course not all foreign managers are world class but all world class managers are foreign. That's my point. So pointing non-world class foreigners does nothing for ur argument here.",
                                                            "score": 0,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Metal_Ambassador541",
                                                                    "body": "I have literally no idea what you're arguing, what I'm arguing is that McKenna is too much of a gamble for Chelsea to take on and will end up being a second coming of Graham Potter in how badly our club will be mismanaged by him.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "TechnicalBedroom7758",
                                                                            "body": "Well i never brought up MCkenna to begin with, so i don't know why you started that argument either. Yes he'll just be yet another dodgy English manager gamble. Gambles are fine, but English manager gambles are the worst going by the numbers.",
                                                                            "score": 0,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Metal_Ambassador541",
                                                                                    "body": "I brought up that argument because originally you argued that Poch was only good because of that last patch of form, which was objectively not true, and we have no good candidates to replace him. McKenna, Maresca, and De Zerbi are all mediocre managers. That's all I'm arguing.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "TechnicalBedroom7758",
                                                                                            "body": "So you refuted my point with zero argument besides saying you don't know of a more capable manager. Good thing it's not your job to look into the footballing world and come up with a shortlist. Also saying \"not objectively true\" is not an argument. The win loss column for 75 % of the season says otherwise. The win after win after in the last quarter leveled it all out for him. 6th is still a failure in the overall scheme of things when Aston Villa finishes over you.",
                                                                                            "score": 0,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "Metal_Ambassador541",
                                                                                                    "body": "There are no more capable managers on their list. None of the managers we are looking at have anything resembling pedigree or success at the highest levels.   \nThe Win Loss column was about 50%. Not amazing, but not awful considering our injury crisis. Aston Villa had the season of their life, with a highly talented manager at the helm. We were better than them in terms of form tables by the end.",
                                                                                                    "score": 1
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                },
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Ok_Asparagus_6163",
                                                                    "body": "McKenna isn't English. Do you know anything about football?",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Lonely-Astronomer184",
            "body": "So Man Utd and Bayern are looking for a pretender now?",
            "score": 2
        },
        {
            "depth": 0,
            "author": "zzaschild",
            "body": "Hard pass",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "RecentReality9898",
                    "body": "Hard or easy?\n\nNever understood these 'hard' passes.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "mrbasil_fawlty",
            "body": "The man who turned 1.5 billion into a mediocre team - who could miss out",
            "score": -7
        }
    ]
}