{
    "title": "Bayern Munich close in on Vincent Kompany as new boss ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Lower_Condition_196",
            "body": "They really don’t want Kane to ever win a trophy lol",
            "score": 57
        },
        {
            "depth": 0,
            "author": "Millzius",
            "body": "Fail upwards lol. The suit/cap look is working wonders for this guy.",
            "score": 32
        },
        {
            "depth": 0,
            "author": "Ashthedestructor_95",
            "body": "Bayern and chelsea have gone mental🙏🏽",
            "score": 23
        },
        {
            "depth": 0,
            "author": "Either-West-711",
            "body": "The desperation…prolonging Kane’s trophy draught",
            "score": 18
        },
        {
            "depth": 0,
            "author": "Kdarl",
            "body": "Bayern out to make Kane trophy-less.",
            "score": 16
        },
        {
            "depth": 0,
            "author": "LordWellesley22",
            "body": "Vincent Kompany has brought the FM editor hasn't he/s \n\n\nNow that I said that watch him win every league game and still finish 2nd in the league due to the Kane curse",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "ThisReditter",
                    "body": "FM’ed",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "tukinoz90",
            "body": "Talk about falling upwards. How has he managed to be linked to this jobs? Never mind be a frontrunner.",
            "score": 34,
            "replies": [
                {
                    "depth": 1,
                    "author": "Far-Post6196",
                    "body": "He was like the 7th option for bayern. Hardly a frontrunner",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "mrtuna",
                    "body": "Everyone else they approached said no.",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "If-I-Had-A-Hamper",
                    "body": "He was not given any players - he had a Championship side in the Premier league and didn't come in last",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "cmae34lars",
            "body": "That is the most random choice I've ever heard",
            "score": 15
        },
        {
            "depth": 0,
            "author": "Plenty_Assumption_18",
            "body": "I want to know what they are smoking over there at Bayern!",
            "score": 15,
            "replies": [
                {
                    "depth": 1,
                    "author": "counter-proof0364",
                    "body": "After basically chasing half of German and England coaches, this made sense.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "SukhdevR34",
                    "body": "They panicked hard after not getting their top 5 or 6 targets. Why get rid of tuchel if you don't have a plan? Tuchel to Kompany is a ridiculous downgrade",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Macho-Fantastico",
            "body": "I don't get this one at all.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "OkCurve436",
                    "body": "Nope it's beyond me. 2 years at Burnley, including a relegation, is hardly the CV for a Top 5 Club.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jojimanik",
                            "body": "This is why you should watch more football games",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "Teaboy1",
                            "body": "I dunno he did quite well with a poor Anderlecht side finished 2nd when he left they finished 8th, \n\nDominated the championship with Burnley, they got promoted by mid-April.\n\nHe plays an attractive brand of football, and when he has a competitive squad, he tends to do quite well. As shown by his results with Anderlecht and Burnley.\n\nThat being said he's never managed any superstars so it'll be interesting to see how he manages the dressing room.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jazzybforecasts",
                                    "body": "In a way he did when he captained city. Tbh I don’t see this as necessarily a terrible choice, it’s definitely a gamble however.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Teaboy1",
                                            "body": "Yeah, fair point. \n\nI hope it works for him.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Maxxxmax",
                    "body": "Its more a comment on bayern's failures to line up a new manager than anything. They've been at it for months with a score of people having turned them down already.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TripleBuongiorno",
            "body": "- Be mid at Anderlecht and dick around there for years\n- Boss the championship with one of the league favorites playing dominant football\n- Refuse any flexibility in your playing style and get relegated \n- ???\n- Become coach of Bayern Munich for some reason",
            "score": 58,
            "replies": [
                {
                    "depth": 1,
                    "author": "Liam_021996",
                    "body": "Anderlecht finished 8th the season before he took over and he finished 4th and 3rd with them and got them to a final. The season after he left, they finished 11th. Anderlecht are hardly the team they used to be these days. So hardly mid there, was he? \n\nAlso the reason he stuck to his style was because the plan was to get the players used to playing that way in the top flight whether they got relegated or not. The board fully backed him doing it as it was never the plan to get promoted in his first season after having a massive rebuild where they lost all of their premier league players more or less. \n\nBayern are after him because he has a distinct style of play and at the top level teams tend to like managers that will play a certain way",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TripleBuongiorno",
                            "body": "Wow, a Man City fan defending Kompany. Extremely suprising stuff. Anderlecht finished 2nd last year. Yes, Kompany was mid there. There is no question about that. He did not achieve anything exceptional. A cup final with Anderlecht, how stunning.\n\n>Also the reason he stuck to his style was because the plan was to get the players used to playing that way in the top flight whether they got relegated or not.\n\nThis makes absolutely no sense. Why get players used to playing a way in the Premier League... When you are just going to get relegated again? \n\n>The board fully backed him doing it as it was never the plan to get promoted in his first season after having a massive rebuild where they lost all of their premier league players more or less. \n\nYeah I am sure the board is thrilled to get relegated immediately again. I am not saying that he should necessarily have gotten sacked or anything, but having more of a real gameplan during some games could have allowed them to finish 16th or 15th for sure.\n\n>Bayern are after him because he has a distinct style of play and at the top level teams tend to like managers that will play a certain way\n\nAnd what a massive mistake it would be, to hire a coach that is inflexible during a time where Bayern are at risk of slipping away heavily in a league they have dominated for so long.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Jwz401",
                                    "body": "Anderlecht is not the team we used to be, financial crisis, players with too much attitude and incompetent board setting us up with players with contracts that were too big. In almost 7 years that cup final was the closest we came to a price, the 4th and 3rd place wasn’t that good but the football we saw was good at times and way better than the football we have seen in the 2 years after that.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TripleBuongiorno",
                                            "body": "Sure but it wasn't like Kompany worked miracles. A miracle would be winning the league or seriously competing for it at least.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "ShimeBD",
                                    "body": "Type of guy to call arteta's time at arsenal mid because he hasn't won the prem yet",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TripleBuongiorno",
                                            "body": "Do I even have to explain to you how that comparison is ridiculous or are you being pedantic?",
                                            "score": 2
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "breezy_y",
                                    "body": "Tuchel was super flexibel and see where that got him",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TripleBuongiorno",
                                            "body": "A CL final, a CL win and one bad season at Bayern",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RuskinBondFan",
                    "body": "Bayern Munich has found their Eric Ten Hag. Now waiting for Barca to sign TT and it will be battle of clowns.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TripleBuongiorno",
                            "body": "Ten Hag was overladen with trophies at Ajax, developed some of the worlds current leading footballers there and reached a CL semifinal with a team that included a 17-year de Ligt as a centreback and a Donny van de Beek scoring at the Bernabeau. Say what you want about ten Hag's performance last season, but he earned his spot at United. Vincent Kompany has earned a spot at, say, Brighton.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ingr1d",
                                    "body": "How does relegation earn you a spot at Brighton?",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TripleBuongiorno",
                                            "body": "Winning the Championship like he did and engaging in the type of football he did earned him that chance for sure.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Ingr1d",
                                                    "body": "Fair enough. He’s proven he can win the league with a bigger budget than every other team and that’s all you techically need to do at Bayern. Still doesn’t qualify him for the Brighton job though.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TripleBuongiorno",
                                                            "body": "Burnley weren't that much better than the opposition in the Championship and were very stuck in their kick and rush mentality. Kompany does deserve some credit for what he got done that season.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RuskinBondFan",
                                    "body": "> the worlds current leading footballers there\n\nLike ?\n\nNobody from that Ajax team is a world class footballer right now or have been in the past. Forget about current leading. \n\nYou've got De Jong, who Barca wants to get rid off, you've got Van De Beek who's at Man Utd, you can maybe make a case for De Light, but that's it.\n\nYou can't have your career highlight be defeating Real Madrid and have merit to coach a big team.",
                                    "score": -1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "TripleBuongiorno",
                                            "body": "Also heftily defeated a prime Juventus during that CL-run, btw. Frenkie de Jong is a worldclass footballer, Ziyech was too at the time of him leaving for Chelsea. De Ligt undoubtedly is. Then you have Mazraoui who is, when uninjured, a starter at Bayern Munich. Onana did great at Inter when he left Ajax and was considered one of the biggest rising stars in goalkeeping before now fizzling out at United. \n\nI can go on- but honestly it is fine if you don't think any of these players are good or were good. He made them play ridiculously good. He brought about that effect in the team and Ajax were heavily slumping both before and now after he left. Slumping is mildly put, even, they have completely collapsed.",
                                            "score": 7,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "RuskinBondFan",
                                                    "body": "> Frenkie de Jong is a worldclass footballer\n\nTell that to Barca who wants to sell that guy. For 5 years they have been trying to find his perfect position in the midfield and have failed. 1 year, 2 years you can blame the managers and system, but after half a decade, you have to look at the player. \n\nAjax run was impressive, but calling all of their players world class based on one run is far too short sighted. And with time we have seen that they don't have it in them. I don't think they have lived up to the hype. I'm not saying they are bad players, but to call them current leading footballers is rating them a little too much.\n\nAnd Ten Hag did have merit to win Eredevise but he hasn't shown it with competition in the Prem or CL. The quality of the leagues is miles apart. Not to mention, all his signings have failed terribly at Man Utd. \n\nWe have seen his merits in the Dutch league, but in Prem and in Europe he has shown he's not a top manager. To finish last in a CL group that should have been a 2 race horse, is beyond incompetence. Not to mention, he has issues with new players every week. You have to be blind to not see his competence in Ajax, at the same time, if you think he hasn't been pretty poor at Man Utd, you have to be blind again.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "TripleBuongiorno",
                                                            "body": ">Tell that to Barca who wants to sell that guy. For 5 years they have been trying to find his perfect position in the midfield and have failed. 1 year, 2 years you can blame the managers and system, but after half a decade, you have to look at the player.\n\nBecause he is a top earner. De Jong came right before Barca basically had to admit that the club had been completely destroyed. They definitely tried to sell him but would only take really high bids and he didn't want to leave. Liverpool and pre-ten Hag United were willing to agree a sum of some 80 million euros. Not bad for a player that has been in a struggling team for years.\n\n>Ajax run was impressive, but calling all of their players world class based on one run is far too short sighted. And with time we have seen that they don't have it in them. I don't think they have lived up to the hype. I'm not saying they are bad players, but to call them current leading footballers is rating them a little too much.\n\nNot just based on that run, they impressed for years on end. The year prior they had been in the EL-final with de Ligt being a starter in that game aged 16. This was before ten Hag, though. Two years later, they won every game in their CL-group with none other than Haller scoring something like 8 goals. Ten Hag made Dusan Tadic, of centre midfield Southampton fame, into one of the most effective strikers in Europe. Barcelona AND Real wanted to sign him in this period, despite him being early 30's at this point. The idea that all of these players necessarily would have to be world class forever is silly.\n\n>And Ten Hag did have merit to win Eredevise but he hasn't shown it with competition in the Prem or CL. The quality of the leagues is miles apart. Not to mention, all his signings have failed terribly at Man Utd. \n\nLast season United finished a very respectable third. But yes, as has been happening for over a decade now, big name transfers have failed under ten Hag. Casemiro, Varane, Eriksen, Sancho- utter failures. Heavily overpaid for players like Antony or Hojlund. Had Antony been 20 million he'd have been a fun, talented substitute player. \n\n>We have seen his merits in the Dutch league, but in Prem and in Europe he has shown he's not a top manager. To finish last in a CL group that should have been a 2 race horse, is beyond incompetence. Not to mention, he has issues with new players every week. You have to be blind to not see his competence in Ajax, at the same time, if you think he hasn't been pretty poor at Man Utd, you have to be blind again.\n\nThis season has been a terrible failure. There are some silver linings though and you do have to wonder if it had been much better under a different coach. Tons of injuries and instability. I don't know if he should get a third season, but the problems run deeper than ten Hag and him berating Jadon Sancho for playing FIFA at night.",
                                                            "score": 2
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "NotMyFirstChoice675",
            "body": "Very odd considering who’s available. Poor Harry Kane lol",
            "score": 12
        },
        {
            "depth": 0,
            "author": "Brewitsokbrew",
            "body": "Bizarro world. Manager gets relegated playing football he refuses to adapt. Gets top job as reward. What happens if / when Bayern need to adapt? Against Real Madrid in the CL quarters or semis next season? Done.",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Mclovan93",
            "body": "Seems mental",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Appropriate-Cap-4140",
            "body": "Kompany got the team relegated and earned a Bayern job,\n\nDyche got Burnley to Europe and was only able to earn an Everton gig,\n\nMake it make sense!\n\n/s",
            "score": 27,
            "replies": [
                {
                    "depth": 1,
                    "author": "LeavingCertCheat",
                    "body": "The power of the baseball cap",
                    "score": 9
                },
                {
                    "depth": 1,
                    "author": "rzarecteh",
                    "body": "Perception is more important than reality. Kompany got a free ride all season playing a style that didn’t even have them competing despite spending a lot of money (which people forget).",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "SukhdevR34",
                    "body": "You know what's ridiculous too? Kompany spent £150 million in 2 summers. That is so ridiculous. Dyche was given peanuts every season and mainly coached and greatly improved the players he had.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Available_Command252",
                    "body": "Kompany plays a better style of football than Dyche",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "eggsbenedict17",
            "body": "10th worst points total in the premier league ever and become Bayern boss, how does that make sense",
            "score": 27
        },
        {
            "depth": 0,
            "author": "waytodusk",
            "body": "Fail upwards best\nI want to be like kompany when I grow up",
            "score": 11
        },
        {
            "depth": 0,
            "author": "Wah-Wah43",
            "body": "Meanwhile, Paul Heckingbottom is interviewing for Plymouth Argyle.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "Capable_Program5470",
            "body": "Right, explain this to me. \n\nSean Dyche gets promoted with Burney to the EPL, relegated with Burnley, Promoted again with Burnley, finishes in the European spots and presides over their most sucessful PL era in the clubs history all whilst spending a net 60million during the whole 10 years he was there. For his excellent performance as manager, he gets sacked, Burnley go down, he stays unemployed until Everton pick him up after sacking Lampard who they chose over Dyche originally. \n\nBurnley hire Vincent Kompany, give him a tasty chequebook (net spend: 74 million in two years) to make some signings, he takes them back to the EPL. They then finish 19th and get relegated after a terrible season whilst being touted as part of the worst 3 promoted teams in the leagues history. For his excellent performance as manager, Kompany gets offered the Bayern Munich job.",
            "score": 35,
            "replies": [
                {
                    "depth": 1,
                    "author": "Vipassana88",
                    "body": "If all your figures are correct, stunning.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Vipassana88",
                    "body": "That's quite a comparison.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "meccamachine",
                    "body": "Ah…hmm.jpg",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "SukhdevR34",
                    "body": "I think dyche was already managing when we hired lampard right? Though we could've still hired him. He looks like Ancelotti compared to Lampard lol",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Remarkable_Injury407",
                    "body": "When you put it like that… wow",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "lordnacho666",
                    "body": "Well, you ain't wrong.\n\nParticularly in the world of work, just about every person who has worked has found some similar stupidity. Idiots being promoted, people who saved the business getting fired, hiring the wrong people.\n\nIt's totally normal.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "TechnicalBedroom7758",
                    "body": "Style of play matters. Sean Dyche does not coach the type of football that top clubs want to see their players playing. \n\nAlso,' you can not ignore just how poorly English managers have done when appointed to big job roles. They routinely fail out. They seem to be inferior to their international colleagues when it comes to modern football. \n\nJust because an English manager can manage expectations at mediocre football clubs does not mean they have what it takes to manage top tier clubs with top tier talent who want to win every game and every trophy. \n\nTry again when the likes of Dyche start coaching teams that play expansive football and routinely play their opponents off the park rather than playing dinosaur football and hoping to poach goals here and there for the odd win.",
                    "score": -2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "NYR_dingus",
                            "body": "Only thing I'd disagree with is saying Dyche plays dinosaur football. He's not nearly as antiquated as people on here or the memes suggest. Against high quality opposition I think he's pragmatic enough to understand that playing open/expansive football against a team like City or Liverpool is suicide. When playing against a more evenly matched side his Burnley teams and Everton this year were able to play some solid attacking football with good passing sequences. Check out his masterclass video on YouTube, shows he's a lot more astute than people give him credit for. \n\nhttps://youtu.be/o3YY7PY-IH0?si=pnY9TlCCsnd5bMNM\n\nI agree with you about English managers not doing well abroad tho. They haven't been at that caliber since the 90s with the likes of Venables and Robson. I think Howe is probably the best English manager at the moment.",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TechnicalBedroom7758",
                                    "body": "Yea great comment, though one thing I'll add is that it's actually not just abroad that English managers fail to live up to consistent high expectations. It's at home with top clubs as those names I mentioned above show. Liverpool especially has given a number of them a try, Chelsea with Frank Lampard and Graham Potter.\n City as well in their earlier days of investments. Stuart Pierce and Mark Hughes. Game has gone beyond them. The high level tactics passed them by. We'll see how Howe does if and when he gets his opportunity after Newcastle.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "NYR_dingus",
                                            "body": "I agree, I think it's a combination of a few factors: English media is relentless, domestic fans are especially impatient if it's a former star player in management, but most importantly I think that the development of the game tactically into the latest generation of football management happened on the continent rather than England. Most of the development which happened at academy and lower level for football took place in Spain and Germany. It's why we see so many great coaches coming from those two countries. That period from the late 90s to around 2010 was crucial towards the development of the modern game. England missed out on a lot of that development unfortunately. I think it's starting to turn around though. Howe, Rob Edwards, Gary O'Neil, I think England is getting itself together again and we'll see more tactically astute managers in the coming years",
                                            "score": 2
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Ok_Asparagus_6163",
                                            "body": "Liverpool had Hodgson. That's it. Do you actually know anything about football?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Capable_Program5470",
                            "body": "How are you meant to prove you can play expansive football when managing Burnley spending 6m a year or Everton who are bankrupt hence maintaining a transfer surplus of over 30m?\n\nI believe Dyche when he says he'd love to play prettier football he just doesn't have the players to do it. Unlike Kompany who stuck to his guns and got relegated for it, Dyche sets them up in the most likely way to win given the resources he has.\n\nI'm not disagreeing English managers struggle at the top (most managers do!) but if Dyche and Kompany were both unemployed and you had to pick one for the Bayern job, who would you pick?",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TechnicalBedroom7758",
                                    "body": "Kompany stuck to his guns, playing expansive football and got that team promoted from the Championship. That's what got him the Bayern Munich shot. Dyche is giving excuses. Truth is he grew up with one type of football and that's all he knows and is comfortable coaching. Moyes too would have given the same excuse while at Everton, well look how shit he turned out at United and with Sociedad in Spain. Look what Xabi Alonso did in Germany with Leverkusen. He didn't moan and give lame excuses about not having Bayern or Leipzig's finances. The best managers stick to their philosophy and let it shine through regardless of the professional players at their disposal. We saw the same thing with Klopp at Pool almost immediately they started playing his style even though he didn't have the optimum players to really succeed with it but he got the culture started. That's how true elite managers do it.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Ok_Asparagus_6163",
                            "body": "So: because Kompany isn't English he's a great manager. Great logic 👏👏👏",
                            "score": 4
                        },
                        {
                            "depth": 2,
                            "author": "SukhdevR34",
                            "body": "Dyche will never play like that but that's fine and that's why none of the elite clubs would ever hire him. He's still a much better manager than kompany. It still doesn't mean kimpany deserves this job, Bayern are panicking heavily as none of the best managers want to manage them.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TechnicalBedroom7758",
                                    "body": "According to your logic here Arsenal should never have hired Arteta because he had practically nothing on his resume when they hired him. He was just an assistant to Pep and never ran a team himself. Arsenal should have hired Dyche instead right? No. \n\nYou can't teach these old dogs new tricks. Young and upcoming managers like Arteta are open to new ways of playing the football of the future. You see it in Italy with Thiago Motta and De Rossi, Germany with Alonso. Young green managers doing something special and promising. \n\nIt was an amazing achievement the way Company got promoted immediately while playing with style in the championship. \n\nYou have no idea what his interview with Bayern was like and what ideas he communicated to their hierarchy. Those interviews matter to the decision makers, not just surface level results.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "SukhdevR34",
                                            "body": "No Arsenal shouldn't have hired Dyche because its an awful style fit but I get your point on Arteta. It's not an amazing achievement by kompany to get them promoted when you consider how much he spent and he still had a few players that were left over from Dyche. Kompany has already failed in a job, Arteta hasn't.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TechnicalBedroom7758",
                                                    "body": "With how bad Arteta was with Arsenal in his first 2 years, my guess is he would have failed woefully as well with newly promoted side with Championship level players. Context matters.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ok_Asparagus_6163",
                                                            "body": "Your \"guess\" means nothing",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Ok_Asparagus_6163",
                                            "body": "Amazing achievement? Indeed, with the lowest budget in the Championship  s/",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "fjtuk",
            "body": "Kompany must have one hell of an agent.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "FactCheckYou",
            "body": "aren't clubs concerned about how quickly they're burning through managers nowadays?\n\nthis is Bayern Munich and the best option they can think of is basically a novice manager with zero top level experience\n\nthe days of Ferguson and Wenger are long gone",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "GloomyLocation1259",
                    "body": "Probably looked over at Leverkusen and thought hmm a novice manager who plays a possession based style what could go wrong.",
                    "score": 10
                },
                {
                    "depth": 1,
                    "author": "markedasred",
                    "body": "Premier league money hoovers up the top managers most of the time.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Southern_Seaweed4075",
            "body": "I don't understand the reason behind hiring a manager who just led his team to relegation in the English Premier League. What's going on in Bayern Munich? ",
            "score": 21,
            "replies": [
                {
                    "depth": 1,
                    "author": "cathar_here",
                    "body": "Yep he played a style the big clubs love even knowing his players could not do it, so bad for current club but great advertisement for his future",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "SovannRoussard",
                    "body": "His play style",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "meccamachine",
            "body": "Oh come on. Don’t do Harry like this. Yes he’s terrorised my team for a decade but he doesn’t deserve this",
            "score": 19,
            "replies": [
                {
                    "depth": 1,
                    "author": "macaleaven",
                    "body": "To paraphrase Barry Gibb: you should be dancing - no way Vinny is ready to manage Bayern, especially ATM",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "diggerbanks",
            "body": "I wish him well. Decent chap.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "cyberdyme",
                    "body": "I think he will do really well and probably win the league - similar to English managers that go to Rangers or Celtic - the club has the most resources and some of the best players in that league - it’s the latter stages of the champions league were he will be found out..",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "diggerbanks",
                            "body": "That would be a great story. Bayern have won 3 CL since 2000. As long as they are competitive in the CL, I'm sure there will be some patience in his first few seasons.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "wallace1981x",
            "body": "Strange choice.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "gelliant_gutfright",
            "body": " The Homer Simpson of football management.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "gelliant_gutfright",
            "body": "In other news, Rob Edwards to take over at Barcelona.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "benjustben2",
                    "body": "Unironically I think Rob Edwards is a better coach than Kompany.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "PenisManNumberOne",
            "body": "This is going to be a great move I think. Seriously. If the likes of Frank Lampard, who failed at promoting Derby County and got the Chelsea job anyway happened then I don’t see why someone who did achieve promotion with 100 points and an extremely progressive play style can’t be gambled on at a (usually in Chelsea’s case) UCL level club. \n\nI personally am sick of the same rotating names and imagine Kompany succeeding. That would be fun to watch and a very cool story.",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "ContraVista",
                    "body": "I agree.   Kompany has the accomplishments to command the respect of the players and uses a top club style high press that suits the team.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "SuspiciousSystem1888",
                    "body": "Because it’s the championship league, we just saw this season how poor his tactics are against actual quality teams. \n\nAnd it’s crap. \n\nBayern will get smacked left and right if they do that in the Bundesliga. It’s a different style of play but he tactics will still be very weak in the league. \n\nThe current situation at Bayern is completely rotten and to bring In Kompany this early in his career with no ties to the club is borderline madness. ",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PenisManNumberOne",
                            "body": "I don’t think the entire roster of burnley players cost the same as like Harry Kane did, combined. By a lot. He’s going to go from the worst players in the league to the best",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Cancel_Still",
            "body": "wow! talk about failing upwards!",
            "score": 7
        },
        {
            "depth": 0,
            "author": "jokerevo",
            "body": "but.....why?",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Cultural_Wallaby_703",
                    "body": "So in one year they can appoint Klopp",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DiscoStupac",
                            "body": "I think this is the plan - or possibly Alonso.\nIn the meantime, if Kompany succeeds? Bonus.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Ne0guri",
                            "body": "Xabi Alonso",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MeUnderstandOda",
            "body": "Bayern Munich and Chelsea. The ownership of these clubs is totally messed up.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "meechinnyon",
            "body": "They must be banking on him becoming the next Arteta lol",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Leather_Jerkin69",
            "body": "Kanes pulling his hair out",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "3rdLion",
                    "body": "Yeah I actually pity the guy at this point, he deserves better.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kapika96",
            "body": "Odd decision. Kompany seems decent and like he could be a good manager, last season proved that. But he hasn't had any success at the top level yet. Seems like way too big a jump up. Hope it does work out for him though.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "GloomyLocation1259",
                    "body": "Think it’s turning into more philosophy than feats. Arteta, Alonso, maybe Kompany. All were new but had a good start playing possession Pep-ish styles  of football. \n\nOn the other hand I’m guessing going for “proven” managers means people who aren’t available or people who already rejected them. \n\nAlso from what I heard from fans it seems similar to Chelsea that it’s more important for the behind the scenes people to sort out their shit at the moment and they can also get a novice manager in as a yes man",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "oppositeofopposite",
            "body": "Let the memes flow",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "InstructionOk9520",
                    "body": "Kompameme",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "ignacio2D",
            "body": "Am I missing something? Is this FM in real life?",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "ThisReditter",
                    "body": "First Xabi save scum, now this. I think the Germans has hacked into the matrix.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "clandistic",
            "body": "At this point, they're just trying to find someone who can't say no. Imagine being the 8th choice, setting up for failure.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "oldschoolology",
            "body": "There’s no way that’s their choice. His club got relegated and had zero fight.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "breezy_y",
                    "body": "Look at burnleys team, even pep would have had trouble with them",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "QuaintHeadspace",
                    "body": "Everyone has said no to them. At this point they are on like their 17th choice manager.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "ersteliga",
            "body": "Nothing a healthy transfer budget can't fix",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Anglo96",
            "body": "Have you ever seen someone fail upwards more than this guy?",
            "score": 18,
            "replies": [
                {
                    "depth": 1,
                    "author": "SukhdevR34",
                    "body": "Roberto Martinez is another guy. Also an awful manager but tries to play a similar possession style. He proved how awful he was at Belgium.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "NightSocks302",
            "body": "This should be posted on r/championship lol",
            "score": 18
        },
        {
            "depth": 0,
            "author": "mrshev",
            "body": "I sort of get it and sort of don't. \n\nYou could definitely see what he was trying to do at Burnley...but trying to get players who were inexperienced at PL level and/or too young/raw to play counter-pressing tactics against some of the fittest and highest skilled teams in England/ Europe struck me as naivé at best and poorly coached at worst. But, I can see how effective employing (essentially) top-level tactics in the Championship paid dividends and how continuing that coaching style and mode of play in the PL makes a lot of sense...but Burnley had to shed quite a lot of loanees on transistion and my viewpoint was that he needed to look at his players and re-tool his team towards getting results. But, you could definitely see flashes of what could be.\n\nBayern would be taking a risk on a young, hungry manager who has learnt from the best but maybe given top level talent could transform Bayern into a dynamic, fast transistion side. Why not? The only way to get experience is to get experience. Fuck it, he's whip smart, articulate and seems like he shouldn't be fucked with - it's a massive risk, but I respect it.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "TakenByVultures",
                    "body": "There is all that, and I agree with you. He gave us a season of Championship football which was the best season many Burnley fans have seen in a lifetime, followed by one of the worst. But you forgot his tactical naivety/stubbornness;\n\n* Refusing to play Muric until 3/4 of the way into the season. \n* Changing formation week in, week out and not really settling on a starting 11 until it was too late. \n* Playing players out of their natural positions and/or changing their position each week. \n* Not making tactical changes during games when we were getting slaughtered. \n* Poor man-management - side-lining half of the squad that won us a record points total in the championship, causing rifts in the changing room.\n\n**All of the above culminating in our lowest points total in a season in 120 years of football, and our fewest wins at Turf Moor in living memory**\n\nFans were okay with that though, we believed in his \"Project\" and we're a loyal fanbase - there was not one single chant of \"Kompany out\" at any home game I went to this season. I know you can't say no to Bayern, but it stings that we gave him loyalty and backed him with £100M of signings that he scouted/chose, just for him to leave after relegating us.\n\nThe VK brand is a fantastic PR machine if nothing else.",
                    "score": 15,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "mrshev",
                            "body": "I 100% understand that the Burnley fans and club stuck with him and will/would feel betrayed - I remember at the start of the season how he told the media that even if they got relegated the club would stand by him as it was a 'project' and they believed in him. That sucks - but if it was you and you were coaching Tetbury United and Burnley came calling?\n\nThe stubborness is something I wanted to add, but didn't want it to turn into a Substack piece. The other stuff you mention was also something I observed...but overall, I could see the spirit of what he was trying to do. IMHO (as a pathetic armchair tactician, tragic FPL mid-tabler and sometime Sunday League player) he should stick with Burnley, take the relegation as a massive lesson in humility and an opportunity to form this team into the fittest, smartest and bad-ass team to yo-yo back up and then aim for 15th place.\n\nAs a side note: Does Turf Moor have the best view from the top of the stand of any team, anywhere??!",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TakenByVultures",
                                    "body": ">  That sucks - but if it was you and you were coaching Tetbury United and Burnley came calling?\n\nOh yeah, I totally agree. It just sucks we're left relegated with a load of players he signed. Still, there's optimism and if the reports are true we should be getting £20M or so in compensation from Bayern for his departure. \n\n>IMHO (as a pathetic armchair tactician, tragic FPL mid-tabler and sometime Sunday League player) he should stick with Burnley, take the relegation as a massive lesson in humility and an opportunity to form this team into fittest, smartest and bad-ass team to yo-yo back up and then aim for 15th place.\n\nI agree. If things go pear-shaped at Bayern, this is a big risk for his future career. Many of the fans have the feeling this job is too big for him right now. But only time will tell obviously. \n\n>As a side note: Does Turf Moor have the best view from the top of the stand of any team, anywhere??!\n\nYes! The view from the top of the Long Side (North Stand) - which is where I usually sit- is widely regarded as one of the best in English football. Bloody cold in winter though.\n\nhttps://media.koobit.com/turf-moor-before-burnley-play-chelsea-v2-44573-w1279.jpg\n\nLooks even better when the sun is setting!",
                                    "score": 4,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mrshev",
                                            "body": "I've been at Turf Moor once and I was blown away by the view.\n\nMy gut feeling on all of this is that he will take the Bayern job, get found out by October, P45, do punditry for the Dutch media for a year or so, offered national job, takes the Netherlands team to the next World Cup, knocked out in the group stage, P45, Chelsea...because Chelsea.\n\nMeanwhile, Burnley hire Tuchel who takes them back into PL, wins PL second season amassing 96pts total, Pep has nervous breakdown, wins champions league beating Bayern in final - you read it here first, folks.",
                                            "score": 4,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TakenByVultures",
                                                    "body": "I'll take your first half, but not the second. Can't stand Tuchel. 😂",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mrshev",
                                                            "body": "But there would be a kind of poetic symmetry to it!",
                                                            "score": 2
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "ANON_YMOUSE_",
                                                    "body": "!remindme in 2 years",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "RemindMeBot",
                                                            "body": "I will be messaging you in 2 years on [**2026-05-23 09:52:18 UTC**](http://www.wolframalpha.com/input/?i=2026-05-23%2009:52:18%20UTC%20To%20Local%20Time) to remind you of [**this link**](https://www.reddit.com/r/PremierLeague/comments/1cykhb8/bayern_munich_close_in_on_vincent_kompany_as_new/l5au2uo/?context=3)\n\n[**CLICK THIS LINK**](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5Bhttps%3A%2F%2Fwww.reddit.com%2Fr%2FPremierLeague%2Fcomments%2F1cykhb8%2Fbayern_munich_close_in_on_vincent_kompany_as_new%2Fl5au2uo%2F%5D%0A%0ARemindMe%21%202026-05-23%2009%3A52%3A18%20UTC) to send a PM to also be reminded and to reduce spam.\n\n^(Parent commenter can ) [^(delete this message to hide from others.)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Delete%20Comment&message=Delete%21%201cykhb8)\n\n*****\n\n|[^(Info)](https://www.reddit.com/r/RemindMeBot/comments/e1bko7/remindmebot_info_v21/)|[^(Custom)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=Reminder&message=%5BLink%20or%20message%20inside%20square%20brackets%5D%0A%0ARemindMe%21%20Time%20period%20here)|[^(Your Reminders)](https://www.reddit.com/message/compose/?to=RemindMeBot&subject=List%20Of%20Reminders&message=MyReminders%21)|[^(Feedback)](https://www.reddit.com/message/compose/?to=Watchful1&subject=RemindMeBot%20Feedback)|\n|-|-|-|-|",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Beastbrook00",
                                                    "body": "Why Dutch? He's Belgian.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "mrshev",
                                                            "body": "You're right. I said that because I am an idiot.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Caesarthebard",
            "body": "I would be so annoyed if I were Burnley.\n\nYes, he got them up but they basically allowed him to get them relegated (most teams would have sacked him in November) to fully buy into him and support him and as soon as he has gotten them relegated because he refused to fix what wasn't working (facts are - you can be idealistic at a bigger club where you have better players but not at a smaller club), he's basically gone \"yeah, fuck you, I'm too good for you\".\n\nBayern are taking a massive, massive punt and it looks like failure all round.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "alldawgsgoat2heaven",
                    "body": "Bayern isn't punting, theyre throwing a goddamn hail mary",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "invest-interest",
            "body": "For those who are wondering about this decision: weed is now legal in Germany.",
            "score": 19
        },
        {
            "depth": 0,
            "author": "No-Plastic7985",
            "body": "Agent Kompany with operation unthinkable, make FCB drop from Bundesliga.",
            "score": 15
        },
        {
            "depth": 0,
            "author": "Zestyclose-Act2039",
            "body": "Bayern think kompany is Alonso 🤣🤣🤣",
            "score": 13
        },
        {
            "depth": 0,
            "author": "Ok_Asparagus_6163",
            "body": "Media-friendly Managerial Mediocrity. Bayern fans must be delighted with this news 👍",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Uchronicclarion",
            "body": "Gotta pity Burnley who rather than sack Kompany for a manager who’d play relegation battle football they stick it out and accepted a long project just for him to leave lol",
            "score": 13
        },
        {
            "depth": 0,
            "author": "SukhdevR34",
            "body": "I've never seen Bayern in a situation like this before. Hiring a manager at the level of Kompany. If you willingly get rid of Tuchel you better have an elite manager lined up. Kompany is awful, 150 mil spent at Burnley and they're atrocious. And this is Burnley btw, 150m for them is huge considering Dyche for peanuts to spend for years",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "A_delta",
                    "body": "Hoeness thought he‘d easily get Alonso or Nagelsmann",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Die_brein",
                            "body": "Seems they don't want the job",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "fyer_me",
            "body": "As if a coach at Bayern is anywhere close to being a Boss.",
            "score": 9
        },
        {
            "depth": 0,
            "author": "Xirnura",
            "body": "Looool Kane never winning a trophy dawg",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheRiddler1976",
                    "body": "Kane to United incoming after Poch takes over there",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TeddyMMR",
                            "body": "So he's never winning a trophy",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Other_Beat8859",
            "body": "Literally failed upwards. The amount of better coaches is insane. Conte, Poch, Mourinho, De Zerbi, Zidane, etc, but no. We go for the guy who has accomplished pretty much nothing. \n\n\n\nFucking Christ, Stevie G has a better record than Kompany. It's insane how big of a clown show Bayern is.",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "GunnersGentleman",
                    "body": "Not enough of a clown show for us to beat them, unfortunately",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Previous-Loss9306",
                            "body": "Bayern curse lives on",
                            "score": 4
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Bobby_Shafto-",
            "body": "Who? The bloke that got Burnley relegated?",
            "score": 17,
            "replies": [
                {
                    "depth": 1,
                    "author": "SamwellBarley",
                    "body": "No, the bloke that got Burnley promoted. Different guy.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MoshiriMagic",
                            "body": "The bloke that captained City to 4 premier league titles as well",
                            "score": -1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Bobby_Shafto-",
                                    "body": "I was just quoting what Steve Bruce said when we hired Eddie Howe (Referring to Bournemouth). He did well in the championship, but getting 24 points in the Premier League doesn’t really qualify him for one of the biggest jobs in European football.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ill-Mathematician218",
                                            "body": "But it's Bayern Munich. Where every man and his dogs can win easily.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Caesarthebard",
                                                    "body": "Tuchel didn't and he's achieved far more than Kompany.",
                                                    "score": 2
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Bobby_Shafto-",
                                                    "body": "Not with the curse of Kane",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Haunting_Ad_9013",
            "body": "For everyone doubting Kompany, he is a very good manager. He single handley rebuilt Burnley from the ground up, and tore up the Championship.\n\nWhen he arrived at Burnley, the club was in utter ruin and was on its way to being relegated from the Championship.\n\nThe reason Burnley did poorly in the Premier League was because the higher ups did not invest in the talent needed to compete.\n\nKeep in mind that Xabi Alonso was also relegated before he joined Leverkusen, but the club took a risk on him, and now he is one of the most sought after managers in Europe.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Batter89",
                    "body": "He did very well in the Championship, obviously a talented manager, but utter ruin is a bit strong.\n\n'Higher ups did not invest' - we were one of the highest spending teams in the world last summer! Granted 10 x £10m players is worse than 4 x £25m players, but the chairman fronted the cash all the same, and Kompany appears to have had a very large influence on transfers.\n\nBeen on every game this season and I can tell you that Kompany isn't without blame for this relegation. It's the lowest points total from a single season in our entire history. I was still behind him, but rest assured, mistakes were made.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "palmerama",
                    "body": "Since when is £150m spend not investing in the team.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Francis-c92",
                    "body": "Tearing up the Championship isn't the same as Bayern's level though is it?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jojimanik",
                            "body": "Championship is better league compared to Bundesliga",
                            "score": -3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "jojimanik",
                                    "body": "No I am not , Championship is definitely top 5 toughest league in Europe . It’s not easy to get promotion here .",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "quickdrawesome",
                                    "body": "Winning the championship with any team is infinitely harder than winning the bundesliga with bayern",
                                    "score": 2
                                },
                                {
                                    "depth": 3,
                                    "author": "SukhdevR34",
                                    "body": "You're hilarious",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "No_Reference1439",
                                    "body": "You’re kidding right? 😆",
                                    "score": 0
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SukhdevR34",
                    "body": "Sorry but your standards are very low if he's very good. If he is very good then what are Moyes and Dyche? People consider these guys good managers but not amazing. 150 mil spent and a pathetic season is unacceptable.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Haunting_Ad_9013",
                            "body": "You could have said the same exact thing about Xabi Alsonso just a few years ago. He was not a highly rated manager when Leverkusen signed him, but now look at Leverkusen now.\n\nComparing Kompany to Dyche or Moyes is ridiculous. You are comparing a young manager in his first few jobs, to veteran managers with decades behind them. Kompany is easily one the best young managers out there. He proved his potential with the what he did to Burnley when he took over.\n\nWho knows what he could do when given the right resources at a big club? The only way to find out is to give him a chance. Bayern are betting on potential, not proven records.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "SukhdevR34",
                                    "body": "It's a silly bet then. He's been given £150 million. That's a HUGE amount, especially for Burnley. Of course you can compare them, they were all in the same league last season. Kompany is not even average let alone very good.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LaQuice",
            "body": "Wait what? Bayern are hiring a manager who manages one of the worst teams in the prem and that just got their team relegated? \n\nThey really wanna keep Kane trophyless wow haha",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "ThisReditter",
                    "body": "Kane must have really pissed off someone in higher power in his previous life that they are just toying with him now.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "AmagicManNamedgob",
            "body": "Bad move for him, bad move for Bayern. I'm all for it",
            "score": 7
        },
        {
            "depth": 0,
            "author": "emilyemone",
            "body": "What?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "hmeets",
            "body": "Why?????",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Islandboi4life",
            "body": "LOL The man relegated Burnley by himself and he gets an opportunity for Bayern?",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "JMaboard",
                    "body": "Pep’s understudies, so hot right now.",
                    "score": 6
                }
            ]
        },
        {
            "depth": 0,
            "author": "Wound-Shagger",
            "body": "Lol, not only is Harry Kane gonna win fuck all, he's gonna get relegated 😅",
            "score": 10
        },
        {
            "depth": 0,
            "author": "StrongStyleDragon",
            "body": "If you’re not on the hot seat stay at Burnley. It’s a good club with passionate fans. And it’s below the radar. Really hone your craft before making a jump to a big club.",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mean-Two5585",
                    "body": "Sounds like ur speaking from experience, Kompany should really listen to u/StrongStyleDragon . He just got offered a role on one of the biggest stages and he’s only 38 he might never get to manage such a big team",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "JaThatOneGooner",
                            "body": "He’s a Chelsea fan.  He’s seen this scenario play out with Frank Lampard twice.  Same happened to Gerard when he made the move to Villa from Rangers.",
                            "score": 12
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Yupadej",
                    "body": "He was a serial winner in his playing career. He will be right at home at Bayern after playing under Guardiola who expects to win every game under the sun.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "AdComprehensive7879",
            "body": "failing upwards lolll\n\ndid they reject poch already?",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "Wrathuk",
                    "body": "from the impression I've been getting its managers turning them down not the other way around.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "AlmirMu",
            "body": "Bayern could have been smart and gone for Poch. What makes it even worse they had the young innovative manager in Nagelsmann who actually managed to be succesful with a relegation threatened side. For Kompany it‘s an even worse decision knowing that you‘re only there because everyone else said no.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "MaxXCeption",
                    "body": "Not sure how Poch would have been a smart move",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "OneStrangeSalad",
                            "body": "Me neither. Poch had it all at PSG and didn’t deliver as expected, maybe it’s better for them to try someone else.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "eggsbenedict17",
                            "body": "That's absolutely nonsense, they got battered all year, they won like 5 games and had a monstrous negative goal difference, they were handily relegated",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Doopaloop369",
                            "body": "What? They were rubbish, they barely won any games!",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "AngieBumper",
            "body": "the power of licking peps ballsack",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sexy_nutty_coconut",
                    "body": "Do you think if I did that everyday, I could get a 100k per week job as a manager?",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MasterReindeer",
            "body": "He’ll be gone by December",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "dainamo81",
                    "body": "He'll outlast Wyclef then.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "purpleshirtonbed",
            "body": "the definition of failing upwards",
            "score": 6
        },
        {
            "depth": 0,
            "author": "riptxlord",
            "body": "I get the appointment, his footballing philosophy is very good. However, it’s a massive punt. Personally, I actually think he’ll do well. He showed in Belgium and in the Championship that his style works when he has a good team compared to the rest of the league.",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Honest-Ad-3937",
            "body": "This is Arteta’s fault! 😊",
            "score": 5
        },
        {
            "depth": 0,
            "author": "accelerated_astroboy",
            "body": "people talk about players who are technical and skilled and are playing in a with no structure suddenly doing well when they make a move to bigger team.\n\nI think kompany is the same and it should make the bayern team a lot more dominant than the gung ho tactics of tuchel",
            "score": 3
        },
        {
            "depth": 0,
            "author": "sondergaard913",
            "body": "wait, what?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Immediate_Wolf3802",
            "body": "Lucky Twat...gets the job on being an excellent professional footballer ? Might aswell give Thierry Henry a ring ding",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ChelseaPIFshares",
            "body": "His career path doesnt even make sense in a video game.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ansahed",
            "body": "If you watched his team play, he focuses on strong defense, building from the back, high pressing, taking risks on young talents, and tactics that suit each opponent.\n\nIt’s exactly what Bayern wants, plus he’s past the apprenticeship stage.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "eggsbenedict17",
                    "body": ">he focuses on strong defense\n\nThey conceded 78 goals last year, average 2 goals conceded a game",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Ok_Asparagus_6163",
                    "body": "Failed his 'apprenticeship' when he got Burnley relegated👍",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "_90s_Nation_",
            "body": "This is just ridiculous\n\nConte, Jose, Poch, De Zerbi, Zidane, Allegri, Mourinho, Potter, Sam Allardyce are all available.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "TripleBuongiorno",
                    "body": "Sam Allardyce hahaha the madlad himself. One of my favorite coaches, such a character",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "CaptQuakers42",
                    "body": "Who is to say all of those coaches didn't already say no ?\n\nAnd some of them have come off equally as shite runs of form they just got sacked before relegation",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "schaapening",
            "body": "As meme-worthy as this seems now, I have a sneaking suspicion it’s going to actually work out incredibly well. That being said, if I were Kompany I’d take another Prem job instead, or just stay with Burnley for another year. Pep’s on his way out, and I can totally see them hiring Kompany as his replacement",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "bielsasballholder",
                    "body": "Lol like he's going to turn down Bayern to manage Burnley in the Championship.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "schaapening",
                            "body": "Is David Moyes’ reputation better off for managing Manchester United after a decade at Everton? Sometimes it’s better to stay where you are and wait it out for something else",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cydoniaking",
                    "body": "Knowing how well run City are I wouldn’t be surprised if they already know the next manager for when Pep decides to call it a day",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "EvenScientist7237",
            "body": "I feel like hiring managers based on their playing careers is so dumb.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "PatRice4Evra",
            "body": "That's him taking a big shit on Burnley. They've stuck with him all season despite relegation looking very obvious and terrible results because they were banking on him getting them straight back up.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "strraand",
                    "body": "I mean who can blame him if he leaves? Would be mad to turn down Bayern Munich for Championship football with Burnley",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PatRice4Evra",
                            "body": "I agree it's too big for him to turn down but it's just sad when the club showed so much faith in him he jumps ship at the first offer.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "No_Reference1439",
                                    "body": "It’s Bayern Munich man, it ain’t Nottingham Forest.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Taef1995",
                    "body": "I'm a Burnley fan and it's impossible to turn bayern down from Burnley what an awful take this is 🤣",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TakenByVultures",
                            "body": "Both can be true.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "KingArthursCodpiece",
            "body": "This is clearly either 1. Some kind of ridiculous joke 2. A massive distraction from something we aren't meant to see",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Significant-Summer-8",
            "body": "Oh dear. How the mighty have fallen",
            "score": 4
        },
        {
            "depth": 0,
            "author": "shotgun883",
            "body": "The ongoing conspiracy theory was that Burnley continued to play naive possession based football with players not up to it last season because Kompany wanted to ensure his personal footballing brand wasn’t harmed by playing pragmatic football. \n\nBravo Vincent. You sacrificed Burnley at the altar of your career and got a top 5 club in the world. Definitely worth it.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jwz401",
                    "body": "No way he did that, if not for Bayern he probably would’ve stayed. Maybe he was a little naive or too stubborn as I’ve seen him be at Anderlecht too.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "kt19o0",
            "body": "Imagine Kompany wasn't a big successful player. Do you think his management success to date would be enough to get the Bayern job? Absolutely not. Very odd choice.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "itsjustchat",
                    "body": "You could have said the same about Xabi and Arteta not that long ago",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kt19o0",
                            "body": "Arteta had at least played for arsenal so there was a connection and was the no.2 to the league's top manager. Xabi is a fair point but Kompany is getting one of the biggest jobs in the world. Bayer Leverkusen was a big job, but it's not like they're one of the top top European names",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "itsjustchat",
                                    "body": "Barca is one of the biggest jobs in Europe and xavi got that with little experience. \n\nZidane the same with Madrid.\n\nIf anything kompany has shown more than either of them.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "kt19o0",
                                            "body": "Again ex players, knew the club inside out. Yes the clubs took a punt on those guys with no real experience but Kompany actually has experience and it's not very good.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "itsjustchat",
                                                    "body": "It’s extremely good in context. You just don’t seem to be able to see that. We aren’t going to agree mate.\n\nI’m done with the back and forth. Good luck to you.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Yupadej",
                    "body": "Do you think Bayern players will have the same respect for a bum player with the same manager record. A big part of hiring former players who played at the highest level is that players respect them. Guys like Mourinho lose dressing rooms because players stop respecting him as soon as he stops winning. Players will never do that to a guy like Zidane. Non players will have to work twice as hard to earn respect in the dressing room.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "kt19o0",
                            "body": "Sorry I don't buy this, a lot of the top managers were average players. You telling me Klopp or Alex Ferguson didn't get respect?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Yupadej",
                                    "body": "They had to gradually earn it. They can't just walk into Real Madrid or Barca like Zidane and Pep did and command the dressing room.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Helluvawreck",
            "body": "I think he will surprise people.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "EngCraig",
                    "body": "I mean, it would be pretty difficult for anyone to underperform by any significant margin with that Bayern squad. Still, I’m fully expecting Kompany to be gone by February.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "markedasred",
                            "body": "I heard a lad whose opinion usually seemed sound on a Liverpool podcast I think it was say he thought there was something about Kompany that we should watch out for in future, I still don't get this at all. I think club data analysts see through the noise in a way we usually don't though. It will be an interesting watch. If he has a good year there, 115FC might grab him back, as Pep has insinuated it's his last year.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "EngCraig",
                                    "body": "I’ve not seen anything that would suggest he’s anything special. Richie Wellens had Oldham playing some very nice football back in 17/18 - he’s then moved from job to job and ended up at Leyton Orient. People don’t realise it is easy to play a nice style of football; it’s actually getting results and managing through bad moments that defines the great managers.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "imtiredokayq",
            "body": "I dont understand the hate on this. Kompany clearly doesn't have the resources at Burnley, he speaks german, plays football that would suit bayern well and has a reputation to players currently playing.\n\nSeems a logical choice, yeah hes limited but so is mourinho, give him the right team and hell shine.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "MindlessUnit1673",
                    "body": "Did you just put Kompany and Mourinho in the same sentence? What level of bullcrap comment is that",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "imtiredokayq",
                            "body": "In the way that its hard for them to adjust yeah. Would u disagree or did u see 2 names ,one of which u like and decide to comment without thought.\n\nMourinho has and always will park the bus.\nKompany has and always will try to play from the back.\n\nIn the way that they are mostly stuck to a single play style , they are comparable.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TakenByVultures",
                    "body": "It's not just that he didn't have the right calibre of players though. He managed the calibre of players he *did* have (which he scouted with his own company btw) pretty poorly, both from a man-management and tactical point of view.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "imtiredokayq",
                            "body": "He won the championship with the best point total or something didn't he? Because the players he had were the caliber in that league.\n\nNot a single Burnley player would make the bench in top 4 imo.\n\nHe only knows how to play one way and imo it'll fit the players and work for bayern. Hell be shit in the champions league tho.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TakenByVultures",
                                    "body": "Yes, he did - I sort of address it in more detail in another comment in this thread so I'll just link it here https://old.reddit.com/r/PremierLeague/comments/1cykhb8/bayern_munich_close_in_on_vincent_kompany_as_new/l5alkvj/\n\nMuric would easily make a top 4 btw. He has the best stats of any keeper in the league this season (and the best shot stopping percentage since De Gea in 2017-18).",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "imtiredokayq",
                                            "body": "Even if the goalkeeper could make it anywhere, i agree with u hes tactically inflexible, but possession based playing from the back football would work at bayern, and simply doesn't at Burnley in the prem because of the quality of players, and opposition.\n\nIm not saying hes going to become a great, but he'll do fine there and if they want a manager who will win the league and go out in quarter finals of cl, u might as well get kompany imo.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TakenByVultures",
                                                    "body": "I don't think he will \"do fine there\" to be honest. I don't think he'll last more than a season at most.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "imtiredokayq",
                                                            "body": "If he doesn't do it there he might as well quit.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "ThunderRoad_44",
            "body": "Does he speak German?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "TripleBuongiorno",
                    "body": "I mean yes he played in Hamburg for two years. It's probably a little rusty but then again most actual Germans will feel as though they have to relearn German when relocating in Bavaria",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "National-Ad-1314",
                    "body": "Given that dutch/flemish is his mother tongue and he lived in Germany already, say he speaks decent German.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "i_am_darkknight",
                    "body": "Yes.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DarayRaven",
            "body": "Relegation loading....",
            "score": 2
        },
        {
            "depth": 0,
            "author": "neil_1980",
            "body": "Vincent Kompany’s Bayern Munich just doesn’t have the same ring to it",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Fonzey200",
            "body": "Big brain tactics",
            "score": 2
        },
        {
            "depth": 0,
            "author": "SukhdevR34",
            "body": "How pathetic of a decision from Bayern. If you let go of an elite manager like tuchel you better have something special lined up. Not the most overrated manager in the world (said it before this season).",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "benificialart",
                    "body": "Kompany is a much better improvement over Tucheliban",
                    "score": -2
                }
            ]
        },
        {
            "depth": 0,
            "author": "A_EXAN_ER",
            "body": "For those who are confused on this - If you haven’t watched the Prime documentary about Burnley with him taking center stage, you should.  This guy duped the Mormon Church into backing him and over-sold himself to highly influential people within the community….. and came through on his initial target of promotion.\n\nThis guy could sell himself to anyone and might just be either a successful Hail Mary for Bayern, or it turns out that he’s a narcissistic sociopath that can gas-light anyone and everyone who he comes in contact with.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Baro_87",
                    "body": "Well I was confused, now I'm more confused",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "A_EXAN_ER",
                            "body": "Just watch it, or google the synopsis.  I would suggest the first couple episodes for background and Vince interviewing for the job and beginning to implement transfer and development strategies.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Baro_87",
                                    "body": "Alright, cool. I will",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Affectionate-Hunt217",
                    "body": "Mormon Church? In football?",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DigitialWitness",
                            "body": "Yes, they essentially own Burnley.",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "A_EXAN_ER",
                                    "body": "Not essentially… “ONE HUNDRED PERCENT” - Ale Moreno voice",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JaThatOneGooner",
                    "body": "That’s… huh.",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "TakenByVultures",
                    "body": "Kompany hardly features in the documentary, it doesn't show any of this at all. The documentary really focuses on our owner (Alan Pace) - and his faith is covered - but it doesn't show anything of him \"duping the Mormon church\".",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "A_EXAN_ER",
                            "body": "The first handful of episodes are background on the ownership and Vince’s initial involvement.  There are also many points where they rely their trust and money in his opinion and words.  Also, speaking about it being a financial statement to bring him on board.  Not to mention, given his lack of managerial experience he leans very far into areas where most managers are not given such concessions.\n\nAdditionally, He was placed in charge of massive financial investments from an institution that is widely known for segregating funds to fully immersed community groups/organizations only.  Nothing wrong with that from a spiritual or faith standpoint!  Living in the most densely Mormon populated area in the world I have first hand experience with close friends and family that are frankly shocked he was given this responsibility without being involved in the church.  Practically unheard of, especially when this area of Europe is a mere missionary location.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TakenByVultures",
                                    "body": "Perhaps club ownership were too naive/loyal in giving him the amount of trust and funds they did, but I wouldn't say he \"duped the Mormon church\". \n\nPace bought the club as a leveraged buyout with a downpayment in the region of £15M (club being worth north of £150M) - and used loans from MSP and player sales for the initial tranch of player purchases, so I don't think it's money straight from the church coffers.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "A_EXAN_ER",
                                            "body": "Look, the guy did what he said he was going to do on this occasion.  I’m not saying he is a vile human being, bad manager, or anything of the sort.  But, given the fact that he threw his lot in with Yaya Torre’s camp regarding racism claims against Pep, then slipped into the background and is no longer in that camp in order to gain managerial clout by association in his role being a leader at City during that time smells like unjustified suspicion.\n\nYou can derive where Alan’s financial situation got its’ roots in a fairly straight line. On another note, I can’t speak specifically to British tax law but they are similar.  As a non-profit institution (USA), any and all business investments and interests established in a 501c are closely tied to how this serves the common good of the entity. Even if it is just $1 into a $150M investment, the ROI, further revenues, and expenses must be accounted for and filed continuously by the listed entity. \n\nVince can sell himself, on a greater scale than most.  He is insanely well spoken, smart, and great at seeking to understand and predicting needs (Clearly stated in the documentary).  He did successfully gain promotion, so he did what he said he was going to do.  This why I said he can gain the trust of a segregated society on words, then back it up.  But, if he didn’t, he would have been over promising and under delivering on the dime of a 501c.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "TakenByVultures",
                                                    "body": "> You can derive where Alan’s financial situation got its’ roots in a fairly straight line. On another note, I can’t speak specifically to British tax law but they are similar. As a non-profit institution (USA), any and all business investments and interests established in a 501c are closely tied to how this serves the common good of the entity. Even if it is just $1 into a $150M investment, the ROI, further revenues, and expenses must be accounted for and filed continuously by the listed entity.\n\nThis might be true, but it doesn't relate to the financial situation of the club. The money the club was bought with and the money VK spent on players was not from the Mormon church. It was a leveraged buyout funded by player sales and external loans.\n\nYou are totally misrepresenting where VK got funds from. It was not from \"duping the Mormon church\".",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "A_EXAN_ER",
                                                            "body": "As a buyout, these would still have to be represented on how it best serves the common good of the entity. The entity not being the Football Club.\n\nYou seem to be hung up on the ‘duped’ phrase. Let me explain my opinion and thinking on this from what I have gathered by friends and family in the church.  He positioned himself in a loosely affiliated (if that sounds better to you) investment portfolio/fund of the Church for exposure and possible promotion.  This is unheard of and mostly frowned upon in the majority of evangelical circles without being fully affiliated with Church.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Familiar_Surprise485",
            "body": "Interesting..that's all I'll say",
            "score": 3
        },
        {
            "depth": 0,
            "author": "FarroFarro",
            "body": "Bayern still want Alonso and will probably go back in for him in a year. Everyone they have asked has turned them down because they would almost be an interim manager.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "havvkeye_",
            "body": "So many fucking armchair experts in every post about this. Give it a rest. Could work out brilliantly, he’s certainly better than Lampard",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "HowlingPhoenixx",
                    "body": "Being better than lampard is basically saying he is not better than 97% of managers.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "TheMemoman",
                            "body": "He’s in the top 97 percentile!\n\nHe must be a genius!\n/s",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Lucky_Town_5417",
                    "body": "He actually isn't. Burnley spent a lot of money to stay in the league. Yes they did ok in the 2nd half of the season but the first half was absolutely pathetic. Getting steamrolled almost every week, never even trying to defend. Kompany only did well in Anderlecht at Burnley he's just been Ok. \nLampard on the other hand took a Chelsea team with a transfer ban, having just lost Eden Hazard to a UCL spot. He also kept a really bad Everton team in the league.\nHe's not better than Lampard and even Lampard shouldn't be managing Bayern Fucking Munich",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Frequent-Cost2184",
                            "body": "Well Chelsea team with transfer ban was still miles stronger than Burnley team after summer spending that Kompany had, and we saw what he is capable of doing in the more favorable environment;Championship when Burnley weren’t miles stronger than the rest of the league but one of the strongest, even though when he arrived majority of the elderly players who had Prem experience were either sold or left cuz their contract expired.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Lucky_Town_5417",
                                    "body": "Lampard at Everton and at Chelsea could defend. He had a decent structure in his teams, yes he had experienced players but he actually made the choice to sign Tarkowski, Coady, Gueye and even Thiago Silva. Kompany could have very easily signed top championship quality players or experienced premier league talent but instead he wanted exciting foreign players. Apart from Berge and Redmond all his signings were inexperienced. He has shown nothing to prove he's better than Lampard",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "eggsbenedict17",
                    "body": "How is that certain, Lampard never got relegated",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "woziak99",
            "body": "When De Zerbie, Pochetino, Flick and Maybe ETH are all available you go for a guy that can’t cut it at the very top level.",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "quickdrawesome",
                    "body": "ETH cut it at the top?? 😂😂",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "woziak99",
                            "body": "He’s terrible but he knows Bayern and has managed their B team, plus he was hugely successful with Ajax what’s kompany done?",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "backchatter77",
                                    "body": "100 pts in championship",
                                    "score": 7,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "woziak99",
                                            "body": "And how many in the PL? \n\nThis is Bayern we are talking about ? \n\nIt’s a crazy appointment?\n\nHe is what 8th choice ?",
                                            "score": -4
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Just_Charge695",
            "body": "Lol people have no idea about Kompany's managing style, he was trying to play out from the back with Burnley and they would always make mistakes and get punished, Kompany would do better than Tuchel with Bayern that's for sure",
            "score": 2
        },
        {
            "depth": 0,
            "author": "innit122",
            "body": "I fully believe he was content with going down and that's why he bought youth and refused to change his play style, but the lack of flexibility is still insane. I believe he can thrive at a big club but this feels like a short term fix for Bayern",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Kikoska85",
            "body": "lol too funny good luck Bayern",
            "score": 2
        },
        {
            "depth": 0,
            "author": "surfinbear1990",
            "body": "I mean some one of his talents and vision is wasted on the Premier League. Few will appreciate what he was trying to do. Shame really.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "strangemanornot",
                    "body": "It was clear he was auditioning for a big gig at the expense of Burnley. Certain tactical changes could have saved them from relegation but Company was very insistent. I am not saying with certainty that they would have stayed up but the way they played pretty much guaranteed their chances of failure.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WesleyFRM",
                            "body": "Exactly. He used the club as a stepping stone. I dont think he had any intention of trying to keep them up. Their style of play wasnt sustainable in the prem but he kept at it anyway",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "surfinbear1990",
                            "body": "He's too good for the premier league",
                            "score": -1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Obvious-Awareness28",
            "body": "I watched some Burnley games this season and can understand why Bayern made this choice. The team showed a lot of promise but it was not successful in the end.\nHe deserves this chance and he will have to prove that it was the right choice made by Bayern, if not he will leave next season.\n\nSo much salt from Liverpool and Arsenal fans and it is because he is a man city legend and learned from Pep😂.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "tearsandpain84",
                    "body": "He got relegated, is Pep to blame ? In a way yes, it shows what happens when a manager doesn’t have the oil money backing him. Would pep and city get relegated without the oil money ? Yes they would, almost instantly.",
                    "score": -7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Obvious-Awareness28",
                            "body": "Maybe one day your team will also have a manager that learned from Pep and you will see how great it is. Until then, keep saying stupid shit bro.",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tearsandpain84",
                                    "body": "Once city get found guilty relegated Pep will be out the door and will deny all knowledge of ever managing city, he will blank all the city fans 😂😂😂😂😂 so sad",
                                    "score": -2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Obvious-Awareness28",
                                            "body": "Keep saying stupid shit bro😂 i have nothing else to add",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "tearsandpain84",
                                                    "body": "It’s all good bro. We are best friends now, friends forever ? Let’s holiday together? We can go clothes shopping ? maybe do charcoal sketches of one another ? It’s important that we don’t let another summer pass us by without filling it with memories of us being together x",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Obvious-Awareness28",
                                                            "body": "😂😂😂 I don’t think I can stand being around you for more than 10 minutes. Better luck next time bro",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "tearsandpain84",
                                                                    "body": "All I am asking is for you to think about it bro. We could divide those 10 minutes into 10 one minute segments ? that might work bro ?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Obvious-Awareness28",
                                                                            "body": "I will think about it only if you admit the hate for pep is simply because he is not your manager and if he was your manager you would 180 to saying he is the goat.",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "tearsandpain84",
                                                                                    "body": "Why not compromise and settle on rat ?",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "SnooHobbies7676",
            "body": "This is after all of those coaches that they approached rejected them",
            "score": 1
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "KingArthursCodpiece",
                    "body": "Well hello there sailor....",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "One_Imagination_8644",
            "body": "Such a risky decision, but it might work out",
            "score": 1
        },
        {
            "depth": 0,
            "author": "bielsasballholder",
            "body": "Chelski are also supposedly considering Maresca.\n\nFarke to Man U?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "robinvangreenwood",
            "body": "If i'm INEOS i'm going all out for kane this summer, give em 50 and get him in.",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Parking-Specific-259",
                    "body": "Why would Kane leave Bayern, even with Kompany as manager, to come to United? The literal only reason I could see would be his goal scoring record, because he certainly has a better chance at trophies in Germany.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "mtojay",
                    "body": "and if i am kane united is the last of the \"top\" clubs i would consider looking at. what makes united a better option for him than bayern atm. honest question. why united? how likely would titles be at united atm - or, whats more likely next season? a title with bayern or a  title with united?\n\nalso with bayern he has cl football promised every year basically. going to united means another year without cl - and in future years at least a question mark if the team will reach top 4.\n\nleaving for him makes no sense. he is at the club which offers him the best chances to win something right now. (from the clubs that might sign him - city and real are out of question - everything else is a \"step down\" in terms of chances for silverware)",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "ScottOld",
                    "body": "Man’s cursed though",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Glenlee92",
            "body": "Finally joining a big club",
            "score": -2
        }
    ]
}