{
    "title": "Poch interest in United",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InstructionOk9520",
            "body": "Poch is the guy who only dates crazy.",
            "score": 18
        },
        {
            "depth": 0,
            "author": "OneOrangeOwl",
            "body": "So he doesn't have a job and is interested in a potential opening… shocking news!",
            "score": 6
        },
        {
            "depth": 0,
            "author": "Gunnerpain98",
            "body": "He is on his Mourinho tour. Roma rubbing hands atm",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ecomalive",
            "body": "He flashed his knickers at them while at Spurs so wouldnt be surprised ",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Immediate_Wolf3802",
            "body": "It will be his 4th Premiership Club he's managed...he's doing a tour of the lot...but was he really that bad at Chelsea ?...hell don't rule out Poch managing Arsenal some day",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "tardguard123",
                    "body": "please do",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "city_city_city",
            "body": "NO. Don't do it, ten Hag is great, put this thought out of your head United!",
            "score": 10
        },
        {
            "depth": 0,
            "author": "Otter269",
            "body": "I wouldn't be surprised. At least the media would be nice to the manager for a while",
            "score": 2
        },
        {
            "depth": 0,
            "author": "Klutchcarbon",
            "body": "Here we go again",
            "score": 2
        },
        {
            "depth": 0,
            "author": "BigChumbuz",
            "body": "to fraud or to bald fraud?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BirdFit3785",
            "body": "It would be a shame if United sacked Ten Hag, we all know that the problem at this stage is not the manager anymore. Let INEOS rebuild the team.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dzenik23",
                    "body": "Rebuild starting with Ten Hag",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "GMD3S1GNS",
                    "body": "A lot of them are his players that he chose to sign, Antony, Onana, Mount, Casemiro etc",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BirdFit3785",
                            "body": "That is true, but that's why you only want a manager to manage the team. Get the technical directers and INEOS to make transfers.",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TexehCtpaxa",
            "body": "I’m fairly confident that even if they somehow win, ETH will be shown the door.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "TheStonedEdge",
                    "body": "He definitely will\n\nWith all the changes to the backroom staff since the takeover I think it's clear they'll be getting someone else once the final is over",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "junius83",
            "body": "I hope this never happens. Hes a Specialist in failure.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "river0f",
                    "body": "Bro, Ten Hag is even more shit than Pochettino, and he's bald too.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "GMD3S1GNS",
                            "body": "Yeah I’ve been begging United to hire Poch for the past few years after Ole left",
                            "score": 2
                        },
                        {
                            "depth": 2,
                            "author": "junius83",
                            "body": "Ohh dont get me wrong, ten haag shouldn't have been gone from october imo.",
                            "score": -1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "xtrasour37",
                    "body": "He finished above United",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Titan4days",
            "body": "Honestly, if there was one team this season that were as shambolic as us it was Chelsea, I would be fucking dismayed if we want to poch..",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "shaunomegane",
                    "body": "Go for Fat Sam then you entitled piece of mustard. ",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Titan4days",
                            "body": "😂 very good man",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "GMD3S1GNS",
                    "body": "Poch is a great manager, the fact he got that unstable club to 6th place speaks volumes. Also managed to implement an exciting style of play that he’s gotten right at every job he’s been in",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Titan4days",
                            "body": "He had way better players than we’ve got and was mid table pretty much all season, a few results at the end and oh he’s a great manager.. we should of beaten them twice this season and we are shite, he’s had a midfield of caicedo, enzo and Gallagher all season basically, plus a absolute baller in palmer.. if he’d had our squad this season we’d of been 15th",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "monkeybawz",
                    "body": "Could be worse.... You could be linked with boehley.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "himynameisnothenry",
                            "body": "I dunno, at least not losing money to interest payment would be a bonus",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "monkeybawz",
                                    "body": "Tbh, it's how things are done. Your debt is high, but not out of hand. You are rich enough to comfortable service it as is, and to make plans to bring it down (or raise it tbh. Your credit is good.) Unless your goal in using national wealth, and the ethical and moral issues that inevitably come with that, why let it bother you?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "himynameisnothenry",
                                            "body": "If I'm a Glazer I don't mind it lol, but look the money lost could've been used somewhere else no? Like fixing the run down stadium facilities even Ronaldo was shocked no improvements in 10 years...",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "monkeybawz",
                                                    "body": "You aren't wrong. But even if there was no debt, would the glazers have sorted that? I doubt it. I'm sure that JR will be all over it this summer to stop the embarrassing bits in the short term, and get to work on proper infrastructure projects in the med/long term.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Titan4days",
                            "body": "I would probably swap you the glazers for Boehley, he does get his wallet out after all",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "monkeybawz",
                                    "body": "He's the front, not the bank.\n\nEven if he came with all the money he's the worst combination you can have as an owner- he's hands on and totally out of his depth.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Mangolassi83",
            "body": "He’s still living off of his Spurs days. Even then he let Leicester win the league. He’s not as good as people think he is.",
            "score": -3
        },
        {
            "depth": 0,
            "author": "Altruistic_Poetry_51",
            "body": "United should have got him years ago, post OGS. I think he could be the man to turn it around. Obviously we know the problems are not with the manager at United though.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "shaunomegane",
            "body": "I know you may not have thought of this.\n\n\nBut Jose is free. United never thought of him as a stopgap? \n\n\nI mean, that Jim fella paid 2 billion to be manager for a year, so, why not get Jose in for a jot?\n\n\nWhat harm could it do?",
            "score": -1
        },
        {
            "depth": 0,
            "author": "imsoyluz",
            "body": "Dude's coaching all big 6 in this lifetime 😂",
            "score": 0
        }
    ]
}