{
    "title": "Is Chelsea's ownership undermining the manager's authority?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Dapper_Platform_1222",
            "body": "Yes.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "biff444444",
            "body": "Does the sun rise in the east?",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "Richardthe3rdleg",
                    "body": "Does the EPL look the other way on the 115 violations?  😅",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "HugeAd5723",
                    "body": "Yes. Depending on where you live and how your planet rotates. Our fellow aliens have been watching the sun differently from us.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "macula8",
            "body": "My word… I am shocked",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "CaptainJingles",
                    "body": "Chelsea certainly has no history of such a thing",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "lewishamilton08",
                    "body": "Shocked Villa finished 4th yes, small club hasn’t been relevant since the 80’s",
                    "score": -11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "macula8",
                            "body": "Bwahaha.  Good one.  Who did you support before Abramovich arrived.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lewishamilton08",
                                    "body": "I have and always will support Chelsea. I was born 4 miles away from Stamford Bridge… I support my local!",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "macula8",
                                            "body": "So… He owned the club when you were born then?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "lewishamilton08",
                                                    "body": "You want me a black person from North West London to support Villa? Never 👍🏾 fuck Birmingham and anyone who reps it",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "macula8",
                                                            "body": "Who the fuck wants you to support Villa. You seem like a miserable fuck. Support whoever you want.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Generic-Name237",
                            "body": "Bit rich coming from a fan of a club that was never, ever relevant until they were bought by a Russian mobster. Villa’s got 10x more history than your lot.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lewishamilton08",
                                    "body": "Were we not relevant when we smoked you and put you in a pack back in the day?",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Generic-Name237",
            "body": "Does the Pope shit in his hat?",
            "score": 20
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "Chelsea manager won’t have any authority, they don’t want a manager, they want a coach.",
            "score": 7,
            "replies": [
                {
                    "depth": 1,
                    "author": "fa_football",
                    "body": "I mean the two terms get thrown around interchangeably anyway",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Visionary_Socialist",
            "body": "Chelsea will never go for a Tuchel or a Mourinho again. They especially now want a person who’ll coach and do nothing else.\n\nUnfortunately all the great managers these days are assertive and don’t like being sandbagged. Doesn’t mean they don’t trust others, they just need to believe in the structure to do so. \n\nThat’s why we’ve heard the names we’ve heard. Lower tier managers who don’t have the rep or the experience to stare down the owners.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mba1956",
                    "body": "It wouldn’t be so bad if the owners and sporting directors were experienced in football and had already achieved footballing success. However this lot are just a bunch of useless cowboys with no real interest in the team other than making them a profit when they can sell the club on.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "BrownEyesWhiteScarf",
            "body": "Chelsea is not looking for a manager, but a “head coach”. The title is very misleading.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "GroundbreakingCow775",
            "body": "This could have been a post stamp instead of an article",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "fa_football",
                    "body": "I mean the article carries a more thorough discussion so I thought to attach it. Plus, it's where I got the idea so it was only right I suppose.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Miliktheman",
            "body": "What manager?",
            "score": 4
        },
        {
            "depth": 0,
            "author": "scoot2006",
            "body": "Is that a real question? Look at what The Athletic said (grain of salt but I agree in this case): [Chelsea want a manager who does not dictate strategy or make demands](https://chelsea.news/2024/05/athletic-chelsea-want-a-head-coach-who-does-not-dictate-strategy-or-make-demands/).\n\nWhat a joke. I’d have “mutually” agreed to leave, too.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "Riespieces16",
                    "body": "Tbf the athletic is a joke of a publication 😂",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "scoot2006",
                            "body": "Even a blind squirrel finds a nut every once in a while.\n\nI don’t disagree, but they hit it pretty spot on with the way I’ve felt about how Chelsea is run for a while.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "editedxi",
            "body": "Chelsea manager has authority? You new here?",
            "score": 7
        },
        {
            "depth": 0,
            "author": "Blueshockeylover",
            "body": "Put “why” at the start and you have an accurate headline.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "fa_football",
            "body": "This is a very interesting discussion to be had considering the recent report - outlined in the article. For me, it's all well and good to have sporting directors to plan and carry the long term vision of the club. I also think it's okay for them to have a major influence on recruitment decisions. But there needs to be a balance on where their authority stops.\n\nFor me it is that once they identify a suitable manager that they think is appropriate, they should allow the manager the freedom to make their decisions. However, Chelsea is moving into a system that involves the sporting directors so much even in the day to day activities of the manager including training and tactics.\n\nWhich I personally think is absolutely ridiculous. Because at that point, the manager isn't really given any space to think or challenge the norm set out by the hierarchy. And he is forced to produce results in that system which might not even be the right way.\n\nAnd in the end, who takes the blame? The manager.\n\nI don't think the owners are right for enforcing such a sporting director-centric approach where they get to even dictate decisions that the manager should take.\n\nThey're going to create an environment that top coaches will not enjoy - thereby dissuading them from joining Chelsea. Anyway, it doesn't look like Chelsea want an 'elite' coach as they are looking for someone 'progressive'.\n\nThat's what I think at least. Let me know what you all think.",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Capital_Werewolf_788",
                    "body": "Finally an article that actually tried to discuss the real issue, which is the more “progressive” organisational structure that the ownership is trying to implement. \n\nWhat they are trying to introduce is a structure that is more compartmentalised and collaborative across departments and levels (main team to youth setup). What this means is that various personnel will come together on a wide variety of issues to give their input, but ultimately the responsibility for the final say will fall to the relevant “compartment”. \n\nFor example, when discussing squad building, the football directors, manager, recruitment team, managers of different youth levels, etc will come together to discuss the state of the current team, and plan transfers and departures. The beauty of it is that this collaborative approach does not just emphasise the needs the first team, but considers it from the perspective of the entire organisation. It might perhaps seek to fill a positional gap in the youth teams, or perhaps discuss the tactics of the youth setup to align with the first team, etc. Basically, ownership is trying to build a baseball organisation in football. Football might be becoming more compartmentalised with positions like director of football becoming more common, but it’s still a far cry from the way baseball orgs are run, where you have pitching and bullpen coaches, hitting coaches, base coaches. Compare that to how Poch was pushing back on the idea if a set-piece coach.\n\nSo this is the vision that ownership had for Chelsea. In this structure, the role of manager is afforded a lot less control than traditionally given to a manager, but are expected to be involved in a greater operational breadth and provide input. As you might expect, this more “progressive” job scope might not be acceptable to many managers in the industry. That’s likely why Chelsea are looking to hire young managers - 1. For longevity, 2. Likely greater willingness to adapt to the club system compared to veteran managers.\n\nUnlike the various speculations that people put forth to explain the departure of Tuchel and Poch, I strongly believe that the true reason is simply a misalignment of philosophy regarding how the organisation is run, which is exactly the reason given by the club, but for some reason doubted and ignored by fans. Tuchel was likely not willing to involve himself in the operations of the organisation, only willing to take on the responsibilities of a first team coach and only any tasks relevant to that role. And I don’t know which aspect of the team structure Poch is against, but my guess would be the way Chelsea wants to compartmentalise, especially with recruitment and coaching, seeing how he did not want a set-piece coach to begin with. Questions might be asked as to why Chelsea hired Poch to begin with if this misalignment exists. It is a fair question, and I am not going to pretend I know the answer. It could be that we needed a manager and Poch was the best available at the time, and now that better candidates we like are available, we mutually part ways to pursue those candidates. Or perhaps Poch did not fully understand what working in the organisation’s structure entailed until he was actually here. Hard to tell.\n\nNow there are various critiques that can be levelled on Chelsea. On a more macro level, there are huge question marks over whether the baseball system is fully transferrable, especially when it comes to recruitment. Baseball recruitment is very organisation-centric, but there just aren’t that many player moulds in baseball, and while the tactics and strategy are deceptively nuanced to the unfamiliar, it’s not the same as in football where the lack of certain types of player could break a particular style. So there is an argument here that in terms of recruitment, you might want it to be a little more manager-centric. Remember that in this structure, the manager is involved in the recruitment discussion, but does not have the final say. I would also criticise the failure to bring in a couple of experienced players this season the ease the transition into a young squad. I fully understand the transfer policy of the team and do think it’s a good idea. After all, players tend to mature by their mid 20s, so you buy up these talents in their early 20s that will mature to become the core of the team in 2 years time (think Enzo, Caicedo, Jackson, Palmer), then you buy up these 16-18 year olds to form the next generation (think Paez, Estevao). However the team could have used a few veterans to guide the team through this phase.\n\nUltimately, i do agree with the direction of the tram and the structure being set up. I think a more collaborative and compartmentalised structure like in baseball is going to be more effective in the long run for the continued success of the club, but it is essential that this structure is being sufficiently adapted to the football context.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Headlesshorsman02",
            "body": "They want a coach not a manager. In other words they want someone who has no say on transfers and just coaches the team",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "fa_football",
                    "body": "But the point is that the new manager's freedom to coach how they want is even compromised with the recent reports",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "McQueensbury",
                    "body": "Tbf this is how Liverpool will set up under Slot, he'll be there just to coach the team. Richard Hughes the sporting director is in charge of transfers, ins, outs and contracts and much more. This is how a lot of clubs around Europe operate",
                    "score": 2
                },
                {
                    "depth": 1,
                    "author": "Impeachcordial",
                    "body": "Because they've done such a sterling job with transfers so far (to be fair selling Mount and buying Palmer at a profit was genius and Caicedo is starting to look seriously good)",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Headlesshorsman02",
                            "body": "I didn’t say I agreed with it but they just want a puppet really",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Impeachcordial",
                                    "body": "Nah I know, aimed at the board not you!",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Nice_Rush_1462",
            "body": "Not looking for a manager, just a coach then ? Long may it continue !",
            "score": 3
        },
        {
            "depth": 0,
            "author": "GMD3S1GNS",
            "body": "Why don’t they get big Sam in the dugout next season, will sort them out defensively and create a no nonsense culture at the club",
            "score": 4
        },
        {
            "depth": 0,
            "author": "eclectic_boogaloo2",
            "body": "Chelsea will be the first club to hire an AI manager",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Spirited_Poem_2366",
            "body": "Honestly, I would've expected this from a club with a history of not giving time to coaches and sacking them at the first slip-up, but good ol' Chelsea? Astounding",
            "score": 5
        },
        {
            "depth": 0,
            "author": "New_Brother_1595",
            "body": "An American owner flying Chelsea into the ground is great stuff",
            "score": 6
        },
        {
            "depth": 0,
            "author": "writemcsean",
            "body": "I hate the mobile experience of that website - ads before legibility…. \n\nCould not get through the article or understand what point they are trying to make… can you summarize here OP?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fa_football",
                    "body": "Yeah the ads are frustrating. In my comment I have provided a very brief summary mixed with my opinion as well. To be fair, it's hard to summarize without providing full context that is provided in the article. I'd say it's still worth a look despite the ads.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "writemcsean",
                            "body": "OK Read it on my laptop - I found the article a bit vague and at the same time hyperbolic.\n\nLike 2 of the 3 pages seem to be reacting to a tweet  \"Mauricio Pochettino’s successor will have to accept the authority of the board and sporting directors, with a control that could even stretch into elements of on-pitch coaching\" \n\nTo me - this is the way the game is moving - marginal gains from specialists - the Athletic did a piece with the substitution specialist - was an awesome listen.  \n\nThe guy approached a problem, and thought maybe there's another way than what has always been done... I'm all for that. Here's a youtube video of the same guy being interviewed. I think most top clubs are adopting his \"finisher\" methodology [https://www.youtube.com/watch?v=ysEbioz4qnw](https://www.youtube.com/watch?v=ysEbioz4qnw)\n\n  \nI view our set piece specialist in a similar vein. I doubt the set piece guy will be dictating exactly what corner routine is run when. It also sounds like he will also have some involvement with Cobham - I think that's smart too - make our amazing academy products better at set pieces.  \n\n  \nIn a way it was similar under Roman, if a Manager with a lot of control wanted to play a certain way, and we did not win - they gone pretty fast.  Roman had his guys that he fell in love with - strikers mostly, and Managers were kind of stuck playing Shevchenko and Torres...  \n\nEmanalo assembled the dream young team, and we all lament in hindsight that they gave into Mourinho power and shifted out KDB and Salah. Marina was always buying for the loan Army (remember the 2017 transfer window!), plenty of our Managers were stuck with Frankenstein squads... just another example of the authority of boards of the past.\n\n  \nEmbrace change.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "nothighandmighty",
            "body": "Lmao",
            "score": 2
        },
        {
            "depth": 0,
            "author": "peoplepersonmanguy",
            "body": "You should check how organizational charts work though.\n\nBoehly wants to hire a manager to be a coach.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "fa_football",
                    "body": "Yeah but the reports suggest that the sporting directors could even potentially have a say in the coaching aspect. Regardless of the title which gets used around interchangeably, what matters i suppose is that a coach will have lesser freedom in his own job.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "The_prawn_king",
                            "body": "My guess is those sound bites are bigging up a mixture of the set piece specialist hire and the vague idea of building a team to play a certain way. These are things many other top clubs are doing. It just makes for a good sound bite because it makes Chelsea’s owners sound dumb, which maybe they are but not necessarily for that reason.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hammerheadhunter",
            "body": "yeah maybs",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Dry-Double-6845",
            "body": "Most certainly. Who would want to be a manager and just have no say in players you want? Imagine Guardiola. Yeah right. ",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "OneOrangeOwl",
                    "body": "Lots of people on here don't think managers have any say on players, it’s the director of football to handle personnel. I think they look at manager as head coach.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dry-Double-6845",
                            "body": "Guardiola has a LARGE amount of say. The director of football talks with Pep over transfers.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OneOrangeOwl",
                                    "body": "In a way, director of football works for the manager to help build the team the manager wants. Some said the manager only gets to say what kind of player profile he wants and it's up to the DOF to find and sign the players. That doesn't make any sense to me.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "WooNoto",
            "body": "Chelsea is looking for someone who can take directions. Useless owners",
            "score": 1
        },
        {
            "depth": 0,
            "author": "StandardConnect",
            "body": "If we gave Poch full control we'd have Viega, Ugarte and Ward Prowse while Palmer will be at Brighton.\n\nPeople who still think managers should get full control on transfers in 2024 need to get with the times, we've done a lot wrong under the new ownership so far but refusing to let Poch turn us into a rugby side isn't one of them.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Makav3lli",
                    "body": "Just the British fighting tooth and nail to keep managers while pretty much every country has moved to a sporting director-head coach setup",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mba1956",
                            "body": "The problem is that this group of sporting directors have made mistake after mistake.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Bigwhtdckn8",
                            "body": "Tell me which clubs in the EPL have British managers,  owners, and DoFs?\n\nWhat a weird statement about one of the most internationally diverse communities.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Makav3lli",
                                    "body": "I’m talking the British football culture… obviously those within the game want to move towards that model. It’s the fans, journalists and tv pundits who can’t seem to get with the times. As evidenced by this thread…",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Showmethepathplease",
                            "body": "Just some casual xenophobia \n\nNice ",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "RazielNet",
            "body": "The Chelsea model really seems bemusing. Do they really intend to challenge at the top? In the era of City you require the whole club to be aligned on that as it's motivating focus so... clearly that's not the goal\n\nDo they want to be a \"rich man's\" Brighton (hilarious thought given the Seagull's financial situation as a result of all this). If that were the case then Europa league is the best place to be - young players need game time and space to grow into game ownership without the pressures of title chasing/CL football. It's no coincidence Kane and Saka burst through in the Europa league first\n\nWas Poch ever going to challenge for a title? Probably not but the owners aren't operating the club to that goal either",
            "score": 1
        },
        {
            "depth": 0,
            "author": "d3vilm4n60",
            "body": "Todd is a control freak. He seems shady and which might bring EPL down.",
            "score": -3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Headlesshorsman02",
                    "body": "It’s Egbalhi that is the control freak Todd barely does anything anymore",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DejisHairline",
                            "body": "Todd gets all the slander because his name actually sounds American lol",
                            "score": 5,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "InstructionOk9520",
                                    "body": "Must be one of the dumbest sounding names ever.  I have never met a Todd who was a likeable person.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Kezmangotagoal",
                                            "body": "I’ve never even met anyone called Todd - they just exist in TV land for me!",
                                            "score": 3
                                        },
                                        {
                                            "depth": 4,
                                            "author": "toadphoney",
                                            "body": "This is fact. Todds are always wankers. See also: Trent. Which is like a diet Todd or Sugar Free Todd.",
                                            "score": 2,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "The_prawn_king",
                                                    "body": "One of the nicest guys I’ve ever met was called Todd",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "toadphoney",
                                                            "body": "Nice try Todd.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "The_prawn_king",
                                                                    "body": "Whatever toad!",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Kezmangotagoal",
                    "body": "Todd Boehly is the front mate, he’s a scapegoat - Egbalhi is literally the puppet master, he’s one making all these ridiculous decisions.",
                    "score": 7
                },
                {
                    "depth": 1,
                    "author": "fa_football",
                    "body": "Honestly he's a face of the ownership consortium. Doesn't necessarily mean that he's calling all the shots.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "MissTimed",
                    "body": "Todd signs the checks, nothing more.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "SnooPies3316",
            "body": "Good luck to Poch finding a big club that gives him control over long term transfer strategy.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BreakSad8773",
                    "body": "Bit of a difference between wtf has happened at Chelsea - and most other big clubs.",
                    "score": 1
                }
            ]
        }
    ]
}