{
    "title": "Phil Foden: Pep Guardiola leaving Manchester City will be \"really sad\", says midfielder",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ScottOld",
            "body": "No it won’t",
            "score": 1
        },
        {
            "depth": 0,
            "author": "DejisHairline",
            "body": "[*me when Pep leaves*](https://youtu.be/_I4Ge_alkSg?si=B4xu4KxV4Cj9swFO)",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "MasterReindeer",
                    "body": "[Me when Pep leaves](https://www.youtube.com/watch?v=jzge_j-_PME)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Patient-Cap-4004",
            "body": "For him 😏",
            "score": 1
        },
        {
            "depth": 0,
            "author": "QuaLiTy131",
            "body": "Really sad but not for me",
            "score": 1
        },
        {
            "depth": 0,
            "author": "PutYrDukesUp",
            "body": "For him maybe, but not for the league.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Tater-Tottenham",
            "body": "Pep is the canary in the coal mine, he'll be gone when the hammer is about to fall.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Busy_Bunch5050",
                    "body": "Very true",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Traditional_Carrot_3",
                    "body": "he won't rule until his cows come home to hatch in a basket",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Happy-Ad8767",
                            "body": "Once in a full spoon, I like things, like this post.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Efficient-Job9077",
                    "body": "This is an unbelievably clumsy sentence. A hammer is going to fall on a canary? The canary doesn’t get out of the coal mine safe, if it dies then the miners know it’s not safe. It’s sacrificial, the opposite of what you’re trying to convey here. I don’t know if you could’ve started off any worse with the canary reference and now there’s a hammer involved. \n\nThis is why Tottenham never win anything",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Panenka7",
                            "body": ">now there’s a hammer involved\n\nNailed it.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Appropriate_Elk_6113",
                            "body": "Let's be pedantic, canary in a coal mine as an analogy just means something that gives an early warning of danger or failure. The death bit isn't part of the analogy, it extends to anything that signals danger through a sensitivity to adverse conditions, you dont have to die.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "itsjustchat",
                                    "body": "You would be right if the next sentence wasn’t “he will be gone when the hammer is about to fall”",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Ok_Enthusiasm_300",
                                            "body": "Oof. Thats what made his sentence right to begin with..",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "itsjustchat",
                                                    "body": "Explain how please.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Ok_Enthusiasm_300",
                                                            "body": "He was saying that pep leaving will be a hint that punishment is about to come for city. I really don’t understand what’s confusing about that",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "itsjustchat",
                                                                    "body": "A canary dies first. It doesn’t leave first.\n\n“Will be gone When the hammer is about to fall”\n\nIs literally the opposite of what a canary does. One of those phrases alone could have been used and made sense in this context(barely). Both together highlight how wrong each statement is. If that makes sense.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Ok_Enthusiasm_300",
                                                                            "body": "You realize the canary doesn’t normally die? It sings and freaks out to let the miners know. \n\nYou’re really really over thinking this. That expression is used nearly daily in the same exact situation as OP used it.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "oldfashionedcookout",
                                                                                    "body": "Nah the canary died, the sign of danger was the bird stopped chirping",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Ok_Enthusiasm_300",
                                                                                            "body": "Again, as someone who has been in a mining area their whole life that’s not true. While often times yes the canary died, it would start freaking out when levels got dangerous. They don’t wait for the canary to die to realize that they should be leaving.",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                },
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "itsjustchat",
                                                                                    "body": "Not together. \n\nI literally just said it could have made sense alone even though it’s technically not applicable. But together they highlight how wrong both are.\n\nNo one uses them together like that. That’s what makes it clumsy.",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Ok_Enthusiasm_300",
                                                                                            "body": "When the hammer is about to drop\nMeans almost exactly the same thing. It means shits about to get real, don’t over think man.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "itsjustchat",
                                                                                                    "body": "I’m not. The person said it was clumsy which it is.\n\nYou might disagree with me. That’s fine. I agree with that bloke. Using them both together highlights how they do not apply in this case.\n\nWe often use phrases like that when they don’t technically apply to the circumstances. \n\nThat’s true.\n\nWe don’t use multiple at the same time that all don’t technically apply because as in this case. It highlights how wrong it is and makes the sentence appear clumsy. \n\nThat’s all I’m saying. I’m only explaining it because you don’t seem to get why I’m talking about this beyond “don’t over think it”",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "Ok_Enthusiasm_300",
                                                                                                            "body": "The hammer dropping is what the canary in the coal\nMine would be theoretically singing about.",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "Appropriate_Elk_6113",
                                            "body": "Why? \"When the hammer falls\" is an analogy for *when an auctioneer finally adjudges an article to a buyer.* So Pep leaving because Foden is about to be sold makes sense, especially as presumably Pep would be one of the first to know about an impeding sale.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "itsjustchat",
                                                    "body": "What you talking about Foden being sold for? \n\nThat’s not what the comment was about….",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Turbulent-Ad6504",
                            "body": "| This is why Tottenham never win anything\n\nYou call someone out for their poor use of idioms, and then immediately follow it up with straw man argument to belittle their team. What a class act you are.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "finn4life",
                                    "body": "This whole thread is hilarious",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Al_C_Oholic",
                                            "body": "Leave it to redditors to argue over the most benign shit in the world when it’s pretty damn clear what OP meant. ",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "InfinityEternity17",
            "body": "Speak for yourself Phil",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ChrisinOrangeCounty",
            "body": "Out before the charges come in, a good move.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Elliotjpearson",
            "body": "Speak for yourself lad",
            "score": 1
        },
        {
            "depth": 0,
            "author": "WinterRespect1579",
            "body": "115%",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "duk-phat",
                    "body": "Av a free one for that 😁",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Key_Information_6786",
                    "body": "wouldn’t that be quite ironic from the Chelsea fan 😂 you’re welcome for giving you your best player",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "WildBandito",
                            "body": "Great bants. Better get one more ucl before it all comes crashing down.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "misterriz",
            "body": "Asterisk FC",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "sheeplamb",
                    "body": "At least we have trophies to asterisk",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Adrasos",
                            "body": "'At least we have trophies to show for our cheating' isn't quite the boon you think it is.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Moving4Motion",
                            "body": "Trophies from UAE oil buying the league and cheating. We all hate your club.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Radiant_Pudding5133",
                            "body": "It’s hilarious how all these people that brag about City and refer to them as “we” are yanks who started supporting City when they started winning every year. Couldn’t find Manchester on a map",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "sheeplamb",
                                    "body": "Ok man, your officially banished to only watching football and only being able to support the team in the city you were born.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Radiant_Pudding5133",
                                            "body": "Country would be a good start. The point is bragging about the team you chose to support winning, *because* they’re winning, is laughable",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "ibridoangelico",
                                                    "body": "what team do you support? You do realize the PL would be nothing like it is now without its international reach",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Radiant_Pudding5133",
                                                            "body": "Don’t care if people want to “support” a foreign team.\n\nChoosing to “support” the team 3000 miles away that has won 6 out of 7 of the last league titles then bragging about it however just makes you look like a bellend",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "ibridoangelico",
                                                                    "body": "What team do you support? lol\n\nalso this type of logic is always inconsistent",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "left-nostril",
                                                    "body": "How about you use apps and phones only made in your country? \n\n\nBut you right.\n\nLet’s all go support some other club, and when you lose money and your club gets porked every year in Europe, you can cry then.\n\nP.s. the PL was started BECAUSE Spain was smacking PL teams for fun and buying the best talent. They (including supporters) WANTED bigger reach…\n\nBut that’s cool. Only support clubs and such from our country.\n\nThough, I do wonder, you’re probably into American movies and music. I can almost guarantee it (you’ll say no to save face but we know you’re lying).\nWonder if you’ll stop supporting anything from other nations.\n\nHell, let’s go further! No more vacationing elsewhere my friend, do it in your own country! Stop flocking to California every summer like Brit’s love doing. Go to whales. \n\n\nSee? Sounds stupid; eh?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Radiant_Pudding5133",
                                                            "body": "Wow all that waffle and yet nothing you said is of any pertinence to my comment. Incredible.\n\nWhat do apps, phones, music and movies have to do with football clubs?\n\n>>whales\n\nThe large marine mammal?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "left-nostril",
                                                                    "body": "It is of any pertinence to your comment. It’s called globalization, you absolute dingle berry. \n\nYou enjoy American everything. We enjoy watching and supporting a club from the UK. \n\nTalk about waffle, your brain is just as much an equivalent of one.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "sheeplamb",
                                                    "body": "I’ve been supporting city before they ever won a premier league trophy. The closest professional team in my country is 2,700km from where I live. Sorry that when I grew up the premier league was on cable all the time fuck me for supporting a team for 15+ years",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Radiant_Pudding5133",
                                                            "body": "Haha. It’s truly astonishing how many lucky Americans on Reddit decided to start supporting City *just* before they were bought out by a gulf state. What a remarkable coincidence.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "sheeplamb",
                                                                    "body": "As a 12 year old I wasn’t giving too much of a fuck nor did I even know what was going on. All my friends supported the traditional “top 6” teams sorry I didn’t bandwagon onto arsenal or united at the time",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Major_Smudges",
                                                                            "body": "Literally no one in this sub believes you started ‘supporting’ Man City before they started winning. No one.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "sheeplamb",
                                                                                    "body": "Crazy how much I don’t care 😂",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "foggin_estandards2",
                                                                                            "body": "Just like us about your tainted \"titles\"",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "sheeplamb",
                                                                                                    "body": "“Your” thank you for affirming my city fan hood",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "foggin_estandards2",
                                                                                                            "body": "I don't think you understand. We're not disputing you being a fan of City. We're disputing the bullshit period that you say you started supporting City...",
                                                                                                            "score": 1,
                                                                                                            "replies": [
                                                                                                                {
                                                                                                                    "depth": 13,
                                                                                                                    "author": "sheeplamb",
                                                                                                                    "body": "Ya you’re right, I started in 2023. The treble win really cemented my allegiance to the club. Cmon citeh",
                                                                                                                    "score": 1
                                                                                                                }
                                                                                                            ]
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "tommyduk",
            "body": "Is this news? Who gives a fuck,?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jarv1223",
                    "body": "City and their oil money amirite",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheGrouchyGamerYT",
            "body": "Won't be watching, Phil.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "davlar4",
            "body": "What a scoop of an article this is eh",
            "score": 1
        },
        {
            "depth": 0,
            "author": "SculpX",
            "body": "Lol, if that will make you sad, then the number 115 will make you feel horrible then 😏",
            "score": 1
        },
        {
            "depth": 0,
            "author": "fifadex",
            "body": "Especially for Foden, same as Trent, when you've only known one manager for so long during your development, no loans out, just a guy that from your point of view plucked you from the academy and developed you in to a first team player for club and country.\n\nNo doubt all the players will be gutted but most of them had multiple managers, some of them had more than one at city.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "bemirlino-",
                    "body": "I sound very unbelievable, but (if im not stupid) the only current city player who is not a Guariola singing is KDB",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Invincible-spirit",
                            "body": "Nah I think you’re right",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "fifadex",
                            "body": "You're probably right mate, wasn't sure about stones and Silva.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "bemirlino-",
                                    "body": "Both Guariola singings.\nSilva was signed right after he destroyed city with monaco lol",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "fifadex",
                                            "body": "Obviously a great move, the guys been amazing pretty much every year lol",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "D-biggest-dick-here",
                                                    "body": "The same time Liverpool signed Fabinho from that same team",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "DestructoSpin7",
                            "body": "Even this is arguable. There were rumours that kdb was signed with pep in mind, and others that he specifically picked him for city.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Thierry_Bergkamp",
                                    "body": "its really not arguable he still played for another manager so his point stands",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "outdatedelementz",
            "body": "Cute couple.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "attilathetwat",
            "body": "The scene in their stadium celebrating their title win when it was half empty was actually depressing. Can’t believe it was real and wondered if it was an AI fake.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Werenotreallyhere86",
                    "body": "How deluded are you 🤣",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Wrong_Biscotti1576",
                            "body": "How deluded are YOU?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Fableside",
                            "body": "Even the fans know their achievements mean nothing with all the blatant cheating. The stadium attendance just proved Trent right with his 'it means more' comment.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "blowinghotstinkygas",
                            "body": "It’s called the Emptyhad for a reason lol.  City have 0 fans \n\nBeen an exciting past 2 years for you, huh?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Key_Information_6786",
                                    "body": "isn’t it embarrassing then? a club with no fans supposedly better than a club that sells out? are Chelsea so bad that they only care about selling tickets now 😂",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BuyGreenSellRed",
            "body": "No one will care.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChelseaPIFshares",
                    "body": "lol we are all waiting on pep to leave so another club can win the league with less than 90 points.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "sillyyun",
                    "body": "I’ll care, he was an amazing manager and ill be glad to see him leave our league alome",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Key_Information_6786",
                    "body": "cared enough to comment, always will be better than Klopp",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "flowella",
            "body": "Struggling to give AF",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sensitiveCube",
            "body": "It's not happening, so why even discuss it?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Rorviver",
                    "body": "Pep himself said its more likely than not that he will leave next summer",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Haigadeavafuck",
                            "body": "Pep also only got really into coaching bc then he could lie to the press all day",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Anjumi96",
                    "body": "Cause everyone lost interest in the fact they won the league again as soon as it happened. 115 btw",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Comfortable_Rip_3842",
            "body": "Newsworthy",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BugsyMaYone",
            "body": "Who cares",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Ar_Ma",
            "body": "Yes, very sad. Anyways..",
            "score": 1
        },
        {
            "depth": 0,
            "author": "kosicepp2",
            "body": "We'll all cry 115 times...",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Hag_bolder",
            "body": "yeah everyone in the UK will be absolutely gutted",
            "score": 1
        },
        {
            "depth": 0,
            "author": "red122063",
            "body": "No one really cares anymore, good job city u can win with an unlimited budget but you killed a lot of neutral viewers in the process. When you did the treble, I had 0 emotion or care to it compared to United in 99.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Styrofoamman123",
                    "body": "When Liverpool was up for the quad a few seasons back I was absolutely dreading the thought of losing uniteds prestige as the only treble winning English team, to the scousers (and a quad to boot). When city won it last season, that rivalry wasn't there, idc about it, there's still one legit treble.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "blowinghotstinkygas",
                    "body": "Agreed.  English football is dogshit now.  Farmers league to the max",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Key_Information_6786",
                            "body": "maybe other teams with a lot of money *AHEM CHELSEA* should do better",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Single-Weather1379",
                    "body": "Cry",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "red122063",
                            "body": "You can’t even come up with a proper response, your best response is “cry”. Shows how much you know",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "thegoat83",
                    "body": "Oh no 😱",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Shouldjustlurk",
            "body": "Looks like a wedding photo look at how happy Phil is getting kissed on the cheek by pep. Adorbs!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Many-Gear-4668",
                    "body": "Adorbs? Wtf",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TezRoll",
            "body": "No one outside of city will bat an eyelid",
            "score": 1
        },
        {
            "depth": 0,
            "author": "CraigDM34",
            "body": "Ah well.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "xLolo7",
            "body": "wow",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Britori0",
            "body": "Why is he leaving? Did the 115 charges stick?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "inadverthonaho",
                    "body": "why did Klopp leave after 9 years? thought it meant more to him",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Bishcop3267",
                    "body": "He just means when he leaves",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ChefJoeyW",
                            "body": "Rent free",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Bishcop3267",
                                    "body": "What? I just though he misunderstood the quote and thought Pep was leaving right now",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Nole_Based",
                            "body": "Soon",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "braggerweevil",
            "body": "Yea man it will be huge news. Just like when they won the treble, people were talking about it for...oh...wait...but when they won their 4th league in a row the place went cra...oh maybe not. Oh damn it looks like literally nobody outside of Abu Dhabi FC cares. Now that is indeed sad.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Small-External4419",
                    "body": "Person who doesn’t care writes comments about how much they don’t care",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "braggerweevil",
                            "body": "Not caring about an achievement doesn't mean you don't think about it or are not allowed to comment on it. Not caring in this context means most fans don't value that achievement",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "OptimisticRealist__",
                    "body": "\"I care so little about City winning, that i write my 10th reddit post of the day explaining how little i care about City winning\"",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lego-105",
                            "body": "I think it’s more that it’s a minor irritant to everyone else and lacks weight to city supporters.\n\nAnother problem is it isn’t the tenth post about how little everyone cares about city winning, it’s a week of people having a moan about city winning and then nobody cares. Like nobody is bothered about any win other than the CL for the last 3 years and another, but people still talk about Leicester and Liverpool, so yeah, I think people don’t care so much any more.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OptimisticRealist__",
                                    "body": "Bro, people have been crying about City winning the league literally 4 mins into the season when Haaland scored Citys first goal. \n\nLike go back to game threads and youll see people perpetually moaning and bitching all year long.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Lego-105",
                                            "body": "In the season, sure. My whole point is that people stop caring a week after the season ends.\n\nBut even besides that, I was there the first game Haaland played and scored his hattrick. I just sort of accepted it and stopped caring because obviously City win the title if he does actually perform like we expected, and they did, because obviously they do. It takes a lot out of the value of it when that’s the case. Look at Bayern, it’s like yeah they won, OK. That’s just not the case in the other wins that’ve been there in the past decade. Even this season, people didn’t take Arsenal seriously as a title contender.\n\nGenuinely, people have just stopped caring beyond a moan, because obviously they win the league, so it just starts to matter less to people.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "OptimisticRealist__",
                                                    "body": "Just pointing out that, for a team that supposedly nobody cares about, there sure is a LOT of fans from other teams who talk about City year in, year out and cry about their success.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Lego-105",
                                                            "body": "I think it’s more nuanced than the literal “I don’t care”. I think it’s more that the title to almost everyone holds less weight because it’s already assumed at the start of the season that obviously they’re gonna win it again. That irritates people.\n\nSo I think when they complain, it’s more complaining about not being able to care about the title because City just win it again and it makes it even more annoying because the team in that position don’t have a genuine supporter base outside the city.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Exotic_Term6884",
                    "body": "'Nobody cares about 115 city winning 5 times in a row but ... (Insert 1000 words).\n\nMan City Fans - 'Another league win. Sweet. Glad everyone else is still shit!!' \n\nTypo - *4 not 5. I got a year ahead of myself there.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "tyresemaxeystan",
                    "body": "Lol you are hurt",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "drc203",
                            "body": "Regardless whether he is hurt or not, he’s 100% right",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "braggerweevil",
                                    "body": "He's right, I am hurt. I grew up watching football constantly, always catching match of the day, football focus, listened to all the podcasts. Don't do any of that now and often entirely miss matches because this fake club has just made it all so boring and removed any jeopardy. Enjoy your lols and your meaningless trophies, I feel sorry for long-term man city fans as their club has also been taken from them",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "D-biggest-dick-here",
                                            "body": "Just like the Americans have taken your club away from you? There are only 4 epl clubs that are English owned",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Happy-Ad8767",
                                                    "body": "Manchester City are just two words, in name only.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "D-biggest-dick-here",
                                                            "body": "Also known as Boobs Town.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "bobbieibboe",
                                            "body": "But it was OK when Liverpool won 9 / 13 titles in the late 70's & 80's and the 3 in a row?\n\nAlso, if you love football so much why are you at home watching Football Focus instead of being out on your way to watch actual live football in the flesh?",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DreadedViking18",
            "body": "Not for anyone else really. There is zero emotion at that club. The club just continues to buy wins and it’s getting boring for most. TV ratings proved that in the last game of the season.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Aggravating_Tell_757",
                    "body": "Buy wins yet Chelsea spent 1 billion in the past two years. Buy wins yet Manchester United does the same thing but fails every time. Buy wins yet that's literally one of the only true ways to even come close to winning the title. Truth is you need a good manager and ownership to actually win titles. Spending money to win titles has been the norm for awhile now",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "amandafan69",
                    "body": "When arsenal goes to West Ham, purchases their academy product for 100m and smacks them 6-0 at their ground, that wasn’t a bought win? Like i get it having a problem with city allegedly cheating FFP, but the concept of buying the league is the biggest virtue signaling in the sport, since the 2000s football has been a capitalist machine where big clubs muscle small clubs, you can moan about city all you want but even if the club gets relegated to the national league the issues with football will remain the same and fans will just cope with same big clubs winning everything because “they earned the money” like a billionaire “worked hard” for his money and deserves another mansion *winks*.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "FizzyLightEx",
            "body": "He can't leave soon enough. Made a mockery of the PL",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Unfair-Reference5500",
                    "body": "This is wrong take.. First of all the problem steams from this false narrative that EPL was ever competitive. It was always contested by the same 3-4 clubs going back more then 2 dacedes now. If you want competitive league go watch the Brazilian league or J-League then you will get the definition of competitive league. If you wanna know what the Brazilian league is like as an example it is like Nottingham Forest who just avoided relegation can win the league next season it honestly just shows the Brazilian league is trash and not strong which is the opposite of what you searching for..\n\nBut the truth is forcing a fake comeptitiveness goes against sportsmanship and meritocracy itself. Every team plays the beautiful game to win and reach perfection if not nobody would have played the game hence eventually always few teams will reach the level of perfection and ethablish a dynasty and just because Man City has ethablished a dynasty doesn´t mean a mockery of the league it just means one team reached perfection meaning they reached their goal.\n\nIf you looking for fake competitiveness you shouldn´t watch the great game because what you are saying in directly is someone should throw the games.\n\nIf nobody is allowed to excel then what is the point of playing football at all is the question that needs to be asked?\n\nIt is like the food chain someone eventually comes on top and you can´t change that no matter what example in Boxing, Tennis, NBA, NFL etc etc someone always comes on top of the food chain. Perfection, excellence and peak levels should be celebrated that is the true spirit of sport",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dorkseid1687",
                            "body": "Why do you talk to people like that ?",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "monkeybawz",
                            "body": "It's not excelling when it's built on fraud. It's actually an insult to those that excel while abiding by the rules.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Unfair-Reference5500",
                                    "body": "I don´t see how these charges are relevant to the in field successes of Manchester city. Also Manchester city ethablishing a dynasty doesn´t do damage but more positive as it forces everyone else to up the level to catch them. Football dynasties aren´t bad it just means someone has reached excellence doesn´t take anything away from the others",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "monkeybawz",
                                            "body": "Dynasties aren't bad. \n\nKnowingly breaching the rules you have agreed to abide by, serially, habitually and for years that allows you to build said dynasty and then asking for credit as one of the greats? \n\nThat's a no for me dawg. Man city's \"dynasty\" is nothing more than a set of medals and experiences they have stolen from other clubs and fans. They weren't playing premier league football. They were playing something else with different rules they invented on the fly.\n\nSo, in retrospect they are nothing but a team of cheats that happened to finish 1st a few years, and if there is justice in the world will have these \"achievements\" stripped and will be expelled from the league. It has all the credibility of my save-scummed footy manager teams.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Unfair-Reference5500",
                                                    "body": "Hahahaha. This comment cracked me up big time. You seemed to have a rather very extreme view and this is extremism. Are you a Liverpool fan? I am of the opinion that all this charges are mostly just fugazi in order to discredit Manchester city´s hard earned legacy.\n\nBut looking at your extreme take it is impossible to reach you bro.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "monkeybawz",
                                                            "body": "It is extreme. Because man city are extremely big cheats.\n\nAnyhoo, you are obvs just trolling.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "D-biggest-dick-here",
            "body": "Based on what City rival fans say, it wouldn’t  matter if he leaves or stays…it’s the money that makes him win 🤷‍♂️",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Loifee",
                    "body": "Same with what they say about Haaland, its just so easy to score all those goals for City, anyone can do it, absolutely brain dead opinions",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "D-biggest-dick-here",
                            "body": "Exactly…football fans come up with the most reductive statements you can ever find online",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CaptQuakers42",
            "body": "Fuck me this sub is such a fucking childish cess pit",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Itsgosky",
                    "body": "Indeed horrid",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "kaiderson",
            "body": "No one will miss him like Klopp. It'll just be like 3rd story of the day probably behind Wayne Rooney returning to manage Everton or something",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "inadverthonaho",
                    "body": "Every city post on reddit is full of haters. I am almost certain people will care what underwear Pep wears at this point",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "comradekaled",
                            "body": "They're probably picturing Pep wearing a sexy sky blue thong underneath his suit",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "D-biggest-dick-here",
                    "body": "It’s easy for rivals to love someone who wasn’t dominant",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Happy-Ad8767",
                            "body": "And yet, Sir Alex Ferguson is both hated and revered.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "D-biggest-dick-here",
                                    "body": "Hated because he was dominant, revered for the same reason",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Happy-Ad8767",
                                            "body": "Pep won't be revered the same. And his legacy will be tainted when you're found guilty, a bit like how the Barcelona Ref Bribes have already tainted his legacy, but on a far greated scale.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "[deleted]",
                                                    "body": "[deleted]",
                                                    "score": 1
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Britz10",
                                                    "body": "Ferguson pretty much destroyed man utd on his own and it's hardly hurt his reputation.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Happy-Ad8767",
                                                            "body": "You able to walk me through your workings for that?",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Britz10",
                                                                    "body": "Basically leveraged his status to get the previous owners out the club because he felt like he was being short changed by them over a racehorse, Rock of Gibraltar. Then left Moyes with a mess to take over down the line",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "D-biggest-dick-here",
                                                    "body": "If you think the bribe allegations that haven’t been proven have tainted his legacy, you should think again. He’s been the most respected manager amongst the pros for a long time now. Fans, as usual, let bias get in the way of being objective. And how will charges about finances taint his legacy? Did he fix matches? Is Ancelotti’s legacy tainted just because Madrid had that money to blow?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Happy-Ad8767",
                                                            "body": "Ancelotti hasn’t been the manager of a cheating club. Twice.\n\nNot everybody thinks the sun shines out of Guardiola’s backside like you do.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "kaiderson",
                            "body": "LoL, copium at its finest",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Loifee",
                            "body": "Success breeds contempt",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "krizkuzz",
            "body": "Too bad, Phil",
            "score": 1
        },
        {
            "depth": 0,
            "author": "its_Preshh",
            "body": "EPL fans here disagree with you. They claim Pep is nothing special, that he's just a chequebook manager and anyone can do what Pep has done...\n\nSince there's no difference if Pep leaves or not, I hope Pep signs a 10 years contract renewal",
            "score": 1
        },
        {
            "depth": 0,
            "author": "FameMoon17",
            "body": "No it won't",
            "score": 1
        },
        {
            "depth": 0,
            "author": "OptimisticRealist__",
            "body": "Pep is a football genius, imo the best coach ever, and we are lucky to live in a time where we can see him coach.\n\nThis man city team is truly a joy to watch and its a tactical symphony. The PL will definetely suffer a great loss when he decides to leave. Even if you dont want to admit it",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jip_Jaap_Stam",
                    "body": "City are a great team, and Pep is an excellent coach, but they are not at all entertaining to watch. Very little flair, constant tiki-taka, the same type of goal scored over and over again. Highly efficient yet dull as fuck.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "themanebeat",
                    "body": ">This man city team is truly a joy to watch\n\nIs it though? His Barcelona team surely was, but City bore me to death",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Shameless_Bullshiter",
                            "body": "Hard agree, most boring dead football with no drama or excitement",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "OptimisticRealist__",
                                    "body": "Just for clarification: are you blaming City for teams parking the bus against them?\n\nTactically, its fascinating to watch them",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Brandaman",
                                            "body": "Do teams park the bus against them? Every time I watch them the teams look like they’ve given up before they’ve even started. Forest and “big six” teams probably the only recent exception",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "OptimisticRealist__",
                                                    "body": "Teams park the bus. West Ham played 5 in the back and, at times, 4 in front so they were basically playing almost 9 people in/close to their own box at some point.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Balbuto",
                    "body": "Since they cheated with their money they have players they shouldn’t have been able to afford, therefor their team is illegitimate and their achievements are worthless. There’s no joy in watching a team that shouldn’t be.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DreadedViking18",
                    "body": "Pep is a good manager, but it’s not hard to look good when you can just buy whoever you want. The team are good enough to manage themselves, he is just an ornament",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "OptimisticRealist__",
                            "body": "That is one of the laziest and at the same time most football iq deprived takes that keeps being made every year, despite sooooo many examples to the contrary, that money and players dont guarantee success",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Many-Gear-4668",
                                    "body": "See ten hag at man united for reference ….",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "OptimisticRealist__",
                                            "body": "Tata Martino with prime MSN...",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "DreadedViking18",
                                    "body": "Yet they have bought the best in the world and they have had success, so many times. In fact 4 titles in a row I might add. When you have the most money of any team in the world you have more push and sway than others and the results are 4 titles. I’m not saying Pep isn’t good but it’s a lot easier to look good when you have the best at your finger tips. Let’s see Pep go to Fulham with their roster and get the same job done. Zero chance",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "OptimisticRealist__",
                                            "body": "Yes, Tata Martino famously went on a legendary run of success with prime MSN, David Moyes famously was successful at ManU, Poch was famously successful at Chelsea after spending 1bn, ETH is famously successful at ManU....\n\n>Let’s see Pep go to Fulham with their roster and get the same job done. Zero chance\n\nI bet youre the type of guy who says Messi isnt one of the greatest players ever, because he didnt lead FC Vaduz to a CL trophy",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "DreadedViking18",
                                                    "body": "Nah I’m pretty sure Messi’s record speaks for itself. That has zero to do with managers or Pep for that matter so I’ll try and steer this back in the right direction. Facts are fact dude, they have a better roster than every other team in the world and they keep winning at every level/cup in the world also. It’s all leaning their way for a reason, more money. As I said Pep is good, great Infact but let’s see him work wonders without billions on hand and then I’ll give him credit. Even Klopp who won less has a lot more respect than Pep on and off the field. Alonso just won his first total and is talked about more than the bloke who won 4 in a row",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "OptimisticRealist__",
                                                            "body": "Either you are completely new to football or youre just intellectually lost if you genuinely think teams would take Alonso over Pep, if both were available.\n\nBut sure, i get it, the dude who won a treble in his first year of coaching pros is actually super overrated and clueless, which is why all the teams who wanted him actually know nothing about football; all the countless players who have praised him know less about football than u/dreadedviking18, obviously.... /s\n\nI admire the confidence with which you fire off your painfully terrible takes tho, truly, its inspiring.",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "DreadedViking18",
                                                                    "body": "Again you have read this and spun it your way. I never said Alonso would be chosen over Pep I said he is more talked about and you know why but because you have a hard on for Pep it won’t let you say it. I have no doubt He is a great manager with the support of all his players, but again as I’ve said countless times, who is the last team he took top that weren’t suppose to. When did he take the underdog team to the top. When did he take a team with half or a quarter the budget of Man City to the top of the league or to a cup final. When he does that then he will be a champion manager, until then he will always be a good manager of a great team not the other way around. Prove me wrong",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "OptimisticRealist__",
                                                                            "body": "So.... by your absent logic the best manager in the history of the game is somehow supposed to go to a team with a bad infrastructure, no money to improve the squad and a bad squad to begin with?\n\nYes, because that makes all the sense in the world. As we all know the big companies just love hiring incompetent fucks while the most qualified candidates all famously take on mininum wage jobs. Thats how the world works \n\nBut, to answer your question: you might want to look further into his time at barca where he took an underperforming barca, got rid of the biggest stars on his first day, played some unknown youth players and went on to win the treble in his first year of coaching in the big leagues.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "DreadedViking18",
                                                                                    "body": "So his Barca record shows how good he is yet his Man City record just shows that if you buy the best you with everything. \nAnd yes the best managers in history have proven themselves by taken the underperforming and lower ranked and pushing them to heights not seen before. Klopp is a good example of that, came to an underperforming team, bought well (not the best on the market) but players he felt would gel in his system and won trophies. And albeit on 1 PL title (one which you guy refuse to recognise because it was the Covid year) but they will build a statue of him out front if Anfield. That shows the stature of a man and a manager. More people watched Klopp’s farewell than Man City win the title, why is that????\nGet back in your box",
                                                                                    "score": 1
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "ibridoangelico",
                                                    "body": ">I bet youre the type of guy who says Messi isnt one of the greatest players ever, because he didnt lead FC Vaduz to a CL trophy\n\n\nNo, no one says this. You know why? Because the whole crux of the argument makes no sense, and its only ever used disingenuously or from people who know nothing about football, or from people who hate Pep/City and are trying to cope any way they can.\n\n\nNo use arguing with that guy lol.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "morocco3001",
                            "body": "Why didn't Bayern just win the league then? Are they stupid?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DreadedViking18",
                                    "body": "Because they have an average team and they got beat by a real Manager, one that took a lesser playing group and turned them into champions, that’s the definition of a good manager. You’re proving my point",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "BruhBruhBruh-123",
            "body": "Womp womp",
            "score": 1
        },
        {
            "depth": 0,
            "author": "archiesnow",
            "body": "Who is he?",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RogerFederer4",
            "body": "Disagree",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sharppi",
            "body": "That's a hard no from me.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "ToroQtze",
            "body": "All this salt !! 😩💀😂",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Saelaird",
            "body": "Yawn... \n\nPep couldn't manage any side who can't buy success. I'm not impressed. He's the most overrated coach I've ever seen.\n\nGive him a league 2 side and see how he goes.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "mankiwsmom",
                    "body": "1) Other GOAT-level managers have given him his flowers, so I’ll listen to them. \n\n2) He’s not gonna coach a shit side, he gets recruited from the “biggest” and best clubs. It’s also not just buying success— other clubs spend a ton, he’s demonstrably improved players, some of whom are now considered GOATs in their position (Busquets, Messi) \n\n3) Pep has said in the past that he might do worse than other managers with worse teams, but that if you give him the budget, he’ll be more dominant than other coaches. I think City’s era before and after Pep is evidence for that.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "blowinghotstinkygas",
                            "body": "Not really moron.  They won in 2012 with Mancini.  Sean Dyche could win the Prem with unlimited funds and blatant cheating",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "yosawa0210",
                                    "body": "Right, and that’s why your team of unlimited funds is doing so well right now.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LMinggg",
            "body": "Said the most overrated player of the season",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "a2godsey",
                    "body": "Worst take of all time",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "ElectroEU",
                    "body": "Not the main taker of any set pieces and scored 19 with 8 assists in just the prem but is overrated 🤣🤣",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Shings12",
                    "body": "Probably should have been Rodri but Phil is a close second. Not that overrated.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MilkTankSue",
            "body": "Foden's gonna be sad because without Pep, he'll be exposed as the overhyped footballer he is.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Loop_Within_A_Loop",
                    "body": "Certified hater, certified doesn’t watch ball opinion\n\nFoden is great, it takes like 5 minutes to figure that out",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Nels8192",
                            "body": "Seriously overestimating how good a 5mins snapshot of an England game will look in a few weeks. Suddenly Bellingham will look like he’s back at Birmingham too.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "MilkTankSue",
                            "body": "🎣",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "itsjustchat",
                                    "body": "Hilarious banter mate….",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MilkTankSue",
                                            "body": "🤫",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "itsjustchat",
                                                    "body": "You edited your comment and removed this emote 🎣\n\nHilarious you ninja edit your comment then try to pretend my comment doesn’t make sense.\n\nAre you 12 years old mate?",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MilkTankSue",
                                                            "body": "It's still there, honeybunch. I can do it again just for you 🎣",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "itsjustchat",
                                                                    "body": "Oh my god you re-edited both comments what a freak you are 😂\n\nIt’s only Reddit mate. Downvotes don’t mean anything. Get over it.",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "MilkTankSue",
                                                                            "body": "Why do you assume I did it cos of downvotes? My original comment slagging Foden is still up with -17. I would have deleted it if I cared. Use ur head, sweetie.",
                                                                            "score": 1,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "itsjustchat",
                                                                                    "body": "Why are you editing multiple comments then? And re editing them? \n\nWhat purpose other than you want people who read this in the future to think you didn’t do anything to be mocked?",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "MilkTankSue",
                                                                                            "body": "Where was the mocking again? Also, if I was scared of other people seeing my comments, I would delete them full stop or not comment at all.",
                                                                                            "score": 1,
                                                                                            "replies": [
                                                                                                {
                                                                                                    "depth": 11,
                                                                                                    "author": "itsjustchat",
                                                                                                    "body": "Ninja editing comments the way you have done in this thread is honestly a pathetic behaviour unless you are a child.\n\nThen it makes sense. \n\nEither way. It’s been fun. All the best.",
                                                                                                    "score": 1,
                                                                                                    "replies": [
                                                                                                        {
                                                                                                            "depth": 12,
                                                                                                            "author": "MilkTankSue",
                                                                                                            "body": "Pathetic behaviour? I turned 🎣 into 🤫 then back to 🎣. \n\nI appreciate your passionate views on my use of emojis, thank you for caring so much 💜",
                                                                                                            "score": 1
                                                                                                        }
                                                                                                    ]
                                                                                                }
                                                                                            ]
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Shigney",
                                                    "body": "The banter is you're a weeaboo loving, love island watching united fan.",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "MilkTankSue",
                                                            "body": "I'm flattered that you took time to look at my profile ❤️\n\nAlso, trying to shame people's interests? Top quality banter 👏",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "pillowpotatoes",
                    "body": "He was good before pep lmao.\n\n19 PL goals in 35 games for a midfielder is top tier no matter how you slice it.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MilkTankSue",
                            "body": "🤫",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Cowboy_on_fire",
                            "body": "No pens and a good amount from outside the box too, couple that with his assists and it’s definitely top tier.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "ocean_boulevard",
                            "body": "Ghosted in the 2 friendlies against Belgium and Brazil this year, guess what was different?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "pillowpotatoes",
                                    "body": "Half the England team must be bums then.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "ocean_boulevard",
                                            "body": "Correct",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        }
    ]
}