{
    "title": "How was Lookman in Everton?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "National-Ad6166",
            "body": "You should be asking Fulham and Leicester fans. They had him at a better age and with more game time",
            "score": 26,
            "replies": [
                {
                    "depth": 1,
                    "author": "Yikes-Yak",
                    "body": "One of our massive bright sparks in a poor season (along with Andersen). He was a class above most other players but was unfairly remembered for a failed Panenka against WHU. He was inconsistent at times, but showed the potential to do what he did yesterday. \n\nScott Parker is a football criminal as our relegation cost us Lookman, Andersen, Areola, and Anguissa. He played bang average winger Cavaleiro up top instead of Mitro, which says it all really. Should never get a top flight managerial role ever again.",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DangerousAd3347",
                            "body": "If you do a panenka for a crucial pen and fail you know it’s not something people will just forget the next day. Was his decision to take the risk",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "CaptainJingles",
            "body": "He was good when he played for Fulham, single handedly won us a match or two.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Jubatus750",
                    "body": "Also lost you a game when he tried to be too cocky with that penalty, I can't remember who it was against",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "HocusDiplodocus",
            "body": "After winning the u20 world cup with England I expected him to kick on and become a star, but its taken him a while to reach his prime. Always looked so good on the ball but something was missing, confidence possibly, but really happy to see him live up to his potential.",
            "score": 14,
            "replies": [
                {
                    "depth": 1,
                    "author": "desvenne",
                    "body": "From what I read here in a Belgian article, he’s apparently only started really training at pro level at 16 (before that was amateur), and they state that he was missing a lot of stuff that he should’ve been taught at an earlier age that he was still learning when he jumped from the championship to the premier League. It was an interesting read, but it’s in Dutch, apologies/ Source: [https://sporza.be/nl/2024/05/23/opgeleid-in-amateurvoetbal-gelanceerd-door-belgische-ontdekker-het-verhaal-van-hattrickheld-ademola-lookman\\~1716455938546/](https://sporza.be/nl/2024/05/23/opgeleid-in-amateurvoetbal-gelanceerd-door-belgische-ontdekker-het-verhaal-van-hattrickheld-ademola-lookman~1716455938546/)",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "GaelicInQueens",
            "body": "I saw him play for Charlton against Leeds years ago and thought he looked very special, cool to see him doing so well at the highest level.",
            "score": 12
        },
        {
            "depth": 0,
            "author": "vngannxx",
            "body": "Look man, sometimes it doesn’t work out",
            "score": 31,
            "replies": [
                {
                    "depth": 1,
                    "author": "sensitiveCube",
                    "body": "Sometimes it isn't meant to be",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jack070293",
            "body": "Impressed me whenever I watched him, I was confused why he didn’t get more playing time.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "chino17",
                    "body": "Because he was really inconsistent but he was also young and Everton's style at the time just didn't seem to suit him",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "ColdConstruction2986",
                    "body": "I think some players just peak a little later on in their careers. He's probably benefitted by not playing in England as well.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "meatpardle",
            "body": "Skilful with potential but was inconsistent, which is what you’d expect from a youngster. He seemed to get impatient at not playing more, we had shit managers who played defensively and didn’t trust him.",
            "score": 9,
            "replies": [
                {
                    "depth": 1,
                    "author": "WonderfulBlackberry9",
                    "body": "First time I saw him was January 2017 when Ronald Koeman’s Everton beat Guardiola’s City 4-0 (wow).  He slotted past Bravo for the fourth. It’s always a nice surprise to see him here and there since then.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DangerousAd3347",
            "body": "Looked promising as a youngster, showed flashes of brilliance but couldn’t really do it consistently",
            "score": 1
        },
        {
            "depth": 0,
            "author": "roadsodaa",
            "body": "He was alright. Didn’t set the world alight, but at the same time he was 18 or 19 and just came from league 1. I think a loan spell in the championship would have done him good, but we had bigger issues at the time.",
            "score": 8,
            "replies": [
                {
                    "depth": 1,
                    "author": "Darth_Socrates",
                    "body": "Think he played under Koeman & Allardyce. Two managers that didn’t rate young players nor played very attacking either.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "roadsodaa",
                            "body": "Yeah it weren’t an ideal time to be breaking in to our team.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "MayLikeCats",
            "body": "Look, man….",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "ChargeWooden1036",
                    "body": "I can’t, I’m Blind Daley",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DiscardedKebab",
                            "body": "Do you want to borrow my glasses? Don't worry, theyll fit, one size Fitz Hall",
                            "score": 6
                        },
                        {
                            "depth": 2,
                            "author": "MayLikeCats",
                            "body": "Points!!",
                            "score": 0
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "innit122",
            "body": "Lookman, he wasn't great",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "tamim1991",
                    "body": "Lookman, that was a long time ago, give it a rest will ya",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "TheGrimReefah",
            "body": "Isn’t he the kid that did that stupid penalty for Fulham and missed?",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Callum1710",
                    "body": "That's the one",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "sandbagger45",
                    "body": "This is my first thought when I hear his name.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "JeanMichelFerri",
            "body": "Everton suffered heavily from having so many different managers with so many varying styles of play. Plus he was young and generally young players need a steady platform to build into. He would have likely flourished under a Martinez or Silva if they and he were given more time.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "tamim1991",
            "body": "He made life hell for us when we played against Fulham a few years back",
            "score": 1
        },
        {
            "depth": 0,
            "author": "losdelacosta",
            "body": "Mate it’s Everton. Prime Messi could play there and they would have him play terrorist football",
            "score": 30,
            "replies": [
                {
                    "depth": 1,
                    "author": "QCtarheel",
                    "body": "You clearly only watched Everton the last few years. Under Moyes and early Martinez years as well as the Ancelotti years, Everton played some great football. We had some fun attacking teams with Lukaku, Mirallas, deulofeu and prime Coleman and Baines pushing up the field",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SpectacularNelson",
                            "body": "Moyes teams playing great football is something I never expected to hear😂😂",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Prokletnost",
            "body": "we about to splash $120m for him only to find he is trash, just like he was at everton",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "DigitialWitness",
                    "body": "Yea the problem is Lookman, not your car crash of a club.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Prokletnost",
                            "body": "Watch your fkn mouth",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DigitialWitness",
                                    "body": "Why, what you gonna do, pay me £300k a week to hand out school meals and miss sitters?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Prokletnost",
                                            "body": "Don't you dare...",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "throwaway014210",
                                                    "body": "Yeah! How dare he talk about Manchester’s 2nd best club like that!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Prokletnost",
                                                            "body": "The audacity, take that back!",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "throwaway014210",
                                                                    "body": "Dude, is this your kink?",
                                                                    "score": 1,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Prokletnost",
                                                                            "body": "Come on, you're ruining the fucking mood now! I was so close...",
                                                                            "score": 1
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "macaleaven",
                                                    "body": "He’s made you look like a right mug!",
                                                    "score": 1,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Prokletnost",
                                                            "body": "Oof he did.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Cleveland_Grackle",
                    "body": "It wouldn't be the first time United haven't done their due diligence.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "simwe985",
            "body": "Was ‘the one that got away’ for Leicester. Our first RW with potential for years. Most of the fanbase is quite heartbroken we didn’t sign him, and look at him now.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "RandomRedditor_1916",
            "body": "Ass.\n\nGood that he had a good game though",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Due_Toe6417",
            "body": "Always had the talent jus not every player can adapt to the prem well theres always been players like that",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Double-Deal-849",
            "body": "Everton fan here. He showed massive potential but he was the definition of hot and cold when he was younger. The problem was he cost a few quid from Charlton, I think 11 million. So he came in young with an inflated ego which never left him. I believe he left due to lack of game time  which I guess made sense but his attitude didn't merit game time at that point. Some player now though",
            "score": 3
        },
        {
            "depth": 0,
            "author": "hammersandhammers",
            "body": "Top Championship player, not consistent enough for the prem.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Marcos_Narcos",
            "body": "He was amazing at Charlton Athletic",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Acrylic_Starshine",
            "body": "I remember him against us when he was at Fulham and he was banging. Then again didnt take much and was the only real spark they had on the pitch.",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Different-Thanks-431",
            "body": "He wasn't really that good in his everton spell, balled a little bit in fulham. The thing is just that not every player will work out for a particular club/league.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "sandbagger45",
            "body": "I don’t even remember him playing for Everton. That should be an indication.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Toffeeman_1878",
            "body": "Scored a goal on his debut (I think) when Everton beat Pep’s City 4-0 (Pep’s heaviest defeat). But he was very young and inconsistent. The constant change of managers and instability at the club couldn’t have helped him.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Adventurous-Bit-3829",
            "body": "Isn't he like really this good only this match? Saw Atalanta fan said he not usually this good",
            "score": 4,
            "replies": [
                {
                    "depth": 1,
                    "author": "Fluid-Selection4378",
                    "body": "He just had one of the greatest ever performances in a European final last night. The only players who are regularly that good are Messi, Pele, Maradona, CR7, R9 etc.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Synopsis_101",
                    "body": "He’s been great for the past two seasons",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "DoireK",
                    "body": "On commentary I thought I heard them say he was their top scorer last year. Although he obviously isn't that good every much otherwise he would be a prime Messi/Ronaldo tier of player.",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "SadAd5184",
                            "body": "Silly comment. A Messi Ronaldo tier is at the very top with very few other players. There are multiple tiers with plenty of top class players below the Messi /Ronaldo rarefied space. ",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "DoireK",
                                    "body": "It was an elite one off performance. If you can't grasp the context of that then that is a you issue.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Hush-Jay",
            "body": "He was good but inconsistent. You could see the raw talent, but somehow, he never lived up to it in the Premier League. I'd love to see him try again because he looked so good yesterday and and in some other games I've watched him this season (mostly the Afcon)",
            "score": 4
        },
        {
            "depth": 0,
            "author": "PenisManNumberOne",
            "body": "Inconsistent in his prem spells with flashes of brilliance I’d say is the general consensus on his time in the league.",
            "score": 2
        },
        {
            "depth": 0,
            "author": "odegood",
            "body": "Looked good at leicester but i dont think they could afford to sign him",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Kyyes",
            "body": "He was English back then 🤣",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Cheeky_Star",
            "body": "He’s he like Diaz.. one good country run and one good game and all of a sudden everyone is going crazy.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Latinnus",
                    "body": "To be honest, he was quite decent in his season at Fulham",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "JBooogz",
            "body": "Everton is a toxic place for a young player look at Barkley, and Davies they got dogs abuse. Even Stones got a lot of bollocking you’d always hear their fans asking him to boot it out.",
            "score": 4
        },
        {
            "depth": 0,
            "author": "animatedpicket",
            "body": "Footballers just play better on continental Europe. Must be the weather, or the mental wellbeing from not having to live in a shithole like Liverpool 🤷‍♂️",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ax441",
                    "body": "It's always easy to spot the person who has never actually been to Liverpool. But then again, beauty lies in the eye of the beholder. If you hate a fun night out, culture and a variety of architectural styles, then Liverpool might actually not be for you.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "cvslfc123",
                            "body": "Liverpool is a lot nicer than Manchester for sure",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "animatedpicket",
                            "body": "I have been to Liverpool. I have also been to Barcelona, Rome, Nice, Munich and a lot of other European cities. I don’t see how you can say Liverpool is relevant in any of the things you said. To be fair I’ll pay culture, Liverpool is Liverpool, not many places like it",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Ax441",
                                    "body": "Live music in many pubs on the weekend, historic buildings combined with modern architecture along its iconic waterfront, lots of (street) art. If you've been there, then you've certainly not paid attention. There's a reason the city is packed with people from all over the world almost all year. It's not the weather and certainly not just their football clubs.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Gullible_Suit6251",
                    "body": "Dublin of course is well known for its great weather and stunning landscapes.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BlueLondon1905",
                            "body": "That’s not where Atalanta plays?",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tamim1991",
                                    "body": "But that's where he played yesterday and played a belter",
                                    "score": 1
                                },
                                {
                                    "depth": 3,
                                    "author": "Nicebutdimbo",
                                    "body": "It’s also not continental Europe…",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Odd-Tax4579",
                    "body": "lol, sure. They can live in a shit hole like mataro instead",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Big_Dependent_8776",
                    "body": "Tell me you've not been to Liverpool, without telling me you've not been to Liverpool",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "afk3400",
            "body": "Reminds me of Lucas Moura. Lucas Moura scored a hat trick in that UCL semi-final against Ajax in 2019 too. Ultimately though, very inconsistent player.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "BlastMyAssholePleasr",
            "body": "Shit for us.",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Individual-Band4496",
                    "body": "Was legit shite at Everton. Everyone going on now like they seen a diamond in the rough or something 😂",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BlastMyAssholePleasr",
                            "body": "Yep, I was super excited for him, he looks good when playing with farmers.",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "veryZexy",
                                    "body": "Those farmers would absolute thrash you",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BlastMyAssholePleasr",
                                            "body": "👍",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "JBooogz",
                    "body": "Tbh I feel sorry for young players coming through Everton look at Barkley, Davies and Gordon. It’s starts off with loads of hype then ends up with them getting severely abused by fans lol rinse and repeat",
                    "score": 0,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BlastMyAssholePleasr",
                            "body": "It's a very small minority of fans doing that shit, most of us stay behind all the players, most of us felt bad for the treatment of niasse for example.",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JBooogz",
                                    "body": "Koeman is a nasty guy for that I went to uni in Liverpool and attended a match at Goodison Park around 2015/2016 some of the abuse I heard being thrown at home players shocked me tbh. I wouldn’t even wanna pick up the ball for a throw in if I was an Everton player.",
                                    "score": 0,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "BlastMyAssholePleasr",
                                            "body": "Dunno man, I go every week and I don't hear it.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "TheBlueprint666",
                            "body": "Let’s not forget Jack Rodwell who was tipped for massive things. Couldn’t even tell you where he is now",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "JBooogz",
                                    "body": "He’s in Australia now lol wow I remember ten years ago he was linked  with Man Utd and Chelsea looool. Funny enough he only made 16 league appearances for City but hey at least he has a prem league medal I guess",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Muyiwa-amuwo",
                    "body": "Everyone is shit for you. Even Ancelotti couldn’t save you. 😀😀",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "BlastMyAssholePleasr",
                            "body": "Fair. At least with Ancelotti we played entertaining football.",
                            "score": 2
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "bduk92",
            "body": "He had bags of potential, no consistency yet wanted to play every week.\n\nCould have benefitted from some more loans, but some players want the big time *now* and won't wait, so they have to get moved on.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "chicken_nugget94",
            "body": "The system at atalanta really gets the best out of him, I think he could easily look average again at another team. He has had a good season but I think people underestimate confidence. His first goal was a great run across the defender but an instinctive first time finish which can sometimes be the easiest for strikers. I don't see him pulling off his hat trick goal if he hadn't already scored earlier in the game",
            "score": 0
        },
        {
            "depth": 0,
            "author": "PhantomPain0_0",
            "body": "Just because a player plays good in one match doesn’t mean he is a good player lmao",
            "score": -7,
            "replies": [
                {
                    "depth": 1,
                    "author": "eco78",
                    "body": "Hes had a great season, not just one match",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Zulfiqarrr",
                    "body": "That one match happens to be a european final tho",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PhantomPain0_0",
                            "body": "Doesn’t matter it’s still a one match",
                            "score": -8
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Internal_Formal3915",
                    "body": "You don't start in a europs league final if you haven't had a good season",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "EdSheeransucksass",
            "body": "His Everton spell was like 500 years ago, C'mon. ",
            "score": -1
        }
    ]
}