{
    "title": "Callum Wilson and Miguel Almiron to leave but Alexander Isak will stay",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Impressive-Ice873",
            "body": "Wilson may be a good shout for a promoted club. Leicester maybe. Still probably got a season left in him. I wouldn’t mind him at Villa as a back up to OW.",
            "score": 52,
            "replies": [
                {
                    "depth": 1,
                    "author": "niblot1",
                    "body": "Callum Wilson is a Coventry fan who hates the Villa, couldn't see either him or James Maddison ever playing for us.  \n\nWilson himself said that he had the choice between Villa and Newcastle when leaving Bournemouth and the offers were the same financially. So a lad from the midlands chose to move 350 miles north to avoid playing for his boyhood team's rivals (I use the word rivals in the loosest sense of the word).",
                    "score": 8
                },
                {
                    "depth": 1,
                    "author": "Aromatic_Pea2425",
                    "body": "Don’t know if we can afford Callum Wilson or if we’d take that big a gamble considering his injury record.",
                    "score": 6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Impressive-Ice873",
                            "body": "I just think we need a back up to OW. Duran isn’t it!",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "ShimeBD",
                                    "body": "Wait, I thought Duran had been good this season?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Impressive-Ice873",
                                            "body": "He’s complaining about game time and agent has hinted at a move",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "Aromatic_Pea2425",
                                    "body": "The question for you lot would be whether he can accept coming in second to Watkins rather than being a guaranteed starter. Here at Leicester, he’d probably start but he’d probably not be on as much money and get relegated too.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Lacabloodclot9",
                    "body": "I doubt he moves to Villa just to be second choice all over again",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "tiny_dreamer",
                    "body": "I thought Villa will be a fairly natural club to consider Wilson for rotation due to European matches actually",
                    "score": 8,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EliToon",
                            "body": "Yeah Wilson is too much of a sicknote to be relied upon as a #1 at any club. He's an amazing player to have as a rotation piece for a CL club. Would be a cracking signing for Villa.",
                            "score": 8,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "tiny_dreamer",
                                    "body": "Fair enough. Agree except for the “cracking signing” haha",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "West_Principle_8190",
                    "body": "When fit ,as good as any English striker in the league, pity he's only good for about 20 games",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "William_Taylor-Jade",
                            "body": "And in those 20 he's probably good for 10 goals which can be all the difference. More than worth it if his wage demands aren't stupid",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "West_Principle_8190",
                                    "body": "Yeah as a united fan I'm not opposed to signing him . Be like getting Owen back in Fergie era",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "Zhurg",
                                    "body": "Even more than that if you look at his stats. I never realised until I just looked but his goals per 90 is pretty insane.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "StDyche",
                                            "body": "Great striker just made of glass",
                                            "score": 7
                                        },
                                        {
                                            "depth": 4,
                                            "author": "mehchu",
                                            "body": "Oh yeah. He is absolutely fantastic. On contention for golden boot based on per 90 stats most seasons. And for a club where he automatically starts when fit his 9 goals in 991 minutes is absolutely a difference between staying up and going down. And you have your other striker play when he isn’t available.\n\nBut if he’s fighting for that spot and can’t play when called upon meaning other players get moved out of position…he becomes more a liability than a strength. \n\nBut he is more than worth it for most clubs.",
                                            "score": 5
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "groovystreet40",
                    "body": "Probably unpopular but would fucking love him at Arsenal as an Nketiah replacement. Guy is always dangerous against us",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "dantes_inferno101",
                    "body": "Um a nice 20M Soler is waiting for y’all",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Adept_Ad5465",
            "body": "Actual headline:\n\n\"Newcastle United squad audit: Callum Wilson and Miguel Almiron to leave but Alexander Isak must stay\"",
            "score": 10
        },
        {
            "depth": 0,
            "author": "mercules1",
            "body": "His goals per minute is fantastic, based on that it would be a shame to see him go.\n\nHis minutes per season is a huge issue though, at 32 if we get decent money it makes sense.",
            "score": 22,
            "replies": [
                {
                    "depth": 1,
                    "author": "Super_Seff",
                    "body": "He’s only 30 in fairness with how bad you lot have struggled with injuries this year it seems daft to not even offer them new deals on reduced terms as squad depth.",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DUKITY",
                            "body": "He's talking about Wilson",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Super_Seff",
                                    "body": "Same point applies in fairness just change the age 👍🏻",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "mercules1",
                                            "body": "The motivation for Miggy is much different, he’s at a much lower level than Wilson but his injury record is decent, consistently plays 30-40 games. I’d sell him as we need to improve that position and £15-20m would help us with PSR.\n\nCallum Wilson could get 20-25 goals if he played 38 games, I’d sell him mainly because of his injuries. He’s been at the club 5 years and both Bruno and BDB have played almost as many games in just 2.5 seasons which just isn’t sustainable.",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Immediate_Wolf3802",
            "body": "Almiron's form has dipped on last season       \n\n\nCallum Wilson at 32 is an excellent striker (a goal every other EPL game at Newcastle) with 1 massive flaw...injuries he gets injured quite alot averaging just 23 games a season at Magpies...he's not a 38 game season man...he's no Timmy Simons or Frank Lampard!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Agile-Day-2103",
                    "body": "You say that as if his “form” last season was actually correlated to his ability and not just a freak 15-game purple patch which far, far outstripped his normal performance",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Immediate_Wolf3802",
                            "body": "You don't like Paraguayan's ",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Agile-Day-2103",
                                    "body": "I was a big fan of roque Santa Cruz thank you very much",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Immediate_Wolf3802",
                                            "body": "What bout Funky Cold Jesus Medina...I've been Piranha fishing with Paraguayan's it's ace, no rod needed just a few dead ducks and a bucket...fascinating people who are mostly very poor but always smiling ",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DEGRAYER",
            "body": "I've never rated Miggy but he has heart and I appreciate him for that. Wilson will be a hard one. I hope both find a club in top leagues. Think both would thrive in La Liga. Feel like Wilson will move to another Prem club though if he leaves.",
            "score": 25,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ok-Entertainment8717",
                    "body": "Wilson is brilliant but with his fitness it's simply not viable with isak who will also miss a significant number of games most likely",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "FlukyS",
                    "body": "He has the workrate and isn't a bad footballer at times but he has probably the worst game intelligence I've seen from a footballer.",
                    "score": 10,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "jamboman_",
                            "body": "Ever seen Oliver Burke play?",
                            "score": 3,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "FlukyS",
                                    "body": "No but not sure I believe there is a dumber footballer than Almiron. Here is the scouting report for Almiron, he has no right foot, he will never cross the ball so it's just a matter of when he cuts inside not if. If there is a chance to shoot even if there are players queuing up to shoot he will power that ball into the nearest defender standing in front of him. He tracks back and all but he never can predict any movement if someone wants to do anything but run in a straight line.",
                                    "score": 6,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "AgileSloth9",
                                            "body": "Don't forget his recent love of diving.",
                                            "score": 3
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "cooleken",
                    "body": "Can any Newcastle fan explain how he was so good for a period of time last season? Remember him being essential in FPL for like 5 weeks.",
                    "score": 4,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "DEGRAYER",
                            "body": "Just a fantastic purple patch due high confidence I guess. We were all as confused as everyone else I think.",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Keemlo",
                                    "body": "Wasn’t every goal in that purple patch an absolute banger too?",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "DEGRAYER",
                                            "body": "He has a great left foot",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "jduboly",
                            "body": "I can count about 6 missed goals this season just because he refuses to use his right foot.  \n\nHis speed and hustle makes up for his flaws though imo",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "HeGivesGoodMass",
                                    "body": "I can remember exactly twice that he tried his right foot this season: a shot from the top of the box that hit the bar and a low cross that was converted for a goal. The fact that he refuses to even make short passes with it has been doing my head in for years.",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "EugeneStonersDIMagic",
                            "body": "He was out to spite Grealish.",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PJBuzz",
                    "body": "Yeah I doubt he will want to go to Saudi like.",
                    "score": 4
                }
            ]
        },
        {
            "depth": 0,
            "author": "vngannxx",
            "body": "Wilson to Leeds",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "bielsasballholder",
                    "body": "We do desperately need a striker if we get promoted.\n\nBut one who can stand upright for more than 10 minutes.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "MasterReindeer",
                    "body": "He could play for a Premier League side",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "b-e-j",
            "body": "As a Newcastle supporter I'd still want to keep Miggy coming on off the bench, but realistically if they were both to leave then I think the best places to suit them as players..\n\nWilson, back to Bournemouth again. They play in a way that keeps him effective. \n\nMiggy.. mid table - Europa La Liga team. Like Sevilla, Betis, Villarreal type of team.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "BugOperator",
                    "body": "Glad Almiron had a great season last year to silence his critics, but this season sort of proved it was anomalous. Wish him the best, though.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "robhall1",
                    "body": "I hope I never see Miggy play for us again. He take longstaff too. He could be as local as my sister and I still don’t care. It’s not personal and I like the lad but fuck me he’s terrible.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "blowinghotstinkygas",
                            "body": "Matty Longstaff, right?",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "blowinghotstinkygas",
                    "body": "Damn dude Almiron sucks lol.  He is an MLS level player.  With Gordon in the mix he is obviously expendable\n\nAlmiron is dogshit",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Kezmangotagoal",
            "body": "Wha…OMG…that’s Saudi Arabia’s music!",
            "score": 34,
            "replies": [
                {
                    "depth": 1,
                    "author": "TMI2020",
                    "body": "BAH GAWD KING!",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "PJBuzz",
            "body": "Longstaff isnt going anywhere, we need him for the Academy regulations in European competitions as current U21 players don't count towards it, same for Paul Dummett. Even if we end up not getting Conference this year, it's unlikely we would move on one of the few viable academy players we have just yet.\n\nHe probably isnt good enough if we are being realistic about it, but that's just the way it is.\n\nLuke Edwards should know better.",
            "score": 20,
            "replies": [
                {
                    "depth": 1,
                    "author": "socksthatdontsmell",
                    "body": "Need to be careful cutting players like Longstaff who can do a job when needed.",
                    "score": 12
                },
                {
                    "depth": 1,
                    "author": "doubledgravity",
                    "body": "Luke has never known better, let’s be honest.",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "justathrowawaym8y",
            "body": "It will be very painful if Wilson leaves, but I get it. He is injury prone but wants to be a guaranteed starter when fit, which just isn't going to happen with Isak in the squad. He has done a lot for the club and will be fondly remembered.\n\nIt's a real shame that Miggy just couldn't find consistent form (barring the first half of last season of course). Love the man to death but he just doesn't have consistent composure in the final third.\n\nI unfortunately think it's inevitable that we'll lose either Isak or Bruno, both of which would be incredibly tough. Bruno is my favourite player in the team, but prolific strikers are worth their weight in gold so I understand if they'd rather sell Bruno than Isak.\n\nHard goodbyes are inevitable this summer window 🥺",
            "score": 11,
            "replies": [
                {
                    "depth": 1,
                    "author": "Nutisbak2",
                    "body": "\n\nNewcastle will not willingly let go of any of their “top” players and it is far more likely we’ll shift on fringe players with value and those not playing regularly so Miggy and Wilson among others make perfect sense.\n\nJust by doing this we mitigate any need to move anyone else on.\n\nThe only exception to this is Bruno and only if an offer that triggers his clause comes in during the window it’s live for.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "Appropriate_Elk_6113",
                    "body": "Youre not going to believe whos looking for a player exactly like Almiron.. \n\nIts Al ettifaq",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Azlan82",
            "body": "Alimiron in his entire Newcastle career has less assists than Jacob Murphy has this season alone. Let that sink in.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "nelex98",
                    "body": "Maybe Grealish knew something",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "LinuxLinus",
            "body": "I feel like fans of every wealthy team in the PL and elsewhere have been salivating over Isak, but it always struck me as crazy to think he was going anywhere. For one thing, it would be a total middle finger to the fans.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Due-Educator5848",
            "body": "If Almiron wants to stay in England I would love to see him at Liverpool. He would be a great 2nd option for us and we could use him since he does now have a tiny bit of Champions League experience.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "GXWT",
                    "body": "United fan here. Yes, you should definitely sign him! Absolutely overspend if you have to",
                    "score": 19,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "KennyOmegaSardines",
                            "body": "Bruv even if Liverpool overspend your management would still find a way to be worse than them 🤣",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "GXWT",
                                    "body": "You’ll never sing that 🗣️",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "PenisManNumberOne",
                    "body": "Runs nonstop for no real reason and then just hits sprint+shoot when he gets the ball bruh you already have Luis Diaz",
                    "score": 23,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Due-Educator5848",
                            "body": "Great. He runs non stop. We need that.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PenisManNumberOne",
                                    "body": "Well yeah I guess that makes sense",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Britz10",
                    "body": "Yeah we definitely need a another unproductive forward around",
                    "score": 22,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Due-Educator5848",
                            "body": "You say this now but as a Liverpool fan you know how those injuries pile up. I don’t mind us filling up our bench with prem/UCL experience if it does not cost us a lot.",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Britz10",
                                    "body": "Just give the youth a chance instead",
                                    "score": 9,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Due-Educator5848",
                                            "body": "We can do both if we are competing at a high level and we find ourselves going far in the FA Cup, Carabao cup, UCL & etc. We have to make signings. I trust Man City & Arsenal will and that is who we compete with. Arsenal get to bring Trossard off the bench if they need to. Man City can bring Julian Alvarez off of the bench…. an academy player is not the answer if we are serious about winning titles. We are not Everton.",
                                            "score": 0,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "foyage347",
                                                    "body": "There's no way you can possibly compare almiron to trossard and Alvarez",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Due-Educator5848",
                                                            "body": "I am calling him a bench player. Not a world cup winner if that’s what you mean 🤣",
                                                            "score": 1
                                                        }
                                                    ]
                                                },
                                                {
                                                    "depth": 5,
                                                    "author": "Britz10",
                                                    "body": "Trossard and Alvarez are much better players than Almiron. Trossard is basically a starter now. Almiron is a nifty player but he's very far off what's needed at Liverpool.",
                                                    "score": 3,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Due-Educator5848",
                                                            "body": "I’m happy to have a Newcastle starter on Liverpool’s bench. It’s just that simple. Any of them.",
                                                            "score": 1
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "AlcoholicCumSock",
                    "body": "He should go to City and be 5th choice, just ahead of Grealish",
                    "score": 13,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "EugeneStonersDIMagic",
                            "body": "That will be awkward...",
                            "score": 1
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "RAH_03",
                    "body": "Bruh what?????\n\nHe's awful, this season has proved it, last season he was ok. He's nowhere near Liverpool level.\n\nRespectfully, Nottingham Forest is his level.",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Agile-Day-2103",
                            "body": "Respectfully, he’s an MLS player at best",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RAH_03",
                                    "body": "Conveniently, where he was before Newcastle😂",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Agile-Day-2103",
                                            "body": "Precisely. Where he belongs",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "RAH_03",
                                    "body": "I think he'd struggle in there now tbf😂",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "nico_cali",
                            "body": "So you’re saying there’s a chance",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "CaptainKickAss3",
                                    "body": "I would love it since he is an actual right winger but I don’t think there’s enough money in between the couch cushions even for him",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Due-Educator5848",
                            "body": "He would be a sensational bench player to throw on during garbage minutes.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "RAH_03",
                                    "body": "No thank you, I really don't see it, I don't even think Howe rates him anymore, i can't remember the last time he started.\n\nI'd rather get the ultimate winger, Muhammad Kudus 🥶🔥",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Due-Educator5848",
                                            "body": "To each their own. If we get Kudus I want him as a starter so that is a whole different conversation for me.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "RAH_03",
                                                    "body": "You can rotate his minutes or shift Salah to the 10 position.\n\nIn 21/22 Thiago and Keita rotated shifts on the LCM position to keep both players fit cos they were injury prone.",
                                                    "score": 1
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "what_am_i_acc_doing",
                    "body": "Too old, probably expensive from rivals too.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "InmateQuarantine2021",
                    "body": "I love Almiron as I'm an Atlanta United Fan. The only team I cheer for more than AU is Liverpool. That said, I wouldn't want him here. He just wouldn't get the play time. He's and attacking mid or winger and he'd be behind Harvey. \n\nAlso, he's about 18 months younger than Salah, so you aren't really replacing him with an option that can grow. \n\nI imagine he's likely headed back to the MLS or maybe to a top 10 but not CL team in France, Germany, or Italy. Hell, I'll add Wrexam as a total shithouse answer.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Due-Educator5848",
                            "body": "That is fair. I just think if everybody thinks he is shit I do not mind having him in the squad because I remember all of the bits of magic he is capable of. \n\nHe would be an awesome MLS signing and the league would love to have a player with that pedigree. Given that he is a former MLS player it would be great since he would respect the league and not view it as a retirement league.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "InmateQuarantine2021",
                                    "body": "He has said he wants to return to Atlanta. Whether that means to live or to play, who knows. The city loved and still loves him.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Miliktheman",
            "body": "We'll see in the summer, can imagine Isak getting snapped up by a big club if he asks to leave to take a step up in his career. Maybe Chelsea if they don't get Osimhen",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "macaleaven",
                    "body": "That’d be the worst thing for Isak… he should just go full Thierry and move to Arsenal",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "robhall1",
                            "body": "For the small price of 200m haha. Legit I hope he never leaves us.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "catf1sh1",
            "body": "Almiron would be an awesome squad option for Arsenal. He could backup both Odegaard and Saka",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "InPatRileyWeTrust",
                    "body": "No, he wouldn't. He has been terrible in the prem apart from a slight purple patch.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "RandomRedditor_1916",
                    "body": "Are you high?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "InternationalUse2355",
                    "body": "Won’t even make bench, what are you smoking?",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "loveliverpool",
                    "body": "I’ve been saying this for a while at LFC but he’s 30+ which doesn’t help",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "2scoopwafflecone",
                    "body": "Almiron wouldn’t sniff the pitch I’d rather keep ESR/Fabio",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "EugeneStonersDIMagic",
                    "body": "When did Salah sign for the Gunners?\n\n\nSurely you mean Saka?",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "catf1sh1",
                            "body": "Yep. Typo",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "EugeneStonersDIMagic",
                                    "body": "All good bruv.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "milkonyourmustache",
            "body": "As a shock to nobody it looks like Saudi Arabia have a lot of interest in Newcastle's wantaways; regarding Callum Wilson:\n\n> It is understood there have been tentative talks with clubs in Saudi Arabia who would be interested in signing a player who has, when fit, been a regular in the England squad as backup to Harry Kane.\n\n> ... Of all the tough calls that need to be made, this is the one that is likely to hurt Howe the most, but if they can get £15-20million for a player who only has one year left on his contract this summer, it is smart business and will massively help the recruitment budget as he has been at the club for four years and the £20m paid for him is almost off the books in terms PSR accounting.\n\nAlmiron is also referenced having interest from Saudi.",
            "score": -5,
            "replies": [
                {
                    "depth": 1,
                    "author": "Redditsleftnipple",
                    "body": "Nothing to see here folks. Move along",
                    "score": 16
                },
                {
                    "depth": 1,
                    "author": "circa285",
                    "body": "I’m shocked. Shocked that Saudi would buy Newcastle’s dead weight and pump money into the club “legally”.",
                    "score": -3
                },
                {
                    "depth": 1,
                    "author": "[deleted]",
                    "body": "[deleted]",
                    "score": -1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "tommyduk",
                            "body": "They got Saint Maximin for a steal, so this seems unlikely.",
                            "score": 2
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "TiredDadCostume",
                    "body": "OMG what!?",
                    "score": -6,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "v6mwt",
                            "body": "Hey Chelsea can’t be to upset their selling assets to themselves",
                            "score": 7,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "TiredDadCostume",
                                    "body": "I’m not upset. Just being a silly goose.",
                                    "score": 2
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "SentientCheeseCake",
                    "body": "Some Newcastle supporters are genuinely annoyed they can’t cheat.",
                    "score": -5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Large_Performance191",
                            "body": "Ah stop your bollocks, you'll roll out the red carpet when they come for Richarlison. You'll get significantly more money and still point the finger at us. ",
                            "score": 9
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "LMinggg",
            "body": "yeah howe's getting poch'd",
            "score": -10,
            "replies": [
                {
                    "depth": 1,
                    "author": "LtColnSharpe",
                    "body": "Why would this suggest that?",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "tiford88",
                    "body": "What on Earth are you talking about, and how did you get to that conclusion?",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "5bergy",
                    "body": "What does that mean?",
                    "score": 2,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "flaycs",
                            "body": "Fired maybe?",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "5bergy",
                                    "body": "You reckon?",
                                    "score": 3,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "flaycs",
                                            "body": "Would you concur if I did?",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "5bergy",
                                                    "body": "No",
                                                    "score": 0
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "charlierc",
            "body": "What price the discard list proves harder to shift in practice than just going \"Alright, go away\" to the ones we wish to let go?",
            "score": -6
        }
    ]
}