{
    "title": "Football regulator set to be shelved for now due to general election",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "LitmusPitmus",
            "body": "no doubt Labour will continue with the plans anyway",
            "score": 16,
            "replies": [
                {
                    "depth": 1,
                    "author": "Nice-Roof6364",
                    "body": "Yeah, but Rishi wanted to appoint his pals.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PoliticsNerd76",
                            "body": "-115 points to City, +115 Points to Southampton, Win Saints the Title, Profit?",
                            "score": 4,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Shigney",
                                    "body": "Certainly sounds like Rishi's maths",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "vaekar",
                    "body": "Hit city with a fine so big it saves the NHS.",
                    "score": 6
                },
                {
                    "depth": 1,
                    "author": "Bulbamew",
                    "body": "Pretty sure keith supports arsenal so fingers crossed at your end.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "AcePlague",
                            "body": "Ah you called him Keith even though his name is Keir, my golly gosh you've really made a fool of him there",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "5bergy",
                                    "body": "Sir Kief*",
                                    "score": 5
                                },
                                {
                                    "depth": 3,
                                    "author": "Bulbamew",
                                    "body": "What do you expect me to say about him, the man is a complete blank canvas.",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Isaysithowiseesit",
                                            "body": "Honestly after years of literal publicly shamed MPs I’m personally quite looking forward to a quiet one who can just shut the fuck up and run the country….",
                                            "score": 9,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Bulbamew",
                                                    "body": "I agree, but that’s also my problem with him, similar to how many Americans felt (and continue to feel) about Biden. His main selling point is he isn’t a Tory. I don’t know what he actually stands for. Corbyn and Farage are complete opposites and you can hate them all you want, you at least know what their main principles and beliefs are.\n\n“The tories are bad, they’ve run the country into the ground, so vote for me instead. And look, I’ve always got a Union Jack in prominent view behind me”. That’s all I hear. I’d like to know more about what he actually stands for and what his plans are, not just vote for him because he’s the red candidate",
                                                    "score": 4,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Isaysithowiseesit",
                                                            "body": "True - I suppose a balance of strong moral viewpoints and reserved media persona would be my ideal MP….",
                                                            "score": 3
                                                        },
                                                        {
                                                            "depth": 6,
                                                            "author": "Akimba07",
                                                            "body": "If you take him at his word he wants to be mission driven which you can see here\n\nhttps://labour.org.uk/missions/\n\nAnd otherwise they've kept the details to themselves to stop the Tories nicking them.\n\nI guess the next 6 weeks will show if that's true.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Isaysithowiseesit",
                                                                    "body": "Nice one - thanks for sharing. I agree it’s all about follow-through now and hopefully not of the underwear variety.",
                                                                    "score": 1
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        },
                                        {
                                            "depth": 4,
                                            "author": "tothecatmobile",
                                            "body": "I mean, you can at least say his actual name.",
                                            "score": 1
                                        }
                                    ]
                                },
                                {
                                    "depth": 3,
                                    "author": "NateShaw92",
                                    "body": "Kier is short for Kierth. But the r is silent when using the full name.\n\nIt's a regional thing.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "je97",
            "body": "How is this news?\n\n'Every governmental plan in the pipeline shelved for general election' would cover it and make less work for journalists.",
            "score": 13,
            "replies": [
                {
                    "depth": 1,
                    "author": "fifadex",
                    "body": "Journalist don't want less work, most of them are click bait specialists. They can wrote one headline that encompasses everything or write individual headlines for every action set to be reviewed or shelved and call it a days work.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "BurceGern",
                    "body": "Not everyone follows mainstream news. They might choose to ignore it and stay in their informational bubble",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "BlackCaesarNT",
                    "body": "> 'Every governmental plan in the pipeline shelved for general election' would cover it and make less work for journalists.\n\nA lot of people (especially international fans) will likely not know there's an election in the UK (hell my mum didn't know til I told her), so they won't have any clue about UK governmental functions and what happens as a result of an election being called.",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "Jsime92",
            "body": "It has cross party support, it’ll be back after the election.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Joshthenosh77",
            "body": "Man City be like haha",
            "score": 14
        },
        {
            "depth": 0,
            "author": "finestryan",
            "body": "I hope Labour pick it up and run with it but I’d imagine its a long way down the list if its even on there.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "g0ldingboy",
            "body": "Man City bought the Government.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dorkseid1687",
                    "body": "Literally",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "shaunomegane",
            "body": "Why does this picture remind me of Tropic Thunder?",
            "score": 3
        },
        {
            "depth": 0,
            "author": "Goose4594",
            "body": "Why does this have anything to do with that?",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "BlackCaesarNT",
                    "body": "New government will mean New culture minister, new sports minister, alternate perceptions on the role of the regulator, alternative ideas about how much power they are given, what powers etc. \n\nStarmer has not spoken much about regulation in football so it's not likely that Tory policy plans will come into fruition.\n\nHell even a governmental reshuffle can see the end of plans if a minister is removed, see the scrapped Channel 4 sale plans that Nadine Dorries was obsessed with.",
                    "score": 3
                },
                {
                    "depth": 1,
                    "author": "itsjustchat",
                    "body": "Why does the formation of a new government regulatory body get affected by a general election? \n\nIs that really the question you are asking?",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Goose4594",
                            "body": "I didn’t know the regulatory body would be state funded and run by the govt. \n\nThought it would just be another body like the pgmol or something",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "itsjustchat",
                                    "body": "Fair enough you didn’t know mate.",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "WinterRespect1579",
                    "body": "Babnahajajkakajjahahhaja",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "PoliticsNerd76",
            "body": "It’s so Jover once we get a man on the inside of Downing Street",
            "score": 4
        },
        {
            "depth": 0,
            "author": "WinterRespect1579",
            "body": "Shahhahaahhahahhahahhahhahahhahhahhaa",
            "score": 1
        },
        {
            "depth": 0,
            "author": "lewishamilton08",
            "body": "Love to see it. Boehly and Egbhali’s Saudi links whilst being American stands us in good stead.",
            "score": -2
        }
    ]
}