{
    "title": "Vincent Kompany and Burnley's Relegation: What Happened?",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Batter89",
            "body": "Contrary to popular opinion, Kompany did actually adjust his style for the Premier League. He definitely went more defensive after the batterings by Chelsea and Spurs early on. We also set up very differently to the Championship season where it was mostly 4123 - we spent most of this season playing some sort of flexible 442.\n\n'What happened' is a combination of inexperience in the squad, difficult fixture list leading to destroyed confidence, poor transfer window(s) (with a record spend too!) and yes, some poor selection, tactical and management decisions from Kompany.\n\nI was still behind him and sad he is leaving, but let's not pretend he hasn't underachieved massively this season.\n\nSource: Season ticket holder for 10+ years",
            "score": 28,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dychetoseeyou",
                    "body": "This is spot on.\n\nThe media trope that we play pretty, mini-City type football but make mistakes as it’s lads who played in the championship is just wrong.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "thesaltwatersolution",
                    "body": "Well said. Pretty much the same story with Norwich under Farke. There was a narrative about him not having a plan B, but he did try to adapt, but we weren’t good enough. Didn’t bother with transfers first time round, then spent badly second time round. Football can be brutal.",
                    "score": 4
                },
                {
                    "depth": 1,
                    "author": "Expensive-Twist7984",
                    "body": "This is the take we needed- like most people I didn’t watch a massive amount of Burnley’s games, so any opinion I’d have is based on limited knowledge of them.\n\nI’d like to see him stay at Burnley, get them back up and “finish what he started” to an extent (stabilise them as a PL side) before he buggers off abroad, but I suppose the lack of a real connection with the club stops that.",
                    "score": 5
                }
            ]
        },
        {
            "depth": 0,
            "author": "blnctl",
            "body": "He played his own preferred style in order to get future job offers, rather than doing what his current club needed for survival.",
            "score": 12,
            "replies": [
                {
                    "depth": 1,
                    "author": "According_Ad_8182",
                    "body": "It almost made sense at the start of the season when people were saying that Burnley didn't care about going down, as they were in it for the long haul and would bounce right back. \n\n\nHowever, the way the season turned out with the point deductions, it was criminal that Burnley didn't put up a decent fight. Everytime it looked like they need a result and they have a chance, they bottled.\n\n\nAnd now with Kompany jumping ship at the end of the season, it looks like Burnley are in a worse place than they were a year ago.",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "PhilosophyFair9062",
                            "body": "The money Burnley will receive for Kompanys departure will help out so it's not all doom and gloom",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "TezRoll",
            "body": "He had a squad that was far too good for the championship (he had Tellla and Maatsen, who have won the Bundesliga and in CL final this season), plus a selection of prem loanees who left after they got promoted , so he was never as good as that season made out",
            "score": 17
        },
        {
            "depth": 0,
            "author": "QuirkyDust3556",
            "body": "Not enough talent on the team for PL",
            "score": 4
        },
        {
            "depth": 0,
            "author": "Wrathuk",
            "body": "of course it's Kompanys fault , my issue isn't that they went down or that Kompany stuck to his style is the real lackluster way they did it. they were the best placed team of the 3 to stay up and they went down without a fight.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "churchill1992",
            "body": "I admired kompany for trying to stick with his philosophy that got them promoted and he did eventually try to adjust philosophy to be more defensively minded and not concede as many goals. Personally I think the gap between the prem and the championship is starting to get too big.",
            "score": 6,
            "replies": [
                {
                    "depth": 1,
                    "author": "roadsodaa",
                    "body": "I honestly think we’re not too far away from the same 3 teams going up and down every year. Even though it’s happened before.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "sungbysung",
            "body": "VK's goal wasn't to secure points at all costs. It was rather an audition to demonstrate his football philosophy. It's clear that he saw the opportunity as a stepping stone in his career.",
            "score": 8
        },
        {
            "depth": 0,
            "author": "Enginebeer",
            "body": "Tella went to Leverkusen",
            "score": 1
        },
        {
            "depth": 0,
            "author": "RecommendationOnly78",
            "body": "He lost a lot of the loan players that got them promoted and they weren't replaced",
            "score": 4
        },
        {
            "depth": 0,
            "author": "HankHippopopolous",
            "body": "His style wasn’t the problem. The problem is that you need very good players to implement the style. It worked in the championship because the other players down there weren’t good enough to stop what Burnley tried to do. \n\nIn the prem how many times did you see Burnley misplace a pass that lead to a goal because their players weren’t that good.\n\nWith the better players he’ll have at Bayern I think his style will be more successful than it was with Burnley.",
            "score": 5,
            "replies": [
                {
                    "depth": 1,
                    "author": "UziKru",
                    "body": ".... so his style was the problem?",
                    "score": 11
                },
                {
                    "depth": 1,
                    "author": "mrpara",
                    "body": "Yes exactly this. I’ve seen and heard people have trouble with wanting to see it in this way. If he can implement this style of play with better players of course he’s gonna have a better outcome than with Burnley. It’s like De Zerbi this season, people criticizing him for his style of play even though he lost all his best players to this season, imagine De Zerbi/Kompanys tactics with players that n Bayern, real or Barca… I’m not saying it’s automatic success because of this but you chances of getting more points and not get relegated are way better with better players, obvious",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Mrkoaly",
                            "body": "Seems managers these days cant adapt or chage tactics and we as fans give them a pass, or even praise them because if they had better players it would look \"beautiful\" Its unacceptable imo. Ancolotti can switch it up on a whim. SAF always put the best team for the job at hand. These days if plan a dosnt work there is no other plan.",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "mrpara",
                                    "body": "Bro are you stupid? SAF always played the same tactics and in the same way relying on his players to do the job, he also had the best players of their generation during his time in Man U, it doesn’t take away the work he did. Let’s talk Ancelotti, it didn’t go well for him at Everton but he’s doing an amazing job in Real Madrid right now, why’s that you think? Also, he has played like real do now most his coaching career too, especially Milan (he did try to change it in Everton) Look at all the coaches with most titles and those who have won the most, they have a style of play and an idea that they stick to, then they tweak and twerk it, change some players and stuff like that. Imagine Pep, SAF, Wenger, Mourinho after loosing a game just going; “yea you are right I need to change it in order to be the best” hahah are you hearing your self, call 911 or I’ll do for you",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "thedudeabides-12",
            "body": "The style of play he attempted in the Prem with the players he had weren't up to the standard required for Premier League...",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "PenisManNumberOne",
                    "body": "And United’s was. Games gone",
                    "score": 0
                }
            ]
        },
        {
            "depth": 0,
            "author": "PeanutButterSauce1",
            "body": "While I didn’t explicitly follow every burnley game, I did notice a couple games they would open the scoring but have trouble maintaining the lead. Dunno how often this happened tho",
            "score": 2,
            "replies": [
                {
                    "depth": 1,
                    "author": "Dychetoseeyou",
                    "body": "27 points worth of times, it happened",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "He simply tried to play out from the back with players that weren't able to skillfully manage it. Instead of adapting it was rinse and repeat. So many goals and losses down to it. Don't understand why Bayern are looking at him",
            "score": 2
        },
        {
            "depth": 0,
            "author": "jackyLAD",
            "body": "Same thing, to a degree happened at Notts County.... and those guys leaked goals for fun. Luckily division 2 isn't quite as cutthroat as the Prem of course.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "InstructionOk9520",
            "body": "It’s a tough league for pretty football.",
            "score": 1
        },
        {
            "depth": 0,
            "author": "brodieman2k",
            "body": "They didn’t get enough points…",
            "score": 1
        },
        {
            "depth": 0,
            "author": "jazzybforecasts",
            "body": "People can talk about philosophy, need to play more pragmatically in the prem etc etc\n\nThe reality is that the gap between the prem and the championship has never been so wide as evidenced by the 3 promoted teams going straight back down.\n\nJonathan Wilson speaks really well about the stratification of English football and what that means for new teams trying to break into the prem.\n\nhttps://amp.theguardian.com/football/article/2024/may/13/premier-league-relegation-championship-burnley-luton",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Uchronicclarion",
                    "body": "Also the fact that all 3 teams relegated the season before performed v well in the championship, with only Ipswich getting in their way (credit to them)",
                    "score": 3
                }
            ]
        },
        {
            "depth": 0,
            "author": "True-Expression3378",
            "body": "Whatever he did was enough for Bayern to come knocking on the door!",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "BroldenMass",
                    "body": "I think they were running out of doors to be honest",
                    "score": 9
                }
            ]
        },
        {
            "depth": 0,
            "author": "ElectronicPlant2336",
            "body": "He owes them nothing. He got them straight back up at a canter. Huge money windfall. They go back down with parachute payments and Bayern will likely pay substantial money to buy out his contract. What's the problem?",
            "score": 0
        },
        {
            "depth": 0,
            "author": "[deleted]",
            "body": "[deleted]",
            "score": 0,
            "replies": [
                {
                    "depth": 1,
                    "author": "Sure-Background8402",
                    "body": "He spent the best part of 100mil and brought in about 15 players. Can't compare the situation to Sheff Utd's. They had the rug pulled out from underneath them by losing two of their best players. Kompany was given everything to succeed and he failed miserably",
                    "score": 7,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "itsjustchat",
                            "body": "“Given everything to succeed” 😂",
                            "score": 2,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sure-Background8402",
                                    "body": "For the context of a team just promoted, he had one of the highest ever spends",
                                    "score": 2,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "itsjustchat",
                                            "body": "And so have most newly promoted teams recently.\n\nThat’s just part of the increasing cost of players etc in football. \n\nHe had a squad that should never have been able to dominate the championship. They added so much because it needed additions and all they could really afford was a bunch of young and untested players.\n\nHe never really had a chance and from the way he dominated the championship it’s clear the man has something as a manager.\n\nIt’s a risk taking him for sure. But so was singing arteta for arsenal. So was getting xavi.",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sure-Background8402",
                                                    "body": "A good point but most of those sides (except that disastrous Fulham season) have stayed up comfortably after spending big.\n\nChampionship is not a good league, I'd say he definitely had the quality to win that league. He had a very strong spine for a Championship side. Young players are generally more expensive, not buying more experienced, cheaper players was naive as hell. Give Sean Dyche that squad plus two free transfers and a loan and he stays up",
                                                    "score": 0,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "itsjustchat",
                                                            "body": "I don’t think you watch much championship football.\n\nIt’s an extremely competitive league. Dominating it like Burnley did was special and isn’t something we see very often.\n\nEspecially with a manager new to the league.",
                                                            "score": 2,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sure-Background8402",
                                                                    "body": "Both true but the players they had in their squad to start with were better than their competitors. He did a good job getting them promoted considering they lost Tarkowski, Mee, Pope etc. But he was so naive in the PL. Lots of teams have stayed up before by signing experienced players who know the league and know how to see a game out, he went and signed a bunch of players with little to no top league experience with an obvious end result",
                                                                    "score": 0
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "Time-Ad-2378",
                            "body": "PL is different than Championship. He was a prolific player but as a young coach he still has a lot to learn. I just wish he stuck with them as it was a multiple year maybe 3-4 years project and then we would have seen the difference. But what can you do feel bad he left for bayern",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Sure-Background8402",
                                    "body": "Used them and got them relegated due to his own arrogance, hope he fails at Bayern as well",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "Time-Ad-2378",
                                            "body": "Nah mann just bad luck and weak strategy..injuries in half the season major striker absence Koleosho beyee ekdal none of em got their chances",
                                            "score": 1,
                                            "replies": [
                                                {
                                                    "depth": 5,
                                                    "author": "Sure-Background8402",
                                                    "body": "Weak strategy/tactics that came from his own arrogance.",
                                                    "score": 2,
                                                    "replies": [
                                                        {
                                                            "depth": 6,
                                                            "author": "Time-Ad-2378",
                                                            "body": "Well they leaked tons of goals with poor defense but it was never really a strong team to begin with. Doesnot mean you can hold VK responsible. Its like millionaires vs billionaires out there lol",
                                                            "score": 1,
                                                            "replies": [
                                                                {
                                                                    "depth": 7,
                                                                    "author": "Sure-Background8402",
                                                                    "body": "Lots of teams stayed up this season and have stayed up previously by spending far less and bringing in proven players. Of course he can be held responsible, he's the manager and he chose the players. Ipso facto he is responsible for their relegation",
                                                                    "score": 2,
                                                                    "replies": [
                                                                        {
                                                                            "depth": 8,
                                                                            "author": "Time-Ad-2378",
                                                                            "body": "Yes he is but not 100% to blame",
                                                                            "score": 2,
                                                                            "replies": [
                                                                                {
                                                                                    "depth": 9,
                                                                                    "author": "Sure-Background8402",
                                                                                    "body": "Who else is to blame? Vast majority of the blame goes with him. The two teams that came up with them were always going to struggle and two other teams had points deductions this season. Would have been one of the easiest seasons for a newly promoted team to stay up if he had been remotely sensible with his signings",
                                                                                    "score": 1,
                                                                                    "replies": [
                                                                                        {
                                                                                            "depth": 10,
                                                                                            "author": "Time-Ad-2378",
                                                                                            "body": "Madarchod terr jaise chutiye fans ki waja se harta hai laudya. You are right bro",
                                                                                            "score": 1
                                                                                        }
                                                                                    ]
                                                                                }
                                                                            ]
                                                                        }
                                                                    ]
                                                                }
                                                            ]
                                                        }
                                                    ]
                                                }
                                            ]
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "EnricoPallazzo_",
            "body": "Maybe the problem is not the style, it's the players. The style might be good and enough for championship, but to keep it working on PL you need to improve the squad.",
            "score": -1,
            "replies": [
                {
                    "depth": 1,
                    "author": "ContraVista",
                    "body": "Burnley also lost two key members of their Championship winning squad, Tella and Maatsen, who were on loan to the team.   I’d argue that ALK’s leveraged buyout acquisition structure makes it more challenging to stay in the Prem and afford upgraded players.   Burnley had zero debt prior to the acquisition so had cash to pay players rather than paying down debt.",
                    "score": 3,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Dychetoseeyou",
                            "body": "Lost Tella, Maatsen and Barnes (leader), and Kompany jettisoned Cork (leader) and Muric (Championship keeper of the season and our best passer). And didn’t sign a left back. \n\nRelegation is 100% on Kompany. And now he’s fucking off leaving us with 40 of his signings.",
                            "score": 3
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "DeltaMusicTango",
            "body": "They finished 19th.",
            "score": 0
        },
        {
            "depth": 0,
            "author": "SanitySlippingg",
            "body": "They weren’t good enough and pragmatic enough, I wouldn’t be surprised to see Kompany do well at Bayern though, it wasn’t his fault.",
            "score": -1
        },
        {
            "depth": 0,
            "author": "PenisManNumberOne",
            "body": "Tippy tappy didn’t work in that shadow realm it’s about smashing balls in, set piece scuffs and fighting at that level and he didn’t understand",
            "score": -2
        }
    ]
}