{
    "title": "Chelsea: Paul Merson astounded by Mauricio Pochettino's departure by mutual consent",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "throwawaysis000",
            "body": "Paul Merson is \"astounded\" every time the sun comes up.",
            "score": 18
        },
        {
            "depth": 0,
            "author": "croghan2020",
            "body": "Is there anything he isn’t astounded by, must be the only word is his vocabulary.",
            "score": 11
        },
        {
            "depth": 0,
            "author": "milkonyourmustache",
            "body": "It's good for Chelsea in some ways because there was no alignment between Poch and management, makes you wonder why they appointed him in the first place.",
            "score": 10,
            "replies": [
                {
                    "depth": 1,
                    "author": "JetsAreBest92",
                    "body": "The owners are trying to assemble ikea furniture without reading the instructions",
                    "score": 11,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Lard_Baron",
                            "body": "Who needs the instructions? Are we not men?",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "Impeachcordial",
                                    "body": "We are Devo",
                                    "score": 3
                                },
                                {
                                    "depth": 3,
                                    "author": "rememberpa",
                                    "body": "Of course! Which is why my kitchen cabinet is as stable as Chelsea’s away form.\n\nEdit: a word.",
                                    "score": 3
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "storgodt",
                    "body": "The only problem will be if the management's strategy is beyond fucked and Poch was the only glue holding it all together.",
                    "score": 5
                },
                {
                    "depth": 1,
                    "author": "PenisManNumberOne",
                    "body": "Yeah they should sign one of their former midfielders it worked well for them last time",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "ItsTom___",
                            "body": "That Frank Lampard is free maybe they could try him",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "PenisManNumberOne",
                                    "body": "Who knows maybe third times the charm",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "WinterRespect1579",
            "body": "I am astounded he is astounded",
            "score": 8
        },
        {
            "depth": 0,
            "author": "PenisManNumberOne",
            "body": "Astounded he still has a septum",
            "score": 12
        },
        {
            "depth": 0,
            "author": "W26D12L0",
            "body": "Let’s see, might actually work out for everybody, who knows",
            "score": 3,
            "replies": [
                {
                    "depth": 1,
                    "author": "TexehCtpaxa",
                    "body": "I’d fancy him to improve United at least a little, and that’s the worst thing that can happen. Even if everyone has won at old trafford in recent memory, its still a nice feeling seeing them struggle. Never gets old.",
                    "score": 2
                }
            ]
        },
        {
            "depth": 0,
            "author": "ImmediatelyOcelot",
            "body": ">Nicolas Jackson reacted to Mauricio Pochettino's exit with two 'facepalm' emojis.\r\n\nPeak off-pitch modern football",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Swoosh33",
            "body": "This whole sub just flooded with Chelsea bollox, we get it Poch has left",
            "score": -6,
            "replies": [
                {
                    "depth": 1,
                    "author": "lewishamilton08",
                    "body": "We get it you bottled the title again and you will never win the Champions League.",
                    "score": 5,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Swoosh33",
                            "body": "We get it you’ve lost Putin and now you’re back to factory settings. Only thing missing now are some Umbro kits then you are truly back to default. £2bn you got out of Putin and your still in your little 30k championship ground",
                            "score": 6,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lewishamilton08",
                                    "body": "And we still spent more money than you with our new American owners and took Mudryk from you, and have more pull than you despite being 6th and we don’t have a sponsor that cosigns the killing of black people in Africa 👍🏾 so you can hold thattttt",
                                    "score": 1
                                }
                            ]
                        },
                        {
                            "depth": 2,
                            "author": "ah2346",
                            "body": "Bottled has lost all meaning. Arsenal didn’t bottle anything this year. Last year, yes. But certainly not this year.",
                            "score": 1
                        },
                        {
                            "depth": 2,
                            "author": "Lymanz88",
                            "body": "Our trophies actually count because we didn’t cheat to get them",
                            "score": 0,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "lewishamilton08",
                                    "body": "You did cheat, every single one of your corrupt trophies is tainted",
                                    "score": 1
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "lewishamilton08",
            "body": "The only people astounded are people clueless about football. Poch is an awful manager and case in point to stop rival fan gaslighting - advocate to take him at your club and stop trying to score points on Chelsea",
            "score": -13,
            "replies": [
                {
                    "depth": 1,
                    "author": "Mountain-Bar-2878",
                    "body": "lol took Chelsea from 12th to 6th in one year. Palmer wouldn’t be there if it wasn’t for him either. Two big signings injured the entire year. All of the players think sacking him was moronic, and you are supporting horrible ownership decisions. ",
                    "score": 9,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Inside-Ad-8935",
                            "body": "He didn’t want Palmer!  He was a club signing, Poch said he had enough wide players.",
                            "score": 1
                        }
                    ]
                }
            ]
        }
    ]
}