{
    "title": "Man Utd have held talks with representatives of Ipswich manager Kieran McKenna ",
    "comments": [
        {
            "depth": 0,
            "author": "AutoModerator",
            "body": "Fellow fans, this is a friendly reminder to please follow the [Rules](https://www.reddit.com/r/premierleague/about/rules) and [Reddiquette](https://support.reddithelp.com/hc/en-us/articles/205926439-Reddiquette). \n\nPlease also make sure to [Join us on Discord](https://discord.gg/football)\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/PremierLeague) if you have any questions or concerns.*",
            "score": 1
        },
        {
            "depth": 0,
            "author": "EwokSuperPig___",
            "body": "Too soon for him. He has a great last two season with Ipswich but going to United will ruin his career. It’s not that he isn’t good enough just too soon. I want him to be either after ETH (if we keep him) or the next manager we get in",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Headlesshorsman02",
            "body": "Not shocking they were the team I figured he would go to if they went in for him seeing as he used to work there",
            "score": 1
        },
        {
            "depth": 0,
            "author": "Cheeky_Star",
            "body": "How in the world did McKenna get so much hype. Man utd needs someone that has a lot of success under their belt. The pressure is too great for McKenna imo. As soon as results are not positive, the media articles will start coming out. I think he need to make a leap to a Brighton or a similar club first to prove himself in the epl. \n\nBut its seems everyone is looking for the next potential. \n\nI think if he comes in it will be on a short term agreement until INEOS/jim gets all the upper management team and a footballing plan in place.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "impala_aeme",
                    "body": "Yeah, previous success worked well with van Gaal and Mourinho.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Cheeky_Star",
                            "body": "This managers won trophies and was able to handle the stress a lot better. McKenna needs their thick skin in order to even survive at man utd.",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Immediate_Wolf3802",
            "body": "Wrong Mckenna ?\n\n\nTry Paul Mckenna he can hypnotise the squad into thinkin they'r world class 😆",
            "score": 1
        },
        {
            "depth": 0,
            "author": "StonedCharmander",
            "body": "I've been seeing more and more clubs going for head coaches instead of managers.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Legendarybbc15",
                    "body": "The newer model calls for head coaches tbh",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Somto_Duba",
            "body": "What's with big clubs going for unproven managers?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "TexehCtpaxa",
                    "body": "Owners want to be in charge of squad building, and have the manager be more strictly a head coach. Someone whose job is to manage what they’re given, and not someone who will demand 3 or 4 specific players that the club is lumbered with when that manager leaves.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "whatwhenwhere1977",
                    "body": "A young manager/coach like McKenna is more likely to fit in the system big clubs want to use of Director of Football, Of recruitment etc etc. their job is just coach the first team. Not always the case but that’s the theory",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "jaybizzleeightyfour",
                    "body": "Arteta effect. First job, young, energetic.\n\nWhen he arrived, Arsenal were a club that had to give players away, were mid table and playing Europa football, now they have a young squad which is the most valuable in world football, fighting for titles and in the Champions League, clubs see that as the new blueprint",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "fifadex",
            "body": "Surely this would have been better waiting until after the cup final?",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Prime_Marci",
                    "body": "Even if you were gonna fire him…",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "fifadex",
                            "body": "Madness. Pretty sure the boyhood fan of one of the biggest clubs in the world where he coached the youth team would have understood if they had asked him to wait until Saturday to give the team the best chance to prepare for the final. Could have called him when the second half kicked off lol",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "Reginald_Jetsetter1",
            "body": "The United job will absolutely springboard his career right into nothingness. \n\nWhy any player or manager would want to come to us is beyond me",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Prime_Marci",
                    "body": "Exactly…. These players will chew him out like they did the first time around.",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "Legendarybbc15",
                    "body": "Moneh",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "fifadex",
            "body": "Can't be true, Ten Hag said everything was great and that he had the full support of the board and the fans love him.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Ethiosya",
                    "body": "Ten Hag doesn’t know head from tail. Wouldn’t trust anything he says.",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "Individual_Put2261",
            "body": "He’s going to Chelsea I bet",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Prime_Marci",
                    "body": "Chelsea to be announce tomorrow… then it’ll seem like agent talk",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "darthrevan22",
            "body": "Why not stay with Ipswich for one more season to enjoy the fruits of winning promotion?  Don’t be like the Bologna coach who got the club to UCL, then immediately bailed to Juve.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Prime_Marci",
                    "body": "He just signed his career death warrant. The current man United squad said his training methods were shit. Then they turn around and hire him. Oh man. This is Ole 2.0",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "Littlepace",
                            "body": "I will say I kind of like the idea of McKenna coming back and giving all those players the boot with INEOS' backing. However I'm still pretty unsure how I feel about him getting the job. Seems way too soon. Feel like he needs to have at least one season in the PL before he's ready to take a job like that on. ",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "graveyeverton93",
            "body": "Must be a weird feeling talking to your team in the dressing room when everyone in there knows you are sacked and the Club are talking to potential replacements like with Ten Hag on Saturday.",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "dispelthemyth",
                    "body": "Many of the players know they are gone too, just need to be professional for the next manager to see, be it at United or other",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "MrShelby1234",
            "body": "It just really goes to show how bad the manager market is right now when 2 (3 if you wanna include bayern) of the big clubs are shopping in the championship",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "GMD3S1GNS",
                    "body": "Style of play goes a long way, Kompany is one of Peps kids that plays that kind of football as a manager now. Much more attractive than hiring some dinosaur like Mourinho",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MrShelby1234",
                            "body": "That's good an all but he got Burnley relegated with what 24 points?\n\nThat doesn't scream big European giant whatsoever",
                            "score": 1,
                            "replies": [
                                {
                                    "depth": 3,
                                    "author": "dennis3282",
                                    "body": "Yeah it's absurd he is linked to Bayern. I've seen some say that he played a style of football to put him in the shop window. But surely that only matters if he gets results.\n\nBurnley massively underachieved this season as almost everyone tipped they would stay up. The fact they fell so far short is bad management, surely. It is only impressive if a manager gets good results while playing good football. Anyone can play good football if the results don't matter.",
                                    "score": 1,
                                    "replies": [
                                        {
                                            "depth": 4,
                                            "author": "MrShelby1234",
                                            "body": "I think its shocked the whole footballing world. You could tell early on in the season that Burnley was going to struggle this season, yet he was far too insistent on playing the same way. It's a baffling decision, and I think Bayern will live to regret it",
                                            "score": 1
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                },
                {
                    "depth": 1,
                    "author": "Miliktheman",
                    "body": "Might have been true a week ago but not now. Tuchel, Pochettino, De Zerbi, Xavi are all on the market. There's options out there for every club.",
                    "score": 1,
                    "replies": [
                        {
                            "depth": 2,
                            "author": "MrShelby1234",
                            "body": "Makes you wonder why Enzo Maresca & Keiran McKenna are the 2 most sought after then",
                            "score": 1
                        }
                    ]
                }
            ]
        },
        {
            "depth": 0,
            "author": "sub2pewdiepieONyt",
            "body": "Kieran should jump at it. He is not gonna get a big job even if he keeps Ipswich up. Take it!!!",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "VoltDiablo_",
                    "body": "You would think we definitely will considering he's a united fan",
                    "score": 1
                },
                {
                    "depth": 1,
                    "author": "L-LCTC-LVGP-BH",
                    "body": "Bayern will come knocking",
                    "score": 1
                }
            ]
        },
        {
            "depth": 0,
            "author": "DagonFishGone",
            "body": "Ineos out. It's not like we've seen a Dutch manager sacked after an FA cup final before. Europa league final, carabao cup win, 2 FA cup finals, and they wanna sack EtH... ineos and glazers out if this is true. It was so close.....\n\nI also have no idea how this dude is supposed to get on with half these players were here since Ollie and they ridiculed him. Then you add on FFP issues and he'll get free transfers to somehow get this squad competing with 100million pound signings arsenal and city are making. Good luck. McKenna out, ineos out , glazers out, Berrarda, ashworth, board, everyone OUT\n\nIf McKenna is announced manager, McKenna out day one, green and gold jerseys coming back",
            "score": 1,
            "replies": [
                {
                    "depth": 1,
                    "author": "Moosje",
                    "body": "Jesus shut up",
                    "score": 1
                }
            ]
        }
    ]
}